{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-partners-with-the-internet-archive-to-keep-the-web-always-online/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "607f4118-38b7-5e63-b782-ee7bb9f5565b",
				"title": "Cloudflare Partners with the Internet Archive to Keep the Web Always Online™",
				"contentfulId": "16SUQFeAZ6azpqjszVQOUo",
				"metaTags": null,
				"subtitle": "Partnership ensures website visitors have access to recent content when origin servers are unreachable",
				"orderDate": "2020-09-17",
				"body": "San Francisco, CA, September 17, 2020 — [Cloudflare, Inc.](http://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today announced that it has partnered with the [Internet Archive](https://archive.org/), a nonprofit digital library that runs a digital archive of the World Wide Web called the Wayback Machine. By partnering with the Internet Archive, Cloudflare is strengthening its [Always Online](https://www.cloudflare.com/always-online/) solution that makes sites available when their origin servers are down and keeps the Internet functioning for users globally.\n\nLaunched in 2010, Always Online is like insurance for websites. It caches a static version of websites, so, if for any reason, your web host or service provider goes down, it will kick in to keep your site online. Without it, a website risks reputation damage, a decreased user experience and even a drop in search ranking if the website's origin goes offline, experiences a timeout, or otherwise breaks. Now, Cloudflare's Always Online service will fetch the most recently archived version of a site from the Internet Archive, an additional safeguard, if one cannot be found in the local cache. To do this, the Internet Archive uses the same crawling infrastructure that has allowed its Wayback Machine to archive over 465 billion web pages to date.\n\n\"The Internet Archive's Wayback Machine has an impressive infrastructure that can archive the web at scale,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"By working together, we can take another step toward making the Internet more resilient by stopping server issues for our customers and in turn from interrupting businesses and users online.\"  \n\nThe Internet Archive's Wayback Machine has been archiving the public web since 1996 and to date, has preserved and made available more than 468 billion [web pages](https://archive.org/web/) and more than 45 petabytes of information. Cloudflare customers can easily upgrade to the new Always Online service with one click in the Cloudflare dashboard. This will allow the Wayback Machine to crawl and archive its website at regular intervals. \n\n\"Through our partnership with Cloudflare, we are learning about, and archiving, web pages we might not have otherwise known about, and by integrating with Cloudflare's Always Online service, archives of those pages are available to people trying to access them if they become unavailable via the live web,\" said Mark Graham, Director of the Wayback Machine at the Internet Archive. \n\nTo learn more about Always Online and how it works, please check out the resources below. \n\n- [Cloudflare Always Online](https://www.cloudflare.com/always-online/)\n- [Cloudflare Blog](https://blog.cloudflare.com/cloudflares-always-online-and-the-internet-archive-team-up-to-fight-origin-errors/)\n- [Internet Archive Blog](http://blog.archive.org/2020/09/17/internet-archive-partners-with-cloudflare-to-help-make-the-web-more-useful-and-reliable/)\n\n__About Cloudflare__\nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare's platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine's Top Company Cultures 2018 list and ranked among the World's Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Beijing, Singapore, Sydney, and Tokyo.\n\nSource: Cloudflare, Inc.",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "607f4118-38b7-5e63-b782-ee7bb9f5565b",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-partners-with-the-internet-archive-to-keep-the-web-always-online/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}