{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-launches-cloudflare-for-campaigns-to-protect-u-s-election/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "85ba394c-3ccd-50ac-8337-4c2b572cdf58",
				"title": "Cloudflare Launches Cloudflare for Campaigns to Protect U.S. Election Campaigns, At No Cost ",
				"contentfulId": "6DC1IIC0vyronw2sqCrl23",
				"metaTags": null,
				"subtitle": "Services protect campaign websites and internal teams of small and large political campaigns and will be available in the U.S. and globally ",
				"orderDate": "2020-01-15",
				"body": "San Francisco, CA, January 15, 2020 — [Cloudflare, Inc.](https://www.cloudflare.com) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today announced it will be offering free security services to help political campaigns in the United States and around the world defend against cyberattacks and election interference. The [Cloudflare for Campaigns](https://cloudflare.com/campaigns/) program will allow any eligible campaign to access a variety of the company’s security services including enhanced firewall protection, denial-of-service (DDoS) attack mitigation, as well as internal data management and security controls. These services will be provided at no cost to eligible U.S. campaigns, and for a fee to other campaigns in the U.S. and globally.\n\nSince 2014, Cloudflare has offered free security and reliability services to nearly 1,000 vulnerable individuals and organizations around the world including journalists, humanitarian groups, and civil rights activists through [Project Galileo](https://www.cloudflare.com/galileo/). The [Athenian Project](https://www.cloudflare.com/athenian/), launched in 2017, extends these benefits to more than 150 state and local election websites. Separate from these projects, Cloudflare provided services to 16 of the 17 2016 U.S. Presidential campaigns and has provided service to 18 of the 32 2020 U.S. Presidential campaigns. The Cloudflare for Campaigns program will ensure that the same type of security services that are available to the largest campaigns are also available to smaller campaigns.\n\n“Given the increase and sophistication of foreign election interference efforts, there is a clear need to help campaigns improve the security of not only their websites and other public-facing assets, but also their internal data security systems and teams,” said Matthew Prince, co-founder and CEO of Cloudflare. “This is our way of providing best practices and no-brainer solutions to not only large campaigns, but also smaller, but equally important campaigns that may have limited resources.” \n\nCloudflare will provide business-level services to candidates for the duration of their campaigns and will include:\n\n- [Load balancing](https://www.cloudflare.com/load-balancing/): Cloudflare Load Balancing runs at each of its data centers across 200 cities worldwide and is powered by the fastest authoritative DNS in the world. Cloudflare’s global Anycast network is 15x bigger than the largest DDoS attack ever recorded and ensures that traffic continues to get routed even under stress. \n- [Rate limiting](https://www.cloudflare.com/rate-limiting/): Cloudflare Rate Limiting protects against denial-of-service attacks, brute-force login attempts, and other types of abusive behavior from suspicious visitors. \n- [Enhanced firewall protection](https://https://www.cloudflare.com/lp/waf-x/?_bt=396751245019&_bk=cloudflare%20waf&_bm=e&_bn=g&_bg=72444010958&_placement=&_target=&_loc=9031951&_dv=c&gclid=EAIaIQobChMI7Yr8jK_o5gIV9iCtBh3e9QrCEAAYASAAEgKb4_D_BwE): The Cloudflare Web Application Firewall fights attacks in seconds without slowing down websites. \n- [DDoS attack mitigation](https://www.cloudflare.com/lp/ddos-x/?_bt=378710648796&_bk=%2Bcloudflare%20%2Bddos&_bm=b&_bn=g&_bg=72444009038&_placement=&_target=&_loc=9031951&_dv=c&gclid=EAIaIQobChMI5aT7_q7o5gIVSSCtBh1hVAxPEAAYASAAEgLCi_D_BwE&utm_expid=.R4jJvuBeRfq6kKMqsmMkxw.0&utm_referrer=https%3A%2F%2Fwww.google.com%2F): Cloudflare’s network, which has a capacity of 30Tbps, has mitigated attacks as big as 942Gbps. No matter the size of attack, the Cloudflare network can handle it. \n- [Cloudflare for Teams](https://teams.cloudflare.com): This newly announced set of solutions, [Cloudflare Access](https://teams.cloudflare.com/access/) and [Cloudflare Gateway](https://teams.cloudflare.com/gateway/), can secure campaigns and their employees and volunteers globally, without sacrificing performance.\n- [Bot management](https://www.cloudflare.com/lp/bot-management/?_bt=396751244839&_bk=cloudflare%20bot&_bm=p&_bn=g&_bg=72444008878&_placement=&_target=&_loc=9031951&_dv=c&gclid=EAIaIQobChMIqs7ukq_o5gIVgtdkCh04zwSZEAAYASAAEgLOSPD_BwE): Cloudflare’s bot management harnesses threat intelligence from protecting more than 20M Internet properties across its network to detect and mitigate bots. \n\nBy providing free services such as rate-limiting, load balancing, bot management, and web application firewall, political campaigns can defend their campaign websites from attacks. With the addition of Cloudflare for Teams, campaigns can protect their employees and volunteers who have access to their internal networks from malware and viruses, while also giving employees easy access to internal applications no matter where they are in the world. \n\nTo provide these services for free to eligible U.S. campaigns, Cloudflare is working with [Defending Digital Campaigns](https://www.defendcampaigns.org/) (DDC), a non-profit, non-partisan organization providing access to cybersecurity products, services, and information regardless of party affiliation. In May 2019, DDC received approval from the Federal Elections Commission to provide free or discounted cybersecurity services to federal candidate committees and national party committees. \n\n\"Political campaigns, like any organization, need a comprehensive approach to cybersecurity,” said Michael Kaiser, President and CEO of Defending Digital Democracy. “Securing a candidate's website, their critical public facing presence, and hardening access to key internal applications can vastly improve cybersecurity. Defending Digital Campaigns, with a mission to make campaigns more cybersecure, is proud to partner with Cloudflare to protect both external and internal technology assets across the campaign ecosystem.\"\n\nPolitical campaigns that meet DDC requirements can receive these sets of services for free. To receive these free services under DDC, political campaigns must meet the following criteria:\n\n- A House candidate’s committee that has at least $50,000 in receipts for the current election cycle, and a Senate candidate’s committee that has at least $100,000 in receipts for the current election cycle;\n- A House or Senate candidate’s committee for candidates who have qualified for the general election ballot in their respective elections; or \n- Any presidential candidate’s committee whose candidate is polling above five percent in national polls. \n\nCandidates seeking free services should contact Defending Digital Campaigns for additional information at [info@defendcampaigns.org](info@defendcampaigns.org). Interested parties can also reach out to Cloudflare directly at [campaign-security@cloudflare.com](campaign-security@cloudflare.com). \n\nTo learn more, please check out the resources below:\n\n- [Cloudflare for Campaigns Blog](https://blog.cloudflare.com/introducing-cloudflare-for-campaigns) \n- [Cloudflare for Campaigns Landing Page](https://cloudflare.com/campaigns/)\n\n__Forward-Looking Statements__\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which statements involve substantial risks and uncertainties. In some cases, you can identify forward-looking statements because they contain words such as “may,” “will,” “should,” “expect,” “explore,” “plan,” “anticipate,” “could,” “intend,” “target,” “project,” “contemplate,” “believe,” “estimate,” “predict,” “potential,” or “continue,” or the negative of these words, or other similar terms or expressions that concern our expectations, strategy, plans, or intentions. However, not all forward-looking statements contain these identifying words. Forward-looking statements expressed or implied in this press release include, but are not limited to, statements regarding our objectives for Cloudflare for Campaigns, the expected functionality and performance of the services provided with Cloudflare for Campaigns, our technological development, future operations, growth, initiatives, or strategies, and comments made by our CEO and others. Our actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in our filings with the Securities and Exchange Commission (SEC), including our Quarterly Report on Form 10-Q filed on November 12, 2019, as well as other filings that we may make from time to time with the SEC.\n\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements are made. We undertake no obligation to update any forward-looking statements made in this press release to reflect events or circumstances after the date of this press release or to reflect new information or the occurrence of unanticipated events, except as required by law. We may not actually achieve the plans, intentions, or expectations disclosed in our forward-looking statements, and you should not place undue reliance on our forward-looking statements.\n\n__About Cloudflare__ \nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare’s platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine’s Top Company Cultures 2018 list and ranked among the World’s Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, New York, NY, San Jose, CA, Seattle, WA, Washington, D.C., Lisbon, London, Munich, Beijing, Singapore, and Sydney. \n\nSource: Cloudflare, Inc.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "85ba394c-3ccd-50ac-8337-4c2b572cdf58",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-launches-cloudflare-for-campaigns-to-protect-u-s-election/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}