{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-data-localization-suite/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "077b62e6-abd5-51b9-974a-e3ca7caec667",
				"title": "Cloudflare's Data Localization Suite Gives Global Companies the Tools They Need to Control Data Wherever They Do Business ",
				"contentfulId": "1ZKeOPBxGbxfBwjLI3OyuG",
				"metaTags": null,
				"subtitle": "A new suite of tools for businesses to make data protection decisions that meet their local and global needs",
				"orderDate": "2020-12-07",
				"body": "San Francisco, CA, and London, UK, December 7, 2020 — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today released [Data Localization Suite](https://www.cloudflare.com/data-localization/) to give businesses across the globe tools to address their data locality, privacy, and compliance needs. With Data Localization Suite, businesses can use Cloudflare's global cloud network to control where their data goes and who has access to it––no matter what countries they operate in, their industry, or their specific data protection obligations. \n\nMany countries across the globe are introducing new standards and regulations to address data access, protection, and privacy. As a result, businesses now need to evaluate and set data controls at the regional level. Until now, businesses who wanted to localize their data often had to choose to restrict their application to one data center or one cloud provider's region—sacrificing performance or security as a result. The Data Localization Suite helps businesses get the performance and security benefits of Cloudflare's global network, while making it easy to set rules and controls at the edge about where their data is stored and protected.\n\n\"Companies that want to win globally need to be able to operate within the local values and requirements of different regions, and that is increasingly true as nearly every country evaluates how to address data access and protection within its borders,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"We've always prioritized privacy at Cloudflare, and now we're making it easier than ever for our customers to navigate this shifting landscape globally, and regionally.\" \n\nWith Cloudflare's Data Localization Suite, businesses of all sizes have a suite of tools to give them: \n\n- __Control over where their data is inspected, no matter where they do business:__ To quickly adapt to changing local requirements, companies need an easy way to adjust local controls. With Cloudflare's Regional Services offering, companies can choose the location of the data centers where their traffic is inspected. Businesses can also use Cloudflare's Geo Key Manager to choose where private keys are held, and Edge Log Delivery to send their logs anywhere in the world.\n- __An easy way to build and deploy serverless code, with regional control:__ In this complex ecosystem, developers need an easy way to build applications that combine global performance with local compliance. Now Cloudflare is expanding [Workers](https://workers.cloudflare.com/), its serverless platform, with Jurisdiction Tags for Durable Objects to give developers control of where they store data without sacrificing global performance.\n- __Alignment with global and European security certifications:__ As regulations and industry norms shift, standardized certifications can provide validation that businesses are acting in line with their industry. Today, Cloudflare meets industry-leading standards for security and privacy, and validates those commitments with third party auditors on an annual basis. This includes [ISO 27001/27002](https://www.cloudflare.com/resources/assets/slt3lc6tev37/4ALYDhIak6XNrKmB8l1I3E/ac3406231ca7e0be178b68e4ad843e65/ISO_compliance.pdf), [Payment Card Industry Data Security Standards (PCI DSS)](https://www.cloudflare.com/resources/assets/slt3lc6tev37/1kR1Ql7kIS7wsgPpFYASkG/3860de26da985a63a5e5127d2d28f140/PCI_compliance.pdf), and [SSAE 18 SOC 2 Type II](https://www.cloudflare.com/resources/assets/slt3lc6tev37/7vZlrNo1tW8fmtSV3ASMqA/d055046a4fd2efeb845e0d2c1e192c55/SOC2_compliance.pdf).\n- __Default encryption based on the latest industry research:__ Privacy isn't possible without encryption, which is why Cloudflare continuously contributes to the industry's pursuit of better encryption protocols. For example, Cloudflare's work developing the Encrypted Client Hello (ECH) protocol standard will help protect the privacy of Internet traffic metadata. \n\n\"Cloudflare has operated in Europe since it's very early days, and so we are acutely aware of how companies headquartered or operating here need greater flexibility to operate in different localities here and across the world,\" said Thomas Seifert, CFO of Cloudflare. \"With this launch, Cloudflare is doubling down on its track record of building privacy safeguards into its network and products – furthering our mission to help build a better Internet.\" \n\nToday, Cloudflare's global network spans more than 200 cities in over 100 countries including more than 78 cities across Europe to bring its security, performance, and reliability solutions to as close to its European customers as possible. Cloudflare continues to invest in the region, with offices in Lisbon, London, Munich, and Paris. \n\n\"SIXT operates in more than 105 countries, and we turned to Cloudflare because we needed a solution that could truly scale globally,\" said Dr. Klaus Kolitz, Chief Technology Officer, at SIXT. \"With Cloudflare, we have confidence that we have the tools we need to ensure a safe and fast online experience for our customers, while providing our teams a flexible and secure way to build and deploy applications.\"\n\n\"At Delivery Hero, we always strive to deliver an amazing experience to our customers. Cloudflare helps us do the same for our internal teams: offering them a secure working environment across the globe and an easy way to build fast, reliable, and privacy-respecting applications,\" said Christian Von Hardenberg, CTO of Delivery Hero. \n\n\"Millions of people and businesses around the world trust TransferWise for a faster, more convenient, and transparent way to send and spend money abroad. With Cloudflare, we can deliver a fast and reliable online experience, operate securely so our customers are safe, and ensure user privacy with built-in data protection,\" said Dr. Thomas Hewer, Engineering Lead at TransferWise. \n\n\"Cloudflare streamlined our migration from on-premise to the cloud — giving us the strategic flexibility to choose the right cloud solution for the job, and the ability to easily make changes down the line,\" said Isabel Wolters, CTO of Handelsblatt. \"We look forward to Cloudflare's continued investment in both its product and its presence in Europe.\" \n\n\"Cloudflare's Project Galileo reflects exactly the spirit of technological innovation combined with a responsible business approach, which we at the Alliance of Democracies Foundation and many of our European partners and friends highly endorse. The focus of our foundation is to advance democracy worldwide. Hence, we didn't hesitate for a moment to partner with Cloudflare for Project Galileo, because we know how important it is to protect democracy activists and civil society organizations from malign interference of state or non-state actors,\" said Jonas Parello-Plesner, Executive Director of the Alliance of Democracies Foundation.\n\nTo learn more about Data Localization Suite or Cloudflare's commitment to customers' privacy and compliance needs, please check out the resources below:\n\n- [Cloudflare Blog: Introducing the Cloudflare Data Localization Suite](https://blog.cloudflare.com/introducing-the-cloudflare-data-localization-suite/)\n- [Cloudflare Blog: Privacy needs to be built into the Internet](https://blog.cloudflare.com/internet-privacy/)\n- [Privacy Week Landing Page](https://www.cloudflare.com/privacyweek/) \n\n__About Cloudflare__ \nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare's platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine's Top Company Cultures 2018 list and ranked among the World's Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Paris, Beijing, Singapore, Sydney, and Tokyo. \n\n__Forward-Looking Statements__ \nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which statements involve substantial risks and uncertainties. In some cases, you can identify forward-looking statements because they contain words such as \"may,\" \"will,\" \"should,\" \"expect,\" \"explore,\" \"plan,\" \"anticipate,\" \"could,\" \"intend,\" \"target,\" \"project,\" \"contemplate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" or \"continue,\" or the negative of these words, or other similar terms or expressions that concern our expectations, strategy, plans, or intentions. However, not all forward-looking statements contain these identifying words. Forward-looking statements expressed or implied in this press release include, but are not limited to, statements regarding our plans and objectives for the Data Localization Suite and the related suite of our products, the benefits to customers from using our products, the expected functionality and performance of our products, our security certifications, global and regional changes in data access, protection, and privacy standards and regulations, our technological development, future operations, growth, initiatives, or strategies, and comments made by our CEO and others. Actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in our filings with the Securities and Exchange Commission (SEC), including our Quarterly Report on Form 10-Q filed on November 10, 2020, as well as other filings that we may make from time to time with the SEC.\n\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements are made. We undertake no obligation to update any forward-looking statements made in this press release to reflect events or circumstances after the date of this press release or to reflect new information or the occurrence of unanticipated events, except as required by law. We may not actually achieve the plans, intentions, or expectations disclosed in our forward-looking statements, and you should not place undue reliance on our forward-looking statements.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "077b62e6-abd5-51b9-974a-e3ca7caec667",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-data-localization-suite/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}