{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-announces-web-analytics-a-privacy-first-free-alternative-for-all/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "ac8070d1-c72b-57aa-8478-4aec5eb91b8e",
				"title": "Cloudflare Announces Web Analytics, a Privacy-First, Free Alternative  for All Website Owners",
				"contentfulId": "4gv2sCWxkqVtwMPyproioh",
				"metaTags": null,
				"subtitle": "New solution gives anyone a more accurate way to track website performance without compromising visitors’ privacy ",
				"orderDate": "2020-09-29",
				"body": "San Francisco, CA, September 29, 2020 — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today launched Cloudflare Web Analytics to provide accurate, clear, and free analytics for anyone who cares about how their site is performing and doesn’t want to sacrifice their visitors’ privacy. Cloudflare Web Analytics is built on top of Cloudflare’s existing network, giving site owners insight into key traffic metrics at the edge. Now site owners have control over their own site data, eliminating the need for third-party scripts that can track their users and help retarget them with advertising. Cloudflare Web Analytics will be available, for free, to any website owner, whether they are an existing Cloudflare customer or not. \n\nFor website owners and businesses, analytics are the backbone of their online strategy. This data helps them understand how people find a website, what types of devices they are using, and what they do once they get to a website–critical information for creating a better experience for their online visitors. Before today, getting access to that data came at a price when using popular analytics tools created by ad-tech companies. Advertising-driven business models help ad-supported sites sell more ads and are gleaning lots of visitor and site data in return for site analytics. As a result, website owners have to trade user privacy for data on how their own sites were performing. What’s worse, the tradeoff doesn’t ensure that site owners get accurate data because visitors with ad blockers often aren’t counted. With Cloudflare Web Analytics, any web creator—not just Cloudflare customers—can get the information they need in a simple, clean, and accurate way that does not sacrifice their visitors' privacy.\n\n“Website owners deserve access to analytics that are transparent and accurate, and that don’t force them to pay with their users’ privacy,” said Matthew Prince, co-founder and CEO of Cloudflare. “With Cloudflare Web Analytics, website owners can help protect their visitors' privacy, and focus on what really matters–clean, simple metrics to understand how their site is performing. We believe this is an important step in helping to build a better, and more private Internet for everyone, not just Cloudflare customers.\"\n\nUnlike ad-supporting analytics companies, Cloudflare’s business model has never been about tracking individual users across the web. Cloudflare does not track where visitors are going online, and can help web owners get clear and accurate information about how their sites are performing without the need to profile users. Cloudflare already processes the requests for sites on its network and can collect analytics at the edge without adding third-party analytics scripts to a website. This privacy-friendly approach measures a ‘visit’ by looking at the source of each request, rather than tracking individual user behavior. Cloudflare Web Analytics is also able to deliver accurate insights because this method does not conflict with ad blockers, which frequently block third-party analytics tools from measuring anything at all. When combined with Cloudflare’s Bot Management tool, automated bot traffic that could skew analytics is also filtered out for improved accuracy. \n\nCloudflare paid customers can enjoy Web Analytics today, with a click of a button on their dashboard. In the coming months, Cloudflare Web Analytics will be made available to any website owner – including those not on Cloudflare's network. If you are not an existing Cloudflare customer on a paid plan, you can add your name to the waitlist [here](https://www.cloudflare.com/web-analytics/). To learn more about Cloudflare Web Analytics, please check out the resources below. \n\n- [Cloudflare Web Analytics ](https://www.cloudflare.com/web-analytics/)\n- [Cloudflare Blog](https://blog.cloudflare.com/free-privacy-first-analytics-for-a-better-web/)  \n\n__About Cloudflare__\nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare’s platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine’s Top Company Cultures 2018 list and ranked among the World’s Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Beijing, Singapore, Sydney, and Tokyo.\n\n__Forward-Looking Statements__\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which statements involve substantial risks and uncertainties. In some cases, you can identify forward-looking statements because they contain words such as “may,” “will,” “should,” “expect,” “explore,” “plan,” “anticipate,” “could,” “intend,” “target,” “project,” “contemplate,” “believe,” “estimate,” “predict,” “potential,” or “continue,” or the negative of these words, or other similar terms or expressions that concern our expectations, strategy, plans, or intentions. However, not all forward-looking statements contain these identifying words. Forward-looking statements expressed or implied in this press release include, but are not limited to, statements regarding our plans and objectives for Cloudflare Web Analytics, the benefits to customers from using our products, the expected functionality and performance of our products, our technological development, future operations, growth, initiatives, or strategies, and comments made by our CEO and others. Our actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in our filings with the Securities and Exchange Commission (SEC), including our Quarterly Report on Form 10-Q filed on August 10, 2020, as well as other filings that we may make from time to time with the SEC.\n\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements are made. We undertake no obligation to update any forward-looking statements made in this press release to reflect events or circumstances after the date of this press release or to reflect new information or the occurrence of unanticipated events, except as required by law. We may not actually achieve the plans, intentions, or expectations disclosed in our forward-looking statements, and you should not place undue reliance on our forward-looking statements.\n\nSource: Cloudflare, Inc.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "ac8070d1-c72b-57aa-8478-4aec5eb91b8e",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-announces-web-analytics-a-privacy-first-free-alternative-for-all/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}