{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-inc-announces-pricing-of-offering-of-usd500-million-of-0-75/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "882f49b3-b638-57cc-b76f-2aa1b240fd1f",
				"title": "Cloudflare, Inc. Announces Pricing of Offering of $500 Million of 0.75% Convertible Senior Notes Due 2025",
				"contentfulId": "1ZVDplhlBi5eqR973HzXj0",
				"metaTags": null,
				"subtitle": null,
				"orderDate": "2020-05-13",
				"body": "San Francisco, CA, May 13, 2020 — Cloudflare, Inc. (NYSE: NET) today announced the pricing of $500 million aggregate principal amount of Convertible Senior Notes due 2025 (the “notes”) in a private offering (the “offering”) to qualified institutional buyers pursuant to Rule 144A promulgated under the Securities Act of 1933, as amended (the “Securities Act”). Cloudflare also granted the initial purchasers of the notes a 13-day option to purchase up to an additional $75 million aggregate principal amount of the notes. The sale of the notes to the initial purchasers is expected to settle on May 15, 2020, subject to customary closing conditions, and is expected to result in approximately $488.2 million in net proceeds to Cloudflare after deducting the initial purchasers’ discount and estimated offering expenses payable by Cloudflare (assuming no exercise of the initial purchasers’ option to purchase additional notes).\n\nThe notes will be senior, unsecured obligations of Cloudflare. The notes will bear interest at a rate of 0.75% per year. Interest will be payable semi-annually in arrears on May 15 and November 15 of each year, beginning on November 15, 2020. The notes will mature on May 15, 2025, unless earlier redeemed, repurchased, or converted. Cloudflare may not redeem the notes prior to May 20, 2023. Cloudflare may redeem for cash all or any portion of the notes, at its option, on or after May 20, 2023, if the last reported sale price of Cloudflare’s Class A common stock has been at least 130% of the conversion price then in effect for at least 20 trading days (whether or not consecutive) during any 30 consecutive trading day period (including the last trading day of such period) ending on and including the trading day preceding the date on which Cloudflare provides notice of redemption at a redemption price equal to 100% of the principal amount of the notes to be redeemed, plus any accrued and unpaid interest to, but excluding, the redemption date. No sinking fund is provided for the notes, which means that Cloudflare is not required to redeem or retire the notes periodically. Holders of the notes will have the right to require Cloudflare to repurchase for cash all or a portion of their notes upon the occurrence of a fundamental change (as defined in the indenture governing the notes) at a purchase price of 100% of their principal amount plus any accrued and unpaid interest.\n\nThe notes will be convertible at an initial conversion rate of 26.7187 shares of Cloudflare’s Class A common stock, per $1,000 principal amount of notes (equivalent to an initial conversion price of approximately $37.43 per share, which represents a conversion premium of approximately 30.0% to the last reported sale price of $28.79 per share of Cloudflare’s Class A common stock on The New York Stock Exchange on May 12, 2020).\n\nPrior to the close of business on the business day immediately preceding February 15, 2025, the notes will be convertible at the option of the noteholders only upon the satisfaction of specified conditions and during certain periods. On or after February 15, 2025 until the close of business on the second scheduled trading day preceding the maturity date, the notes will be convertible at the option of the noteholders at any time regardless of these conditions. Conversions of the notes will be settled in cash, shares of Cloudflare’s Class A common stock, or a combination thereof, at Cloudflare’s election.\n\nIn connection with the pricing of the notes, Cloudflare entered into privately negotiated capped call transactions with certain of the initial purchasers and/or their respective affiliates and/or other financial institutions (the “option counterparties”). The capped call transactions cover, subject to anti-dilution adjustments, the number of shares of Class A common stock underlying the notes sold in the offering. The capped call transactions are generally expected to reduce potential dilution to Cloudflare’s Class A common stock upon any conversion of the notes and/or offset any cash payments Cloudflare is required to make in excess of the principal amount of converted notes, as the case may be, with such reduction and/or offset subject to a cap. The cap price of the capped call transactions is initially approximately $57.58 per share, which represents a premium of 100% over the last reported sale price of Cloudflare’s Class A common stock of $28.79 per share on May 12, 2020, and is subject to certain adjustments under the terms of the capped call transactions.\n\nCloudflare has been advised that, in connection with establishing their initial hedges of the capped call transactions, the option counterparties or their respective affiliates expect to purchase shares of Cloudflare’s Class A common stock and/or enter into various derivative transactions with respect to the Class A common stock concurrently with or shortly after the pricing of the notes. This activity could increase (or reduce the size of any decrease in) the market price of Cloudflare’s Class A common stock or the notes at that time. In addition, Cloudflare expects that the option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to the Class A common stock and/or by purchasing or selling shares of the Class A common stock or other securities of Cloudflare in secondary market transactions following the pricing of the notes and prior to the maturity of the notes (and are likely to do so following any conversion, repurchase, or redemption of the notes, to the extent Cloudflare exercises the relevant election under the capped call transactions). This activity could also cause or avoid an increase or a decrease in the market price of the Class A common stock or the notes, which could affect the ability of noteholders to convert the notes and, to the extent the activity occurs following a conversion or during any observation period related to a conversion of the notes, could affect the number of shares and value of the consideration that noteholders will receive upon conversion of the notes.\n\nCloudflare intends to use approximately $58.6 million of the net proceeds from the offering of the notes to pay the cost of the capped call transactions. If the initial purchasers exercise their option to purchase additional notes, Cloudflare expects to use a portion of the net proceeds from the sale of such additional notes to enter into additional capped call transactions with the option counterparties. Cloudflare intends to use the remainder of the net proceeds from the offering for general corporate purposes, which may include working capital, capital expenditures, and potential acquisitions and strategic transactions.\n\nThe notes were only offered to qualified institutional buyers pursuant to Rule 144A promulgated under the Securities Act by means of a private offering memorandum. Neither the notes nor the shares of Cloudflare’s Class A common stock potentially issuable upon conversion of the notes, if any, have been, or will be, registered under the Securities Act or the securities laws of any other jurisdiction, and unless so registered, may not be offered or sold in the United States, except pursuant to an applicable exemption from such registration requirements.\n\nThis announcement is neither an offer to sell nor a solicitation of an offer to buy any of these securities and shall not constitute an offer, solicitation, or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful.\n\nInvestor Relations Information  \nJayson Noland  \nir@cloudflare.com  \n\nPress Contact Information  \nDaniella Vallurupalli  \npress@cloudflare.com",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "882f49b3-b638-57cc-b76f-2aa1b240fd1f",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-inc-announces-pricing-of-offering-of-usd500-million-of-0-75/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}