{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-announces-cloudflare-pages/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "ebb046c0-adeb-55d1-b06b-244073f046e8",
				"title": "Cloudflare Announces Cloudflare Pages, Brings Next Generation Website Development Platform to Businesses and Developers",
				"contentfulId": "1D2lsAFJ9yagF94UMrsCzz",
				"metaTags": null,
				"subtitle": "New platform delivers the fastest and most scalable websites distributed on the edge",
				"orderDate": "2020-12-17",
				"body": "San Francisco, CA, December 17, 2020 — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today announced the release of Cloudflare Pages, the next-generation website development platform with exceptional performance, security, scalability, and pricing. Cloudflare Pages is [JAMstack](https://www.cloudflare.com/learning/performance/what-is-jamstack/)-compatible and offers exceptional security, scalability, pricing, and performance—up to twice as fast as other platforms. Cloudflare Pages provides developers a simpler, faster, and more collaborative way to build websites for free. \n\n\"From day one Cloudflare was built to service developers. Over the last ten years, millions of developers have counted on us for our network performance and security services. With Cloudflare Pages, we're now providing them with a scalable, fast, secure, cost-effective platform to build next-generation applications that they can deploy globally,\" said Matthew Prince, co-founder & CEO of Cloudflare. \"Internally, we believe it's only a matter of time before an individual developer builds a billion dollar company on their own. We hope Cloudflare Pages will provide the building blocks to help make our belief a reality.\"  \n\nPerformance on the web has always been a battle against the speed of light—accessing a site from London that is served from Seattle, WA means every single asset request has to travel over seven thousand miles. Cloudflare Pages is the next breakthrough in the web performance battle, building entire sites directly onto the edge of the Internet, and closer to the end-users. With Cloudflare Pages, developers can focus on building brilliant websites rather than spending time on integrating disparate systems. Pages integrates seamlessly with GitHub to simplify the development process, to collect and integrate feedback from multiple stakeholders, and to deploy those changes quickly to the edge. \n\nCloudflare Pages provides a broad set of benefits to developers: \n- __Massively Scalable:__ Built on Cloudflare's global network spanning more than 200 cities in over 100 countries. \n- __Collaborative:__ Pages automatically generates preview links for every commit, allowing all stakeholders to easily provide feedback. Users can add an unlimited number of collaborators for free to each project, making Pages ideal for teams of every size.\n- __Simple Deployment:__ Deploy directly to Cloudflare's edge using Git integration.\n- __Performance:__ Cloudflare Pages run on Cloudflare's edge, within 100 milliseconds of 99% of the Internet-connected population in the developed world, resulting in speeds up to twice as fast as other platforms.\n- __Secure By Design:__ Build with confidence with free SSL as standard, and Cloudflare's WAF just one click away. Cloudflare also provides support for the latest web standards with HTTP/3, QUIC, and image compression out of the box.\n- __Cost-Effective:__ Cloudflare Pages has one of the industry's best free plans, providing unlimited bandwidth, requests, and admin seats for free.\n- __Integrated with Cloudflare Workers Platform:__ Developers will be able to write their own APIs through direct integration with Workers, and have access to direct storage via Workers KV and Durable Objects. \n\n\"Cloudflare Pages makes it really easy for our agency to hit deadlines to build static sites for our customers,\" said Matt Weinberg, Co-Founder & President of Development & Technology at Happy Cog. \"We no longer have to worry about scaling as traffic increases around launch dates. We are also very excited to see what powerful applications we can build by combining Cloudflare Pages and Workers.\"\n\nTo learn more about Cloudflare and Cloudflare Pages, please check out the resources below:\n- [Cloudflare Pages Blog](https://blog.cloudflare.com/cloudflare-pages)\n- [Cloudflare Pages Landing Page](https://pages.cloudflare.com/)\n\n__About Cloudflare__\nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare's platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine's Top Company Cultures 2018 list and ranked among the World's Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Paris, Beijing, Singapore, Sydney, and Tokyo.\n\n__Forward-Looking Statements__ \nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which statements involve substantial risks and uncertainties. In some cases, you can identify forward-looking statements because they contain words such as \"may,\" \"will,\" \"should,\" \"expect,\" \"explore,\" \"plan,\" \"anticipate,\" \"could,\" \"intend,\" \"target,\" \"project,\" \"contemplate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" or \"continue,\" or the negative of these words, or other similar terms or expressions that concern our expectations, strategy, plans, or intentions. However, not all forward-looking statements contain these identifying words. Forward-looking statements expressed or implied in this press release include, but are not limited to, statements regarding our plans and objectives for Cloudflare Pages, the benefits to customers from using our products, the expected functionality and performance of our products, our technological development, future operations, growth, initiatives, or strategies, and comments made by our CEO and others. Actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in our filings with the Securities and Exchange Commission (SEC), including our Quarterly Report on Form 10-Q filed on November 10, 2020, as well as other filings that we may make from time to time with the SEC.\n\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements are made. We undertake no obligation to update any forward-looking statements made in this press release to reflect events or circumstances after the date of this press release or to reflect new information or the occurrence of unanticipated events, except as required by law. We may not actually achieve the plans, intentions, or expectations disclosed in our forward-looking statements, and you should not place undue reliance on our forward-looking statements.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "ebb046c0-adeb-55d1-b06b-244073f046e8",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-announces-cloudflare-pages/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}