{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-launches-radar-sharing-the-latest-internet-trends-with-the-world/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "f7d49e56-9292-5077-bd25-1b1333b34cc2",
				"title": "Cloudflare Launches Radar, Sharing the Latest Internet Trends with the World in One Interactive Public Tool",
				"contentfulId": "2xthyTFPxUkPTg9QyeiM8z",
				"metaTags": null,
				"subtitle": "New interactive, public Internet intelligence platform lets anyone view the latest global Internet trends, traffic patterns, and threat intelligence, for free",
				"orderDate": "2020-09-30",
				"body": "San Francisco, CA, September 30, 2020 — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today launched [Cloudflare Radar](https://radar.cloudflare.com/), a free public tool that lets anyone view global traffic and security trends across the Internet as they happen. Leveraging Cloudflare's network, which touches millions of Internet properties and spans more than 200 cities in over 100 countries, Cloudflare Radar allows people to access global and regional trends in traffic patterns, view changes in traffic to popular websites over time, and monitor emerging security threats.  \n\n\"Cloudflare has built one of the world's largest networks, offering one of the most representative views of Internet traffic and activity worldwide,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Cloudflare Radar is like a newspaper for the Internet, showing the latest headlines so everyone can understand what's happening at any given time online. Giving any digital citizen the chance to see what's happening online is part of our pursuit to help build a better, more informed, Internet.\"\n\nWith Cloudflare Radar, anyone can easily explore Internet trends and insights related to security, performance, and usage. Now anyone can access Cloudflare Radar to: \n\n- __Internet News & Trends:__ Discover the latest trends happening online—including the adoption of new technologies, operating systems, and even what devices people are using by region. \n- __Trending Domains:__ Access a running list of the most visited websites globally, and by region.\n- __Traffic Volume:__ Uncover current Internet traffic volumes globally, and by region.\n- __Attack Activity:__ Identify insights into attack vectors and volumes globally, and by region.\n- __Domain Insights:__ Learn more about individual domains, including a domain's traffic ranking, creation date, and if it follows the latest security protocols. \n- __IP Insights:__ Find more information about specific IP addresses including its ISP, origin country, and even if it has been associated with a bot before.\n\nCloudflare Radar is available to everyone today. Check it out for yourself at: https://radar.cloudflare.com/\n\nOther Resources:\n- [Cloudflare Blog: Introducing Cloudflare Radar](https://blog.cloudflare.com/introducing-cloudflare-radar)\n- [Cloudflare Blog: Speeding up HTTPS and HTTP/3 negotiation with... DNS](https://blog.cloudflare.com/speeding-up-https-and-http-3-negotiation-with-dns)\n\n__About Cloudflare__\nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare's platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine's Top Company Cultures 2018 list and ranked among the World's Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Beijing, Singapore, Sydney, and Tokyo.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "f7d49e56-9292-5077-bd25-1b1333b34cc2",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-launches-radar-sharing-the-latest-internet-trends-with-the-world/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}