{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-announces-cloudflare-one-a-platform-to-connect-and-secure/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "f688997a-60bf-50b6-838b-b68f5ca8426c",
				"title": "Cloudflare Announces Cloudflare One, a Platform to Connect and Secure Companies and Remote Teams Anywhere, On Any Device",
				"contentfulId": "19Oi31VL2ATqbO8vVFybgl",
				"metaTags": null,
				"subtitle": "New platform uses a Zero Trust security model to provide an easy and reliable way for companies of all sizes to protect the devices, data, and applications they rely on ",
				"orderDate": "2020-10-12",
				"body": "San Francisco, CA, October 12, 2020 — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today released Cloudflare One, a comprehensive, cloud-based network-as-a-service solution for your workforce. As more businesses rely on the Internet to operate, Cloudflare One protects and accelerates the performance of devices, applications, and entire networks to keep workforces secure. Now businesses can protect their workforce in a flexible and scalable way, without compromising security as distributed teams work from multiple devices and personal networks. \n\n\"After decades of building legacy corporate networks, organizations are left with clunky systems designed to protect their now empty offices. The only way to secure today’s work-from-anywhere economy is to secure each individual employee, protecting their individual networks, devices, and access to business-critical applications,\" said Matthew Prince, co-founder and CEO of Cloudflare. “With Cloudflare One, we’re giving organizations of any size the power to solve their security and networking needs seamlessly, no matter how their business needs shift.”\n\nCompanies have traditionally used a castle-and-moat approach to security, creating a barrier between the enterprise network and external threats. Now that applications have moved to the cloud, and more employees have moved outside of the office, that model is broken. Employees are frustrated with the speed and experience of VPNs, and organizations want an alternative to the expensive patchwork of legacy solutions required to secure and connect corporate offices to each other and the Internet. Today’s new landscape requires a Zero Trust approach, where organizations do not automatically trust any requests to corporate data or resources, and instead, verify every attempt to connect to corporate systems before allowing them access.\n\nWith the rapid shift to remote work caused by the pandemic, businesses of all sizes are looking to adopt a Zero Trust architecture. According to an October 2020 commissioned study conducted by Forrester Consulting:\n- 76% of businesses today say their organization’s security approach is “antiquated” and that they need to shift to a Zero Trust framework. \n- 82% of all organizations have already committed to migrating to a Zero Trust security architecture. \n- 80% of security leaders said that their organizations accelerated cloud transformation efforts in 2020, but they were unprepared to manage such an overhaul.\n\nCloudflare secures and accelerates millions of Internet properties using a global network that covers 200+ cities in more than 100 countries. Cloudflare One uses that same network scale to give businesses multiple on-ramps to the public Internet from offices, to data centers, to employees in-the-field, and connects traffic to Cloudflare’s comprehensive Zero Trust solution. This unified solution enables fast and safe connections to workplace applications, allows teams to use an app without exposing it to the public Internet, makes personal devices safe for business use, and works in any environment with any cloud provider.\n\nCloudflare One provides a unified set of tools for a Zero Trust solution, giving organizations a one-stop-shop to do things like:\n\n- __Secure every connection:__ Remote employees can get the same protection they’d expect from a corporate firewall no matter where they are working from. With Cloudflare One, Cloudflare Access checks for identity across every workload and Cloudflare Gateway keeps users, devices, and data safe on the Internet.\n- __Protect against Zero-Day attacks:__ Today’s browsers are inherently vulnerable to zero-day attacks and other malicious threats on the Internet. Cloudflare’s remote browser isolation technology creates a gap between a user’s browser and endpoint, protecting devices and networks from exploits and attacks.  \n- __Integrate with the security solutions you’re using:__ Cloudflare seamlessly connects with leading identity platforms like Okta, Onelogin, and Ping Identity, and endpoint protection platforms like CrowdStrike, VMware Carbon Black, Tanium, and SentinelOne to verify identity and assess device health before granting access to applications. \n- __Monitor and manage your network with a single pane of glass:__ With Cloudflare's firewall features, businesses get a comprehensive view of all data flows globally. Now businesses have a bird's eye view of what’s happening on their data centers, branch offices, clouds, and endpoints and then use that intelligence to mitigate intrusions and threats quickly across the entire network.\n\nAccording to Chase Cunningham, VP, Principal Analyst Serving Security & Risk Professionals at Forrester, in the report *“The Forrester Wave™: Zero Trust eXtended Ecosystem Platform Providers, Q3 2020,”* “As legacy technology becomes outdated and less effective, improved technical capabilities powering the future of work will dictate which providers will lead the pack. Vendors that can provide a secure remote workforce, Zero Trust mission completion, and easy-to-use technology position themselves to successfully deliver true Zero Trust to their customers.”\n\n__Cloudflare One Customers __\n\n“JetBlue Travel Products needed a way to give crew-members secure and simple access to internally-managed benefit apps,” said Vitaliy Faida, General Manager, Data/DevSecOps at JetBlue Travel Products. “Cloudflare gave us all that and more — a much more efficient way to connect business partners and crew-members to critical internal tools.\"\n\n“OneTrust relies on Cloudflare to maintain our network perimeter, so we can focus on delivering technology that helps our customers be more trusted,” said Blake Brannon, CTO of OneTrust. “With Cloudflare, we can easily build context-aware Zero Trust policies for secure access to our developer tools. Employees can connect to the tools they need so simply teams don’t even know Cloudflare is powering the backend. It just works.”\n\n\"Discord is where the world builds relationships. Cloudflare helps us deliver on that mission, connecting our internal engineering team to the tools they need,” said Mark Smith, Director of Infrastructure at Discord. “With Cloudflare, we can rest easy knowing every request to our critical apps is evaluated for identity and context — a true Zero Trust approach.\" \n\n\"When you're a fast-growing, security-focused company like Area 1, anything that slows development down is the enemy,” said Blake Darché, CSO at Area 1 Security. “With Cloudflare, we've found a simpler, more secure way to connect our employees to the tools they need to keep us growing — and the experience is lightning-fast.\"\n\n\"We launched quickly in April 2020 to bring remote learning to children throughout the UK during the coronavirus pandemic,\" said John Roberts, Technology Director at Oak National Academy. \"Cloudflare Access made it fast and simple to authenticate a huge network of teachers and developers into our production sites and we set it up in literally less than an hour. Cloudflare's WAF helped ensure the security and resilience of our public-facing website from day one.\" \n\n“With Cloudflare, we’ve been able to reduce our dependence on VPNs and IP allow-listing for development environments. Our developers and testers aren't required to login from specific locations, and we’ve been able to deploy an SSO solution to simplify the login process,” said Alexandre Papadopoulos, Director of Cyber Security, INSEAD. “Access is easier to manage than VPNs and other remote access solutions, which has removed pressure from our IT teams. They can focus on internal projects instead of spending time managing remote access.”  \n\n__Cloudflare One Partners__\n\n“In today’s work-from-anywhere business culture, the risk of compromise has substantially increased as employees and their devices are continuously surrounded by a hostile threat environment outside the office walls,” said Amol Kulkarni, Chief Product Officer at CrowdStrike. “Through our integration with Cloudflare, organizations can leverage the power of the CrowdStrike Falcon platform to accurately assess the security posture of any host for application access, delivering end-to-end Zero Trust protection across endpoints, workloads and applications to stop attacks in real-time.” \n\n“The VMware Carbon Black Cloud consolidates multiple endpoint and workload security offerings into a single, cloud native platform,” said Tom Corn, Senior Vice President, Security Business Unit, VMware. “Leveraging VMware Carbon Black Cloud, Cloudflare can help customers enable devices connecting to their cloud and Zero Trust networks are better secured and managed.”\n\n\"Ping Identity helps enterprises improve security and user experience across their digital footprint with their Intelligent Identity Platform,\" said Baber Amin, CTO West of Ping Identity. \"Cloudflare integrates with Ping Identity's global authentication authority to provide a comprehensive identity and zero trust networking solution to teams working on the internet, and ensure that only the right people get the appropriate access to resources at the right time.\" \n\n“Enterprises have come to terms with the notion of a disintegrating traditional perimeter. The distributed and dynamic perimeter of today requires a fundamentally new approach to security,” said Chuck Fontana, SVP Business & Corporate Development at SentinelOne. “In partnership with Cloudflare, our AI-powered cybersecurity platform offers modern enterprises a more robust zero trust security solution that spans the devices, the network, and the mission critical applications enterprises rely on.\"\n\n\"Zero trust security architectures started at the network level with segmentation and enforcement, but as corporate resources and data increasingly live on endpoints, a zero trust architecture must take both the endpoint and the network into consideration,\" said Pete Constantine, Chief Product Officer at Tanium. \"Knowing the identity of the endpoint, as well as knowing that it’s up-to-date, hardened against security threats and hasn’t been compromised, is paramount in ensuring secure access to an organization's resources.\"\n\n\"As enterprises make the move to cloud infrastructure and adopt zero trust security models, they need to visualize, manage, and enforce security policy across heterogenous hybrid networks,” said Satin Mirchandani, President and CEO of FireMon. “Through our partnership with Cloudflare, enterprises can embrace the performance and security benefits of Cloudflare One while ensuring consistent visibility and control across their entire network security estate.\"\n\nTo learn more about Cloudflare One, please check out the resources below:\n- [Introducing Cloudflare One](http://blog.cloudflare.com/introducing-cloudflare-one)\n- [Cloudflare One Technical Overview](http://blog.cloudflare.com/cloudflare-one)\n- [Forrester Opportunity Snapshot](http://cloudflare.com/lp/forrester-opportunity-snapshot-zero-trust) \n\n__About Cloudflare__ \nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare’s platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine’s Top Company Cultures 2018 list and ranked among the World’s Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Beijing, Singapore, Sydney, and Tokyo.\n\nVMware and Carbon Black are registered trademarks or trademarks of VMware, Inc. or its subsidiaries in the United States and other jurisdictions.\n\n__Forward-Looking Statements__ \nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which statements involve substantial risks and uncertainties. In some cases, you can identify forward-looking statements because they contain words such as “may,” “will,” “should,” “expect,” “explore,” “plan,” “anticipate,” “could,” “intend,” “target,” “project,” “contemplate,” “believe,” “estimate,” “predict,” “potential,” or “continue,” or the negative of these words, or other similar terms or expressions that concern our expectations, strategy, plans, or intentions. However, not all forward-looking statements contain these identifying words. Forward-looking statements expressed or implied in this press release include, but are not limited to, statements regarding our plans and objectives for Cloudflare One, the benefits to customers from using our products, the expected functionality and performance of our products, our technological development, future operations, growth, initiatives, or strategies, and comments made by our CEO and others. Actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in our filings with the Securities and Exchange Commission (SEC), including our Quarterly Report on Form 10-Q filed on August 10, 2020, as well as other filings that we may make from time to time with the SEC.\n\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements are made. We undertake no obligation to update any forward-looking statements made in this press release to reflect events or circumstances after the date of this press release or to reflect new information or the occurrence of unanticipated events, except as required by law. We may not actually achieve the plans, intentions, or expectations disclosed in our forward-looking statements, and you should not place undue reliance on our forward-looking statements.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "f688997a-60bf-50b6-838b-b68f5ca8426c",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-announces-cloudflare-one-a-platform-to-connect-and-secure/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}