{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2020/cloudflare-announces-new-tokyo-office-and-head-of-japan-to-further-support/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "af447320-b8e8-576d-9d7c-f64b255d7e05",
				"title": "Cloudflare Announces New Tokyo Office and Head of Japan to Further Support APAC Operations",
				"contentfulId": "5DGCLfQj4MeFQveWZvKMpm",
				"metaTags": null,
				"subtitle": "The company expands its presence in APAC with new office in Tokyo",
				"orderDate": "2020-07-19",
				"body": "San Francisco, CA, July 20, 2020 — [Cloudflare, Inc.](https://www.cloudflare.com) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today announced that Tokyo, Japan, is the home of its newest Asia-Pacific (APAC) office. This office will help the company grow brand awareness, support customers, and recruit new talent. Cloudflare also announced that Masa Aoba, a seasoned technology executive with more than 30 years of experience in the IT industry, will lead this new office and team. \n\nToday, Cloudflare's global network spans more than 200 cities in more than 100 countries, including two cities in Japan. Cloudflare first invested in Japan nearly a decade ago, expanding its network into Tokyo in 2010, just months after launching. The company later expanded its network into Osaka in [2015](https://blog.cloudflare.com/osaka-data-center/), and today Cloudflare's network spans 33 cities across the APAC region. Cloudflare is planning further expansion in the region as it continues to grow its network beyond 200 cities globally. \n\n\"As the third largest economy, and one of the most Internet-connected countries in the world, Japan was a clear choice when considering expansion locations for our next APAC office,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Our new facility and team in Tokyo present a unique opportunity to be closer to our customers, and help even more businesses and users experience a better Internet across Japan and throughout the world.\" \n\nWith more than 27 million Internet properties on Cloudflare's network, the company already has many customers in the APAC region and in Japan, specifically, including Sony Music Axis Inc. \nCloudflare has also partnered with Accelia, Classmethod, D-zero, Domo, Mitsui Knowledge Industry, Spelldata, and GlobalDots Japan GK in Japan to enable joint customers in the country. \n\nCloudflare's first Head of Japan, Masa Aoba, will oversee and lead the company's sales and activities in Japan. \"More than 90 percent of Japan's population uses the Internet and Japan is home to 52 of the Fortune 500 companies,\" said Masa Aoba, Head of Japan at Cloudflare. \"With this level of connectivity and business acumen, we have a huge opportunity to grow our brand in Japan. I'm looking forward to helping our Japanese customers and partners secure and optimize their business-critical applications to connect to their users across the world.\"\n\nIn the last year, Cloudflare grew its APAC team by 63 percent. Today, Cloudflare has more than 180 employees in APAC. Cloudflare's Tokyo location will join its other global offices in San Francisco, CA, San Jose, CA, Austin, TX, Champaign, IL, New York, NY, Washington, D.C., Lisbon, London, Munich, Singapore, Sydney, and Beijing. \n\nTo learn more about Cloudflare, please check out the resources below:\n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [Cloudflare Careers Page](https://www.cloudflare.com/careers/jobs/?location=tokyo&)\n- [Japan Blog (English)](http://blog.cloudflare.com/why-im-helping-cloudflare-grow-in-japan/) \n- [Japan Blog (Japanese)](http://blog.cloudflare.com/jp/why-im-helping-cloudflare-grow-in-japan-jp/) \n\n__About Cloudflare__\nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare's platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine's Top Company Cultures 2018 list and ranked among the World's Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Beijing, Singapore, Sydney, and Tokyo.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "af447320-b8e8-576d-9d7c-f64b255d7e05",
			"locale": "en-US",
			"pathname": "/press-releases/2020/cloudflare-announces-new-tokyo-office-and-head-of-japan-to-further-support/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}