{
	"card.add_button": "Add DNS Firewall Cluster",
	"card.at_least_one": "Please enter at least one IP Address",
	"card.description": "You can add groups of DNS servers for Cloudflare to upstream queries to. Each group of DNS servers is called a ‘cluster’. It’s important that each cluster contains nameservers that all share the same data so that Cloudflare can send queries directed to that cluster to any nameserver within that cluster.",
	"card.enter_a_name": "Please enter a name for this DNS Firewall Cluster.",
	"card.enter_ip_address": "IP Addresses",
	"card.help": "#### What is DNS Firewall?\nDNS Firewall is a DNS proxy where queries destined for a DNS provider’s nameservers are first sent through Cloudflare. Cloudflare then either responds from cache or fetches the answer from the upstream origins.\n#### What is a DNS Cluster?\nA DNS Cluster is a group of nameservers that contain the same data.  When Cloudflare receives a DNS query destined for one of the nameservers in that cluster, it chooses the most performant server within that cluster to fetch the answer from. \n#### How does the maximum and minimum cache TTL work?\nCloudflare’s DNS Firewall proxy cache respects the cache TTLs on DNS records within a maximum and minimum that you can configure per DNS cluster. The benefit of setting a high maximum TTL is to increase the cache hit ratio, improving the speed of your DNS answers and reducing the load your origin servers need to handle. However, a higher maximum TTL also means that you will need to wait extra time for DNS records to update when changes to them are made.\n#### What does it mean if ANY queries are turned off?\nANY queries are a built-in debugging tool, meant to return every DNS record that exist for a name. Unfortunately, they are instead more often used for launching large DDoS attacks. Cloudflare stopped answering ANY queries for its own DNS traffic in September 2015 and published [this Internet Draft](https://tools.ietf.org/html/draft-jabley-dnsop-refuse-any) to propose this as a wider solution. If you would like to deprecate ANY queries on your DNS traffic, then you can turn on ‘Deprecate ANY’ and Cloudflare will answer automatically to ANY with an HINFO record:\n\n`HINFO     \"Please stop asking for ANY\"  \"See draft-ietf-dnsop-refuse-any\"`",
	"card.invalid_ip_address": "%{address} is not a valid IP Address",
	"card.ip-addresses": "IP Addresses",
	"card.maximum_cache_ttl": "Max. Cache TTL",
	"card.minimum_cache_ttl": "Min. Cache TTL",
	"card.table.delete": "Are you sure you want to delete the DNS Firewall cluster **%{name}**?",
	"card.table.deprecate_any_requests": "ANY Queries",
	"card.table.empty": "You don't have any DNS Firewall upstream clusters yet. Add some!",
	"card.table.group_id": "Cluster ID",
	"card.table.maximum_cache_ttl": "Max. Cache TTL",
	"card.table.minimum_cache_ttl": "Min. Cache TTL",
	"card.table.ptr": "PTR",
	"card.title": "DNS Firewall Upstream Servers",
	"form.description": "Add IP Addresses to the cluster and configure settings.",
	"form.dns_cluster_name": "DNS Cluster Name (This is what will display in your management panel).",
	"form.dns_cluster_name_placeholder": "NS1 and NS2",
	"form.enable_ptr": "Enable PTR (Pointer records are used to map a network interface to host name)",
	"form.enable_ptr_placeholder": "Domain nameservers (Optional)",
	"form.maximum_cache_ttl": "Maximum Cache TTL",
	"form.maximum_cache_ttl_required": "Maximum Cache TTL is required.",
	"form.minimum_cache_ttl": "Minimum Cache TTL",
	"form.minimum_cache_ttl_required": "Minimum Cache TTL is required.",
	"form.origin_ips": "IP Addresses (Add the IP Addresses that DNS Firewall should upstream DNS queries to).",
	"form.title": "Set up a DNS Firewall Cluster",
	"nameservers.change_nameserver": "Please **wait one hour** for your new DNS Firewall configuration to be updated worldwide, and **then change your name server IP Addresses to these** to start DNS traffic flowing though DNS Firewall. You'll be able to test that the IP addresses work in an hour by doing a DNS lookup against these new addresses for domains on your name servers.",
	"nameservers.click_to_copy": "Click to copy",
	"nameservers.description": "The last step of setting up DNS Firewall is to change your cluster’s nameserver IP Addresses to these new DNS Firewall IP Addresses. This will start your DNS traffic flowing through the DNS Firewall proxy.",
	"nameservers.new_virtual_dns": "Your new DNS Firewall IP Addresses",
	"nameservers.title": "Change your nameserver IP Addresses.",
	"tab.title": "DNS Firewall"
}