{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2010/cloudflare-launches-at-techcrunch-disrupt/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "d15824ec-2a0b-52d0-b222-12e44d9516d5",
				"title": "Cloudflare Launches at TechCrunch Disrupt",
				"contentfulId": "2Po1daGx7fGsPmEvQS9ZjZ",
				"metaTags": null,
				"subtitle": "New Service brings the performance and security tools from the Internet giants to the rest of the web",
				"orderDate": "2010-09-27",
				"body": "<strong>San Francisco, CA, September 27, 2010</strong>\n<p>\nCloudflare, Inc. announced the launch of the public beta of\nits performance and security service (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>) at the prestigious TechCrunch Disrupt conference.\n</p>\n<p>\n“We are excited to launch Cloudflare to the public at\nTechCrunch Disrupt,” said CEO and co-founder Matthew Prince.\n“Cloudflare addresses two real problems everyone with a\nwebsite has: making sure it’s fast and making sure it’s\nsecure. By bringing the performance and security tools\npreviously available only to the Internet giants to anyone\nwith a website, Cloudflare is disrupting the very way in\nwhich content is made available online.”\n</p>\n<p>\nCloudflare is provisioned as a service through a simple\nchange to a website’s domain settings. Cloudflare works on\nany platform, regardless of the underlying infrastructure.\nIt does not require any hardware, software, or changes to\nexisting code. Websites keep their existing hosting provider\nand infrastructure stack. Setup typically takes less than 5\n minutes. Once on the Cloudflare network, sites see an average\n30% improvement in page load times, a 60% decrease in\nbandwidth usage, and a 65% decrease in load on their server.\n</p>\n<p>\nCloudflare’s core service is free. Additional services,\nsuch as SSL, realtime reports, and advanced security are\navailable for a fee beginning at $20/month. Cloudflare has\nbeen running a private beta since June and currently powers\nmore than 1,000 websites. Cloudflare’s network has served\nmore than 50 million page views since the beginning of the\nprivate beta.\n</p>\n<p>\n“It is rewarding to have built a service that our users\nare already telling us they can’t live without,” said\nMichelle Zatlyn, co-founder and head of user experience.\n“What our team is most proud about is that we have built\na service that anyone with a website can use, regardless\nof technical ability.”\n</p>\n<p>\nCloudflare’s founding team originally started Project\nHoney Pot, the largest open source community tracking\nonline fraud and abuse. Cloudflare was selected from over\n1,000 promising startups that applied to launch on-stage\nat TechCrunch Disrupt. Cloudflare is based in Palo Alto,\nCalifornia and backed by leading security and networking\ninvestors from Venrock and Pelion Venture Partners.\n</p>\n<hr>\n",
				"omitBoilerplate": true,
				"boilerplate": "<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>) brings the performance and security tools previously reserved for the Internet giants to the rest of the web. Powering thousands of websites, Cloudflare’s free service accelerates their\nperformance, protects against attacks, and gets smarter as its community expands. Cloudflare can be setup on any website in less than five minutes without any hardware, software, or code changes. Headquartered in Palo Alto, California, Cloudflare was the winner of the 2009 Harvard Business\nSchool Business Plan Competition and founded by the engineering team behind Project Honey Pot.\n</p>\n<hr>\n<h4 class=\"marketing-h4\">About TechCrunch Disrupt</h4>\n<p>\nTechCrunch Disrupt San Francisco\n(<a href=\"http://disrupt.techcrunch.com\" target=\"_blank\">http://disrupt.techcrunch.com</a>),\nis being held Sept 27–29, 2010, at the San Francisco Design Center Concourse. TechCrunch Disrupt attracts over 1,500 leading technology innovators and investors and over 150 new startups. The format combines top thought-leader discussions with new product and company launches. Morning executive discussions debate the most timely disruptions in media, advertising and technology. Afternoons host the Startup Battlefield where 25 new companies will launch for the first time on stage, selected to present from more than 500 applications received from around the world.\nAnother 100 early-stage startups will exhibit in Startup Alley. TechCrunch will award a $50,000 grand prize along with other award recognitions at the conclusion of the conference.\n</p>\n"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "d15824ec-2a0b-52d0-b222-12e44d9516d5",
			"locale": "en-US",
			"pathname": "/press-releases/2010/cloudflare-launches-at-techcrunch-disrupt/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}