{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2012/cloudflare-launches-business-and-enterprise-services/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "158aef8e-17c0-5e65-862d-b667cb9387e2",
				"title": "Cloudflare Launches Business and Enterprise Services",
				"contentfulId": "64dKuVa8yIahAsxDagiOTZ",
				"metaTags": null,
				"subtitle": "The collective knowledge gathered from hundreds of thousands of websites, plus revolutionary technologies, disrupt web performance &amp; security",
				"orderDate": "2012-06-06",
				"body": "<strong>San Francisco, CA, June 6, 2012</strong>\n<p>\nCloudflare, the web performance and security company, today\nannounced the availability of Cloudflare Business and Cloudflare\nEnterprise. The new tiers of service add additional performance\nand security features designed for businesses and are built on\ntop of Cloudflare's massive global infrastructure.\n</p>\n<p>\n\"The core asset of Cloudflare is its network which gets smarter\nas it grows larger,\" explained Matthew Prince, Cloudflare's\nco-founder and CEO. \"We've spent the last 18 months building\nmassive scale across hundreds of thousands of websites.\nToday, knowledge from this network allows us to provide a\nperformance and security solution for business and enterprises\nthat is unlike anything else on the market.\"\n</p>\n<p>\nCloudflare Business, which costs $200 per month, and Cloudflare\nEnterprise, which starts at $3,000 per month, add higher levels\nof customer support, greater customization, and full service\nlevel agreements to Cloudflare's existing products. The\nbusiness-oriented plans also include new technologies\nincluding Cloudflare's Advanced DDoS Protection and\nCloudflare's Railgun™ WAN Optimization. Experts agree\nthat Cloudflare's performance and security technologies\nare revolutionary:\n</p>\n<p>\n\"I test a lot of denial of service attack tools, including the\nones used by Anonymous, but it has become a dull exercise\nbecause Cloudflare stops them all,\" explained Sam Bowne,\nProfessor of Cybersecurity at the City College of San\nFrancisco and a leading researcher in denial of service\nattack mitigation. \"Cloudflare has completely changed the\ngame, making DoS and DDoS into trivial, solved problems.\"\n</p>\n<p>\nFor the last year, Cloudflare has been quietly testing\nCloudflare Business and Cloudflare Enterprise with\norganizations ranging from ecommerce sites to Fortune\n500 companies to national governments. Customer reactions\nspeak for themselves:\n</p>\n<p>\n\"StumbleUpon chose Cloudflare Enterprise to boost the\nperformance of the product in every channel including the\nwebsite and mobile applications.\" said Berk D. Demir,\nSoftware Architect at StumbleUpon. \"Cloudflare's\ncombination of performance and value made our decision\neasy and their global network matches StumbleUpon's\nexpanding user base. We are pleased to be one of the\nfirst Cloudflare Enterprise customers and excited for\nthe ongoing innovations Cloudflare provides.\"\n</p>\n<p>\n\"Cloudflare offers the first effective execution of a holistic\napproach to both performance and security for web applications,\nin a technology landscape otherwise rife with solutions\nspecializing in either one,\" said Chris Holland, Director\nof Technology for LuxuryLink. \"Having helped us achieve\nimproved performance while saving us 40 percent in monthly\nbandwidth, I feel that Cloudflare's philosophy, technological\nleadership and innovative platforms are best aligned with our\ncommitment to providing a world-class online experience to\nour discerning audience.\"\n</p>\n<p>\n\"StockTwits chose Cloudflare for security during an attack on\nStockTwits.com. We were back online within an hour,\" said\nChris Corriveau, StockTwits CTO. \"Since joining Cloudflare,\nwe've seen performance benefits, too, and added\nCloudflare to several more sites.\"\n</p>\n<p>\n\"Clicky Web Analytics chose Cloudflare Enterprise after an\nexhaustive search,\" said Sean Hammons, co-founder at\nRoxr Software, creators of Clicky Web Analytics. \"We could not\nfind any other CDN, security or performance company quite\nlike Cloudflare. Their solution is easy to implement and\nCloudflare's global network is exactly what we needed to\nserve our hundreds of thousands of global customers.\"\n</p>\n<p>\nCloudflare operates 14 global data centers through which it\ncleans and accelerates its customers' web traffic. Every\nmonth, Cloudflare sees more than 50 billion page views and\nmakes the web faster and safer for more than 475 million\npeople worldwide. Cloudflare can be provisioned in front\nof any web architecture without the need for any hardware,\nsoftware, or code changes. Businesses can be up and running\nafter just a few minutes without any downtime to their sites.\n</p>\n<p>\nCompanies interested Cloudflare Business and Cloudflare\nEnterprise can visit: <a href=\"/plans/enterprise/contact/\" target=\"_blank\">https://cloudflare.com/business</a>\n</p>",
				"omitBoilerplate": true,
				"boilerplate": "<hr>\n<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>)\nmakes sites lightning fast, protects them from attacks, ensures\nthey are always online, and makes it simple to add web apps\nwith a single click. Regardless of size or platform, Cloudflare\nsupercharges websites with no need to add hardware, install\nsoftware, or change a line of code. The Cloudflare community\ngets stronger as it grows: every new site makes the network\nsmarter. More than 5% of global web requests flow through\nCloudflare's network daily. And, thanks to our awesome sauce\ntechnology, every month billions of people experience a\nfaster, safer, better Internet. Cloudflare was recognized\nby the World Economic Forum as a Technology Pioneer, named\nthe Most Innovative Network &amp; Internet Technology Company for\ntwo years running by the Wall Street Journal, and ranked among\nthe world's 50 most innovative companies by Fast Company.\nCloudflare is based in San Francisco, California, USA.\n</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "158aef8e-17c0-5e65-862d-b667cb9387e2",
			"locale": "en-US",
			"pathname": "/press-releases/2012/cloudflare-launches-business-and-enterprise-services/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}