{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2012/cloudflare-and-parallels-to-bring-website-performance-and-security-to-millions-of-smbs/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "6ae315d1-5cea-5d3d-8a01-1804ff8759c5",
				"title": "Cloudflare and Parallels to Bring Website Performance and Security to Millions of SMBs",
				"contentfulId": "ENilJjxQHm5gwKhlipLwE",
				"metaTags": null,
				"subtitle": null,
				"orderDate": "2012-12-04",
				"body": "<p>SAN FRANCISCO, CA--(Marketwire - Dec 4, 2012) - <a href=\"https://www.cloudflare.com\">Cloudflare</a>, the web performance and security company, and Parallels, a worldwide leader in hosting and cloud service enablement, announced that service providers using Parallels software can now easily activate and resell Cloudflare's services.</p>\n<p>\"Moving to the cloud allows a business to get cost-effective access to enterprise functionality,\" said John Zanni, Parallels VP Marketing and Alliances. \"We are very happy to see Cloudflare joining the ecosystem of APS Certified applications to bring enterprise-level website performance and security to every website online.\"</p>\n<p>\"As a result of our partnership with Parallels, we have been able to bring a number of innovative solutions to our customers,\" said Celal Ulgen, Chief Marketing Officer at SoftCom, parent company to the popular myhosting.com. \"Now that Cloudflare is available in Parallels Automation, we will have another service to further improve our customers' experience.\"</p>\n<p>On average, a website on Cloudflare loads twice as fast, uses 60 percent less bandwidth and is more secure. Hosting providers offering Cloudflare benefit from an additional source of revenue, reduced server load, bandwidth savings and robust denial of service (DDoS) attack protection.</p>\n<p>\"Cloudflare is so much more than just a content delivery network; the service optimizes web traffic, protects against online attacks, and provides real-time statistics,\" said Marco Houwen, CEO and co-founder of LuxCloud. \"We are thrilled to be adding Cloudflare to our marketplace so that our partners can offer enhanced performance and increased security to their customers.\"</p>\n<p>\"The new Parallels Plesk Panel plugin is a great addition that allows for quick and easy deployment of Cloudflare on our shared web hosting, virtual and dedicated servers,\" said Gerardo Altman, CEO of Velocity Host. \"Cloudflare allows us to get more out of every server and network connection in our cloud.\"</p>\n<p>Cloudflare has grown exponentially over the last year. Today, more than 670 million web surfers enjoy a faster and safer Internet experience each month. Partnering with Parallels expands the global reach of Cloudflare's performance and security.</p>\n<p>\"We are thrilled to work with Parallels and bring website performance and security to their global customer base who serve more than 10 million SMBs in 130 countries,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"This integration enables SMBs to make more money and reduce operating costs.\"</p>\n<p>For additional information, visit <a href=\"https://www.cloudflare.com/parallels/\" target=\"_blank\">www.cloudflare.com/parallels</a>.</p>",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br>Cloudflare, Inc. (<a href=\"https://www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) makes sites twice as fast, protects them from attacks, ensures they are always online, and makes it simple to add web apps with a single click. Cloudflare supercharges websites regardless of size or platform with no need to add hardware, install software, or change a line of code. The Cloudflare community gets stronger as it grows; every new site makes the network smarter. Thanks to our awesome sauce technology, every month hundreds of millions of people experience a faster, safer, better Internet. Cloudflare is recognized by the World Economic Forum as a Technology Pioneer, was named the 2012 Most Innovative Network &amp; Internet Technology Company of the Year by the Wall Street Journal as well as ranked among the world's 50 most innovative companies of 2012 by Fast Company. Cloudflare is based in San Francisco, California, USA.</p>\n<p><strong>About Parallels</strong><br>Parallels is a global leader in hosting and cloud services enablement and desktop virtualization. Founded in 1999, Parallels is a fast-growing company with more than 900 employees in North America, Europe and Asia. For more information, please visit <a href=\"https://www.parallels.com/spp\" target=\"_blank\">www.parallels.com/spp</a>, follow us on Twitter at <a href=\"https://www.twitter.com/ParallelsCloud\" target=\"_blank\">www.twitter.com/ParallelsCloud</a>, and Like us on Facebook at www.facebook.com/ParallelsCloud.</p>\n<pre>Contact:\nDaniella Vallurupalli\n+1-650-483-4463\ndaniella@cloudflare.com / press@cloudflare.com</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "6ae315d1-5cea-5d3d-8a01-1804ff8759c5",
			"locale": "en-US",
			"pathname": "/press-releases/2012/cloudflare-and-parallels-to-bring-website-performance-and-security-to-millions-of-smbs/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}