{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2016/cloudflare-introduces-the-industrys-first-security-focused-registrar/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "0e8aed15-f8cd-5181-813d-3949242ac2d3",
				"title": "Cloudflare Introduces the Industry's First Security-Focused Registrar",
				"contentfulId": "5U0pbdeErCOA5f5uqFJqMy",
				"metaTags": null,
				"subtitle": "Designed for Security, Not the Masses, Cloudflare Registrar Is the first ICANN-Accredited Registrar Built for High-Profile Domains",
				"orderDate": "2016-02-23",
				"body": "\n <p>SAN FRANCISCO, CA--(Marketwired - Feb 23, 2016) - <a href=\"https://www.cloudflare.com\">Cloudflare</a>, the leading Internet performance and security company, today launched <a href=\"https://www.cloudflare.com/products/registrar/\" target=\"_blank\">Cloudflare Registrar</a>, to bring large enterprises the highest level of security available and to protect their web domains from unauthorized changes. One of the biggest risks for high-profile customers is having their domains hijacked -- meaning their sites are redirected or compromised without the site owner's approval. Now, domain hijacking, domain expiration, or loss of control over an external account are all prevented with Cloudflare Registrar.</p>\n <p>The security of a domain name is only as robust as the security of the registrar used to maintain it. Many domains on the Internet, even the highest-value domains belonging to large household name brands, are managed through consumer-focused registrars with limited security features. Domain hijacks -- whether they are conducted by third party attackers or rogue employees -- can be difficult to detect. What's more, reclaiming a domain can be an arduous, expensive, reputation-damaging process that is never guaranteed.</p>\n <p>\"Customers who care enough about the security of their website to use Cloudflare are still at risk to domain hijacking via their registrar. By offering registrar services to Cloudflare Enterprise customers, we instantly eliminate the additional risk a third-party registrar may overlook,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Even in Cloudflare's own search for a high-security registrar, we didn't find anything that met our security standard. Rather than waiting for one to come onto the market, we built our own, fundamentally changing the way Registrar security is offered today.\"</p>\n <p>With Cloudflare Registrar, owners of high-value domains can protect themselves with enterprise-grade, customizable domain security and integrate domain renewal into their IT department workflow. This protects enterprises from the unexpected consequence of losing their domain, resulting in damage to their brand's reputation, complete loss of their security functionality, control over their website's content, and the potential to redirect web traffic to another IP address.</p>\n <p>While domain hijacks have historically been outright web defacements or theft, an attacker can also choose to be more subtle and proxy traffic to the original server, observing every user and tampering with any target. This is a particular risk for API providers (such as mobile application or IoT backends), where the hijacking of a domain can remain undetected while being exploited to compromise many applications.</p>\n <p>Rather than limiting registrar account security to a single shared password or email address, customers can now require formal approval from multiple independent stakeholders within the organization to make any change. By adding friction to the process, it prevents the worst-case consequences of domain compromise. Web properties using Cloudflare Registrar will never expire; all domains will automatically renew when they have less than one year left on their registration term.</p>\n <p>Domain name registrars, registry operators, and the governing body ICANN have developed various security measures to protect domains and registrants -- but they have not been widely implemented. \"With other technologies like certificates, if anyone trusted is compromised, everyone is at risk. DNS isn't like that, you can manage your risk by choosing which registrar you trust. And the risk is significant; networks can be no safer than the DNS infrastructure that links them. Cloudflare integrating registrar security into their broad product line reflects a commitment to a deep level of security on the public Internet,\" said Dan Kaminsky, DNS security expert and chief scientist and co-founder of White Ops.</p>\n <p>\"Cloudflare Registrar isn't for the masses, it's for organizations that would make a front-page story if they lost their domains,\" Prince said. \"There are plenty of great mass-market registrars available today, but now high-profile organizations don't need to settle for a one-size-fits-most security approach when it comes to their online brands.\"</p>\n <p>Interested Cloudflare Enterprise customers should contact their dedicated account managers to get started with Cloudflare Registrar. If you are not a current customer, <a href=\"http://globenewswire.com/Tracker?data=6b9RD7tAnHz_6sgV1t0aqAvhkQiLOLITQirUTIoAnXO2TREIuh3MW1dlSubwp0f-1bne3jXYQybTP8EjpzRtiEYPn_75FOtB2Qh3gpJsww0yGedeu7jZHNuYoNGyw6YIMxwRYi3WZEVKTWikC0iwNrf721zl_7sJ8OnPvSVehVVo_qSYSZ3uVjs0-4uEQOd7NM18FDL9xviaqugRZ0Dd-TnCcEBsBo-f19pF2fKZp5I%3D\" target=\"_blank\">learn how</a> Cloudflare can help fully lock down your domains today.</p>",
				"omitBoilerplate": true,
				"boilerplate": "\n<strong>About Cloudflare</strong><br>\nCloudflare, Inc. (<a href=\"https://www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) makes any Internet application lightning fast, protects them from attacks, ensures they are always online, and makes it simple to add web apps with a single click. Regardless of size or platform, Cloudflare supercharges Internet applications with no need to add hardware, install software, or change a line of code. The Cloudflare community gets stronger as it grows: every new site makes the network smarter. More than 5 percent of global Internet requests flow through Cloudflare's network; every month more than 2 billion people experience a faster, safer, better Internet. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Cloudflare has offices in San Francisco, Champagne, IL, Washington, DC, London, and Singapore.<p></p>\n\n<pre>Daniella Vallurupalli\nCommunications\ndaniella@cloudflare.com\npress@cloudflare.com\n650-483-4463</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "0e8aed15-f8cd-5181-813d-3949242ac2d3",
			"locale": "en-US",
			"pathname": "/press-releases/2016/cloudflare-introduces-the-industrys-first-security-focused-registrar/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}