{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2016/days-of-an-unencrypted-internet-are-coming-to-an-end/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "098a78d6-a1a1-5707-8b92-3b5a08daafa5",
				"title": "Days of an Unencrypted Internet are Coming to an End",
				"contentfulId": "28L9WkFl62rAyfI05dU40q",
				"metaTags": null,
				"subtitle": "Cloudflare is the first to support capabilities that expand the reach and speed of the encrypted web",
				"orderDate": "2016-09-20",
				"body": "\n<p><strong>San Francisco, CA, September 20th, 2016 — </strong><a href=\"https://www.cloudflare.com\">Cloudflare</a>, the leading Internet performance and security company, today announced that three new encryption features have been added to its network: TLS 1.3, Opportunistic Encryption, and Automatic HTTPS Rewrites. </p>\n\n<p>\"Cloudflare is putting an end to the unencrypted Internet,\" said Matthew Prince, co-founder &amp; CEO of Cloudflare. \"We are the first to support the fastest and most secure Internet protocol, TLS 1.3, and to help virtually eliminate the problem of 'mixed content' that has plagued companies trying to go secure.\"</p>\n\n<p><strong>TLS 1.3: Supporting the Turbocharged Encrypted Internet</strong></p>\n\n<p>Starting today, Internet connections that use Cloudflare have the most secure and fastest encryption possible: TLS 1.3. This new protocol eliminates attacks that work against the previous version, 1.2, and makes encrypted connections just as fast as unencrypted. With TLS 1.3, the unencrypted Internet becomes an anachronism.</p>\n\n<p>\"This update, the first since 2008, is a major overhaul that provides both increased security and enhanced speed, especially on mobile networks,\" said Nick Sullivan, head of cryptography at Cloudflare. \"TLS 1.3 improves request speeds by requiring one less round-trip to connect to an Internet application, compared to previous versions, and can make connections over 20 percent faster.\"</p>\n\n<p>Mozilla Firefox and Google Chrome currently offer preliminary versions of TLS 1.3,  with all major browsers committed to implementing the protocol in the future. \"Cloudflare, Mozilla, and others have made implementing TLS 1.3 a priority,\" said Eric Rescorla, Mozilla Fellow and editor of the TLS 1.3 specification. \"In doing so, we've set the stage for a faster and more secure web.\"</p>\n\n<p><strong>Automatic HTTPS Rewrites: Instantly Upgrading Insecure Content to Secure Content</strong></p>\n\n<p>Two years ago Cloudflare introduced Universal SSL—free, unrestricted SSL for everyone. Despite the availability of unrestricted SSL, some web properties were still unable to go secure because of 'mixed content' problems. Automatic HTTPS Rewrites eliminates the mixed content problem.</p>\n\n<p>If a secure site references insecure content, such as a third-party image, video or ads, it is no longer secure and web browsers won't show a green lock icon for the site. Automatic HTTPS Rewrites upgrades all insecure content on a page ensuring that it is encrypted and reinstates the green lock.</p>\n\n<p>\"There has been a crazy chicken-and-egg problem holding up the deployment of secure encryption on the web,\" said Peter Eckersley, chief computer scientist at the Electronic Frontier Foundation and co-founder of the Let's Encrypt project. \"Browsers tried to protect users by blocking insecure parts of secure HTTPS pages, but that made it impossible to deploy encryption incrementally. Cloudflare's new Automatic HTTPS Rewrites will help sites encrypt everything all at once, and fix this deadlock in web security.\"</p>\n\n<p><strong>Opportunistic Encryption: HTTP Gets Encrypted</strong></p>\n\n<p>Web properties stuck using the unencrypted web expose their users to attacks and don't benefit from the dramatic speedups from HTTP/2. Cloudflare's Opportunistic Encryption brings encryption and the fastest web protocol, HTTP/2, to sites that have yet to upgrade to SSL, by encrypting the connection between the browser and Cloudflare. </p>\n\n<p>Cloudflare is the only global platform that supports Opportunistic Encryption, and Mozilla Firefox is the first browser to support it. \"Opportunistic Encryption will help encryption reach more of the web, but it's up to browsers and platforms to support this emerging standard,\" said Patrick McManus, principal engineer at Mozilla and lead developer of the Firefox HTTP stack.</p>\n\n<p><strong>No Excuses to Stay Unencrypted</strong></p>\n\n<p>\"Cloudflare has continued to push the envelope when it comes to encrypting the Internet for all. Two years ago we were the first to deliver <a href=\"https://blog.cloudflare.com/introducing-universal-ssl/\" target=\"_blank\">free Universal SSL</a> for all of our customers—doubling the size of the encrypted web in 24 hours. Later we announced support for the next generation Internet protocols SPDY and HTTP/2, followed by <a href=\"https://blog.cloudflare.com/cloudflare-ca-encryption-origin/\" target=\"_blank\">free and performant encryption to the origin</a> for Cloudflare customers with Origin CA,\" said Dr. John Graham-Cumming, CTO of Cloudflare. \"Now we are working to deprecate the unencrypted web. There are no longer any reasons to stay unencrypted.\"</p>\n\n<p>To learn more about TLS 1.3 and how Cloudflare is expanding the encrypted web, please check out the additional resources below:\n</p><ul>\n  <li><a href=\"https://blog.cloudflare.com/introducing-tls-1-3/\" target=\"_blank\">TLS 1.3 Blog</a></li>\n  <li><a href=\"https://blog.cloudflare.com/encryption-week/\" target=\"_blank\">Encryption Week Blog</a></li>\n</ul>\n",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br>\nCloudflare, Inc. (<a href=\"https://www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) is on a mission to help build a better Internet. Today the company runs one of the world's largest networks that powers more than 10 trillion requests per month, which is nearly 10 percent of all Internet requests for more than 2.5 billion people worldwide. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Web properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with each new site added. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Washington, DC, London, and Singapore.</p>\n\n<pre>Daniella Vallurupalli\nCommunications\ndaniella@cloudflare.com\npress@cloudflare.com\n650-483-4463</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "098a78d6-a1a1-5707-8b92-3b5a08daafa5",
			"locale": "en-US",
			"pathname": "/press-releases/2016/days-of-an-unencrypted-internet-are-coming-to-an-end/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}