{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2016/no-need-for-hardware-cloudflare-gives-customers-traffic-control-at-the-edge/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "1581c670-f13a-59ab-9e3b-050abf20fa06",
				"title": "No Need for Hardware: Cloudflare Gives Customers Traffic Control at the Edge",
				"contentfulId": "5mBAOMKtAhTR6gBje3LtIF",
				"metaTags": null,
				"subtitle": "Cloudflare lets customers play “traffic cop” on its global network with new load balancing and rate limiting offerings",
				"orderDate": "2016-09-29",
				"body": " <p>San Francisco, CA, September 29th, 2016 — <a href=\"https://www.cloudflare.com\">Cloudflare</a>, the leading Internet performance and security company, today announced two Cloudflare Traffic products: Cloudflare Traffic Control and Cloudflare Traffic Manager. Utilizing Cloudflare’s global network, customers will have increased control over how their traffic is handled based on their unique needs.</p>\n\n<p>“Cloudflare operates one of the world’s largest global networks that provides a unique opportunity for customers to control where and how their traffic operates at the edge,” said Matthew Prince, co-founder &amp; CEO of Cloudflare. “Four million customers rely on us to keep their infrastructure and web properties up and running across the globe, regardless of traffic volume, server location, and threats. The future doesn’t come in a box, so we are introducing offerings that give customers full control of the traffic that they work hard to acquire in a scalable way that no piece of hardware could manage.”</p>\n\n<p><strong> Cloudflare Traffic Control: A Global Backbone for the Most Vulnerable Parts of the Internet</strong> </p>\n\n<p>Cloudflare Traffic Control gives customers the ability to set specific limits for traffic and to shape or block it based on the number of requests per second. With this new offering, customers can ensure that their visitors have the best online experience with uncompromised availability, regardless of a sudden flash sale, outage, or traffic spike that could otherwise add friction to their online experience.</p>\n\n<p>In addition to huge volumetric DDoS attacks, there has been an uptick in simpler and cheaper attacks that easily knock down web applications by targeting a specific part of a site—whether it be an API endpoint, login page, or search function. These smaller scale yet targeted attacks can take even a secure Internet property offline in seconds with just a few hundred requests.</p>\n\n<p>Mobile APIs, often less protected than web applications, will especially benefit from Traffic Control guarding against similar request spikes as well as any nefarious attacks directed at less visible API endpoints.</p>\n\n<p>Traffic Control offers five features for customers securing their traffic and protecting themselves from targeted attacks:\n</p><ul>\n<li><strong> Rate limiting:</strong>  Set specific request limits, per second or for a longer time period, for individual URLs or patterns, and with matching parameters including IP address, headers, and HTTP response codes</li>\n<li><strong> Custom responses:</strong>  Return application-appropriate custom responses, such as JSON for API clients and HTML for browsers</li>\n<li><strong> Traffic profiling:</strong>  Respond differently to GET and POST requests, useful for protecting logins or forms</li>\n<li><strong> Thoughtful configuration:</strong>  Test rules to measure impact, and then apply different mitigation options to block or throttle</li>\n<li><strong> Speedy propagation:</strong>  Make changes globally within seconds</li>\n</ul>\n<p></p>\n<p>“Customers are looking for more control over who visits their site or application and how traffic is routed through their application,” said John Graham-Cumming, CTO of Cloudflare. “With Traffic Control, we’re able to secure vulnerable resources in the most efficient and cost-effective way possible, keeping our customers online and making for a safer Internet.” </p>\n\n<p><strong>Cloudflare Traffic Manager: The Power to Route Traffic at the Edge</strong></p>\n\n<p>Cloudflare Traffic Manager enables customers to keep their application or site available no matter what kind of traffic day they are having. Now customers can have full control over traffic—even with unexpected spikes in traffic—by load balancing across multiple servers, datacenters, and geographies. Customers set policies for their traffic on Cloudflare's global network, directing traffic to healthy servers and load balancing across individual or multiple hosts to route around failure.</p>\n\n<p>Traffic Manager has four major features to provide customers with fine-grained control over their traffic:\n</p><ul>\n<li><strong>Health checks:</strong> Test the availability of servers in real-time from 100 data centers worldwide </li>\n<li><strong>Load balancing:</strong> Share traffic across multiple servers and locations </li>\n<li><strong>Failover:</strong> Push traffic instantly to a standby server in the event that the main server fails</li>\n<li><strong>Geo-steering:</strong> Direct traffic to servers based on the location of the visitor</li>\n</ul>\n<p></p>\n<p>The size of Cloudflare’s network provides a huge advantage for customers: hardware boxes are vulnerable to local network failure while other solutions are vulnerable to DDoS attacks. Customers often run multiple servers for their web properties, moving to load balancing to better handle traffic spikes and traffic in different global regions. Cloudflare’s edge network offers infinite scalability and the power of its intelligent global network, which learns from every attack it sees.</p>\n\n<p>Both Cloudflare Traffic Manager and Cloudflare Traffic Control are available for Early Access to all customers.</p>\n\n<p>To learn more about Cloudflare Traffic Control and Traffic Manager, please check out the additional resources below:\n</p><ul>\n<li><strong><a href=\"https://blog.cloudflare.com/cloudflare-traffic\" target=\"_blank\">Cloudflare Traffic Blog</a></strong></li>\n<li><strong><a href=\"https://www.cloudflare.com/traffic-control\" target=\"_blank\">Cloudflare Traffic Control product page</a></strong></li>\n<li><strong><a href=\"https://www.cloudflare.com/traffic-manager\" target=\"_blank\">Cloudflare Traffic Manager product page</a></strong></li>\n</ul>\n",
				"omitBoilerplate": true,
				"boilerplate": "\n\n<p><strong>About Cloudflare</strong><br>\nCloudflare, Inc. (<a href=\"https://www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) is on a mission to help build a better Internet. Today the company runs one of the world’s largest networks that powers more than 10 trillion requests per month, which is nearly 10 percent of all Internet requests for more than 2.5 billion people worldwide. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Web properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with each new site added. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Washington, DC, London, and Singapore.</p>\n\n<pre>Daniella Vallurupalli\nCommunications\ndaniella@cloudflare.com\npress@cloudflare.com\n650-483-4463</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "1581c670-f13a-59ab-9e3b-050abf20fa06",
			"locale": "en-US",
			"pathname": "/press-releases/2016/no-need-for-hardware-cloudflare-gives-customers-traffic-control-at-the-edge/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}