{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/1-1-1-1-launches-to-make-the-internet-faster-and-more-private-for-everyone/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "5460f90d-607f-5133-89f1-521814c56b39",
				"title": "1.1.1.1 Launches to Make the Internet Faster and More Private for Everyone",
				"contentfulId": "6nek3s1sxGuCI04AUkqg08",
				"metaTags": null,
				"subtitle": "Cloudflare and APNIC partner to help build a better Internet",
				"orderDate": "2018-04-01",
				"body": "__San Francisco, CA, April 1, 2018__ — [www.cloudflare.com](http://www.cloudflare.com/), the leading Internet performance and security company, today announced 1.1.1.1, the first public DNS resolver built around the principle of privacy-first. 1.1.1.1 will ensure a more private and faster Internet for users everywhere, all for free.\n\nNearly everything on the Internet starts with a DNS request. DNS is the Internet's directory. It translates a human-friendly name like [www.example.com](http://www.example.com/) to a numerical Internet address that a computer understands. Almost nothing happens on the Internet without a DNS request happening first.\n\nBut DNS is by default an insecure, unencrypted, and often slow system. Internet Service Providers (ISPs) and other entities on the Internet can monitor DNS requests to see every site and app a user visits, even if the site or app is encrypted. Some DNS providers even sell data about users' Internet activity or use it to deploy targeted ads.\n\nWith 1.1.1.1, there is now an alternative. The offering boasts both unrivaled security and speed and supports both encrypted DNS and DNS over HTTPS. Data from logs is destroyed after 24 hours and no IP addresses or user data is stored.\n\n\"We think it's creepy that user data is sold to advertisers and used to target consumers without their knowledge or consent,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Frankly, we don't want to know what people do on the Internet—it's none of our business—and we've designed 1.1.1.1 to ensure that we, along with ISPs around the world, can't.\"\n\nCloudflare partnered with [APNIC](https://www.apnic.net/), a non-profit organization managing IP address allocation for Asia-Pacific, to develop 1.1.1.1.\n\n\"At APNIC Labs, we're aware that the DNS is not always private, fast, or secure, and we're always looking for ways to improve how it works,\" said Geoff Huston, Chief Scientist at APNIC. \"We're working with Cloudflare to refine this basic Internet function so that users have a much more private and faster experience.\"\n\nCloudflare is working with major browsers, operating systems, app manufacturers, cloud platforms, and router manufacturers to enable DNS over HTTPS. Mozilla is working to integrate the standard into its Firefox browser:\n\n\"Like Cloudflare, Mozilla cares about making the Internet faster and more privacy-conscious so people have a better experience on the web,\" said Selena Deckelmann, Senior Director of Engineering, Firefox Runtime at Mozilla. \"We are always looking for new technologies like DNS over HTTPS to ensure Firefox is at the cutting edge of speed, privacy and improving life online.\"\n\nSetting up 1.1.1.1 takes less than five minutes and requires no technical skill or special software. It is available for [mobile devices](https://cloudflare.com/cdn-cgi/preview/9393b42b5a217e623615de8288dd3eef), [desktop computers](https://cloudflare.com/cdn-cgi/preview/d17432114205ed061b9e1ba97e7241c0), and even [home routers](https://cloudflare.com/cdn-cgi/preview/510f09dad9812cd7ac009ebcab75068e) to any user around the globe, for free.\n\nTo learn more about 1.1.1.1, please check out the resources below.\n\n- [1.1.1.1 Landing Page](https://1.1.1.1/)\n- [1.1.1.1 Technical Blog](https://blog.cloudflare.com/dns-resolver-1-1-1-1/)\n- [1.1.1.1 Blog](https://blog.cloudflare.com/announcing-1111)",
				"omitBoilerplate": false,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "5460f90d-607f-5133-89f1-521814c56b39",
			"locale": "en-US",
			"pathname": "/press-releases/2018/1-1-1-1-launches-to-make-the-internet-faster-and-more-private-for-everyone/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}