{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-and-ibm-collaborate-to-extend-security-and-performance/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "be2b9884-be4e-56e3-afa8-90481593474d",
				"title": "Cloudflare and IBM Collaborate to Extend Security and Performance from the Cloud to the Network Edge",
				"contentfulId": "3W5C19s40EcMWo0UCuCiqs",
				"metaTags": null,
				"subtitle": "IBM customers using public, private, or hybrid cloud can address security and performance at the network edge",
				"orderDate": "2018-03-14",
				"body": "__San Francisco, CA, March 14, 2018__ — [Cloudflare](http://www.cloudflare.com/), the leading Internet performance and security company, today announced a collaboration with IBM that will provide IBM's enterprise customers with the benefits of Cloudflare's edge computing solutions.\n\nWith this collaboration, IBM becomes an authorized reseller of Cloudflare's suite of security and performance edge services. Cloudflare's solutions can be deployed in IBM customer environments, including public, private, hybrid cloud, or on-premise.\n\nThrough the collaboration, IBM plans to launch IBM Cloud Internet Services, a one-stop shop for enterprise network edge services. IBM Cloud Internet Services is designed to enable customers to more easily protect and accelerate their Internet properties—domains, applications, and APIs—through an integration of Cloudflare in the IBM Cloud console.\n\nCyber security threats are increasing in scale and becoming more complex every day, but security should not be a barrier for enterprises entering the cloud. Enterprises crave a cloud and edge security strategy that provides state-of-the-art protection and performance. With IBM Cloud Internet Services, in just a few clicks, enterprises can obtain the benefits of Cloudflare's massive global network and core DDoS, WAF, DNS, and web caching solutions, in one place, without having to rely on multiple vendors.\n\n\"Now IBM enterprise customers can focus on innovating and spend less time worrying about performance issues or potential security incidents,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"We admire IBM's broad and deep experience with some of the world's most powerful enterprises, and we view this offering as a great first step in working together.\"\n\n\"The rate and sophistication of cyber threats is growing daily, but enterprises shouldn't have to sacrifice performance in order to address the security of their Internet-facing applications,\" said John Considine, General Manager, IBM Cloud Infrastructure. \"IBM Cloud Internet Services combines IBM's high value cloud capabilities and Cloudflare's robust intelligent network to offer our customers an innovative solution.\"\n\nEarly access to IBM Cloud Internet Services will be available in the IBM Cloud portal on March 19. Tune in on Wednesday, March 21 at 11:30 am PT during the \"Building Future-Proof Cloud Solutions with an Enterprise-First Cloud Infrastructure\" keynote to hear Matthew Prince and John Considine discuss the news at IBM THINK.\n\nTo learn more, please check out the resources below:\n\n- [Cloudflare + IBM Partnership Page](https://www.cloudflare.com/integrations/ibm-cloud-internet-services/)\n- [Cloudflare + IBM Blog](https://blog.cloudflare.com/ibm-cloud-and-cloudflare)",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "be2b9884-be4e-56e3-afa8-90481593474d",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-and-ibm-collaborate-to-extend-security-and-performance/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}