{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-grows-network-by-nearly-30-percent-in-first-quarter/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "0e6c9400-ff1c-5fdf-b2b4-2aa387a2bf9f",
				"title": "Cloudflare Grows Network by Nearly 30 Percent in First Quarter",
				"contentfulId": "6eNJ2tV2VOo6g8gYksgyUM",
				"metaTags": null,
				"subtitle": "The company announced three new products and a major collaboration as part of giant quarter",
				"orderDate": "2018-04-26",
				"body": "__San Francisco, CA, April 26, 2018__ — [www.cloudflare.com](https://www.cloudflare.com), the leading Internet performance and security company, today announced record network growth in the first quarter of 2018. The company added 32 new cities, growing its network to 151 points of presence globally. Cloudflare now protects more than 8 million domains, websites, APIs, mobile applications, and anything connected to the Internet.\n\n\"At Cloudflare's core is its network, which we've built to be flexible, efficient, and able to perform any task in any given location,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"In this last quarter, we grew our network at record pace, bringing our network closer to everyone on earth. This means that we're able to roll out products at a global scale for users everywhere.\"\n\nToday's announcement caps off a strong quarter for Cloudflare. The company announced three major new products in the quarter, including [Cloudflare Access](https://www.cloudflare.com/products/cloudflare-access/), a solution that makes accessing internal enterprise applications fast and easy, [Cloudflare Workers](https://www.cloudflare.com/products/cloudflare-workers/), a better, faster way for developers to deploy and execute their code directly at the edge of Cloudflare's global network, and the [Cloudflare Mobile SDK](https://www.cloudflare.com/products/mobile-sdk/), a free solution that enables any mobile app developer to understand network performance and metrics.\n\nCloudflare and IBM announced a collaboration to extend security and performance from the cloud to the network edge. Through the collaboration, IBM launched Cloud Internet Services, a one-stop shop for Cloudflare's security and performance capabilities designed to protect enterprise public-facing web content and applications. Now Cloudflare's solutions can be deployed in IBM's customers' environments, including public, private, hybrid cloud, or on-premise. Additionally, IBM is now an authorized reseller of Cloudflare's suite of security and performance edge services.\n\nCloudflare now has more than 625 employees, up from 400 just over a year ago. The company continues to grow its engineering, sales, marketing, and support teams across its offices in San Francisco, Austin, Champaign, IL, London, New York, Washington D.C., and Singapore.\n\nTo learn more about Cloudflare, please check out the resources below.\n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [Cloudflare Blog](https://blog.cloudflare.com/)\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "0e6c9400-ff1c-5fdf-b2b4-2aa387a2bf9f",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-grows-network-by-nearly-30-percent-in-first-quarter/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}