{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-announces-spectrum-to-protect-anything-connected-to-the-internet/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "2d14bc13-0cff-5fb7-ab40-013e3112521b",
				"title": "Cloudflare Announces Spectrum to Protect Anything Connected to the Internet",
				"contentfulId": "1V14DUAySwWuiUaGKmugmS",
				"metaTags": null,
				"subtitle": "New solution extends Cloudflare's security and performance beyond the web",
				"orderDate": "2018-04-12",
				"body": "__San Francisco, CA, April 12, 2018__ — [www.cloudflare.com](http://www.cloudflare.com/), the leading Internet performance and security company, today announced Cloudflare Spectrum, a solution that extends Cloudflare's benefits beyond web protocols to protect and accelerate email servers, gaming servers, IoT devices, and anything else that connects to the Internet.\n\nThe Internet is more than just the web. Until now, Cloudflare has used its global network to make anything on the web—applications, APIs, and websites—faster and more secure. With Spectrum, Cloudflare now protects and accelerates everything else. Spectrum allows customers to put their email servers, gaming servers, IoT devices, etc. behind Cloudflare to protect them from DDoS attacks, no matter what protocol they are using.\n\nSpectrum works by proxying traffic using any Internet protocol. With Spectrum, Cloudflare is able to accelerate everything across its global network of 150+ data centers and protect anything connected to the Internet from attack.\n\n\"Cloudflare has always been focused on improving the Internet experience for users around the world, but until now, we've only protected and accelerated web protocols,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Spectrum represents a huge step in helping to build a better Internet, as we open the power of Cloudflare to protocols beyond the web.\"\n\nThe benefits of Spectrum include:\n\n- __Protect everything from DDoS attacks.__ Many critical services like email and proprietary enterprise applications can now be protected from large DDoS attacks that would otherwise make these important services unreachable.\n- __Encryption of legacy protocols and applications.__ Many legacy protocols used by enterprises still do not support encrypted communications. With Spectrum, enterprises can send traffic over an encrypted connection.\n- __Enhanced performance.__ Faster TLS, optimized network routing, and high speed interconnection mean services behind Spectrum are often faster than they were on the native Internet.\n\nA number of customers are already using Spectrum:\n\n\"Hypixel was one of the first subjects of the Mirai botnet DDoS attacks and frequently receives large attacks,\" said Bruce Blair, CTO of Hypixel. \"Before Spectrum, we had to rely on unstable services and techniques that increased latency, worsening the user experience. Now, we're able to be continually protected without added latency, which makes it the best option for any latency and uptime-sensitive service such as online gaming.\"\n\n\"We were looking for a security solution to protect additional services like email and SSH so that if we are subject to attack, our operations can continue to run reliably and securely,\" said Paul Abramson, Director of Network Operations at Montecito Bank & Trust. \"We are happy to see Cloudflare launch Spectrum.\"\n\nSpectrum is currently available to Cloudflare's Enterprise customers. To learn more about Cloudflare Spectrum, please check out the resources below.\n\n- [Cloudflare Spectrum Product Page](https://www.cloudflare.com/products/cloudflare-spectrum/)\n- [Cloudflare Spectrum Blog](https://blog.cloudflare.com/spectrum/)\n- [Cloudflare Spectrum Technical Blog](https://blog.cloudflare.com/how-we-built-spectrum/)",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "2d14bc13-0cff-5fb7-ab40-013e3112521b",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-announces-spectrum-to-protect-anything-connected-to-the-internet/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}