{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-launches-the-first-domain-registrar-you-can-love/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "f0f6f496-3ce3-557a-b29d-83b3b26977fc",
				"title": "Cloudflare Launches the First Domain Registrar You Can Love",
				"contentfulId": "9MXCB7rod2SMkacE8mCim",
				"metaTags": null,
				"subtitle": "Secure domain registration has never been this easy or fairly priced ",
				"orderDate": "2018-09-27",
				"body": "__San Francisco, CA, September 27, 2018 —__ [Cloudflare](http://www.cloudflare.com/), the leading Internet performance and security company, today announced early access of Cloudflare Registrar, the first registrar built around trust, security, and fair, wholesale pricing. Cloudflare has chosen today, its eighth birthday, to announce Registrar as a gift to the Internet. \n\nA domain cannot be secured without a registrar. Registrars protect domains from being compromised—and their owners from the resulting consequences. A compromised domain means completely losing security functionality, control over website content, and the potential of redirecting web traffic to another IP address, ultimately damaging a brand’s reputation. \n\nThe marketplace for domain registration has been stagnant and manipulative. Registrars lure customers in with low registration fees and end up charging them extremely high renewal fees. They also trick users into purchasing services they do not need or charge fees for critical services that are otherwise offered for free, like SSL. Cloudflare’s Registrar does away with the misleading pricing model, offering a fairly-priced solution with no markup from wholesale pricing—initially and at every renewal—to all of Cloudflare’s customers. \n\n“When we looked at the marketplace for domain registration, we were shocked at the deceitful pricing around a service that is really just a commodity,” said Matthew Prince, co-founder and CEO of Cloudflare. “We realized that the one thing every Cloudflare customer needs is a domain, so they needed a registrar they could trust. With Cloudflare Registrar, we’re promising to offer our customers the best security practices at the best possible price. Our goal is simply to create the first domain registrar you can love.” \n\nThe benefits of Cloudflare Registrar include: \n\n- __Fair Pricing:__ At-cost pricing eliminates any surprise charges associated with inflated renewal costs or hidden add-on fees with other registrars. Cloudflare simply charges the wholesale price of the registry, the lowest price available today.\n- __Transparency:__ Notifies the entire authorized team should any changes be applied.\n- __Security-First Practices:__ Built-in two-factor authentication, automatic domain lock, WHOIS privacy protection, and security best-practices like automatic DNSSEC—all at no extra cost. \n\n![registrar pricing](//cf-assets.www.cloudflare.com/slt3lc6tev37/3xwRKTnCcgcgySa0YgQuAg/763411d92d19ce44a5768116beae95ac/registrar_pricing_.svg)\n\nIn addition to Cloudflare Registrar, the company has an enterprise-level domain registration service called Cloudflare Custom Domain Protection, which [launched](https://blog.cloudflare.com/introducing-cloudflare-registrar/) in February of 2016. \n\nTo learn more about Cloudflare Registrar, please check out the resources below. Existing Cloudflare customers can sign up for early access [here](https://dash.cloudflare.com/domains). \n\n- [Cloudflare Registrar Product Page](https://www.cloudflare.com/products/registrar/)\n- [Cloudflare Registrar Blog ](https://blog.cloudflare.com/cloudflare-registrar)\n- [Cloudflare Registrar Technical Blog](https://blog.cloudflare.com/using-cloudflare-registrar) \n  ",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "f0f6f496-3ce3-557a-b29d-83b3b26977fc",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-launches-the-first-domain-registrar-you-can-love/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}