{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-stream-now-generally-available-to-democratize-video-streaming/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "b4d33e1a-f26c-5efa-9855-611329ab2e85",
				"title": "Cloudflare Stream Now Generally Available to Democratize Video Streaming",
				"contentfulId": "6xB0ldgz72m2mCCWaSqI2C",
				"metaTags": null,
				"subtitle": "New technology enables anyone to affordably integrate video into apps and online",
				"orderDate": "2018-08-07",
				"body": "__San Francisco, CA, August 7, 2018 —__ [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced the general availability of Cloudflare Stream, a new way for content owners and app developers to integrate video into any application or website. \n\nPrior to Cloudflare Stream, if businesses wanted to move beyond just uploading videos to a consumer service like YouTube, they had to use at least three different services: one to encode video into a streamable format, another to act as the content delivery network delivering the bytes, and another to provide the player code that runs on the client device. Cloudflare is fixing both the technical and business issues that have plagued the video streaming market to date. \n\n“Now that Cloudflare Stream has democratized the video technology that was previously only available to the likes of Netflix, YouTube, and Facebook, we can’t wait to see what developers will build,” explained Matthew Prince, co-founder and CEO of Cloudflare. “A developer on our team was literally able to build a full-featured video sharing service over a weekend. Get ready for an explosion of apps that use video in innovative, new ways—all powered by Cloudflare Stream.”\n\nCloudflare Stream gives content owners a new way to integrate video into any app or website, without dealing with technical complications or giving up control to platforms like YouTube or Facebook. Cloudflare handles the infrastructure setup to give developers an independent platform, which enables owners to retain their own data, own branding, and keep viewers on their own pages instead of referring them back to other major sites. This allows creators and developers to have full control over their content.\n\nThe benefits of Cloudflare Stream include: \n\n- __Cost-Effective Pricing:__ With zero-cost encoding and a per-minute pricing model, Cloudflare Stream is one of the most cost-effective ways to deliver high quality video anywhere around the world.\n- __Adaptable Workflow:__ Users can now focus on their content and customers, with Cloudflare Stream removing the need to be an expert in video processing and delivery. \n- __High-Quality Video:__ Adaptive bitrate streaming serves the highest-quality video through Cloudflare’s robust network of 150+ data centers spanning the globe. \n- __Customizable Player:__ Content creators can increase profit by keeping visitors on their site, resulting in higher advertising revenue. \n\nStream’s ease-of-use and affordability are its killer features. Stream is priced on a per-minute viewed basis, aligning Cloudflare’s interests in continuing to innovate with Stream’s users. Stream costs $1 per 1,000 minutes viewed. Cloudflare customers pay $5 per 1,000 minutes of video files stored. Discounts are available at higher volumes and there are no additional encoding, bandwidth, or player license fees.\n\n“Stream was designed to be the high-quality, low-cost solution in the video market,” said Dane Knecht, Head of Product Strategy at Cloudflare. “It’s typical for users of legacy video solutions to save more than half their costs by switching to Stream.”\n\n\"Cloudflare's unique position as an independent, massively scaled infrastructure company allows the company to change the game across any number of markets once considered stagnant or dominated by the giant platform companies,\" said Internet entrepreneur and author, John Battelle. \"Cloudflare Stream will enable an entirely new ecosystem of quality content creators to find and engage with their audiences directly, rendering irrelevant the technical and economic moats once considered impregnable.\" \n\nCloudflare first [announced](https://blog.cloudflare.com/introducing-cloudflare-stream/) the Cloudflare Stream beta in September. Since then, more than 4,000 customers have signed up and are using Stream for a variety of uses. Cloudflare customers who were previously using other video streaming services have reported savings of up to half of their prior bills. \n \n\"Video plays a key role in our mission to reinvent the Spotify playlist. Using artificial intelligence, we are creating unique video experiences that are tailored to our users' preferences,” said Michael Pazaratz, CEO of Rave. “We're excited to use Cloudflare Stream to help us deliver the best video experience to our users.\"\n\n\"We've been delighted with our trial of Stream: it's a simple, powerful service with zero bloat that's clearly been built with a lot of attention to detail,” said Greg Annandale, Web Platform Lead, Raspberry Pi Foundation. “The API-driven video upload functionality fits our requirements perfectly, and it's very easy to embed videos and customise the player. The service also has clear, fair pricing, and we look forward to streaming much more of our content with its help in the near future.\"  \n\n\"Cloudflare Stream has proved to be an innovative, easy-to-use solution for our video streaming needs,” said Andrew Austin, Lead Developer, A2 Services. “Its per-minute pricing has helped us avoid large upfront costs involved with other video solutions.”\n\nTo learn more about Cloudflare Stream, please check out the resources below. \n\n- [Cloudflare Stream Product Page ](https://www.cloudflare.com/products/cloudflare-stream/)\n- [Cloudflare Stream Blog ](https://blog.cloudflare.com/why-use-stream)",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "b4d33e1a-f26c-5efa-9855-611329ab2e85",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-stream-now-generally-available-to-democratize-video-streaming/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}