{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-workers-opens-edge-computing-to-everyone/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "bab0f967-fbf4-562f-8d74-8e15d6fcb25e",
				"title": "Cloudflare Workers Opens Edge Computing to Everyone",
				"contentfulId": "5sbXtopmz6iGKI6iEe4a4C",
				"metaTags": null,
				"subtitle": "Industry-first solution makes Cloudflare the leader in edge computing",
				"orderDate": "2018-03-13",
				"body": "__San Francisco, CA, March 13, 2018__ — [www.cloudflare.com](http://www.cloudflare.com/), the leading Internet performance and security company, today announced the general availability of Cloudflare Workers, a new way for developers to deploy and execute their code directly at the edge of Cloudflare’s global network.\n\nPrior to Cloudflare Workers, there were two main places where developers could deploy code: front-end code running on an end user’s device, or back-end code running in a central data center. Both have their drawbacks. Code running on an end user’s device is difficult to update and is limited by power and bandwidth. Code running in a central data center can have substantial network latency and be subject to outages.\n\nCloudflare Workers gives developers a third place to deploy their code close to their customers — at the edge of Cloudflare’s ever-expanding global network — bringing the power and flexibility of a cloud data center, and the redundancy of a massively distributed system, within milliseconds of virtually every Internet user.\n\n“Prior to today, the only way to write code that ran at the edge of Cloudflare’s network was to be a Cloudflare employee. Cloudflare Workers opens the scale of our global network to any developer,” explained Matthew Prince, co-founder and CEO of Cloudflare. “By bridging the front-end and back-end with a third place to develop code, we’re excited Cloudflare Workers will empower a new class of applications that were previously impossible. I can’t wait to see what developers build.”\n\nThe benefits of Cloudflare Workers include:\n\n- __Programmable__: Developers can deploy custom JavaScript code at the edge to intelligently respond to users on any browser or API client.\n- __Scalable__: Cloudflare Workers runs across Cloudflare’s 127+ data centers and dynamically scales to meet the demands of any load.\n- __Fast__: Cloudflare’s global network is within milliseconds of virtually every Internet user, allowing Cloudflare Workers to support latency-sensitive applications.\n- __Resilient__: A globally-distributed, “serverless” architecture ensures that Cloudflare Workers is not hamstrung by any single point of failure.\n- __Unconstrained__: Support for complex computing tasks without worrying about end users’ bandwidth or battery burden.\n- __Affordable__: Cloudflare Workers is priced at 50¢ per 1 million tasks, making its pricing easy to understand, globally consistent, predictable, and less expensive than centralized alternatives.\n- __Portable__: Powered by JavaScript, the Internet’s most popular programming language, Cloudflare Workers supports the same code that many developers have already used for their front- and back-end applications.\n- __Updatable__: Developers can push updates to Cloudflare Workers and within seconds know their code has been deployed globally — without having to wait for end users to update their apps or centralized cloud platforms that can take half an hour or more to deploy code.\n- __Backward Compatible__: Legacy static configuration languages like Varnish Configuration Language (VCL) or Edge Side Includes (ESI) can be automatically converted to dynamic Cloudflare Workers.\n\nCloudflare [announced](https://blog.cloudflare.com/introducing-cloudflare-workers/) the Cloudflare Workers beta in September. Since then, customers in the beta have run billions of edge computing tasks using Cloudflare Workers.\n\n“Cloudflare Workers saves us a great deal of time,” said John Thompson, Senior System Administrator at MaxMind. “Managing bot traffic without Workers would consume valuable development and server resources that are better spent elsewhere.”\n\n“At Postmates, customer trust is the most important thing,” said Aabhas Sharma, Infrastructure Lead at Postmates. “We needed a way to do a high volume of redirects without dedicating additional internal resources. Ultimately, Cloudflare Workers gave us a simpler way to build flexibility and fine-grained control into our systems at the edge for a more reliable and secure process.”\n\n\"Moving away from VCL and adopting Cloudflare Workers will allow us to do some creative routing that will let us deliver JavaScript to npm's millions of users even faster than we do now,\" said CJ Silverio, CTO of npm, Inc. \"We will be building our next generation of services on Cloudflare's platform and we get to do it in JavaScript!\"\n\nThe use cases for Cloudflare Workers are emerging across a variety of verticals:\n\n- An adtech beta customer is using Workers to run real-time tests to determine which advertisement versions yield the best conversions. They have benefitted from higher conversions for their customers and increased revenue as a company, all while bringing previously high-priced ad optimization capabilities to a broader market.\n- Another customer in media and publishing uses Workers to redirect language-specific readers to the German version of their site, providing a more personalized experience and an opportunity to build an optimized advertising base.\n- An eCommerce customer uses Workers to identify the type of device users are connecting from so that they can optimally deliver images. This results in a better user experience and ultimately more purchases.\n- A gaming company is now using Workers to perform authentication and redirects to their back-end infrastructure. Workers has transformed their operational and capex expenditures by eliminating additional server hardware that hosts NGINX, saving countless hours of engineering time.\n\nTo learn more about Cloudflare Workers, please check out the resources below.\n\n- [Cloudflare Workers Product Page](https://www.cloudflare.com/products/cloudflare-workers/)\n- [Cloudflare Workers Blog](https://blog.cloudflare.com/cloudflare-workers-unleashed/)",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "bab0f967-fbf4-562f-8d74-8e15d6fcb25e",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-workers-opens-edge-computing-to-everyone/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}