{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-continues-growth-with-record-new-products-in-q3-2018/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "567bd1ee-dd96-5117-b87e-68112b039da3",
				"title": "Cloudflare Continues Growth With Record New Products in Q3 2018",
				"contentfulId": "1qhY078XEYgiuQgAc4qGie",
				"metaTags": null,
				"subtitle": "The company continues to expand its network capacity and offerings for all customers",
				"orderDate": "2018-10-26",
				"body": "San Francisco, CA, October 26, 2018 — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced results from the third quarter of 2018. Cloudflare announced 15 new offerings in the third quarter and is now protecting and accelerating more than 10 million domains, websites, APIs, mobile applications, and anything connected to the Internet.\n\n\"Our third quarter is always a special time for us. Cloudflare celebrated its eighth birthday on September 27th, and in our birthday tradition, we celebrated by giving back to the Internet with ten new offerings,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Every year, we release solutions that will have lasting impacts on the Internet and solve some of its toughest challenges. This year was no different, and we truly continued our mission of helping to build a better Internet.\" \n\nCloudflare announced five solutions and advancements in cryptography to help make the Internet more secure for everyone during its \"Crypto Week\" in September. This included Cloudflare's [Distributed Web Gateway](https://blog.cloudflare.com/distributed-web-gateway/), a fast and secure way to access content stored on the peer-to-peer file system, [DNSSEC](https://blog.cloudflare.com/automatically-provision-and-maintain-dnssec/), to simplify and automate DNSSEC provisioning for customers and increase overall adoption, [RPKI](https://blog.cloudflare.com/rpki/), a feature which authenticates and validates IP addresses within Cloudflare's global network, [Cloudflare Onion](https://blog.cloudflare.com/cloudflare-onion-service/), to improve security and reduce friction for visitors using Tor on Cloudflare's network, and [Roughtime](https://blog.cloudflare.com/roughtime/), a solution that reduces TLS certificate errors and ultimately malicious actors by using an authenticated timestamp service. \n\nCloudflare celebrated its eighth birthday by making five announcements that give back to the Internet at large during its \"Birthday Week.\" Cloudflare became the first CDN to deploy the [Encrypted SNI (ESNI)](https://blog.cloudflare.com/esni/) standard, which further protects the privacy of online users. Cloudflare also announced [QUIC](https://cloudflare-quic.com/), a protocol that improves web security and performance for all visitors using the latest browsers, and [Cloudflare Registrar](https://www.cloudflare.com/products/registrar/), the first domain registrar available at the wholesale price. With the launch of Workers KV, developers can now use Cloudflare Workers and [Workers KV](https://www.cloudflare.com/products/workers-kv/) to augment existing apps or build entirely new apps on top of the Cloudflare network. \n\nDuring Birthday Week, Cloudflare also announced the [Bandwidth Alliance](https://www.cloudflare.com/bandwidth-alliance/), a collection of forward-thinking cloud companies including Microsoft Azure, IBM Cloud, Digital Ocean, and more. Bandwidth Alliance members have committed to waiving or greatly reducing bandwidth fees for customers when interconnecting directly to Cloudflare's network. \n\nIn August, Cloudflare launched general availability of [Stream](https://www.cloudflare.com/products/cloudflare-stream/), a new way for content owners and app developers to integrate video into any application or website. In addition, Cloudflare is continuing to expand its network across the world and now has a network capacity of 20Tbps. \n\nCloudflare now has more than 800 employees, up from 475 just over a year ago, and recently opened an office in San Jose, California. The company continues to grow its engineering, sales, marketing, and support teams across its offices worldwide. \n\nTo learn more about Cloudflare, please check out the resources below. \n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [Cloudflare Blog](https://blog.cloudflare.com)\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "567bd1ee-dd96-5117-b87e-68112b039da3",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-continues-growth-with-record-new-products-in-q3-2018/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}