{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-continues-to-build-on-its-massive-global-network-in-second-quarter/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "49565ebe-5228-508b-aaa3-b2961cfef445",
				"title": "Cloudflare Continues to Build On Its Massive Global Network in Second Quarter ",
				"contentfulId": "19bIQQQgK2cUGWYwQOi6I0",
				"metaTags": null,
				"subtitle": "The company announced its first consumer offering and extended its services to anything connected to the Internet",
				"orderDate": "2018-07-27",
				"body": "__San Francisco, CA, July 27, 2018__ — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced results from the second quarter of 2018 and has continued to expand its network capabilities with a number of new offerings. Cloudflare is also announcing that it now protects more than 9 million domains, websites, APIs, mobile applications, and anything connected to the Internet.\n\n“In the second quarter we focused on delivering solutions that help everyone online,” said Matthew Prince, co-founder and CEO of Cloudflare. “We announced our first consumer offering and extended our services to anything connected to the Internet, both huge milestones for us as a company and for users everywhere.” \n\nIn April, Cloudflare announced [1.1.1.1](https://1.1.1.1/), the first public DNS resolver built around the principle of privacy-first. Cloudflare’s first consumer offering, 1.1.1.1, ensures a faster and more private Internet for users everywhere, for free. It is already the fastest DNS resolver in the world and [47 percent faster](https://www.dnsperf.com/#!dns-resolvers) than the second-fastest resolver.\n\nCloudflare also announced [Spectrum](https://www.cloudflare.com/products/cloudflare-spectrum/), a solution that extends Cloudflare’s benefits beyond web protocols to protect and accelerate email servers, gaming servers, IoT devices, and anything else that connects to the Internet. With Spectrum, Cloudflare is able to accelerate everything across its global network of 150+ data centers and protect anything connected to the Internet from attack.\n\nAnother milestone for the company was its [first Cloudflare Internet Summit UK](https://www.cloudflare.com/internet-summit/london/), held on Thursday, June 14 in London. Cloudflare usually holds the event in San Francisco annually, and this was the first international expansion of the event. The event featured fireside chats and panels with speakers including Sir John Scarlett, the former chief of MI6, Nnenna Nwakanma, senior policy manager at the World Wide Web Foundation, and Alex Macgillivray, the former US Deputy CTO, among many others. Cloudflare will be holding its [fourth annual Internet Summit](https://www.cloudflare.com/internet-summit/sanfrancisco/) in San Francisco on Thursday, October 4. \n\nCloudflare now has more than 709 employees, up from 440 just over a year ago. The company continues to grow its engineering, sales, marketing, and support teams across its offices in San Francisco, Austin, TX, Champaign, IL, London, New York, NY, Washington D.C., and Singapore. \n\nTo learn more about Cloudflare, please check out the resources below. \n\n- [Cloudflare Blog](https://blog.cloudflare.com/) \n- [Q2 Product Releases](https://blog.cloudflare.com/better-internet-end-to-end/)\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "49565ebe-5228-508b-aaa3-b2961cfef445",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-continues-to-build-on-its-massive-global-network-in-second-quarter/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}