{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-announces-cloud-native-access/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "9966fa5b-d683-54bf-afe8-a1244b3194e6",
				"title": "Cloudflare Announces Cloud-Native \"Access\" to Release Users from the Shackles of the Legacy Enterprise VPN",
				"contentfulId": "4KrpNHOBjqgAAouSwAEAIU",
				"metaTags": null,
				"subtitle": "Cloudflare builds upon Google's BeyondCorp initiative, creating a solution for everyone else",
				"orderDate": "2018-01-17",
				"body": "__San Francisco, CA, January 17, 2018__ — [www.cloudflare.com](http://www.cloudflare.com/), the leading Internet performance and security company, today announced Cloudflare Access, a solution that does away with slow, unwieldy, complex Virtual Private Networks (VPNs) and makes accessing internal enterprise applications fast and easy. With Access, companies ensure that only authorized employees can securely access internal applications, without the use of a VPN.\n\nCompanies typically use a VPN to allow employees access to internal applications that are not available on the public Internet, but VPNs slow down every request, are inconvenient on mobile, and require ongoing maintenance. The average enterprise hosts thousands of internal Internet applications across multiple cloud and on-premise locations, and employees need to access them while outside of the corporate office.\n\nGoogle's internal BeyondCorp initiative sought to fix this by allowing Google employees to work more securely from any location without the need for a VPN. Cloudflare has democratized the BeyondCorp model, creating a solution that works for anyone, anywhere, across all devices, and across thousands of applications. It acts as a single security management plane for internal enterprise applications wherever they are hosted without the need for a VPN, with increased security and dramatically improved speed.\n\n\"VPNs are slow, clunky, and frankly don't make sense for an increasingly mobile workforce accessing increasingly cloudified apps,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Cloudflare Access gives centralized application access control for legacy or cloud apps without slowing down connections, regardless of where someone is working around the world.\"\n\nThe benefits of Cloudflare Access include:\n\n- __No unauthorized access__: Every request is authenticated to ensure that sensitive data is protected without sacrificing usability.\n- __Seamless app integration__: It works for both legacy on-premise apps as well as modern cloudified apps.\n- __Faster productivity__: Internal applications operate at the same speed whether an employee is at company HQ or traveling overseas to visit a customer.\n- __No hardware necessary__: There is no expensive hardware or time consuming maintenance required.\n- __Easy set-up__: Set-up takes just five to 10 minutes from start to finish.\n- __Detailed audit logs__: All policy changes and attempted access to internal applications are audited and logs are easily searchable.\n\nAccess integrates with identity providers like Okta, Microsoft Active Directory, Google G Suite, IBM, and others.\n\n\"Thousands of organizations around the world rely on the Okta Identity Cloud to manage and secure their extended enterprise,\" said Chuck Fontana, VP of Business Development. \"Okta and Cloudflare's integration will enable our joint customers to securely connect to both cloud and on-premises applications, with Okta providing user identity and Cloudflare providing application access to complete the authentication flow. Together, we will empower organizations to better manage and secure the vast volume of resources available as the proliferation of people, applications and devices continues.\"\n\nAccess customers include 23andMe and Scrapbook.com:\n\n\"Cloudflare Access is helping 23andMe access our internal applications securely from any device at anytime without the need for VPN,\" said Arnold de Leon, SRE manager, 23andMe, Inc.\n\n\"Access helps us by providing authenticated access to our knowledge base and other internal tools that were previously limited to our corporate network. Our remote workers now have the same access to these tools as anyone in our offices, and all of our colleagues can use the same accounts that they already use for their other core services,\" said Greg Bonham, Director of IT, Scrapbook.com. \"Our technology team benefits greatly from the centralized account control and logging which allow us to see every login attempt. The best part is that new sites can be added in minutes, so we can extend this to more internal tools in the future.\"\n\nTo learn more, please check out the resources below:\n\n- [Cloudflare Access Product Page](https://www.cloudflare.com/products/cloudflare-access/)\n- [Cloudflare Access Blog](https://blog.cloudflare.com/introducing-cloudflare-access/)",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "9966fa5b-d683-54bf-afe8-a1244b3194e6",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-announces-cloud-native-access/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}