{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-opens-first-office-in-germany-amid-significant-dach-region/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "f7dcc14f-cb9f-5349-86ca-87d61d18e1d5",
				"title": "Cloudflare Opens First Office in Germany Amid Significant DACH Region Growth",
				"contentfulId": "TBwYqRTLI2qm2wyWsuIgW",
				"metaTags": null,
				"subtitle": "The company continues to grow its presence in Europe with an office in Munich ",
				"orderDate": "2018-10-18",
				"body": "__Munich, Germany, October 18, 2018 —__ [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced the opening of an office in Munich, Germany, its first office in the DACH region (Germany, Austria, and Switzerland). This office opening marks Cloudflare's second office in Europe, following the company's European headquarters in London, and will help the company grow brand awareness, acquire customers, and recruit new talent.\n\nCloudflare's network is already spread across the DACH region, with seven points of presence in Frankfurt, Berlin, Hamburg, Düsseldorf, Munich, Zurich, and Vienna. Cloudflare is planning further expansion in the region as it continues to grow its network beyond 150+ data centers globally. \n\n\"Germany has the largest national economy in Europe and the fourth-largest by nominal GDP in the world. As Cloudflare considered locations for its second European office, Munich, a hub of technology innovation and business, seemed like an obvious choice,\" said Matthew Prince, co-founder & CEO, Cloudflare. \"Opening an office in Munich presents a unique opportunity to be closer to our customers in the fast-growing DACH market.\"\n\nWith more than 10 million domains on Cloudflare's network, the company already has many customers across the DACH region.  \n\n\"We're using Cloudflare not only because it's easy and fun to use, but because it also gives us excellent value in terms of features, security, and performance,\" said Dirk Fiebiger, Team Manager of IT at Paessler AG.\n\n\"Cloudflare provides excellent logging, agile security controls, and powerful centralized management of our many brands around the world,\" added Michael Strout, Senior Security Engineer at Delivery Hero. \n\nCloudflare's first head of DACH, Stefan Henke, will oversee and lead the company's sales in Germany and the broader DACH region. \n\n\"Although digitalization started late in the DACH region, it is now booming across all verticals and there is huge demand for Cloudflare's services,\" said Stefan Henke, Head of DACH at Cloudflare. \"Cloudflare is able to protect, accelerate, and optimize anything connected to the Internet and is also able to shift computing functions to the edge of the public network as an edge network vendor.\"\n\nCloudflare's Munich office joins its other global offices in San Francisco, CA, London, Singapore, Austin, TX, Champaign, IL, New York, NY, and Washington, DC. The company is continuing to grow its engineering, sales, marketing, and support teams across all offices. \n\nTo learn more about Cloudflare, please check out the resources below.  \n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [DACH Expansion Blog](https://blog.cloudflare.com/why-im-helping-cloudflare-grow-in-germany-austria-and-switzerland/) (English)\n- [DACH Expansion Blog](http://blog.cloudflare.com/why-im-helping-cloudflare-grow-in-germany-austria-and-switzerland-de/) (German)\n\n\n\n\n\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "f7dcc14f-cb9f-5349-86ca-87d61d18e1d5",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-opens-first-office-in-germany-amid-significant-dach-region/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}