{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2018/cloudflare-announces-mobile-sdk-to-monitor-network-performance-for-applications/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "36d7decb-debc-591c-a1c8-7263658c7a89",
				"title": "Cloudflare Announces Mobile SDK to Monitor Network Performance for Applications",
				"contentfulId": "3bLW1a04gwowoWoC0QUmIq",
				"metaTags": null,
				"subtitle": "New free solution delivers network analytics to any mobile app developer",
				"orderDate": "2018-03-22",
				"body": "__San Francisco, CA, March 22, 2018__ — [Cloudflare](http://www.cloudflare.com/), the leading Internet performance and security company, today announced the Cloudflare Mobile SDK, a free solution that enables any mobile app developer to understand network performance and metrics.\n\nConsumers are frustrated by mobile apps that are slow, crash, or deliver errors that degrade the user experience. For mobile app developers, a bad user experience means poor reviews, lower engagement, and reduced conversion on business metrics.\n\nDelivering consistent app performance requires focusing on every link in the chain: app code, network calls between the app and edge networks, and server infrastructure. There are a number of solutions that give developers analytics on their applications, but there has never been a way for app developers to understand how often their apps fail due to network errors.\n\nApp developers easily integrate the Cloudflare Mobile SDK with their mobile apps to give them visibility into network performance and errors around the world. The Cloudflare Mobile SDK is complementary to existing developer tools like Crashlytics, Rollbar, Sentry, Instabug, etc.\n\n\"Cloudflare is focused on helping to build a better Internet, from handset to origin server and back,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"We wanted to help mobile app developers better track network performance easily and for free, because it's better for the Internet.\"\n\nExamples of network errors impacting user experience include:\n\nDisconnects that occur when roaming from network-to-network (eg. from a cell network to home WiFi).\nPacket loss due to poor signal.\nCongestion on the Internet between the cell tower and infrastructure.\nThe Cloudflare Mobile SDK offers app developers never-before-seen insights to improve their customers' user experience. The benefits of the Cloudflare Mobile SDK include:\n\n- __Lightweight__: No impact on performance or device battery life.\n- __Actionable, Novel Data__: Understand network performance in apps the same way developers analyze network calls in a browser.\n- __Minimal Dependencies__: Anyone can use the Cloudflare Mobile SDK to collect data, even those not using any Cloudflare infrastructure.\n- __Private by Design__: Cloudflare will never collect persistent identifiers or sell your data to third parties.\n- __Easy Setup__: Installing Cloudflare's Mobile SDK is easy, only requiring developers to add a few lines of code to an iOS or Android application.\n\nA number of customers have already integrated the Cloudflare Mobile SDK into their applications:\n\n\"Cloudflare is helping us deliver a faster, more reliable cryptocurrency trading experience to our users,\" said Kirill Yashuk, co-founder and CTO of TabTrader. \"The Mobile SDK was straightforward to integrate into our apps despite a complicated use case, and data started flowing quickly.\"\n\n\"Our users never complain about poor connectivity; they complain our app doesn't work,\" said Ben Yule, CTO of Spire. \"After integrating the SDK, my engineering team has visibility where previously we had none. Cloudflare's Mobile SDK delivers the missing link in app experience monitoring.\"\n\n\"Network access has a huge impact on any connected user experience in mobile, but mobile network latency is often ten times the latency of server processing times and mostly untracked,\" said Alex Austin, CEO of Branch Metrics. \"Cloudflare's focus on bringing mobile network issues to light with minimal engineering effort will be great for users and even better for developers.\"\n\nTo learn more about Cloudflare Mobile SDK, please check out the resources below.\n\n- [Cloudflare Mobile SDK Product Page](https://www.cloudflare.com/products/mobile-sdk/)\n- [Cloudflare Mobile SDK Blog](http://blog.cloudflare.com/mobile-sdk-metrics/)",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "36d7decb-debc-591c-a1c8-7263658c7a89",
			"locale": "en-US",
			"pathname": "/press-releases/2018/cloudflare-announces-mobile-sdk-to-monitor-network-performance-for-applications/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}