{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2022/cloudflare-leader-gartner-magic-quadrant-waaap/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "a27200fd-8241-5067-9ccd-18e1fe791f9b",
				"title": "Cloudflare Positioned as a Leader in the Gartner®  Magic Quadrant™ for Web Application and API Protection",
				"contentfulId": "4KJ31AbD3em3Tpl5UcH9oy",
				"metaTags": null,
				"subtitle": "Cloudflare placed in the Leaders quadrant for its ability to execute and completeness of vision ",
				"orderDate": "2022-09-06",
				"body": "__San Francisco, CA, September 6, 2022__ — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today announced it has been named by Gartner® as a Leader in the Magic Quadrant™ for Web Application and API Protection (WAAP). This is the first year Cloudflare has been placed in the Leaders quadrant.\n\n\"More than half of traffic across Cloudflare's network is for APIs. That's why we've invested heavily in building the best platform for protecting APIs and application web traffic,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"We're proud to be recognized as a Leader in this space by Gartner and that more and more enterprises choose Cloudflare to fully protect their networks from the most sophisticated attacks.\"\n\nCloudflare was recognized among 11 vendors for its ability to execute and completeness of vision. In the past year, Cloudflare has expanded its WAF's [threat intelligence](https://blog.cloudflare.com/new-waf-intelligence-feeds/) capabilities, added [machine learning](https://blog.cloudflare.com/waf-ml/) WAF detection, unveiled an [API Gateway](https://blog.cloudflare.com/api-gateway/), delivered client-side protections against 3rd party JavaScript attacks, and bolstered its Bot Management protections while reducing the need for [CAPTCHAs](https://blog.cloudflare.com/eliminating-captchas-on-iphones-and-macs-using-new-standard/).\n\nA complimentary copy of the 2022 Gartner Magic Quadrant for WAAP is available [here](https://www.cloudflare.com/lp/gartner-magic-quadrant-waap-2022/). Visit our [blog](https://blog.cloudflare.com/cloudflare-waap-named-leader-gartner-magic-quadrant-2022) for more details, and learn more about Cloudflare's WAAP solutions:\n- [Cloudflare API Gateway](https://www.cloudflare.com/products/api-gateway/)\n- [Cloudflare Application Security](https://www.cloudflare.com/application-security/)\n- [Cloudflare Bot Management](https://www.cloudflare.com/products/bot-management/)\n- [Cloudflare DDoS](https://www.cloudflare.com/ddos/#:~:text=Cloudflare%20DDoS%20protection%20secures%20websites,Sign%20UpContact%20Sales)\n- [Cloudflare WAF](https://www.cloudflare.com/waf-pro/)\n\nGartner, \"Magic Quadrant for Web Application and API Protection\", Analyst(s): Jeremy D'Hoinne, Rajpreet Kaur, John Watts, Adam Hils, August 30, 2022\n\n__Gartner Disclaimer__ \n\n*Gartner and Magic Quadrant are registered trademarks of Gartner, Inc. and/or its affiliates in the U.S. and internationally and are used herein with permission. All rights reserved.\n\n*Gartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Copyright and Quote Policy Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.*\n*\n__About Cloudflare__ \nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare's suite of products protect and accelerate any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine's Top Company Cultures 2018 list and ranked among the World's Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, New York, NY, San Jose, CA, Seattle, WA, Washington, D.C., Toronto, Dubai, Lisbon, London, Munich, Paris, Beijing, Singapore, Sydney, and Tokyo.\n\n__Forward Looking Statements__ \nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which statements involve substantial risks and uncertainties. In some cases, you can identify forward-looking statements because they contain words such as \"may,\" \"will,\" \"should,\" \"expect,\" \"explore,\" \"plan,\" \"anticipate,\" \"could,\" \"intend,\" \"target,\" \"project,\" \"contemplate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" or \"continue,\" or the negative of these words, or other similar terms or expressions that concern Cloudflare's expectations, strategy, plans, or intentions. However, not all forward-looking statements contain these identifying words. Forward-looking statements expressed or implied in this press release include, but are not limited to, statements regarding Cloudflare's plans and objectives for its global network, web application firewall, DDoS protection, API Gateway, Bot Management, and other products and technology, the benefits to customers from using Cloudflare's global network, web application firewall, DDoS protection, API Gateway, Bot Management, and other products and technology, the expected functionality and performance of Cloudflare's global network, web application firewall, DDoS protection, API Gateway, Bot Management, and other products and technology, Cloudflare's technological development, future operations, growth, initiatives, or strategies, and comments made by Cloudflare's CEO and others. Actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in Cloudflare's filings with the Securities and Exchange Commission (SEC), including Cloudflare's Quarterly Report on Form 10-Q filed on August 4, 2022, as well as other filings that Cloudflare may make from time to time with the SEC.\n\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements are made. Cloudflare undertakes no obligation to update any forward-looking statements made in this press release to reflect events or circumstances after the date of this press release or to reflect new information or the occurrence of unanticipated events, except as required by law. Cloudflare may not actually achieve the plans, intentions, or expectations disclosed in its forward-looking statements, and you should not place undue reliance on Cloudflare's forward-looking statements.\n\n© 2022 Cloudflare, Inc. All rights reserved. Cloudflare, the Cloudflare logo, and other Cloudflare marks are trademarks and/or registered trademarks of Cloudflare, Inc. in the U.S. and other jurisdictions. All other marks and names referenced herein may be trademarks of their respective owners.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "a27200fd-8241-5067-9ccd-18e1fe791f9b",
			"locale": "en-US",
			"pathname": "/press-releases/2022/cloudflare-leader-gartner-magic-quadrant-waaap/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}