{
	"content_protection.description": "Protect content on your site",
	"content_protection.title": "Scrape Shield",
	"email_filter.description": "Display obfuscated email addresses on your website to prevent harvesting by bots and spammers, without visible changes to the address for human visitors.",
	"email_filter.help": "#### Why use Email Address Obfuscation?\nEmail harvesters and bots are roaming the Internet looking for email addresses to add to their spam lists. Cloudflareu2019s Email Address Obfuscation encrypts email addresses on your web pages. This means that email addresses are hidden from harvesters and bots, but still visible to human visitors.\n\n**Note:** Email Address Obfuscation is only applied in certain instances. It will work for email addresses within documents with a MIME type of text/html or application/xhtml+xml. However, it will not work for email addresses inside certain conditional comments, attributes, and tags outlined below:\n\n ```\n// Conditional comment:       <!--email_off--><!--/email_off--> \n// Script:                    <script></script> \n// Noscript:                  <noscript></noscript> \n// Comments:                  <!-- --> \n// Textarea:                  <textarea></textarea> \n// XMP:                       <xmp></xmp> \n// Head:                      <head></head> ``` \n",
	"email_filter.title": "Email Address Obfuscation",
	"email_filter.api.title.get": "Get Email Obfuscation setting",
	"email_filter.api.title.patch": "Change Email Obfuscation setting",
	"hotlink.description": "Protect your images from off-site linking.",
	"hotlink.help": "#### What does Hotlink Protection do?\nHotlink Protection prevents your images from being used by other sites. This can reduce the bandwidth consumed by your origin server.\n\nWhen Cloudflare receives an image request for your site, we check to ensure the request did not originate from visitors on another site. Visitors to your domain will still be able to download and view images.\n\nHotlink protection has no impact on crawling, but it will prevent the images from being displayed on sites such as Google images, Pinterest, etc.\n\nSupported file extensions: gif, ico, jpg, jpeg, and png.\n\n**Note:** Hotlink Protection will deny access to requests when the HTTP referer does not include your website domain name (and is not blank).\n\n#### Can I allow hotlinking to specific images?\nYou can allow certain images to be hotlinked by placing them in a directory named hotlink-ok. The hotlink-ok directory can be placed anywhere on your website.\n\n**Example:** To allow example.com to use logo.png from %{name}, put logo.png in a new folder called hotlink-ok on %{name}. Any images in the hotlink-ok folder will not be checked for hotlinking.\n\nSome examples of URLs that will not be checked for hotlinking:\n- `http://%{name}/hotlink-ok/pic.jpg`\n- `http://%{name}/images/hotlink-ok/pic.jpg`\n- `http://%{name}/hotlink-ok/images/pic.jpg`\n- `http://%{name}/images/main-site/hotlink-ok/pic.jpg`",
	"hotlink.title": "Hotlink Protection",
	"hotlink.api.title.get": "Get Hotlink Protection setting",
	"hotlink.api.title.patch": "Change Hotlink Protection setting",
	"sse.description": "Automatically hide specific content from disreputable visitors.",
	"sse.help": "#### How can I hide content using Server-side Excludes?\nPlace the content you want to hide from disreputable visitors inside the following conditional comment:\n\n`<!--sse--> <!--/sse-->`\n\n**Example:**\n\n`<!--sse-->Disreputable visitors won't see this<!--/sse-->`\n\n#### How do I know if Server-side Excludes are working?\nYou may not see conditional comments in your content when served by Cloudflare. Certain Cloudflare features like HTML minification will remove the conditional comments. This indicates that Server-side Excludes are functioning properly. You will always be able to see your conditional comments in the HTML source on your origin.\n\n**Note:** Server-side Excludes are only applied to content with a MIME type of `text/html` or `application/xhtml+xml`.",
	"sse.title": "Server-side Excludes",
	"sse.api.title.get": "Get Server Side Exclude setting",
	"sse.api.title.patch": "Change Server Side Exclude setting"
}