{
	"customization.account.need_upgrade": "To use error pages at the account level, you need to have at least 1 site on a paid plan. [Learn more](https://developers.cloudflare.com/rules/custom-errors/).",
	"customization.custom_url": "Address of customized page:",
	"customization.customize": "Custom Pages",
	"customization.error.full_url": "Please provide a complete URL. Be sure to include http or https.",
	"customization.headline": "Custom Pages",
	"customization.instructions": "Build your custom page and host it online.",
	"customization.preview": "Preview",
	"customization.view_default": "View default",
	"customization.publish": "Publish",
	"customization.required_tokens_description": "The following token must be included in your custom page:\n\n- **%{tokens}**",
	"customization.reset_defaults": "Set to Default",
	"customization.subheadline": "Personalize the error and challenge pages that Cloudflare presents to your visitors.",
	"customization.page.documentation_label": "Error Pages documentation",
	"customization.example.custom_url": "example: http://example.com/your-custom-page.html",
	"1000_errors.description": "Customize the error page your visitors will see when a 1000 class error occurs.",
	"1000_errors.help": "#### How do I customize my 1000 Class Errors page?\nTo customize your 1000 Class Errors page, design your custom HTML page and make sure to include the required token. Then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard 1000 Class Errors page to your visitors. **The maximum customized page size is 1.5 MB**.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note**: Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.\n\n#### What token is required in my custom 1000 Class Errors page?\nTo customize your 1000 Class Error page, you must include the following token on your custom HTML:\n\n**::CLOUDFLARE_ERROR_1000S_BOX::**\n\nThis token ensures that diagnostic information will appear on your custom error page allowing support teams to identify issues quickly.\n\nThe following diagnostic information and text will always appear with your custom 1000 Class Errors page:\n\n**Diagnostic information**:\nRay ID: 000000000000000\nTimestamp: Thu, 01-Jan-70 00:00:00 GMT\nYour IP address: 1.1.1.1\nRequested URL: example.url/foo\nError reference number: 1001\nServer ID: FL_FOO\nUser-Agent: Example User Agent\n\n**Text**:\nError 1001\nDNS resolution error\n\nYou've requested a page on a website (cloudflarepreview.com) that is on the Cloudflare network. Cloudflare is currently unable to resolve your requested domain (cloudflarepreview.com). There are two potential causes of this:\n\n**Most likely**: If the owner just signed up for Cloudflare it can take a few minutes for the website's information to be distributed to our global network.\n**Less likely**: Something is wrong with this site's configuration. Usually this happens when accounts have been signed up with a partner organization (e.g., a hosting provider) and the provider's DNS fails.\n\n**Note**: The header and messaging will change based on the type of 1000 error.\n\n[Learn more about 1000 errors](https://support.cloudflare.com/hc/articles/4425107232525).",
	"1000_errors.title": "1000 Class errors",
	"500_errors.description": "Customize the error page your visitors will see when a 500 class error occurs.",
	"500_errors.help": "#### How do I customize my 500 Class Errors page?\nTo customize your 500 Class Errors page, design your custom HTML page and make sure to include the required token. Then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard 500 Class Errors page to your visitors on 502, 504, and 52x errors. **The maximum customized page size is 1.5 MB**.\n\n500, 501, 503, and 505 responses **will not** trigger custom error pages to avoid breaking specific API endpoints and other web applications. Typically, custom errors should be reserved for cases where the origin server could not return a response for the request (520-526 errors).\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note:** Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.\n\n#### What token is required in my custom 500 Class Errors page?\n\n**::CLOUDFLARE_ERROR_500S_BOX::**\n\nThis token ensures that diagnostic information will appear on your custom error page allowing support teams to identify issues quickly.\n\nThe following diagnostic information and text will always appear with your custom 500 Class Errors page:\n\n**Diagnostic information**:\nRay ID: 1df54f578987b9ec013\nYour IP address: 1.1.1.1\nError reference number: 522\nCloudflare Location: San Jose\n\n**Text**:\nThe initial connection between Cloudflare's network and the origin web server timed out. As a result, the web page can not be displayed.\n\n**Note**: The header and messaging text will change based on the type of 500 error.\n\n[Learn more about 500 errors](https://support.cloudflare.com/hc/articles/115003011431).",
	"500_errors.title": "500 Class errors",
	"ip_block.description": "Customize the error page shown to your visitors when they visit from a blocked IP address or country.",
	"ip_block.help": "#### How do I customize my IP/Country Block page?\nTo customize your IP/Country Block page, design your custom HTML page, then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard IP Block page to your visitors.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note:** Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.\n\n#### What token is available for my custom IP Block page?\n\n**::CLIENT_IP::**\n\n**::RAY_ID::**\n\n**::GEO::**\n\nThese token provides diagnostic information such as Client's IP, Ray ID and Geographical Location that will appear on your custom error page, allowing support teams to identify issues quickly.",
	"ip_block.title": "IP/Country block",
	"waf_block.description": "Customize the error page presented to your visitors when they trigger a Web Application Firewall rule.",
	"waf_block.help": "#### How do I customize my WAF Block page?\nTo customize your WAF Block page, design your custom HTML page, then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard WAF Block page to your visitors.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note:** Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.",
	"waf_block.title": "WAF block",
	"origin_error_page_pass_thru.description": "Serve 502 and 504 error pages directly from the origin.",
	"origin_error_page_pass_thru.help": "#### What are Origin Error Pages?\nThis feature allows the customer to display the 5xx error pages set on the origin, rather than showing the default Cloudflare error page.\n\n**Note:** Only for 5xx class errors (excluding 521 and 522 errors)",
	"origin_error_page_pass_thru.title": "Origin Error Pages",
	"always_online_error.description": "Customize the error page your visitors will see when Always Online does not have a cached copy of the requested page.",
	"always_online_error.help": "#### How do I customize my Always Online Error page?\nTo customize your Always Online Error page, design your custom HTML page and make sure to include the required token. Then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard Always Online Error page to your visitors.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note:** Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.\n\n#### What token is required in my custom Always Online Error page?\n**::ALWAYS_ONLINE_NO_COPY_BOX::**\n\nThis token is replaced by a message explaining that Always Online does not have a cached copy of the requested page.\n\n**Note:** The token is a unique piece of text you include in your custom HTML that will be replaced by specific Cloudflare pre-defined modules on your published page.",
	"always_online_error.title": "Always Onlineu2122 Error",
	"basic_challenge.description": "Customize the Interactive Challenge page presented to your visitors.",
	"basic_challenge.help": "#### How do I customize my Interactive Challenge page?\nTo customize your Interactive Challenge page, design your custom HTML page and make sure to include the required token. Then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard Interactive Challenge page to your visitors. **The maximum customized page size is 1.5 MB**.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note**: Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.\n\n#### What token is required in my custom Interactive Challenge page?\nTo customize your Interactive Challenge page, you must include the following token on your custom HTML:\n\n**::CAPTCHA_BOX::**\n\nThe CAPTCHA_BOX token embeds the CAPTCHA on your custom Interactive Challenge page.",
	"basic_challenge.title": "Interactive challenge",
	"managed_challenge.title": "Managed challenge / I'm Under Attack Modeu2122",
	"managed_challenge.description": "Customize the Managed Challenge and I'm Under Attack Modeu2122 page presented to your visitors.",
	"managed_challenge.help": "#### How do I customize my Managed Challenge page?\nTo customize your Managed Challenge page, design your custom HTML page and make sure to include the required token. Then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard Managed Challenge page to your visitors. **The maximum customized page size is 1.5 MB**.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note**: Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.\n\n#### What token is required in my custom Managed Challenge page?\nTo customize your Managed Challenge page, you must include the following token on your custom HTML:\n\n**::CAPTCHA_BOX::**\n\nThe CAPTCHA_BOX token embeds the CAPTCHA on your custom Managed Challenge page.",
	"country_challenge.description": "Customize the challenge page presented to visitors from countries you have selected to block.",
	"country_challenge.help": "#### How do I customize my Country Challenge page?\nTo customize your Country Challenge page, design your custom HTML page and make sure to include the required token. Then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard Country Challenge page to your visitors. **The maximum customized page size is 1.5 MB**.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note**: Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.\n\n#### What token is required in my custom Country Challenge page?\nTo customize your Country Challenge page, you must include the following token on your custom HTML:\n\n**::CAPTCHA_BOX::**\n\nThe CAPTCHA_BOX token embeds the CAPTCHA on your custom Country Challenge page.\n\n**::CLIENT_IP::**\n\n**::RAY_ID::**\n\n**::GEO::**\n\nThis token provides diagnostic information such as Client's IP, Ray ID and Geographical Location that will appear on your custom error page.",
	"country_challenge.title": "Country challenge",
	"error_pages.custom_error_rules.card.title": "Custom Error Rules",
	"error_pages.custom_error_rules.card.description": "To create custom error responses for requests that match specific conditions, use custom error rules. Custom error rules override settings on the error pages dashboard for 500 and 1000 class errors.",
	"error_pages.custom_error_rules.card.disabled": "Requires Pro plan or higher",
	"error_pages.custom_error_rules.card.button": "Manage Rules",
	"error_pages.analytics.card.title": "Review error response analytics",
	"error_pages.analytics.card.description": "Track how often specific errors occur and identify opportunities to customize the visitor experience with tailored error pages.",
	"error_pages.analytics.card.button": "View analytics",
	"error_pages.onboarding.title": "Welcome to the error pages dashboard",
	"error_pages.onboarding.display": "Change error pages displayed to visitors",
	"error_pages.onboarding.display.description.one": "Personalize Cloudflareu2019s default error and challenge pages with content of your choice.",
	"error_pages.onboarding.rules": "Custom error rules",
	"error_pages.onboarding.rules.description.one": "To return custom error responses for request that match specific conditions, create a <0>custom error rule from the rules dashboard.</0>",
	"error_pages.onboarding.rules.description.one.account": "To return custom error responses for request that match specific conditions, create a custom error rule from the rules dashboard at the zone level.",
	"error_pages.onboarding.rules.description.two": "Store <0>reusable assets</0> that can be displayed as error pages for custom error rules.",
	"error_pages.onboarding.rules.description.three": "Custom error rules override settings on the error pages dashboard for 500 and 1000 class errors.",
	"error.pages.promo.title": "Deliver a better experience, even when things go wrong",
	"error.pages.promo.description": "Take full control of error responses with <0>Custom Errors</0> u2014 serve branded, helpful pages for origin issues, Cloudflare errors, and security challenges.",
	"error.pages.promo.benefit.1": "**Turn downtime into brand time**\nReplace generic error pages with custom content that reflects your brand u2014 and keeps visitors engaged, informed and confident.",
	"error.pages.promo.benefit.2": "**Smart, rule-based logic**\nServe different HTML, JSON, XML or plain text based on status codes, error sources, or custom conditions like visitoru2019s country u2014 powered by the [Ruleset Engine](https://developers.cloudflare.com/ruleset-engine/).",
	"error.pages.promo.benefit.3": "**Inline or asset-based**\nWrite inline responses in the UI or fetch fully designed pages with images, CSS, and JS u2014 and reuse them across rules.",
	"error.pages.promo.benefit.4": "**Included with paid plans**\nCustom Errors are available at no extra cost on Pro, Business, and Enterprise plans.",
	"error.pages.promo.button": "Upgrade plan",
	"error.pages.promo.footer": "Explore <0>Custom Errors in the documentation.</0>",
	"error_pages.table.cell.error": "There was an error fetching your error pages customizations",
	"error_pages.table.cell.type": "Page type",
	"error_pages.table.cell.show": "Show",
	"error_pages.table.cell.show.default_value": "Cloudflare default page",
	"error_pages.table.cell.show.rules": "%{rules} custom error rule references this error code and may override it |||| %{rules} custom error rules reference this error code and may override it",
	"error_pages.table.cell.last_fetched": "Last fetched",
	"error_pages.table.cell.last_fetched.tooltip": "A custom page is stored at the time it is saved and needs to be fetched again if it is modified on the origin.",
	"error_pages.table.cell.show.tooltip": "This is a live preview of the page visitors will see. It may differ from whatu2019s stored at the edge unless re-fetched after changes.",
	"error_pages.table.cell.preview": "Preview page",
	"error_pages.table.cell.fetch_again": "Fetch custom page again",
	"error_pages.table.update.success": "Custom page updated",
	"error_pages.table.disabled": "This zone doesn't have permissions",
	"error_pages.waf_block.title": "WAF block",
	"error_pages.waf_block.description": "The page displayed when visitors are blocked by a Web Application Firewall rule. This page returns a 403 status code. <0>Learn more about Cloudflare WAF.</0>",
	"error_pages.ip_block.title": "IP/Country block",
	"error_pages.ip_block.description": "The page displayed when a request originates from an blocked IP address or country. This page returns a 403 status code. <0>Learn more about IP and country blocking.</0>",
	"error_pages.ip_challenge.title": "IP/Country challenge",
	"error_pages.ip_challenge.description": "Presents a challenge to visitors from specified IP addresses or countries. This page returns a 403 status code. <0>Learn more about IP and country blocking.</0>",
	"error_pages.500_errors.title": "500 class errors",
	"error_pages.500_error.description": "500 class error pages are displayed when a web server is unable to process a request. <0>Learn more about 500 class errors.</0>",
	"error_pages.1000_errors.title": "1000 class errors",
	"error_pages.1000_error.description": "1000-class error pages are displayed when a domainu2019s configuration, security settings, or origin setup prevents Cloudflare from completing a request. <0>Learn more about 1000 class errors.</0>",
	"error_pages.interactive_challenge.title": "Interactive challenge",
	"error_pages.interactive_challenge.description": "Presents an interactive challenge to visitors. This page returns a 403 status code. <0>Learn more about interactive challenges.</0>",
	"error_pages.under_attack.title": "Managed challenge / I'm Under Attack Mode",
	"error_pages.under_attack.description": "Presents different types of challenges to a visitor depending on the nature of their request and your security settings. This page returns a 403 status code. <0>Learn more about managed challenges.</0>",
	"error_pages.javascript.title": "Javascript challenge",
	"error_pages.javascript.description": "Displayed to visitors while their browser completes a JavaScript challenge. This page returns a 403 status code. <0>Learn more about JavaScript challenges.</0>",
	"error_pages.rate_limiting.title": "Rate limiting block",
	"error_pages.rate_limiting.description": "Displayed to visitors when they have been blocked by a rate limiting rule. This page returns a 429 status code. <0>Learn more about rate limiting rules.</0>",
	"error_pages.form.back": "Back to Error Pages",
	"error_pages.form.title": "Edit %{customErrorPage}",
	"error_pages.form.show": "Show",
	"error_pages.form.option.default": "Cloudflare default page",
	"error_pages.form.option.default.preview": "Preview default page",
	"error_pages.form.show.custom": "Custom Page",
	"error_pages.form.show.custom.label": "Custom page address",
	"error_pages.form.show.custom.info": "The page will be fetched and stored upon save. You can manually trigger another fetch to get the latest version if it has been modified on your origin.",
	"custom_error_rules.button": "Manage rules",
	"under_attack.description": "Customize the JavaScript Challenge page presented to your visitors.",
	"under_attack.help": "#### How do I customize my JavaScript Challenge page?\nTo customize your JavaScript Challenge page, design your custom HTML page and make sure to include the required token. Then host it online (it may be hosted anywhere). Once you publish your custom page, Cloudflare will use your customized page instead of serving our standard JavaScript Challenge page to your visitors. **The maximum customized page size is 1.5 MB**.\n\nYou can preview your customized page as it will appear to your visitors before publishing.\n\n**Note**: Once you add the URL and click u201CPublishu201D, Cloudflare will store your custom page on our servers. You **do not** need to host your custom page after it has been published.#### What token is required in my custom JavaScript Challenge page?\nTo customize your JavaScript Challenge page, you must include the following token on your custom HTML:\n\n**::IM_UNDER_ATTACK_BOX::**\n\nThe following text will always appear with your custom JavaScript Challenge page:\n\nChecking your browser before accessing example.com\nThis process is automatic. Your browser will redirect to your requested content shortly.\nPlease allow up to 5 seconds.",
	"under_attack.title": "JavaScript challenge",
	"rate_limit.description": "Customize the response presented to your visitors when they have triggered rate limiting.",
	"rate_limit.help": "",
	"rate_limit.title": "429 errors"
}