{
	"app_name": "1.1.1.1-Windows-1",
	"app_display_name": "Cloudflare WARP Windows Release",
	"app_os": "Windows",
	"owner": {
		"name": "Cloudflare",
		"display_name": "Cloudflare"
	},
	"is_external_build": false,
	"origin": "appcenter",
	"id": 45,
	"version": "2022.8.857.0",
	"short_version": "",
	"size": 106332160,
	"min_os": null,
	"device_family": null,
	"bundle_identifier": "e1feb92186dec41e456128415cf6c25e",
	"fingerprint": "64d1c010ad310b3ff86d9d63ed892394",
	"uploaded_at": "2022-09-12T17:54:58.402Z",
	"mandatory_update": false,
	"enabled": true,
	"fileExtension": "msi",
	"is_latest": true,
	"release_notes": "This release primarily contains improvements to stability and bug fixes. Please\r\nnote that the issue preventing the client from working with Windows versions\r\nolder than 10.0.19042 is now fixed in this release. We also wanted to call out\r\nthat we've made server side changes to significantly reduce captcha issues for\r\nusers with IPv6 enabled (no client related change but wanted to call out the\r\nwork).\r\n \r\n## Notable updates\r\n \r\n- Added ability for ZT Administrators to specify if they want embedded WebView2 browser to be used instead of the default system browser. See [Deployment documentation](https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/deployment/mdm-deployment/#install-warp-on-windows) for more information\r\n- Modified GUI app to now be built on .Net 6.0 as .Net 5.0 is now end of life and upgraded the internal version of our upgrade engine (Sparkle). No user facing changes expected.\r\n- Modified GUI when in Include Only split tunneling mode to correctly state that just the routes included in the split tunnel configuration are protected. This is just a string change.\r\n- Fixed issue where `warp-cli set-custom-endpoint` could be used by users without local admin rights as a way to bypass Gateway policies.\r\n- Fixed issue where `warp-cli add-trusted-ssid` worked in Zero Trust mode when it should not have.\r\n- Fixed issue where `warp-cli teams-enroll` would run even if already joined to an organization and users were not allowed to disconnect or leave.\r\n- Fixed issue that could result in connection issues coming out of certain sleep states (AddrInUse error or Multiple WARP Connections or NoCurrentSession).\r\n- Fixed issue that could result in connection flickering between connected/disconnected.\r\n- Fixed issue where connectivity test could report wrong status in logs when in Include Only split tunnel configuration.\r\n- Fixed issue where warp-cli could hang if service was in a bad state.\r\n- Fixed issue where sometimes Zero Trust device settings configured in the dash wouldn't take effec",
	"is_udid_provisioned": null,
	"can_resign": null,
	"package_hashes": [
		"3eadd8cf56b79b85588a5b9d73eeedc54cf4911ce40d9a3bff543324d94d84c3"
	],
	"destination_type": "group",
	"status": "available",
	"distribution_group_id": "d85ff7fd-8cbb-443d-a77b-a81748eb0bd4",
	"distribution_groups": [
		{
			"id": "d85ff7fd-8cbb-443d-a77b-a81748eb0bd4",
			"name": "Release",
			"origin": "appcenter",
			"display_name": "Release",
			"is_public": true
		}
	]
}