{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2017/cloudflare-named-a-leader-in-ddos-mitigation-solutions/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "8721e3a3-b1cd-5fa2-9948-012610792f65",
				"title": "Cloudflare Named a Leader in DDoS Mitigation Solutions",
				"contentfulId": "3hy0GOscSd2o0OV2IldYMW",
				"metaTags": null,
				"subtitle": "Independent research firm ranks Cloudflare as a leader among DDoS protection providers",
				"orderDate": "2017-12-07",
				"body": "<p>San Francisco, CA, December 7, 2017 -- <a href=\"http://www.cloudflare.com/\" target=\"_blank\">Cloudflare</a>, the leading internet performance and security company, has been identified by Forrester Research, Inc. as a Leader in The Forrester Wave™: DDoS Services Providers, Q4 2017 report. Cloudflare’s DDoS solutions received the highest possible scores in 15 criteria, including length of implementation, Layer 3 and Layer 4 attack mitigation, DNS attack mitigation, multi-vector attacks, mitigation capacity, and pricing model. </p>\n      <p>Cloudflare’s global network integrates DDoS protection for DNS, network, and application traffic giving it the ability to more holistically block DDoS traffic. Cloudflare’s network serves traffic to seven million Internet properties, serving over 400B HTTP requests per day, about 10% of all HTTP traffic.</p>\n      <p>“Cloudflare’s global network is designed to address high-volume attacks and learn from each attack, becoming smarter and more robust over time, something on-premise solutions just can’t do,” said Matthew Prince, co-founder and CEO of Cloudflare. “Being recognized as a leader by Forrester is, in our opinion, confirmation that we’re on the right track to providing the most substantial and flexible solution for our customers, so that the Internet works the way it should.”</p>\n      <p>Cloudflare currently has data centers in 118 unique cities across 58 countries. In the report, customers of Cloudflare rated the company highly for its “ability to mitigate layer 3 and 4 attacks as well as DNS attacks and new attack types.” The report notes that “enterprises that need a more automated, hands-off approach to DDoS mitigation or want to combine multiple services should consider Cloudflare.”</p>\n      <p>\"As a large website, we have a huge target on our back, facing ransomware and hackers going after our servers. Cloudflare helps us avoid these risks with DDoS mitigation and WAF protection,” said Jager McConnell, CEO of Crunchbase. “Honestly, I think that when hackers see that Cloudflare is protecting our servers, they just go somewhere else.”</p>\n      <p>Forrester evaluated all 11 participating vendors based on 36 criteria including current offering, strategy, and market presence.</p>\n      <p>To learn more, please check out the resources below:\n        <ul>\n          <li><a href=\"https://blog.cloudflare.com/forrester-wave-ddos-mitigation-2017/\" target=\"_blank\">Forrester Wave Blog</a></li>\n          <li><a href=\"https://www.cloudflare.com/forrester-wave-ddos-mitigation-2017\" target=\"_blank\">Forrester Wave: DDoS Mitigation Solutions, Q4 2017 Report</a></li>\n          <li><a href=\"https://www.cloudflare.com/ddos/\" target=\"_blank\">Cloudflare DDoS Protection</a></li>\n          <li><a href=\"https://www.cloudflare.com/case-studies/crunchbase/\" target=\"_blank\">Crunchbase Case Study</a></li>\n        </ul>\n       ",
				"omitBoilerplate": true,
				"boilerplate": " <p><strong>About Cloudflare</strong><br />\n          Cloudflare, Inc. (<a href=\"http://www.cloudflare.com/\" target=\"_blank\">www.cloudflare.com</a> / <a href=\"https://twitter.com/cloudflare\" target=\"_blank\">@cloudflare</a>) is on a mission to help build a better Internet. Today the company runs one of the world’s largest networks that powers more than 10 trillion requests per month, which is nearly 10 percent of all Internet requests for more than 2.5 billion people worldwide. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Web properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with each new site added. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network & Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Washington, DC, London, Singapore, and now Boston, MA.</p>\n        <p class=\"text--extra-small\">Source: Forrester Wave™: DDoS Mitigation Solutions, Q4 2017, Forrester Research, Inc., December 7, 2017</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "8721e3a3-b1cd-5fa2-9948-012610792f65",
			"locale": "en-US",
			"pathname": "/press-releases/2017/cloudflare-named-a-leader-in-ddos-mitigation-solutions/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}