{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2017/cloudflare-collaborates-with-google-cloud-to-fund-developer-innovation/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "b425f1bf-c5f3-5eab-a5f2-533b58b45c19",
				"title": "Cloudflare Collaborates with Google Cloud to Fund Developer Innovation",
				"contentfulId": "79HfiEhBZQxNIuUcreCNNI",
				"metaTags": null,
				"subtitle": "Collaboration Offers Developers $100,000 in Cloud Platform Credits",
				"orderDate": "2017-09-19",
				"body": "<p align=\"left\">SAN FRANCISCO, Sept.  19, 2017  (GLOBE NEWSWIRE) -- <a href=\"http://www.cloudflare.com/\" rel=\"nofollow\" target=\"_blank\" title=\"Cloudflare\">Cloudflare</a>, the leading Internet performance and security company, is collaborating with Google Cloud to help support developer innovation on the Cloudflare Apps Platform. Starting today, Cloudflare and Google Cloud will help eligible early-stage startups access the resources needed to quickly launch and scale Cloudflare Apps built on <a href=\"https://cloud.google.com/developers/startups/\" rel=\"nofollow\" target=\"_blank\" title=\"Google Cloud Platform\">Google Cloud Platform</a>. The Cloudflare Apps Platform enables developers to build applications and distribute them to the more than six million customers on Cloudflare's network.<br></p>    <p>The collaboration will give Cloudflare Apps developers access to a wide range of benefits including $3k - $100k of Google Cloud Platform (GCP) credits at no cost for one year. Some startups will also be eligible for 24/7 technical support, and access to GCP's technical solutions team.</p>    <p>Google Cloud Platform provides a comprehensive set of solutions and highly-scalable, reliable infrastructure to build applications. Through this partnership, GCP credits can be used for anything from hosting interactive elements of their Apps, to doing advanced analytics and data crunching to provide next-level features to their App's user-base. Google's industry-leading machine learning and artificial intelligence APIs are also included, opening the door to Cloudflare Apps which would have been unimaginable just a few years ago.</p>    <p>Just as Cloudflare democratized technology that was previously reserved for large companies — making it simpler to use, more accessible, and even more powerful for everyone — <a href=\"https://www.cloudflare.com/apps/\" rel=\"nofollow\" target=\"_blank\" title=\"Cloudflare Apps\">Cloudflare Apps</a> was created to give users access to tools previously only available to technical experts. The Apps Platform is a collection of APIs that allows developers to build applications that take advantage of Cloudflare's global network infrastructure, easily deploy their applications to any of Cloudflare's customers, and get paid for the applications they have built.</p>    <p>\"We've been collaborating with Google for years, and working together for this initiative was a no-brainer. Now we're working together to help drive innovation and democratize access to Internet tools that help developers and our customers accomplish things that were impossible before,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"This is just another example of how we're continuing to find new and collaborative ways to encourage app development and unlock access to Cloudflare's global infrastructure in a scalable way.\"</p>    <p>In June, 2017, Cloudflare announced its <a href=\"https://www.cloudflare.com/fund\" rel=\"nofollow\" target=\"_blank\" title=\"$100 million Cloudflare Developer Fund\">$100 million Cloudflare Developer Fund</a>, backed by leading venture capital investors, <a href=\"http://www.nea.com/\" rel=\"nofollow\" target=\"_blank\" title=\"New Enterprise Associates\">New Enterprise Associates</a>, <a href=\"http://www.pelionvp.com\" rel=\"nofollow\" target=\"_blank\" title=\"Pelion Venture Partners\">Pelion Venture Partners</a>, and <a href=\"http://www.venrock.com\" rel=\"nofollow\" target=\"_blank\" title=\"Venrock\">Venrock</a>, to finance startups building applications on the Cloudflare Apps Platform.</p>    <p>With Cloudflare Apps, prospective users can preview apps on their live site before installing, leading to impressive installation conversion rates. Visit <a href=\"https://cloudflare.com/apps/docs\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://cloudflare.com/apps/docs</a> to start building your app, or email <a href=\"mailto:app-developer-help@cloudflare.com\" rel=\"nofollow\" target=\"_blank\" title=\"app-developer-help@cloudflare.com\">app-developer-help@cloudflare.com</a> to speak with our Developer Relations team.</p>    <p>To learn more about Cloudflare Apps, please check out the resources below:</p>    <ul type=\"disc\"><li><a href=\"https://www.cloudflare.com/apps/developer/offers/google\" rel=\"nofollow\" target=\"_blank\" title=\"Cloudflare + Google Cloud: Get up to $100k in Google Cloud Credits\">Cloudflare + Google Cloud: Get up to $100k in Google Cloud Credits</a></li><li><a href=\"https://www.cloudflare.com/apps/\" rel=\"nofollow\" target=\"_blank\" title=\"Cloudflare Apps\">Cloudflare Apps</a></li><li><a href=\"https://blog.cloudflare.com/cloudflare-and-google-offer-app-developers-100k\" rel=\"nofollow\" target=\"_blank\" title=\"Cloudflare + Google Cloud Blog Post\">Cloudflare + Google Cloud Blog Post </a></li><li><a href=\"https://www.cloudflare.com/apps/developer/docs/getting-started\" rel=\"nofollow\" target=\"_blank\" title=\"Developer Resources\">Developer Resources</a></li><li><a href=\"https://cloudplatform.googleblog.com/2014/09/announcing-100000-dollars-for-startups-on-google-cloud-platform.html\" rel=\"nofollow\" target=\"_blank\" title=\"Google Cloud Platform Blog\">Google Cloud Platform Blog</a></li></ul>    ",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br>Cloudflare, Inc. (<a href=\"http://www.cloudflare.com/\" rel=\"nofollow\" target=\"_blank\" title=\"www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) is on a mission to help build a better Internet. Today the company runs one of the world's largest networks that powers more than 10 trillion requests per month, which is nearly 10 percent of all Internet requests for more than 2.5 billion people worldwide. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with each new site added. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Boston, MA, Washington, DC, London, and Singapore.</p>    <p>Daniella Vallurupalli<br>Communications<br><a href=\"mailto:daniella@cloudflare.com\" rel=\"nofollow\" target=\"_blank\" title=\"daniella@cloudflare.com\">daniella@cloudflare.com</a><br><a href=\"mailto:press@cloudflare.com\" rel=\"nofollow\" target=\"_blank\" title=\"press@cloudflare.com\">press@cloudflare.com</a><br>650-483-4463</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "b425f1bf-c5f3-5eab-a5f2-533b58b45c19",
			"locale": "en-US",
			"pathname": "/press-releases/2017/cloudflare-collaborates-with-google-cloud-to-fund-developer-innovation/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}