{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2017/cloudflare-announces-ampersand-the-first-open-amp-cache-to-give-publishers-more-control-of-their-mobile-optimized-content/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "1ac15860-c0bf-560d-ae1d-54860113ee90",
				"title": "Cloudflare Announces Ampersand, the First Open AMP Cache, to Give Publishers More Control of their Mobile-Optimized Content",
				"contentfulId": "4TrQMgFQFaFZwItOxhulm",
				"metaTags": null,
				"subtitle": "Now publishers can control how their AMP content is branded, served, and monetized",
				"orderDate": "2017-03-08",
				"body": "<p>SAN FRANCISCO, March  08, 2017  (GLOBE NEWSWIRE) -- <a href=\"http://www.cloudflare.com/\" rel=\"nofollow\" target=\"_blank\" title=\"Cloudflare\">Cloudflare</a>, the leading Internet performance and security company, is introducing today a new way for publishers to serve the fastest and most up-to-date mobile-optimized web content while preserving their brand identity.<br></p>    <p>Traffic to publishers’ websites from mobile devices surpassed traffic from desktops last year. But with consumers expecting increasingly fast and secure mobile access to content, the mobile web is still too slow. Google’s Accelerated Mobile Pages (AMP) project is designed to provide that fast, secure experience with optimized HTML that loads quickly on mobile devices.</p>    <p>To use AMP, publishers have to make their content available in the AMP format and serve it from a global web cache. The combination of the AMP format and a global cache means that pages are delivered and displayed rapidly wherever a mobile user accesses content. But, until today, publishers had to use Google’s cache to serve AMP content to end users. That risked brand damage and data leakage as a publisher’s page views were served from a Google-controlled domain and not the publisher’s own.</p>    <p>Cloudflare’s Ampersand changes the AMP landscape by introducing a white-label cache that any publisher can use to serve AMP content directly from their own domain. Publishers are free to use the AMP format and deliver the fastest mobile content worldwide without a single page view leaving their own domain.</p>    <p>This solution gives publishers complete control of their content, analytics, and how they monetize their page views, without giving up speed or security. Cloudflare’s global reach means that publishers’ AMP content is cached and delivered from more than 100 data centers worldwide for the fastest possible experience.</p>    <p>“Publishers have worked hard to establish their brands and grow traffic across their own web properties,” said Matthew Prince, co-founder and CEO of Cloudflare. “Cloudflare is giving publishers the flexibility to monetize on their terms without compromising the user experience. There’s no reason why they shouldn’t have control of how they run their online business.”</p>    <p>With Ampersand, publishers can:</p>    <ul type=\"disc\"><li><strong>Serve content on their own domains:</strong> Publishers can keep control of their own branding by serving AMP content from their own domains when served outside of Google. <br> <br></li><li><strong>Stay up to date with the latest AMP standard: </strong>The AMP standard is always evolving. Ampersand helps publishers modify their sites quickly and effectively without having to make changes to the backend.<br> <br></li><li>Enjoy all of the benefits of Cloudflare’s AMP Cache offering.</li></ul>    <p>To learn more about Ampersand, please visit the <a href=\"https://www.cloudflare.com/website-optimization/amp-real-url/\" rel=\"nofollow\" target=\"_blank\" title=\"product page\">product page</a>.</p>",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br>Cloudflare, Inc. (<a href=\"http://www.cloudflare.com/\" rel=\"nofollow\" target=\"_blank\" title=\"www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) is on a mission to help build a better Internet. Today the company runs one of the world’s largest networks that powers more than 10 trillion requests per month, which is nearly 10 percent of all Internet requests for more than 2.5 billion people worldwide. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Web properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with each new site added. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Boston, MA, Washington, DC, London, and Singapore.</p>    <p> </p><pre>Contact:\nDaniella Vallurupalli\n+1-650-483-4463\ndaniella@cloudflare.com / press@cloudflare.com</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "1ac15860-c0bf-560d-ae1d-54860113ee90",
			"locale": "en-US",
			"pathname": "/press-releases/2017/cloudflare-announces-ampersand-the-first-open-amp-cache-to-give-publishers-more-control-of-their-mobile-optimized-content/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}