{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2017/cloudflare-announces-orbit-to-help-fix-challenges-in-the-internet-of-things-iot-security-model/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "e5a83c3b-9879-5498-bceb-f464e2a35c30",
				"title": "Cloudflare Announces Orbit to Help Fix Challenges in the Internet of Things (IoT) Security Model",
				"contentfulId": "7IVn7rDg55k75Vb4UXGnQx",
				"metaTags": null,
				"subtitle": "Orbit adds a layer of IoT security from individual devices to the network itself for a more seamless and secure Internet of Things",
				"orderDate": "2017-04-27",
				"body": "<img class=\"responsive-image\" title=\"press release orbit\" alt=\"press release orbit\" src=\"/img/press-releases/press-release-orbit.jpg\" />\n\n<p align=\"left\">SAN FRANCISCO, April  27, 2017  (GLOBE NEWSWIRE) -- <a href=\"http://www.cloudflare.com/\" rel=\"nofollow\" target=\"_blank\" title=\"Cloudflare\">Cloudflare</a>, the leading Internet performance and security company, today announced Orbit, a new approach to securing IoT devices. With Orbit, IoT manufacturers can add an additional layer of security on top of the individual Internet-connected devices via Cloudflare's high-powered global network, taking IoT security beyond what is possible when relying solely on the security of the device.</p>  <p>In working with IoT manufacturers to develop Orbit, Cloudflare realized the usual device security model, based on the PC approach to user-installed patches, was deeply flawed. There will be <a href=\"http://www.businessinsider.com/the-internet-of-things-2017-report-2017-1\" rel=\"nofollow\" target=\"_blank\" title=\"22.5 billion IoT devices\">22.5 billion IoT devices</a> in 2021, far outnumbering PCs, and that number will continue to grow. There is no magic bullet that will allow IoT developers to write perfect, bug-free code. And there is no way end users can be expected to upgrade each IoT device the way they needed to with their PCs.</p>  <p>IoT devices need a new security model, and Cloudflare's Orbit provides a critical component of that new model. With Orbit, IoT manufacturers can configure their devices to only connect to the Internet through Cloudflare's network. Then, if there is a security vulnerability, the IoT manufacturer can perform a \"virtual patch,\" across all of their devices, simultaneously. This layer of security complements on-device security and can protect the device even if it is running vulnerable or outdated code.</p>  <p>\"The PC-era model of on-device security didn't work very well for PCs and definitely won't scale to protect the Internet of Things,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Cloudflare Orbit is already protecting more than 120 million IoT devices and provides a new approach to security that can scale to meet the needs of an increasingly networked world.\"</p>  <p>With Orbit, IoT manufacturers can improve device and end-user security with:</p>  <ul type=\"disc\"><li><strong>Real-Time Exploit Blocking</strong>: Utilizing Cloudflare's firewall in the cloud, Orbit catches exploit attempts, including distributed denial of service (DDoS) attacks, as they happen, protecting devices that are still running vulnerable code. <br>&nbsp;</li><li><strong>Secure &amp; Authenticated Data Transfer</strong>: Orbit authenticates devices to determine that they actually belong to a user's network and are not a malicious attacker trying to infiltrate the IoT infrastructure.<br>&nbsp;</li><li><strong>Dedicated Private Network: </strong>Orbit locks down the traffic of IoT devices at the network level as if each device has its own VPN, or private network, that secures it from potential attacks.</li></ul>  <p><strong><em>Consumer IoT Devices Need a Better Solution&nbsp; </em></strong><br>\"Keeping our products and customers secure is our primary concern,\" said Paul Gerhardt, co-founder of <a href=\"https://lockitron.com\" rel=\"nofollow\" target=\"_blank\" title=\"Lockitron\">Lockitron</a>. \"Cloudflare provides an extra layer of security that allows us to keep our devices continually updated and ahead of any vulnerabilities.\"&nbsp;</p>  <p><strong><em>Industrial Control Manufacturers Need the Power of a Network</em></strong><br>\"This approach of adding security to the network is extremely important for industrial manufacturers,\" said Sam Cece, CEO of <a href=\"https://www.swiftsensors.com/\" rel=\"nofollow\" target=\"_blank\" title=\"Swift Sensors\">Swift Sensors</a>. \"Being able to patch vulnerabilities from the network rather than at the device level is a major shift in the way we secure IoT devices, and one that is completely necessary.\"</p>  <p><strong><em>The Automotive Industry Needs Secure IoT to Keep Passengers and the Road Safer</em></strong><br>\"Car controllers are IoT devices. Karamba Security hardens these devices and prevents cyberattacks with zero false positives to maintain driver and passenger safety,\" said Ami Dotan, CEO of <a href=\"https://www.karambasecurity.com\" rel=\"nofollow\" target=\"_blank\" title=\"Karamba Security\">Karamba Security</a>. \"We view Cloudflare's Orbit as a complementary solution that enables secure connectivity between the cars' hardened controllers and the car company's data center for trusted, over-the-air updates.\"</p>  <p><strong><em>IoT Platforms Want to Augment their Security </em></strong><br>\"We are at the beginning of a new era in which a vast number of devices will be connecting to the Internet and security will play a critical role in the successful roll-out and adoption of IoT devices. Cloudflare's Orbit adds another layer of defense that compliments other security measures such as strong hardware-based device security and helps ensure a safer Internet of Things.\" Quinn Li, VP and global head of <a href=\"https://www.qualcommventures.com\" rel=\"nofollow\" target=\"_blank\" title=\"Qualcomm Ventures\">Qualcomm Ventures</a> (the investment arm of Qualcomm Incorporated).</p>  <p><strong><em>Industry Experts Agree with New Security Model </em></strong><br>Michael Freedman, professor of computer science at Princeton University and CTO of <a href=\"http://www.timescale.com/\" rel=\"nofollow\" target=\"_blank\" title=\"Timescale\">Timescale</a>, shared: \"IoT devices create a distinct security challenge both because of the inability of most end users to update their software, as well as the cost that manufacturers bear if they release an update that bricks devices. This is even worse for legacy devices, many of which are effectively unpatchable. Cloudflare's Orbit provides a unique approach to help with these challenges, by deploying a defensive layer in the network where security updates can be safely made without end-user intervention or on-device changes.\"</p>  <p>To learn how Orbit can help secure your devices please visit the Orbit <a href=\"https://www.cloudflare.com/orbit/\" rel=\"nofollow\" target=\"_blank\" title=\"product page\">product page</a> or read our <a href=\"https://blog.cloudflare.com/orbit/\" rel=\"nofollow\" target=\"_blank\" title=\"blog\">blog</a>.</p>  <p>A photo accompanying this release is available at&nbsp;<a href=\"http://www.globenewswire.com/NewsRoom/AttachmentNg/9dc89e8a-2713-42b7-ab13-e58f3b3ede32\" rel=\"nofollow\" target=\"_blank\" title=\"\">http://www.globenewswire.com/NewsRoom/AttachmentNg/9dc89e8a-2713-42b7-ab13-e58f3b3ede32</a></p>  ",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br>Cloudflare, Inc. (<a href=\"http://www.cloudflare.com/\" rel=\"nofollow\" target=\"_blank\" title=\"www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) is on a mission to help build a better Internet. Today the company runs one of the world's largest networks that powers more than 10 trillion requests per month, which is nearly 10 percent of all Internet requests for more than 2.5 billion people worldwide. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Web properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with each new site added. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Boston, MA, Washington, DC, London, and Singapore.</p>  <p>The photo is also available at Newscom, <a href=\"http://www.globenewswire.com/newsroom/ctr?d=10018400&amp;l=10&amp;a=www.newscom.com&amp;u=http%3A%2F%2Fwww.newscom.com%2F\" rel=\"nofollow\" target=\"_blank\" title=\"www.newscom.com\">www.newscom.com</a>, and via AP PhotoExpress.</p><pre>Contact:\nDaniella Vallurupalli\n+1-650-483-4463\ndaniella@cloudflare.com / press@cloudflare.com</pre>\n"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "e5a83c3b-9879-5498-bceb-f464e2a35c30",
			"locale": "en-US",
			"pathname": "/press-releases/2017/cloudflare-announces-orbit-to-help-fix-challenges-in-the-internet-of-things-iot-security-model/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}