{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2017/cloudflare-announces-unmetered-mitigation-to-make-attacks-a-thing-of-the-past/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "67970ddd-5ef4-5aca-b351-8927e799708f",
				"title": "Cloudflare Announces Unmetered Mitigation to Make Attacks a Thing of the Past",
				"contentfulId": "6zBMmsNEGqSl2vrSNFsLks",
				"metaTags": null,
				"subtitle": "Eliminates \"surge pricing\" that had been standard in the DDoS Mitigation space",
				"orderDate": "2017-09-25",
				"body": " <p>San Francisco, CA, September 25, 2017 — <a href=\"/\">Cloudflare</a>, the leading Internet performance and security company, today announced Unmetered Mitigation, giving customers unlimited and unmetered distributed denial-of-service (DDoS) attack protection regardless of the size of attack. This is a break from other DDoS mitigation services that charge more based on the size of the attack received.</p>\n\n<p>Without protection, DDoS attacks overwhelm the available bandwidth or servers of an Internet property, knocking it offline. When an Internet property or application faces an especially large attack, nearly every DDoS mitigation service will charge extra to block it. With DDoS attacks getting bigger and more sophisticated each year—Cloudflare's network mitigates a major DDoS attack every three minutes—Internet property owners face significant and unexpected charges with no way of avoiding them.</p>\n\n<p>\"DDoS attacks are, quite simply, a plague on the Internet and it's wrong to surprise customers with higher bills when they are targeted by one,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"With Unmetered Mitigation, we're breaking the industry's practice of surge pricing when someone comes under attack. It was an easy decision for us because it's the right thing to do.\"</p>\n\n<p>Many security companies operate like insurance providers. The consumer pays a fee for the first year and as soon as something goes wrong, the insurance company increases the premium for the next year. Cloudflare is not only ending per-Gbps overage fees, but also that insurance model. With Unmetered Mitigation, DDoS protection is now a basic part of all Cloudflare plans, keeping every Internet application and property online without penalizing customers with extra charges.</p>\n\n<p>Business and Enterprise customers will continue to benefit from additional advanced mitigation services including superior reporting, productivity enhancements, fine-grained controls, business and enterprise-grade service level agreements (SLA's), and customer support options to fit their individual needs.</p>\n\n<p>With more than 200 data centers and 15 terabits per second of DDoS mitigation capacity, Cloudflare has one of the largest networks in the world. With this scope, Cloudflare's network is able to mitigate even the largest DDoS attacks, without impacting other customers on the network.</p>\n\n<p>To learn more about Unmetered Mitigation, please check out <a href=\"https://www.cloudflare.com/ddos/\">Cloudflare DDoS Protection</a>.</p>",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong></p>\n            <p>Cloudflare, Inc. (<a href=\"/\">www.cloudflare.com</a> / <a href=\"https://twitter.com/Cloudflare\" target=\"_blank\">@cloudflare</a>) is on a mission to help build a better Internet. Today the company runs one of the world's largest networks that powers more than 10 trillion requests per month, which is nearly 10 percent of all Internet requests for more than 2.5 billion people worldwide. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with each new site added. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network & Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Boston, MA, Washington, DC, London, and Singapore.</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "67970ddd-5ef4-5aca-b351-8927e799708f",
			"locale": "en-US",
			"pathname": "/press-releases/2017/cloudflare-announces-unmetered-mitigation-to-make-attacks-a-thing-of-the-past/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}