{
	"app_name": "1.1.1.1-macOS",
	"app_display_name": "Cloudflare WARP macOS Beta",
	"app_os": "macOS",
	"owner": {
		"name": "Cloudflare",
		"display_name": "Cloudflare"
	},
	"is_external_build": false,
	"origin": "appcenter",
	"id": 2509,
	"version": "20230405.4",
	"short_version": "2023.3.386.1",
	"size": 49314217,
	"min_os": null,
	"device_family": null,
	"bundle_identifier": "405f1f2733a10d9a10a2ca4888a8a3ee",
	"fingerprint": "b76ec4000d4c547dbfbac3aab438e784",
	"uploaded_at": "2023-04-05T16:58:23.423Z",
	"mandatory_update": false,
	"enabled": true,
	"fileExtension": "zip",
	"is_latest": true,
	"release_notes": "This release contains new features and improvements from last GA release.\n \n## Notable updates \n- Added support for Zero Trust Digital Experience Monitoring. More information coming soon for customers who signed up for the beta\n- Added new log message to help customers and support identify when a users local network IP space overlaps with a remote network configured to go through the tunnel\n- Added support for Zero Trust customers to opt in to having the WARP Client install the root CA for your organization if TLS Decryption is enabled. A new toggle switch will appear in the dashboard under Settings->WARP Client soon to enable this\n- Modified behavior of Managed networks tests to always happen outside the tunnel as per original intent\n- Modified firewall behavior to allow incoming UDP traffic on ports 67-68 over split tunnel routes configured to be protected by Gateway. This change should allow organizations with overlapping networks to an end users local network, to not leave their users in a completely broken state without internet connectivity\n- Improved user validation logic during manual ZT login\n- Improve timeouts with broken CNAME records that could result in very long load times for certain apps (Office 365 apps, etc.)\n- Fixed issue where trying to launch a support_url without a valid protocol handler (ex. https://) would result in an error\n- Fixed issue where systems with significantly out of sync system clocks could fail registration\n- Fixed panic that could result in loss of internet connectivity\n- Fixed issue where the WARP daemon can crash and lose connectivity\n- Fixed issue where warp-diag could run traceroutes longer than expected. Traceroute tests will now timeout after 65 seconds.\n- Fixed issue where manually logging into a ZT org could fail if certificate authentication was used\n- Fixed issue where GUI could miss a status message from the WARP Service resulting in the wrong state being reflected to users. An example is the GUI could show `Connecting` even though device was `Connected`\n- Fixed is",
	"is_udid_provisioned": null,
	"can_resign": null,
	"package_hashes": [],
	"destination_type": "group",
	"status": "available",
	"distribution_group_id": "8d228a4a-99fe-426c-ad9f-623db9d82323",
	"distribution_groups": [
		{
			"id": "8d228a4a-99fe-426c-ad9f-623db9d82323",
			"name": "Beta",
			"origin": "appcenter",
			"display_name": "Beta",
			"is_public": true
		}
	]
}