{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2024/cloudflare-to-become-technology-partner-of-u-s-ski-and-snowboard/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "024d1a7c-32ed-5bc2-9fbd-637849dadf2f",
				"title": "​​​​​​​Cloudflare to Become Technology Partner of U.S. Ski & Snowboard",
				"contentfulId": "FrSqxboZcPeGw0JHlKzbu",
				"metaTags": null,
				"subtitle": null,
				"orderDate": "2024-10-21",
				"body": "__PARK CITY, Utah (October 21, 2024)__ — U.S. Ski & Snowboard announced today a multi-year partnership with Cloudflare (NYSE: NET), the leading connectivity cloud company, as the Official Technology Partner of the U.S. Ski & Snowboard Team. As part of the partnership, Cloudflare will provide Internet security, reliability and performance tools to help accelerate, protect and secure the U.S. Ski & Snowboard website and its internal network used by coaches and athletes.  \n\n\"We're thrilled for Cloudflare to join as a partner,\" said Sophie Goldschmidt, President and CEO of U.S. Ski & Snowboard. \"Cloudflare is one of the world's most trusted Internet platforms, with services that not only connect the entire world but provide security to millions. As we enter into this new partnership, I am excited to collaborate with an organization that also puts performance, speed, reliability and safety at the forefront of what they do.\" \n\nWith a mission of helping to build a better Internet, Cloudflare powers one of the world's largest and most interconnected networks that spans more than 330 cities in over 120 countries. The company blocks billions of online threats for millions of its customers every day—from the largest brands to entrepreneurs and small businesses to nonprofits, humanitarian groups and governments across the globe.\n\nThis is Cloudflare's first sports partnership. U.S. Ski & Snowboard and Cloudflare will amplify the partnership through branding on the highly valued alpine, cross country, moguls, aerials, Para alpine and Para snowboard uniforms, along with various content opportunities and hospitality experiences. Additionally, Cloudflare will provide the U.S. Ski & Snowboard team with the technology needed to make their coaches, athletes, applications and networks faster and more secure online, while reducing complexity and cost. This technology implementation will ensure the U.S. Ski & Snowboard website and internal operations stay reliable, fast, secure and performant, no matter where fans or athletes are accessing it from on their travels across the globe. \n\n\"Skiing and snowboarding are the rare sports that have a truly global community, and attract the most technical, disciplined athletes,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Speed, safety, reliability and performance are values that define both Cloudflare and the U.S. Ski & Snowboard athletes. We're excited to support the U.S. Ski & Snowboard Team with the technology needed to secure the organization and its athletes so they can focus on winning medals and pushing the boundaries of the sport safely and securely, on the slopes and online.\" \n\n\"As an alpine skier, innovation is critical to my success,\" said Stifel U.S. Alpine Ski Team athlete and world champion River Radamus. \"It's necessary for me to push boundaries, stay ahead of the competition and perform at my best. I'm excited to have a cutting-edge company like Cloudflare partnering with us as we take on the World Cup and World Championships. Precision and performance are everything—both on the slopes and in the digital world.\"\n\nWith the announcement, Cloudflare joins a strong and growing roster of high-level partners that have joined U.S. Ski & Snowboard throughout the last two years, including Stifel Financial, Hydro Flask, Kappa Sportswear, iFit and United Airlines.\n\n__About U.S. Ski & Snowboard__\n\nU.S. Ski & Snowboard is the Olympic and Paralympic National Governing Body of ski and snowboard sports in the USA, based in Park City, Utah. Started in 1905, the organization now represents nearly 240 elite skiers and snowboarders competing on 10 teams: alpine, cross country, freestyle moguls, freestyle aerials, snowboard, freeski, nordic combined, ski jumping, Para alpine and Para snowboard. In addition to the elite teams, U.S. Ski & Snowboard also provides leadership and direction for tens of thousands of young skiers and snowboarders across the USA, encouraging and supporting them in achieving excellence. By empowering national teams, clubs, coaches, parents, officials, volunteers and fans, U.S. Ski & Snowboard is committed to the progression of its sports, athlete success and the value of team. For more information, visit [www.usskiandsnowboard.org](https://www.usskiandsnowboard.org) \n\n__About Cloudflare__\n\nCloudflare, Inc. (NYSE: NET) is the leading connectivity cloud company on a mission to help build a better Internet. It empowers organizations to make their employees, applications and networks faster and more secure everywhere, while reducing complexity and cost. Cloudflare's connectivity cloud delivers the most full-featured, unified platform of cloud-native products and developer tools, so any organization can gain the control they need to work, develop, and accelerate their business.\n\nPowered by one of the world's largest and most interconnected networks, Cloudflare blocks billions of threats online for its customers every day. It is trusted by millions of organizations – from the largest brands to entrepreneurs and small businesses to nonprofits, humanitarian groups, and governments across the globe.\n\nLearn more about Cloudflare's connectivity cloud at [cloudflare.com/connectivity-cloud](http://cloudflare.com/connectivity-cloud). Learn more about the latest Internet trends and insights at [https://radar.cloudflare.com](https://radar.cloudflare.com/).\n\nFollow us: [Blog](https://blog.cloudflare.com/) | [X](https://x.com/cloudflare) | [LinkedIn](https://www.linkedin.com/company/cloudflare/) | [Facebook](https://www.facebook.com/Cloudflare/) | [Instagram](https://www.instagram.com/cloudflare)\n\n__FOR MORE INFORMATION CONTACT:__\n\n__U.S. Ski & Snowboard__\nCourtney Harkins\n\nDirector, Marketing & Communications\n\ncourtney.harkins@usskiandsnowboard.org\n\n__Cloudflare__\nDaniella Vallurupalli\n\nVice President, Communications\n\ndaniella@cloudflare.com ",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "024d1a7c-32ed-5bc2-9fbd-637849dadf2f",
			"locale": "en-US",
			"pathname": "/press-releases/2024/cloudflare-to-become-technology-partner-of-u-s-ski-and-snowboard/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}