{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2024/cloudflare-expands-emea-operations-with-new-headquarters-to-further-support/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "77b0e16b-53a4-5144-855b-7d3f586a1973",
				"title": "Cloudflare Expands EMEA Operations with New Headquarters to Further Support Growing Customer Demand & Innovation ",
				"contentfulId": "3X2vXCLnNxrQ6nyLTTjOb8",
				"metaTags": null,
				"subtitle": "Cloudflare grows its presence in EMEA with new operations in Lisbon, Portugal",
				"orderDate": "2024-10-18",
				"body": "__San Francisco, CA, and Lisbon, Portugal, October 18, 2024__ — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the leading connectivity cloud company, today announced the opening of a new headquarters and technical hub in Lisbon, Portugal to further support its growing EMEA operations and offices in London, Paris, Munich, and Dubai. Portugal already represents a growing Cloudflare team.\n\nToday Cloudflare's network currently spans 58 cities in Europe, including Lisbon, Portugal, which was announced in [2016](https://blog.cloudflare.com/amsterdam-to-zhuzhou-cloudflare-global-network/). Cloudflare announced its first office in Lisbon in 2019. Since establishing an office in the region, the company has grown from 14 employees to more than 350 in Portugal. Cloudflare plans to significantly increase its presence in Lisbon over the coming years. \n\nCloudflare celebrated the official opening of its new office with a ribbon cutting ceremony, followed by a reception attended by Portugal's Minister of Economy, Mr. Pedro Reis, along with other Portuguese officials. Top Cloudflare executives were also in attendance, including Cloudflare co-founder and CEO Matthew Prince, and John Graham-Cumming, CTO & Head of the Lisbon office, which he opened in July 2019.\n\n\"Portugal is playing a role in the emerging geo-economy over the next few years. We are massively investing in strategic infrastructure, energy, innovation, and research and development. And, we want to continue to develop and attract new talents. We are very happy that Cloudflare continues to be committed to Portugal. Cloudflare shares many of our values and we envision it not just as a partner in these values, but as a part of our future.\" says Mr. Pedro Reis, Minister of Economy of Portugal.\n\n\"Cloudflare has been invested in Portugal for the past eight years, and it continues to be a well-connected international hub and a vibrant tech ecosystem. It's home to an impressive talent pool, and supportive government initiatives,\" said Matthew Prince co-founder & CEO of Cloudflare. \"We've attracted a terrific team in Portugal, and Lisbon's vibrant charm and inclusivity attracted a number of our global team members to also call it home.\"\n\nCloudflare is planning further expansion in the region as it continues to grow its network globally. Its network already supports millions of Internet properties – including a significant number of customers in the EMEA region and Portugal, such as Allianz, Banco de Portugal, Carrefour, Clever Advertising, DHL, Doctolib, L'Oréal, TAP Air Portugal, Porsche Informatik, and the Portuguese Football Federation. Other notable customers include Roche, Sage, WA Technology, and Zalando. Cloudflare will continue to work closely with partners to support joint customers and drive further growth in the region.\n\n__About Cloudflare__\n\nCloudflare, Inc. (NYSE: NET) is the leading connectivity cloud company. It empowers organizations to make their employees, applications and networks faster and more secure everywhere, while reducing complexity and cost. Cloudflare's connectivity cloud delivers the most full-featured, unified platform of cloud-native products and developer tools, so any organization can gain the control they need to work, develop, and accelerate their business.\n\nPowered by one of the world's largest and most interconnected networks, Cloudflare blocks billions of threats online for its customers every day. It is trusted by millions of organizations—from the largest brands to entrepreneurs and small businesses to nonprofits, humanitarian groups, and governments across the globe.\n\nLearn more about Cloudflare's connectivity cloud at [cloudflare.com/connectivity-cloud](https://cloudflare.com/connectivity-cloud). Learn more about the latest Internet trends and insights at [radar.cloudflare.com](https://radar.cloudflare.com/).\n\nFollow us on: [Blog](https://blog.cloudflare.com/) | [X](https://twitter.com/cloudflare) | [LinkedIn](https://www.linkedin.com/company/cloudflare/) | [Facebook](https://www.facebook.com/Cloudflare/) | [Instagram](https://www.instagram.com/cloudflare)\n\n__Forward-Looking Statements__\n\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which statements involve substantial risks and uncertainties. In some cases, you can identify forward-looking statements because they contain words such as \"may,\" \"will,\" \"should,\" \"expect,\" \"explore,\" \"plan,\" \"anticipate,\" \"could,\" \"intend,\" \"target,\" \"project,\" \"contemplate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" or \"continue,\" or the negative of these words, or other similar terms or expressions that concern Cloudflare's expectations, strategy, plans, or intentions. However, not all forward-looking statements contain these identifying words. Forward-looking statements expressed or implied in this press release include, but are not limited to, statements regarding Cloudflare's products and technology, Cloudflare's technological development, future results of operations, financial condition, operations, growth, initiatives, strategies, future market trends, plans to expand Cloudflare's network or office locations, and comments made by Cloudflare's CEO and others. Actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in Cloudflare's filings with the Securities and Exchange Commission (SEC), including Cloudflare's Quarterly Report on Form 10-Q filed on August 1, 2024, as well as other filings that Cloudflare may make from time to time with the SEC.\n\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements are made. Cloudflare undertakes no obligation to update any forward-looking statements made in this press release to reflect events or circumstances after the date of this press release or to reflect new information or the occurrence of unanticipated events, except as required by law. Cloudflare may not actually achieve the plans, intentions, or expectations disclosed in Cloudflare's forward-looking statements, and you should not place undue reliance on Cloudflare's forward-looking statements.\n\n© 2024 Cloudflare, Inc. All rights reserved. Cloudflare, the Cloudflare logo, and other Cloudflare marks are trademarks and/or registered trademarks of Cloudflare, Inc. in the U.S. and other jurisdictions. All other marks and names referenced herein may be trademarks of their respective owners.\n\n__Media Contacts__\n\nCloudflare, Inc.\n\npress@cloudflare.com ",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "77b0e16b-53a4-5144-855b-7d3f586a1973",
			"locale": "en-US",
			"pathname": "/press-releases/2024/cloudflare-expands-emea-operations-with-new-headquarters-to-further-support/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}