{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2021/cloudflare-named-as-innovation-leader/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "b6f1a4bf-93e4-5709-9142-e8c89e9cb0f7",
				"title": "Cloudflare Named as the Innovation Leader in the Frost & Sullivan Frost Radar™: Global Holistic Web Protection Market Report",
				"contentfulId": "28VaSwtF0vHnE5BhFuDfTv",
				"metaTags": null,
				"subtitle": "Company is a ‘clear leader’ in providing innovative comprehensive Internet protection, including DDoS, WAF, and Bot Management",
				"orderDate": "2021-01-14",
				"body": "San Francisco, CA, January 14, 2021 — [Cloudflare, Inc.](https://www.cloudflare.com/) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today announced that it has been named the Innovation Leader in the 2020 Frost & Sullivan Frost Radar™: Global Holistic Web Protection Market Report. The global analyst firm cites Cloudflare's network scale, continued growth, and ability to secure customer infrastructure without performance tradeoffs as key success factors for the company.\n\n“Businesses are relying on the Internet more than ever before, so keeping websites online and running fast is paramount,” said Jen Taylor, SVP and Chief Product Officer at Cloudflare. \"Our team is always working to stay one step ahead of bad actors. This recognition of Cloudflare as the innovation leader in Frost & Sullivan’s Web Protection Market is validation of our approach and a reflection of our commitment to keeping our customers' web properties safe and secure online.\"\n\n“Cloudflare is a clear leader with respect to innovation in the Global Holistic Web Protection Market,” said Mikita Hanets, Information & Communication Technologies Research Analyst at Frost & Sullivan. “In the past years, Cloudflare has demonstrated a commitment to not only bettering the technology behind its Holistic Web Protection suite but also simplifying the end-user experience with their products.”\n\nFrost & Sullivan’s recent analysis of the Global Holistic Web Protection Market, finds that holistic web protection is rapidly gaining popularity worldwide. Holistic web protection solutions — an emerging category of security solutions — integrates three key security technologies: distributed denial-of-service (DDoS) mitigation, web application firewall (WAF), and bot risk management (BRM). According to Frost & Sullivan, the holistic web protection market addresses organizations’ demand for consolidated, single-pane-of-glass solutions, which reduce the security gap of legacy products and provide simplified management capabilities. The report is an analysis of 10 providers’ competitive strengths and opportunities as assessed by Frost & Sullivan.\n\nTo learn more about Cloudflare and read the Frost & Sullivan report please check out the resources below:\n- [View the Frost & Sullivan report ](https://www.cloudflare.com/lp/frost-radar-holistic-web/)\n- [Cloudflare Blog ](https://blog.cloudflare.com/cloudflare-named-the-innovation-leader-in-holistic-web-protection/)\n- [Cloudflare Bot Management](https://www.cloudflare.com/products/bot-management/)\n- [Cloudflare DDoS Protection](https://www.cloudflare.com/ddos/)\n- [Cloudflare WAF Protection ](https://www.cloudflare.com/waf/)\n\n__About Cloudflare__\nCloudflare, Inc. (www.cloudflare.com / @cloudflare) is on a mission to help build a better Internet. Cloudflare’s platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare have all web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine’s Top Company Cultures 2018 list and ranked among the World’s Most Innovative Companies by Fast Company in 2019. Headquartered in San Francisco, CA, Cloudflare has offices in Austin, TX, Champaign, IL, Seattle, WA, New York, NY, San Jose, CA, Washington, D.C., Lisbon, London, Munich, Paris, Beijing, Singapore, Sydney, and Tokyo.\n\n__About Frost & Sullivan__\nFor six decades, Frost & Sullivan has been world-renowned for its role in helping investors, corporate leaders and governments navigate economic changes and identify disruptive technologies, Mega Trends, new business models, and companies to action, resulting in a continuous flow of growth opportunities to drive future success.\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "b6f1a4bf-93e4-5709-9142-e8c89e9cb0f7",
			"locale": "en-US",
			"pathname": "/press-releases/2021/cloudflare-named-as-innovation-leader/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}