{
	"app_name": "1.1.1.1-Windows",
	"app_display_name": "Cloudflare WARP Windows Beta",
	"app_os": "Windows",
	"owner": {
		"name": "Cloudflare",
		"display_name": "Cloudflare"
	},
	"is_external_build": false,
	"origin": "appcenter",
	"id": 2631,
	"version": "2023.3.142.1",
	"short_version": "",
	"size": 106692608,
	"min_os": null,
	"device_family": null,
	"bundle_identifier": "7a7bd448eb879dd27c630897b75f98bb",
	"fingerprint": "26c03655f15ee8722bdf4dc1ffbfebb2",
	"uploaded_at": "2023-03-13T22:14:39.826Z",
	"mandatory_update": false,
	"enabled": true,
	"fileExtension": "msi",
	"is_latest": true,
	"release_notes": "This release contains bug fixes and new features from the previous beta release. With this release we are now feature complete for the quarter and will begin focusing exclusively on QA and bug fixes only. We encourage customers to test with this version and report issues ASAP.\r\n \r\n*Major change*\r\nAs a reminder, starting with the previous beta 2023.1.625.1, WARP On Windows now uses a new tunnel architecture that more closely matches our macOS and Linux implementations. WARP will now create a virtual interface that is visible in your network connections and directly modify the routing table to control where traffic flows. Please thoroughly test this release before deploying in your organization. \r\n \r\n## Notable updates\r\n- Added support for Zero Trust Digital Experience Monitoring. More information coming soon for customers who signed up for the beta\r\n- Added new log message to help customers and support identify when a users local network IP space overlaps with a remote network configured to go through the tunnel\r\n- Added support for Zero Trust customers to opt in to having the WARP Client install the root CA for your organization if TLS Decryption is enabled. A new toggle switch will appear in the dashboard under Settings->WARP Client soon to enable this\r\n- Modified behavior of Managed networks tests to always happen outside the tunnel as per original intent\r\n- Fixed issue introduced in previous beta, and called out in known issues, where users may need to restart or perform a clean install after upgrade to the new release\r\n- Fixed issue where GUI could miss a status message from the WARP Service resulting in the wrong state being reflected to users. An example is the GUI could show `Connecting` even though device was `Connected`\r\n \r\n## Known issues\r\n- Latest Windows client may take a few seconds to change to update the connection status after initial registration.\r\n- If you encounter issues during upgrade/install, please restart your Windows device (this issue will be resolved in a future release).\r\n\r\nFor Zero Trust documentation please see: https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp\r\nFor Consumer documentation please see: https://developers.cloudflare.com/warp-client/\r\n",
	"is_udid_provisioned": null,
	"can_resign": null,
	"package_hashes": [
		"d703a40b888a215fc093c900ea473e7f78baaec3b7571511ed4156d4a959c45c"
	],
	"destination_type": "group",
	"status": "available",
	"distribution_group_id": "d5dd5a80-bdb1-4274-83f7-13e9e392e07f",
	"distribution_groups": [
		{
			"id": "d5dd5a80-bdb1-4274-83f7-13e9e392e07f",
			"name": "Beta",
			"origin": "appcenter",
			"display_name": "Beta",
			"is_public": true
		}
	]
}