{
	"componentChunkName": "component---src-components-case-studies-templates-case-study-template-tsx",
	"path": "/case-studies/value-marketing/",
	"result": {
		"data": {
			"caseStudy": {
				"name": "Value Marketing",
				"contentfulId": "27hoZdE0LLfsmUGZxqaj4p",
				"nameUrlSlug": "value-marketing",
				"metaTags": null,
				"orderDate": "2020-01-02",
				"homepageUrl": "https://www.valuemarke.com/",
				"hideFromCaseStudiesPage": null,
				"shortDescription": "Value Marketing makes a safe bet with Cloudflare",
				"longDescription": "The leading Maltese iGaming affiliate business, Value Marketing, offers resources and tools to a worldwide audience. As the company has built major brands in the market such as CasinoTopp.net and CasinoTop.com, it has also made information security one of its top priorities.\n\n\"We are very serious about the online casino affiliate industry,\" says Reza Shojaei, Founder and Editor-in-Chief of Value Marketing. \"Trustworthiness and reliability are paramount for any business, but especially in the iGaming market, which has inconsistent rules and regulations globally. Readers and players need to know that their information is safe.\"\n \n### __The Challenge__\n \nHowever, information security, while essential, was also part of a bigger set of challenges for Value Marketing. Reza explains, \"In parallel, we were facing performance issues. We tried different ways to optimize servers and the CMS we use for our websites, but loading speed on our website was slow. Our server team investigated and found there were many attacks on the admin portal. Even though our server was properly hardened to resist these attacks, we still faced distributed denial-of-service (DDoS) attacks.\" Facing increasing pressure to keep their website running smoothly and rising complaints from their customers, Value Marketing knew it had to find a better solution.\n \n### __Cloudflare offers integrated security and performance solutions__\n \nValue Marketing evaluated different cloud platforms to help safeguard customer data and defend against future attacks, but Reza says, \"Frankly, Cloudflare was a clear choice, as we could see they prevent attacks and improve performance, trustworthiness, and efficiency.\"\n\nDuring their migration to Cloudflare services, Value Marketing started using Cloudflare's Web Application Firewall (WAF) and Advanced DDoS Protection to head off any incoming attacks. The server team also implemented the Cloudflare Railgun solution to improve the connection between the server and the end-user through content compression without impact on quality.\n\nAfter turning to Cloudflare, Value Marketing noticed significant security and performance improvements across the board. According to Reza, \"All the attacks were blocked, server load decreased, and our websites started working smoothly.\" Other Cloudflare services also contributing to Value Marketing's success and growth include Argo Smart Routing, Argo Tunnel, Cache API, and DNS.\n \n\"Cloudflare, you are our saving grace!\"\n\nDelighted with all these advantages, Reza estimates that Cloudflare increases their server security to 99% or better, especially against DDoS attacks. \n",
				"cloudflareStreamVideoId": null,
				"keyResults": "- Cloudflare increases their server security to about 99% or better",
				"relatedCaseStudies": [
					{
						"name": "How orderbird uses Cloudflare to protect their POS system",
						"nameUrlSlug": "how-orderbird-uses-cloudflare-to-protect-their-pos-system"
					}
				],
				"inPartnershipWith": null,
				"relatedCloudflareProducts": [
					{
						"title": "Web Application Firewall (WAF) ",
						"url": "/waf/"
					},
					{
						"title": "DDoS Mitigation",
						"url": "/ddos/"
					}
				],
				"employeeHeadshot": null,
				"employeeQuoteName": "Reza Shojaei",
				"employeeQuoteText": "Cloudflare is a saving grace for us, as hackers have tried to attack us, but they have always been blocked by Cloudflare. And thanks to Cloudflare CDN with caching, our content reaches users worldwide in a flash. Last, but not least, Cloudflare has great support and dedicated people. They also have many methods for supporting us, for instance, the community forum, support ticket, chat, and emergency phone number.",
				"employeeQuoteJobTitle": "Founder and Editor-in-chief",
				"employeeQuoteName2": null,
				"employeeQuoteText2": null,
				"employeeQuoteJobTitle2": null,
				"downloadPdfButtonLink": null,
				"ref_streamVideoThumbnail": null,
				"logo": {
					"file": {
						"publicURL": "[path]/VM_2.png"
					}
				},
				"customCanonicalTag": null,
				"availableLocales": null
			},
			"site": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"locale": "en-US",
			"contentfulId": "27hoZdE0LLfsmUGZxqaj4p",
			"pathname": "/case-studies/value-marketing/",
			"baseURL": "https://www.cloudflare.com",
			"allowedHrefLangs": [
				"en-US",
				"zh-CN"
			]
		}
	}
}