{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2011/cloudflare-raises-usd20-million-to-bring-performance-and-security-to-every/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "9da16db8-e593-5a1f-8873-fd93ae0b7f47",
				"title": "Cloudflare Raises $20 Million to Bring Performance and Security to Every Website",
				"contentfulId": "69hbBR2QJCm4lxO4O79wTr",
				"metaTags": null,
				"subtitle": "Investment to Expand World-Class Team and Infrastructure",
				"orderDate": "2011-07-12",
				"body": "<strong>San Francisco, CA, July 12, 2011</strong>\n<p>\nCloudflare, the web performance and security company, announced\ntoday that it has raised $20 million in funding led by New\nEnterprise Associates (NEA). Existing investors, Venrock and\nPelion Venture Partners, also participated in the Series B\nfunding round. The company will use the financing to continue\nto build its world-class team and expand its infrastructure to\nfulfill Cloudflare’s goal of making the Internet faster and\nsafer for everyone.\n</p>\n<p>\n“Cloudflare is in a unique position to transform the online\nexperience for users around the world with the rapid and\nwidespread adoption of its platform,” said Scott Sandell,\nGeneral Partner with NEA who joined Cloudflare’s Board of\nDirectors. “They have built what is effectively an Operating\nSystem for the Internet, and they are already demonstrating\nthat their technology can have a meaningful positive impact\nevery day on hundreds of millions of people using the web.”\n</p>\n<p>\nCloudflare’s growth has been nothing short of staggering\nsince its public launch in September 2010. Today, the service\npowers 7 billion page views per month, an increase of 280\npercent in just the last 60 days. More than 10 percent of\nthe Internet’s users worldwide passed through Cloudflare’s\nnetwork in the last month. Cloudflare has stopped 2.1 billion\nattacks against its users’ websites, while legitimate visitors\nto those sites have collectively saved 2,000 years worth of\ntime they would have otherwise spent waiting for pages to load.\n</p>\n<p>\n“Cloudflare now has the team, technology, investors and\nresources to realize our vision of powering a faster, safer\nInternet,” said Matthew Prince, CEO and co-founder of Cloudflare.\n</p>\n<p>\nWith 12 data centers worldwide, Cloudflare has built an\nintelligent, global network that automatically optimizes\nthe delivery of web pages so visitors get the fastest page\nload times and best performance. Cloudflare also stops threats\n and limits abusive bots and crawlers from wasting bandwidth\nand server resources. Cloudflare’s proprietary technology\nautomatically detects and shares information about attacks\nacross the community. This means that as the community of\nusers grows, the network gets smarter and the level of\nprotection and performance provided rises.\n</p>",
				"omitBoilerplate": null,
				"boilerplate": "<hr>\n<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>) makes sites twice\nas fast, protects them from attacks, ensures they are always\nonline, and makes it simple to add web apps with a single\nclick. Cloudflare supercharges websites regardless of size\nor platform with no need to add hardware, install software,\nor change a line of code. The Cloudflare community gets\nstronger as it grows; every new site makes the network\nsmarter and faster. Thanks to our awesome sauce technology,\nhundreds of millions of people experience a faster, safer,\nbetter Internet. Cloudflare is based in San Francisco, California.\n</p>\n<hr>\n<h4 class=\"marketing-h4\">About NEA</h4>\n<p>\nNew Enterprise Associates, Inc. (NEA) is a leading venture\ncapital firm focused on helping entrepreneurs build\ntransformational businesses across multiple stages, sectors\nand geographies. With approximately $11 billion in committed\ncapital, NEA invests in information technology, healthcare and\nenergy technology companies at all stages in a company’s\nlifecycle, from seed stage through IPO. The firm’s long track\nrecord of successful investing includes more than 165 portfolio\ncompany IPOs and more than 280 acquisitions, including\ninvestments in technology leaders like Data Domain,\nCareerBuilder, Diapers.com, Groupon, Juniper, Macromedia,\nPlaydom, Salesforce.com, and TiVo. In the U.S., NEA has two\noffices in the Washington, D.C. metropolitan area and one in\nMenlo Park, California. In addition, New Enterprise Associates\n(India) Pvt. Ltd. has offices in Bangalore and Mumbai, India\nand New Enterprise Associates (Beijing), Ltd. has offices in\nBeijing and Shanghai, China. For additional information, visit\n<a href=\"http://www.nea.com\" target=\"_blank\">www.nea.com</a>.\n</p>\n<hr>\n<h4 class=\"marketing-h4\">About Venrock</h4>\n<p>\nVenrock is a leading venture capital firm with offices in Palo\nAlto, CA; New York, NY; and Cambridge, MA. Originally\nestablished as the venture capital arm of the Rockefeller\nfamily, Venrock continues an eight- decade tradition of\npartnering with entrepreneurs to establish successful,\nenduring companies. With a primary focus on technology,\nhealthcare, and energy, portfolio companies have included\nAdify, Adnexus Therapeutics, Apple Computer, Athenahealth,\nCentocor, Check Point Software, DoubleClick, Gilead Sciences,\nIdec Pharmaceuticals, Illumina, Intel, Millennium\nPharmaceuticals, Sirna Therapeutics, StrataCom, and Vontu.\nFor more information, please visit Venrock’s website at\n<a href=\"http://www.venrock.com/\" target=\"_blank\"> www.venrock.com</a>\nand follow the firm on Twitter at\n<a href=\"http://www.twitter.com/venrock\" target=\"_blank\">@venrock</a>.\n</p>\n<hr>\n<h4 class=\"marketing-h4\">About Pelion</h4>\n<p>\nSince 1986, Pelion Venture Partners has been helping\nentrepreneurs turn early-stage concepts into tomorrow’s\nindustry-leading companies. The Pelion team is hands- on in\nits approach and works collaboratively on each portfolio\ncompany over the life of an investment. Pelion Ventures has\ninvested in 91 companies over the last 25 years, resulting in\n14 IPOs and 34 M&amp;As. In addition to Cloudflare, Pelion oversees\ninvestments in a range of enterprise software, healthcare,\ninformation technology and security firms. Current and previous\nportfolio companies include: Riverbed Technologies, Red Hat,\nFusion-io, MXLogic, Carefx, Angioscore, Conviva, Mojiva and\nSoasta. For additional information, visit\n<a href=\"http://www.pelionvp.com/\" target=\"_blank\">www.pelionvp.com</a>.\n</p>\n"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "9da16db8-e593-5a1f-8873-fd93ae0b7f47",
			"locale": "en-US",
			"pathname": "/press-releases/2011/cloudflare-raises-usd20-million-to-bring-performance-and-security-to-every/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}