{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2011/cloudflare-launches-certified-hosting-provider-program-at-hostingcon-2011/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "bf8bf7cf-479d-517c-8255-e4348b9c8194",
				"title": "Cloudflare Launches Certified Hosting Provider Program at HostingCon 2011",
				"contentfulId": "7tDWJZD8ZqpFD8hjgBD9pG",
				"metaTags": null,
				"subtitle": "Over 100 hosting providers already partnered with Cloudflare to offer their customers faster, safer websites",
				"orderDate": "2011-08-08",
				"body": "<strong>San Diego, CA, August 8, 2011, HostingCon</strong>\n<p>\nCloudflare, the web performance and security company,\nlaunched their Certified Hosting Provider Program today at\nthe 2011 HostingCon Conference. The program helps hosting\nproviders save money while offering faster and safer\nservice to their clients.\n</p>\n<p>\n“The demand for this has been incredible from hosting\nproviders and their customers,” said Matthew Prince, CEO\nand co-founder of Cloudflare. “During the limited pilot of\nthe program, we enrolled more than 100 hosting providers.\nWe’re now rolling the Cloudflare Certified Hosting Provider\nProgram out to all hosting providers.”\n</p>\n<p>\nCloudflare Certified Hosting Partners get reduced server\nload, bandwidth savings, a next-generation web performance\nservice to offer their customers, a suite of web security\nservices to protect their hosted sites and robust denial\nof service (DDoS) attack protection. Integrating with\nCloudflare is easy and there is no cost to becoming a\nCloudflare Certified Hosting Provider.\n</p>\n<p>\n“We partnered with Cloudflare because they have a simple\nand free solution to help to protect and accelerate any\nwebsite online,” said Matt Jones, Product Manager for Media Temple.\n</p>\n<p>\n“This is a game changer that brings CDN services to our\ncustomers through the click of a button. Faster site loads,\na geographically diverse CDN, added security and simplicity.\nWhat’s not to like?” said Bryan Muthig, Chief Executive\nOfficer for A2 Hosting.\n</p>\n<p>\n“Since signing up for Cloudflare, we’ve seen an increase in\nour sales,” said Ryan Morris, Marketing Director for CoolHandle.\n</p>\n<p>\n“It has been a great experience to partner with Cloudflare.\nBy integrating Cloudflare with our hosting services, customers\nhave improved their website security, decreased their\nbandwidth consumption and provided their visitors with\na better performance. Our clients love Cloudflare, and\nso do we,” said Teotonio Ricardo, Chief Marketing Officer\nfor WebTuga Hosting.\n</p>\n<p>\n“Cloudflare is a win-win product. It not only provides an\nextra layer of website security protection and reduces server\nload, but it informs people who are spreading viruses around,”\nsaid Dave Collins, Chief Technology Officer for HostGator.com.\n</p>\n<p>\nWeb hosting companies around the world are now eligible to\nsign up for Cloudflare’s Certified Hosting Partner Program\nby visiting\n<a href=\"/partners/\" target=\"_blank\">www.cloudflare.com/hosting-partners</a>.\n</p>\n",
				"omitBoilerplate": true,
				"boilerplate": "<hr>\n<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>) makes\nsites lightning fast, protects them from attacks, ensures they\nare always online, and makes it simple to add web apps with a\nsingle click. Regardless of size or platform, Cloudflare\nsupercharges websites with no need to add hardware, install\nsoftware, or change a line of code. The Cloudflare community\ngets stronger as it grows: every new site makes the network\nsmarter. More than 5% of global web requests flow through\nCloudflare’s network daily. And, thanks to our awesome sauce\ntechnology, every month billions of people experience a\nfaster, safer, better Internet. Cloudflare was recognized\nby the World Economic Forum as a Technology Pioneer, named\nthe Most Innovative Network &amp; Internet Technology Company\nfor two years running by the Wall Street Journal, and ranked\namong the world’s 50 most innovative companies by Fast Company.\nCloudflare is based in San Francisco, California, USA.\n</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "bf8bf7cf-479d-517c-8255-e4348b9c8194",
			"locale": "en-US",
			"pathname": "/press-releases/2011/cloudflare-launches-certified-hosting-provider-program-at-hostingcon-2011/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}