{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2011/cloudflare-selected-as-2012-technology-pioneer-by-world-economic-forum/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "e044bfd7-dd88-5995-abd2-927c7d854157",
				"title": "Cloudflare Selected as 2012 Technology Pioneer by World Economic Forum",
				"contentfulId": "1caMvnzC0DkuSVwOJdfzMp",
				"metaTags": null,
				"subtitle": "World Economic Forum selects 25 Technology Pioneers as visionary companies in the fields of information technology and new media, energy/environment and life sciences/health",
				"orderDate": "2011-09-01",
				"body": "<strong>San Francisco, CA, September 1, 2011</strong>\n<p>\nCloudflare, the web performance and security company, has\nbeen recognized by the World Economic Forum as a 2012\nTechnology Pioneer. The Forum’s Technology Pioneers\nrepresent the most innovative startup companies worldwide,\npoised to make a significant, positive impact on business\nand society. Cloudflare was selected for its mission to\nbring performance and security to every website on the Internet.\n</p>\n<p>\n“The Internet is one of the great technological innovations\nof all time and its promise is the ability to give anyone\nwith something to share a way to address a global audience,”\nsaid Matthew Prince, co-founder and CEO of Cloudflare.\n“At Cloudflare, we measure our success in large part on\nhow well we are helping deliver on that promise. We hope\nthat our selection as a World Economic Forum Technology\nPioneer will help us accelerate our goal of building a faster,\nsafer web for everyone worldwide.”\n </p>\n<p>\nPrevious Technology Pioneers have included groundbreaking\ncompanies like Google, Twitter, PayPal, Admob, and Mozilla.\nThis year, the 25 winners were selected from thousands\nof nominated startups.\n</p>\n<p>\n“The revolutionary technological platform Cloudflare has\ndeveloped allows us to deliver the resources previously\nreserved for the Internet giants at a price any website in\nthe world can afford,” said Mr. Prince. “We operate 14 data\ncenters worldwide to ensure any website can effectively\nreach a global audience.”\n</p>\n<p>\nEvery month, Cloudflare makes the web faster and safer for\nmore than 350 million Internet visitors worldwide, representing\nmore than 17 percent of the Internet’s total population.\nCloudflare has stopped more than a billion attacks directed\nat its customers’ websites. By making websites faster,\nCloudflare saves more than 50 lives worth of time every\nmonth that would have otherwise been spent waiting for\nwebsites to load.\n</p>",
				"omitBoilerplate": null,
				"boilerplate": "<hr>\n<h4 class=\"marketing-h4\">About the World Economic Forum</h4>\n<p>\nThe World Economic Forum is an independent international\norganization committed to improving the state of the world\nby engaging leaders in partnerships to shape global, regional\nand industry agendas. Incorporated as a foundation in 1971,\nand headquartered in Geneva, Switzerland, the World Economic\nForum is impartial and not-for-profit; it is tied to no\npolitical, partisan or national interests\n(<a href=\"http://www.weforum.org\" target=\"_blank\">http://www.weforum.org</a>).\n</p>\n<hr>\n<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>)\nmakes sites lightning fast, protects them from attacks, ensures\nthey are always online, and makes it simple to add web apps with\na single click. Regardless of size or platform, Cloudflare\nsupercharges websites with no need to add hardware, install\nsoftware, or change a line of code. The Cloudflare community\ngets stronger as it grows: every new site makes the network\nsmarter. More than 5% of global web requests flow through\nCloudflare’s network daily. And, thanks to our awesome sauce\ntechnology, every month billions of people experience a\nfaster, safer, better Internet. Cloudflare was recognized\nby the World Economic Forum as a Technology Pioneer, named\nthe Most Innovative Network &amp; Internet Technology Company for\ntwo years running by the Wall Street Journal, and ranked among\nthe world’s 50 most innovative companies by Fast Company.\nCloudflare is based in San Francisco, California, USA.\n</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "e044bfd7-dd88-5995-abd2-927c7d854157",
			"locale": "en-US",
			"pathname": "/press-releases/2011/cloudflare-selected-as-2012-technology-pioneer-by-world-economic-forum/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}