{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2011/cloudflare-rocket-loader-delivers-app-like-speeds-to-any-website/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "7bf4581a-52a6-596a-a91f-38d4e49d90d8",
				"title": "Cloudflare Rocket Loader Delivers App-Like Speeds to Any Website",
				"contentfulId": "27EBl4HcQTW2daBpDH4jIh",
				"metaTags": null,
				"subtitle": null,
				"orderDate": "2011-05-25",
				"body": "<strong>San Francisco, CA, May 25, 2011</strong>\n<p>\nCloudflare, the web performance and security company, today\nannounced the beta of its Rocket Loader, a free service that\nautomatically optimizes the code on your site so you can\nget app-like page load speeds.\n</p>\n<p>\nCloudflare Rocket Loader ensures websites load as fast as\npossible based on the device and code on the page, even if\nthat code is pulled from a third party service. Third party\nservices, like the ad networks, the Facebook \"Like\" button,\nor the Twitter \"Tweet\" button have previously been\nperformance-robbing culprits that can slow down a site,\neven if the site owner has optimized their own code.\n</p>\n<p>\n\"Every webmaster has experienced the frustration of a message\nin the lower-left corner of the browser saying it is waiting\nfor some third-party widget to load,\" said Matthew Prince,\nCEO and co-founder of Cloudflare. \"Cloudflare Rocket Loader\ngives webmasters full control of their sites by allowing them\nto ensure that even third party widgets are loaded through the\nminimum number of network connections at the maximum possible speed.\"\n</p>\n<p>\nRocket Loader was inspired in part by the work of Google on\ntheir SPDY web protocol. The SPDY protocol allows multiple\nresources to be delivered via a minimum number of network\nconnections. While SPDY is limited to only the Chrome browser,\nCloudflare's Rocket Loader brings this same performance to a\nwide range of browsers, and especially rocks on smartphones\nand other mobile devices.\n</p>\n<p>\n\"Each new network connection on a mobile device is another\nopportunity for your network provider to fail,\" explained\nChris Joel, an engineer at Cloudflare who was on the team\nthat created Rocket Loader. \"While Rocket Loader dramatically\nimproves the performance on desktops and laptops, where it\nreally takes off is web browsing on mobile devices.\"\n</p>\n<p>\nCloudflare is provisioned via DNS, meaning web administrators\ndo not need to add hardware, install software, or change their\ncode to get the benefits of Cloudflare, including Rocket\nLoader. Announced today at TechCrunch Disrupt New York City,\nCloudflare Rocket Loader is available as a no-cost option for\nany website on the Cloudflare network, regardless of whether\nthey are on a free or pro plan.\n </p>",
				"omitBoilerplate": true,
				"boilerplate": "<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>)\nmakes sites lightning fast, protects them from attacks,\nensures they are always online, and makes it simple to\nadd web apps with a single click. Regardless of size or\nplatform, Cloudflare supercharges websites with no need\nto add hardware, install software, or change a line of\ncode. The Cloudflare community gets stronger as it grows:\nevery new site makes the network smarter. More than 5% of\nglobal web requests flow through Cloudflare's network\ndaily. And, thanks to our awesome sauce technology, every\nmonth billions of people experience a faster, safer, better\nInternet. Cloudflare was recognized by the World Economic\nForum as a Technology Pioneer, named the Most Innovative\nNetwork &amp; Internet Technology Company for two years running\nby the Wall Street Journal, and ranked among the world's 50\nmost innovative companies by Fast Company. Cloudflare is\nbased in San Francisco, California, USA.\n</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "7bf4581a-52a6-596a-a91f-38d4e49d90d8",
			"locale": "en-US",
			"pathname": "/press-releases/2011/cloudflare-rocket-loader-delivers-app-like-speeds-to-any-website/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}