{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2015/cloudflare-solves-an-industry-wide-dns-security-problem-shields-any-dns-infrasctructure-from-attacks/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "6d5b3f5e-19fa-51d9-9bd2-626ca92219c1",
				"title": "Cloudflare Solves an Industry-Wide DNS Security Problem, Shields Any DNS Infrasctructure From Attacks",
				"contentfulId": "6j2b2GSuL9NdJbALjaAPW6",
				"metaTags": null,
				"subtitle": "Virtual DNS Protects and Supercharges DNS Servers, Mitigating One of the Most Common Infrastructure Vulnerabilities -- Distributed Denial of Service Attacks (DDoS)",
				"orderDate": "2015-03-10",
				"body": "\n <p><strong>SAN FRANCISCO, CA--(Marketwired - Mar 10, 2015) - </strong> <a href=\"https://www.cloudflare.com\">Cloudflare</a>, the leading Internet performance and security company, today launched Virtual DNS to protect and accelerate any organization's DNS infrastructure. DNS is the Internet's address book, and every query on the Internet begins with a DNS lookup. The performance and security of an organization's DNS infrastructure is therefore critical. Virtual DNS boosts the security, global availability, and speed of DNS responses without requiring organizations to make disruptive changes to their legacy DNS infrastructure.</p>\n<p>\"Virtual DNS is a lifesaver for anyone managing their own legacy nameservers. Hosting providers and large enterprises are stuck between a rock and a hard place: on one hand, they struggle to keep up with the performance and security challenges of running their own DNS infrastructure while, on the other, their legacy DNS infrastructure is nearly impossible to replace without costly disruption,\" explained Matthew Prince, co-founder and CEO of Cloudflare. \"With Virtual DNS, organizations get the performance, security, and high availability of Cloudflare's global DNS network with no disruption and no change to their existing infrastructure.\"</p>\n<p>DNS infrastructures are increasingly becoming the target of cyber attacks. The latest DNS based DDoS attacks mitigated by Cloudflare have exceeded 500Gbps with more than 250 million seemingly valid DNS queries. Traditional DDoS scrubbing hardware and services are useless in the face of these attacks, meaning that until now there has been no way for organizations to avoid downtime if they are targeted. Virtual DNS stops attack traffic at Cloudflare's edge -- blocking traffic before it reaches a company's nameservers -- so even legacy infrastructure is safeguarded.</p>\n<p>Industry-leading cloud hosting provider, DigitalOcean, was an early beta customer of Virtual DNS and has been using the service since July 2014. Since every request on the Internet begins with a DNS query, faster DNS responses mean quicker page loads and happier customers.\n\"DigitalOcean answers 10,000 DNS queries every second, and Cloudflare makes sure that it's 100 percent clean,\" said Sam Kottler, platform engineer at DigitalOcean. \"Cloudflare's Virtual DNS is exactly what we need to protect our DNS infrastructure and ensure that we are always fast and always online, anywhere.\"</p>\n<p>Dan Kaminsky, DNS security expert and chief scientist and co-founder of White Ops, agrees: \"Cloudflare is addressing a critical issue at the foundation of the Internet.\" Kaminsky said, \"Internet users depend on DNS to be both highly available and accurate. Cloudflare's DNS stack, including Virtual DNS and DNSSEC, is already a reality for more than 35 percent of domains using managed domain nameservers.\"</p>\n<p>With Cloudflare's Virtual DNS, records stay on an organization's nameservers. More than 30 enterprises participated in Cloudflare's beta. Beta participants were protected from all attacks, and their DNS performance increased by 50 percent. \"We're opening up a new door for organizations that were unable to make changes to their legacy infrastructure,\" said Olafur Gudmundsson, long time contributor and DNS Working Group chair at the IETF and now a systems engineer at Cloudflare focused on DNS and DNSSEC development. \"Virtual DNS gives organizations a global, battle-tested DNS shield in front of their existing operations.\"</p>\n<p>Virtual DNS is currently available to Cloudflare Enterprise customers, hosting providers, and large DNS operators.</p>\n<p><strong>Additional Resources</strong>\n</p><ul>\n<li><a href=\"https://www.cloudflare.com/dns/dns-firewall/\" target=\"_blank\">Virtual DNS</a></li>\n<li><a href=\"https://www.cloudflare.com/case-studies/digitalocean/\" target=\"_blank\">DigitalOcean Case Study</a></li>\n<li><a href=\"https://blog.cloudflare.com/announcing-virtual-dns-ddos-mitigation-and-global-distribution-for-dns-traffic/\" target=\"_blank\">(Blog) Announcing Virtual DNS</a></li>\n</ul>",
				"omitBoilerplate": true,
				"boilerplate": "<strong>About Cloudflare</strong><br>\nCloudflare, Inc. (<a href=\"https://www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) makes sites lightning fast, protects them from attacks, ensures they are always online, and makes it simple to add web apps with a single click. Regardless of size or platform, Cloudflare supercharges websites with no need to add hardware, install software, or change a line of code. The Cloudflare community gets stronger as it grows: every new site makes the network smarter. More than 5 percent of global Web requests flow through Cloudflare's network; every month more than 1.8 billion people experience a faster, safer, better Internet. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Cloudflare has offices in San Francisco, California, USA and London, UK.<p></p><pre>Daniella Vallurupalli\nCommunications\ndaniella@cloudflare.com\npress@cloudflare.com\n650-483-4463</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "6d5b3f5e-19fa-51d9-9bd2-626ca92219c1",
			"locale": "en-US",
			"pathname": "/press-releases/2015/cloudflare-solves-an-industry-wide-dns-security-problem-shields-any-dns-infrasctructure-from-attacks/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}