{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2015/cloudflare-and-baidu-announce-strategic-partnership-to-help-build-a-better-internet/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "e44058dd-f5fb-5538-812b-63cbe61ad0d1",
				"title": "Cloudflare and Baidu Announce Strategic Partnership to Help Build a Better Internet",
				"contentfulId": "2RStTg10BYTs02nzEYqHl9",
				"metaTags": null,
				"subtitle": "China's Leading Search Engine Forms Strategic Partnership to Take Cloudflare's Internet Security and Performance Platform Global",
				"orderDate": "2015-09-13",
				"body": "\n <p>SAN FRANCISCO, CA--(Marketwired - Sep 13, 2015) - <a href=\"https://cloudflare.com/\">Cloudflare</a>, the leading Internet performance and security company, and <a href=\"http://ctt.marketwire.com/?release=1217036&amp;id=7050358&amp;type=1&amp;url=http%3a%2f%2fwww.baidu.com%2f\" target=\"_blank\">Baidu</a> (NASDAQ: <a href=\"http://www.marketwired.com/news_room/Stock?ticker=BIDU\" target=\"_blank\">BIDU</a>), China's leading search engine, today announced a strategic partnership to launch the first-ever unified global platform to make Internet applications fast, secure, and more intelligent in China and around the world. The partnership joins together Cloudflare's pioneering technology with Baidu's extensive network across mainland China. Together, Cloudflare and Baidu are enabling Chinese and international businesses to grow their global online presence, while improving application performance and security inside and outside of China.</p>\n <p>Cloudflare's cloud acceleration and security platform transforms the way SMBs and enterprises deploy services at the edge of their networks -- disrupting the traditional model of on-premise appliance deployments. Leveraging Cloudflare's international network outside of China, and Baidu's network inside of China, any enterprise can rapidly and securely deploy cloud-based firewall, load balancing, WAN optimization, distributed denial of service (DDoS) mitigation, content delivery, and DNS services worldwide -- without a single piece of hardware. In just the past day, Cloudflare has saved Chinese users more than 243 years of time that, prior to this partnership, would have been collectively spent waiting for web content to load.</p>\n<p>\"Baidu's mission has always been to provide the best and most equitable way for people to find what they're looking for. As people search for the content and services they want, they expect it to be fast and secure everywhere, all of the time,\" said Ya-Qin Zhang, president of Baidu. \"Our partnership with Cloudflare makes this possible, and is the first of its kind between a Chinese and American Internet company. Together, Cloudflare and Baidu have the opportunity to transform the Internet for the better in China and worldwide.\"</p>\n<p>\"China is the world's largest online population with more than 650 million Internet users, and we are proud to partner with Baidu to make our technology available in China, as well as to extend services for our customers into the China market, \" said Matthew Prince, co-founder and CEO of Cloudflare. \"With this partnership, Cloudflare has become the only unified network that can provide performance and security to the entire world's Internet population.\"</p>\n<p>Cloudflare currently offers its services across a network of 62 points of presence around the world, including China. This partnership expands the global availability of Cloudflare across seventeen points of presence in China -- Qingdao, Fuzhou, Hengyang, Dongguan, Shenyang, Luoyang, Hangzhou, Jiaxing, Tianjin, Guangzhou, Chengdu, Langfang, Xian, Nanning, Zhengzhou, Shijiazhuang, and Foshan. The result is the first truly integrated, global platform to bring all of the performance and security advantages of Cloudflare's technology to organizations and Internet users in China.</p>\n<p>TechCrunch China is one of the first Cloudflare customers to enable the China network. \"There are millions of tech news readers in China who know TechCrunch well, but we have long been frustrated by the super slow performance of TechCrunch.CN in China,\" said Ned Desmond, COO of TechCrunch and GM AOL Tech Media. \"When we heard about Cloudflare's solution in China, we asked to get on board, and the results have been nothing short of dramatic for our business in mainland China. Now TechCrunch.CN loads six times faster and is nearly doubling availability for our mainland readers.\"</p>\n<p>As the world's largest market for ecommerce, retailers need to provide a world-class experience for their online shoppers in mainland China. \"China is one of the fastest growing and largest markets for retail ecommerce, and providing a great online experience for our Chinese customers plays a critical part in our global strategy,\" said Phong Nguyen, co-founder of Gilt Groupe. \"We initially selected Cloudflare as our performance and security solution to improve our service globally, and we are excited that this expansion can further optimize our service worldwide.\"</p>\n<p>Cloudflare enabled ChaseFuture, a Shanghai-based startup and platform for college and graduate school admissions, to provide students with a better online experience. \"The number of trade-offs we've made to launch our platform to connect Chinese students with international educational opportunities was astounding,\" said Greg Nance, CEO and founder of Shanghai based ChaseFuture. \"Cloudflare solved all of our problems. Our desktop and mobile apps are now blazing fast for our Chinese customers, as well as our international partners and mentors, even though all of our infrastructure is in China.\"</p>\n<p>Russell Moore, partner at leading global hosting provider, Spark::red, shared: \"China is a critical market for our consumer products clients like American Apparel. Cloudflare's single-platform solution, ensuring web properties can be fast and reliable in China and globally, is a real game changer.\"</p>\n<p>Qualifying Cloudflare customers will soon be able to enable the China network in their Cloudflare account with a click of a button. This will allow any Cloudflare customer to reduce the latency of their applications by over 200 milliseconds in China without any additional configuration changes.</p>\n<p>\"We've navigated what few have been able, a cooperation-based model that preserves the integrity and security of the two networks, as well as our customers,\" said Joshua Motta, Head of Special Projects at Cloudflare. \"Baidu operates all services within China, and Cloudflare outside of China, in accordance with all local laws and regulations.\"</p>\n<p>To learn more about how your organization can be fast and more reliable in China, visit: <a href=\"https://cloudflare.com/china\" target=\"_blank\">https://cloudflare.com/china</a></p>",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br>\nCloudflare, Inc. (<a href=\"https://cloudflare.com/\">www.cloudflare.com</a> / @cloudflare) makes any Internet application lightning fast, protects them from attacks, ensures they are always online, and makes it simple to add web apps with a single click. Regardless of size or platform, Cloudflare supercharges Internet applications with no need to add hardware, install software, or change a line of code. The Cloudflare community gets stronger as it grows: every new application makes the network smarter. More than 5 percent of global Internet requests flow through Cloudflare's network; every month more than 2 billion people experience a faster, safer, better Internet. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network &amp; Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Cloudflare has offices in San Francisco, Washington, DC, London, and Singapore.</p>\n\n<p><strong>About Baidu</strong><br>\nBaidu, Inc. is the leading Chinese language Internet search provider. As a technology-based media company, Baidu aims to provide the best and most equitable way for people to find what they're looking for. In addition to serving individual Internet search users, Baidu provides an effective platform for businesses to reach potential customers. Baidu's ADSs trade on the NASDAQ Global Select Market under the symbol \"BIDU\". Currently, ten ADSs represent one Class A ordinary share.</p>\n\n<pre>Daniella Vallurupalli\nCommunications\ndaniella@cloudflare.com\npress@cloudflare.com\n650-483-4463</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "e44058dd-f5fb-5538-812b-63cbe61ad0d1",
			"locale": "en-US",
			"pathname": "/press-releases/2015/cloudflare-and-baidu-announce-strategic-partnership-to-help-build-a-better-internet/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}