{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2015/fidelity-google-microsoft-baidu-and-qualcomm-back-cloudflare-to-help-build/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "362fa490-aa69-5439-9738-064b2d0b71d2",
				"title": "Fidelity, Google, Microsoft, Baidu, and Qualcomm Back CloudFlare to Help Build a Better Internet",
				"contentfulId": "3KBTnczTgsYES6S6ME2Qki",
				"metaTags": null,
				"subtitle": "CloudFlare announces $110 million investment, and collaboration with leading global technology firms",
				"orderDate": "2015-09-22",
				"body": "SAN FRANCISCO, September 22, 2015 — CloudFlare, a leading Internet performance and security company, today announced it has raised $110 million in equity capital in a round led by Fidelity Management and Research Company, with strategic participation from Google Capital, Microsoft, Baidu, and Qualcomm Incorporated--through its venture investment group, Qualcomm Ventures. CloudFlare will use the new funding and backing from global technology powerhouses to accelerate its rapid customer growth, extend product ranges to meet the demands of large enterprises, and expand into new international markets.  \n\nThe investment comes as the company's customer base reaches the four million mark globally, following expansion into more than 30 countries. In just the last month, CloudFlare has processed more than five percent of all Internet requests globally, and mitigated more than 200 billion cyberattacks on behalf of its customers.\n\n\"There's an inevitability around our business,\" said Matthew Prince, co-founder and CEO of CloudFlare. \"Traditional on-premise solutions such as firewalls, load balancers, and DDoS mitigation appliances are becoming obsolete as organizations distribute their applications across geographies and cloud environments. CloudFlare offers these edge functions as a service without any additional hardware or software, irrespective of where the applications reside.\"\n\nThe announced funding and collaborations will help CloudFlare target four key areas:\n\nInternational expansion:  To further support the company's growth, CloudFlare plans to expand its global network at the pace of one new datacenter location per week. \"CloudFlare offers a differentiated technology that fundamentally improves the performance and security of any Internet application,\" said Ya-Qin Zhang, president of Baidu. \"Our partnership is the first step towards extending the accessibility of this innovative technology across Baidu's network in China.\"\n\nMobile: As mobile Internet traffic grows, CloudFlare continues to invest in product ranges to increase the performance and security of any mobile application. \"In the future, mobile networks will have to deal with a thousand times more data traffic than they handle today,\" said Matt Grob, executive vice president of Qualcomm Technologies, Inc., and chief technology officer. \"CloudFlare is well positioned in the face of this growth to increase the security and speed of content delivered to the mobile handset, and we look forward to working with the company to make mobile networks more capable and useful.\"\n\nEnterprise:  Once targeted at individuals and SMBs, CloudFlare is now also the choice for many of the world's largest Internet properties and enterprises. \"CloudFlare is a natural complement to Microsoft Azure, enabling enterprises of any size to help secure and enhance their applications running on Azure, including hybrid deployments,\" said Bob Kelly, CVP of business development, Microsoft Corp. \"We look forward to working with CloudFlare to seamlessly extend its capabilities to the Azure ecosystem.\"\n\nNetwork: To tackle problems at Internet scale, CloudFlare will expand its network and connectivity across the globe. \"Google is a company we've always admired. We're excited to have Google's support as an investor, broadening our existing partnership,\" said Michelle Zatlyn, co-founder and head of user experience at CloudFlare. \"Support from organizations that truly understand Internet scale, and operating massive networks, is essential as we achieve our goals as a company.\"\n\nLaunched in 2009, CloudFlare is transforming the way SMBs and enterprises deploy services at the edge of their networks, disrupting the traditional model of on-premise appliance deployments. Through CloudFlare's global network, any enterprise can rapidly and securely deploy cloud-based firewall, load balancing, WAN optimization, distributed denial of service (DDoS) mitigation, content delivery and DNS services without ever purchasing a single piece of hardware. CloudFlare customers include many of the world's largest Internet properties, financial institutions and national governments.\n\nScott Sandell, managing general partner at New Enterprise Associates said: \"We view CloudFlare as a category-defining company that is fundamentally changing the way enterprises deploy applications on the Internet. The broad strategic participation in the round reflects the degree to which this proposition has entered the mainstream, and is recognized by forward-thinking companies as a massive opportunity.\" \n\nCloudFlare turned profitable in 2014, and is currently running at a gross profit margin of 75 percent. In total, CloudFlare has raised $182 million in equity funding from investors including New Enterprise Associates, Pelion Venture Partners, Venrock, Union Square Ventures, and Greenspring. All existing investors participated in CloudFlare's latest round of funding. \n",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br />\nCloudflare, Inc. (<a href=\"https://cloudflare.com/\">www.cloudflare.com</a> / @cloudflare) makes any Internet application lightning fast, protects them from attacks, ensures they are always online, and makes it simple to add web apps with a single click. Regardless of size or platform, Cloudflare supercharges Internet applications with no need to add hardware, install software, or change a line of code. The Cloudflare community gets stronger as it grows: every new application makes the network smarter. More than 5 percent of global Internet requests flow through Cloudflare's network; every month more than 2 billion people experience a faster, safer, better Internet. Cloudflare was recognized by the World Economic Forum as a Technology Pioneer, named the Most Innovative Network & Internet Technology Company for two years running by the Wall Street Journal, and ranked among the world's 50 most innovative companies by Fast Company. Cloudflare has offices in San Francisco, Washington, DC, London, and Singapore.</p>\n\n<pre>Daniella Vallurupalli\nCommunications\ndaniella@cloudflare.com\npress@cloudflare.com\n650-483-4463</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "362fa490-aa69-5439-9738-064b2d0b71d2",
			"locale": "en-US",
			"pathname": "/press-releases/2015/fidelity-google-microsoft-baidu-and-qualcomm-back-cloudflare-to-help-build/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}