{
	"AccountID": "string; Cloudflare account ID.",
	"BytesReceived": "int; The number of bytes sent from the origin to the client during the network session.",
	"BytesSent": "int; The number of bytes sent from the client to the origin during the network session.",
	"ClientTCPHandshakeDurationMs": "int; Duration of handshaking the TCP connection between the client and Cloudflare in milliseconds.",
	"ClientTLSCipher": "string; TLS cipher suite used in the connection between the client and Cloudflare.",
	"ClientTLSHandshakeDurationMs": "int; Duration of handshaking the TLS connection between the client and Cloudflare in milliseconds.",
	"ClientTLSVersion": "string; TLS protocol version used in the connection between the client and Cloudflare.",
	"ConnectionCloseReason": "string; The reason for closing the connection, only applicable for TCP. Possible values are CLIENT_CLOSED | CLIENT_IDLE_TIMEOUT | CLIENT_TLS_ERROR | CLIENT_ERROR | ORIGIN_CLOSED | ORIGIN_TLS_ERROR | ORIGIN_ERROR | ORIGIN_UNREACHABLE | PROXY_CONN_REFUSED | UNKNOWN | MISMATCHED_IP_VERSIONS.",
	"ConnectionReuse": "bool; Whether the TCP connection was reused for multiple HTTP requests.",
	"DestinationTunnelID": "string; Identifier of the Cloudflare One connector to which the network session was routed to, if any, such as Cloudflare Tunnel or WARP device.",
	"DetectedProtocol": "string; Detected traffic protocol of the network session.",
	"DeviceID": "string; Identifier of the client device which initiated the network session, if applicable, (for example, WARP Device ID).",
	"DeviceName": "string; Name of the client device which initiated the network session, if applicable, (for example, WARP Device ID).",
	"EgressColoName": "string; The name of the Cloudflare colo from which traffic egressed to the origin.",
	"EgressIP": "string; Source IP used when egressing traffic from Cloudflare to the origin.",
	"EgressPort": "int; Source port used when egressing traffic from Cloudflare to the origin.",
	"EgressRuleID": "string; Identifier of the egress rule that was applied by the Secure Web Gateway, if any.",
	"EgressRuleName": "string; The name of the egress rule that was applied by the Secure Web Gateway, if any.",
	"Email": "string; Email address associated with the user identity which initiated the network session.",
	"IngressColoName": "string; The name of the Cloudflare colo to which traffic ingressed.",
	"Offramp": "string; The type of destination to which the network session was routed. Possible values are INTERNET | MAGIC | CFD_TUNNEL | WARP.",
	"OriginIP": "string; The IP of the destination (\"origin\") for the network session.",
	"OriginPort": "int; The port of the destination origin for the network session.",
	"OriginTLSCertificateIssuer": "string; The issuer of the origin TLS certificate.",
	"OriginTLSCertificateValidationResult": "string; The result of validating the TLS certificate of the origin. Possible values are VALID | EXPIRED | REVOKED | HOSTNAME_MISMATCH | NONE | UNKNOWN.",
	"OriginTLSCipher": "string; TLS cipher suite used in the connection between Cloudflare and the origin.",
	"OriginTLSHandshakeDurationMs": "int; Duration of handshaking the TLS connection between Cloudflare and the origin in milliseconds.",
	"OriginTLSVersion": "string; TLS protocol version used in the connection between Cloudflare and the origin.",
	"Protocol": "string; Network protocol used for this network session. Possible values are TCP | UDP | ICMP | ICMPV6.",
	"RuleEvaluationDurationMs": "int; The duration taken by Secure Web Gateway applying applicable Network, HTTP, and Egress rules to the network session in milliseconds.",
	"SessionEndTime": "int or string; The network session end timestamp with nanosecond precision.",
	"SessionID": "string; The identifier of this network session.",
	"SessionStartTime": "int or string; The network session start timestamp with nanosecond precision.",
	"SourceIP": "string; Source IP of the network session.",
	"SourceInternalIP": "string; Local LAN IP of the device. Only available when connected via a GRE/IPsec tunnel on-ramp.",
	"SourcePort": "int; Source port of the network session.",
	"UserID": "string; User identity where the network session originated from. Only applicable for WARP device clients.",
	"VirtualNetworkID": "string; Identifier of the virtual network configured for the client."
}
