{
	"AttackCampaignID": "string; Unique identifier of the attack campaign that this packet was a part of, if any.",
	"AttackID": "string; Unique identifier of the mitigation that matched the packet, if any.",
	"AttackVector": "string; Descriptive name of the type of attack that this packet was a part of, if any. Only for packets matching rules contained within the Cloudflare L3/4 managed ruleset.",
	"ColoCity": "string; The city where the Cloudflare datacenter that received the packet is located.",
	"ColoCode": "string; The Cloudflare datacenter that received the packet (nearest IATA airport code).",
	"ColoCountry": "string; The country where the Cloudflare datacenter that received the packet is located (ISO 3166-1 alpha-2).",
	"ColoGeoHash": "string; The latitude and longitude where the colo that received the packet is located (Geohash encoding).",
	"ColoName": "string; The unique site identifier of the Cloudflare datacenter that received the packet (for example, 'ams01', 'sjc01', 'lhr01').",
	"Datetime": "int or string; The date and time the event occurred at the edge.",
	"DestinationASN": "int; The ASN associated with the destination IP of the packet.",
	"DestinationASNName": "string; The name of the ASN associated with the destination IP of the packet.",
	"DestinationCountry": "string; The country where the destination IP of the packet is located (ISO 3166-1 alpha-2).",
	"DestinationGeoHash": "string; The latitude and longitude where the destination IP of the packet is located (Geohash encoding).",
	"DestinationPort": "int; Value of the Destination Port header field in the TCP or UDP packet.",
	"Direction": "string; The direction in relation to customer network. Possible values are ingress | egress.",
	"GREChecksum": "int; Value of the Checksum header field in the GRE packet.",
	"GREEtherType": "int; Value of the EtherType header field in the GRE packet.",
	"GREHeaderLength": "int; Length of the GRE packet header, in bytes.",
	"GREKey": "int; Value of the Key header field in the GRE packet.",
	"GRESequenceNumber": "int; Value of the Sequence Number header field in the GRE packet.",
	"GREVersion": "int; Value of the Version header field in the GRE packet.",
	"ICMPChecksum": "int; Value of the Checksum header field in the ICMP packet.",
	"ICMPCode": "int; Value of the Code header field in the ICMP packet.",
	"ICMPType": "int; Value of the Type header field in the ICMP packet.",
	"IPDestinationAddress": "string; Value of the Destination Address header field in the IPv4 or IPv6 packet.",
	"IPDestinationSubnet": "string; Computed subnet of the Destination Address header field in the IPv4 or IPv6 packet (/24 for IPv4; /64 for IPv6).",
	"IPFragmentOffset": "int; Value of the Fragment Offset header field in the IPv4 or IPv6 packet.",
	"IPHeaderLength": "int; Length of the IPv4 or IPv6 packet header, in bytes.",
	"IPMoreFragments": "int; Value of the More Fragments header field in the IPv4 or IPv6 packet.",
	"IPProtocol": "int; Value of the Protocol header field in the IPv4 or IPv6 packet.",
	"IPProtocolName": "string; Name of the protocol specified by the Protocol header field in the IPv4 or IPv6 packet.",
	"IPSourceAddress": "string; Value of the Source Address header field in the IPv4 or IPv6 packet.",
	"IPSourceSubnet": "string; Computed subnet of the Source Address header field in the IPv4 or IPv6 packet (/24 for IPv4; /64 for IPv6).",
	"IPTTL": "int; Value of the TTL header field in the IPv4 packet or the Hop Limit header field in the IPv6 packet.",
	"IPTTLBuckets": "int; Value of the TTL header field in the IPv4 packet or the Hop Limit header field in the IPv6 packet, with the last digit truncated.",
	"IPTotalLength": "int; Total length of the IPv4 or IPv6 packet, in bytes.",
	"IPTotalLengthBuckets": "int; Total length of the IPv4 or IPv6 packet, in bytes, with the last two digits truncated.",
	"IPv4Checksum": "int; Value of the Checksum header field in the IPv4 packet.",
	"IPv4DSCP": "int; Value of the Differentiated Services Code Point header field in the IPv4 packet.",
	"IPv4DontFragment": "int; Value of the Don't Fragment header field in the IPv4 packet.",
	"IPv4ECN": "int; Value of the Explicit Congestion Notification header field in the IPv4 packet.",
	"IPv4Identification": "int; Value of the Identification header field in the IPv4 packet.",
	"IPv4Options": "string; List of Options numbers included in the IPv4 packet header.",
	"IPv6DSCP": "int; Value of the Differentiated Services Code Point header field in the IPv6 packet.",
	"IPv6ECN": "int; Value of the Explicit Congestion Notification header field in the IPv6 packet.",
	"IPv6ExtensionHeaders": "string; List of Extension Header numbers included in the IPv6 packet header.",
	"IPv6FlowLabel": "int; Value of the Flow Label header field in the IPv6 packet.",
	"IPv6Identification": "int; Value of the Identification extension header field in the IPv6 packet.",
	"MitigationReason": "string; Reason for applying a mitigation to the packet, if any. Possible values are BLOCKED | RATE_LIMITED |UNEXPECTED | CHALLENGE_NEEDED | CHALLENGE_PASSED | NOT_FOUND | OUT_OF_SEQUENCE | ALREADY_CLOSED.",
	"MitigationScope": "string; Whether the packet matched a local or global mitigation, if any. Possible values are local | global.",
	"MitigationSystem": "string; Which Cloudflare system sampled the packet. Possible values are dosd | flowtrackd | magic-firewall.",
	"Outcome": "string; The action that Cloudflare systems took on the packet. Possible values are pass | drop.",
	"ProtocolState": "string; State of the packet in the context of the protocol, if any. Possible values are OPEN | NEW | CLOSING | CLOSED.",
	"RuleID": "string; Unique identifier of the rule contained within the Cloudflare L3/4 managed ruleset that this packet matched, if any.",
	"RuleName": "string; Human-readable name of the rule contained within the Cloudflare L3/4 managed ruleset that this packet matched, if any.",
	"RulesetID": "string; Unique identifier of the Cloudflare L3/4 managed ruleset containing the rule that this packet matched, if any. Possible values are 3b64149bfa6e4220bbbc2bd6db589552.",
	"RulesetOverrideID": "string; Unique identifier of the rule within the accounts root ddos_l4 phase ruleset which resulted in an override of the default sensitivity or action being applied/evaluated, if any.",
	"SampleInterval": "int; The sample interval is the inverse of the sample rate. For example, a sample interval of 1000 means that this packet was randomly sampled from 1 in 1000 packets. Sample rates are dynamic and based on the volume of traffic.",
	"SourceASN": "int; The ASN associated with the source IP of the packet.",
	"SourceASNName": "string; The name of the ASN associated with the source IP of the packet.",
	"SourceCountry": "string; The country where the source IP of the packet is located (ISO 3166-1 alpha-2).",
	"SourceGeoHash": "string; The latitude and longitude where the source IP of the packet is located (Geohash encoding).",
	"SourcePort": "int; Value of the Source Port header field in the TCP or UDP packet.",
	"TCPAcknowledgementNumber": "int; Value of the Acknowledgement Number header field in the TCP packet.",
	"TCPChecksum": "int; Value of the Checksum header field in the TCP packet.",
	"TCPDataOffset": "int; Value of the Data Offset header field in the TCP packet.",
	"TCPFlags": "int; Value of the Flags header field in the TCP packet.",
	"TCPFlagsString": "string; Human-readable string representation of the Flags header field in the TCP packet.",
	"TCPMSS": "int; Value of the MSS option header field in the TCP packet.",
	"TCPOptions": "string; List of Options numbers included in the TCP packet header.",
	"TCPSACKBlocks": "string; List of the SACK Blocks option header in the TCP packet.",
	"TCPSACKPermitted": "int; Value of the SACK Permitted option header in the TCP packet.",
	"TCPSequenceNumber": "int; Value of the Sequence Number header field in the TCP packet.",
	"TCPTimestampECR": "int; Value of the Timestamp Echo Reply option header in the TCP packet.",
	"TCPTimestampValue": "int; Value of the Timestamp option header in the TCP packet.",
	"TCPUrgentPointer": "int; Value of the Urgent Pointer header field in the TCP packet.",
	"TCPWindowScale": "int; Value of the Window Scale option header in the TCP packet.",
	"TCPWindowSize": "int; Value of the Window Size header field in the TCP packet.",
	"UDPChecksum": "int; Value of the Checksum header field in the UDP packet.",
	"UDPPayloadLength": "int; Value of the Payload Length header field in the UDP packet.",
	"Verdict": "string; The action that Cloudflare systems think should be taken on the packet. Possible values are pass | drop."
}
