{
	"ClientResponseCode": "int; Integer value of the response code Cloudflare presents to the client. Response code follows [IANA parameters](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml#dns-parameters-6).",
	"ClusterID": "string; The ID of the cluster which handled this request.",
	"ColoCode": "string; IATA airport code of data center that received the request.",
	"EDNSSubnet": "string; IPv4 or IPv6 address information corresponding to the [EDNS Client Subnet (ECS)](https://developers.cloudflare.com/glossary/?term=ecs) forwarded by recursive resolvers. Not all resolvers send this information.",
	"EDNSSubnetLength": "int; Size of the [EDNS Client Subnet (ECS)](https://developers.cloudflare.com/glossary/?term=ecs) in bits. For example, if the last octet of an IPv4 address is omitted (`192.0.2.x.`), the subnet length will be 24.",
	"QueryDO": "bool; Indicates if the client is capable of handling a signed response (DNSSEC answer OK).",
	"QueryName": "string; Name of the query that was sent.",
	"QueryRD": "bool; Indicates if the client means a recursive query (Recursion Desired).",
	"QuerySize": "int; The size of the query sent from the client in bytes.",
	"QueryTCP": "bool; Indicates if the query from the client was made via TCP (if false, then UDP).",
	"QueryType": "int; Integer value of query type. For more information refer to [Query type](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml#dns-parameters-4).",
	"ResponseCached": "bool; Whether the response was cached or not.",
	"ResponseCachedStale": "bool; Whether the response was cached stale. In other words, the TTL had expired and the upstream nameserver was not reachable.",
	"ResponseReason": "string; Short descriptions with more context around the final DNS Firewall response. Refer to [response reasons](https://developers.cloudflare.com/dns/dns-firewall/analytics/) for more information.",
	"SourceIP": "string; IP address of the client (IPv4 or IPv6).",
	"Timestamp": "int or string; Timestamp at which the query occurred.",
	"UpstreamIP": "string; IP of the upstream nameserver (IPv4 or IPv6).",
	"UpstreamResponseCode": "int; Integer value of the response code from the upstream nameserver. Response code follows [IANA parameters](https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml#dns-parameters-6)",
	"UpstreamResponseTimeMs": "int; Upstream response time in milliseconds."
}
