{
	"AccountID": "string; Cloudflare account tag.",
	"Action": "string; Action performed by gateway on the HTTP request.",
	"BlockedFileHash": "string; Hash of the file blocked in the response, if any.",
	"BlockedFileName": "string; File name blocked in the request, if any.",
	"BlockedFileReason": "string; Reason file was blocked in the response, if any.",
	"BlockedFileSize": "string; File size(bytes) blocked in the response, if any.",
	"BlockedFileType": "string; File type blocked in the response eg. exe, bin, if any.",
	"Datetime": "int or string; The date and time the corresponding HTTP request was made.",
	"DestinationIP": "string; Destination ip of the request.",
	"DestinationPort": "string; Destination port of the request.",
	"DeviceID": "string; UUID of the device where the HTTP request originated from.",
	"DeviceName": "string; The name of the device where the HTTP request originated from (for example, 'Laptop MB810').",
	"DownloadMatchedDlpProfileEntries": "array[string]; List of matched DLP entries in the HTTP request.",
	"DownloadMatchedDlpProfiles": "array[string]; List of matched DLP profiles in the HTTP request.",
	"DownloadedFileNames": "array[string]; List of files downloaded in the HTTP request.",
	"Email": "string; Email used to authenticate the client.",
	"FileInfo": "object; Information about files detected within the HTTP request.",
	"ForensicCopyStatus": "string; Status of any associated forensic copies that may have been captured during the request.",
	"HTTPHost": "string; Content of the host header in the HTTP request.",
	"HTTPMethod": "string; HTTP request method.",
	"HTTPStatusCode": "int; HTTP status code gateway returned to the user. Zero if nothing was returned (for example, client disconnected).",
	"HTTPVersion": "string; Version name for the HTTP request.",
	"IsIsolated": "bool; If the requested was isolated with Cloudflare Browser Isolation or not.",
	"PolicyID": "string; The gateway policy UUID applied to the request, if any.",
	"PolicyName": "string; The name of the gateway policy applied to the request, if any.",
	"PrivateAppAUD": "string; The private app AUD, if any.",
	"Quarantined": "bool; If the request content was quarantined.",
	"Referer": "string; Contents of the referer header in the HTTP request.",
	"RequestID": "string; Cloudflare request ID. This might be empty on bypass action.",
	"SessionID": "string; Network session ID.",
	"SourceIP": "string; Source ip of the request.",
	"SourceInternalIP": "string; Local LAN IP of the device. Only available when connected via a GRE/IPsec tunnel on-ramp.",
	"SourcePort": "string; Source port of the request.",
	"URL": "string; HTTP request URL.",
	"UntrustedCertificateAction": "string; Action taken when an untrusted origin certificate error occurs (for example, expired certificate, mismatched common name, invalid certificate chain, signed by non-public CA). One of none | block | error | passThrough.",
	"UploadMatchedDlpProfileEntries": "array[string]; List of matched DLP entries in the HTTP request.",
	"UploadMatchedDlpProfiles": "array[string]; List of matched DLP profiles in the HTTP request.",
	"UploadedFileNames": "array[string]; List of files uploaded in the HTTP request.",
	"UserAgent": "string; Contents of the user agent header in the HTTP request.",
	"UserID": "string; User identity where the HTTP request originated from."
}
