{
	"Application": "string; The unique public ID of the application on which the event occurred.",
	"ClientAsn": "int; Client AS number.",
	"ClientBytes": "int; The number of bytes read from the client by the Spectrum service.",
	"ClientCountry": "string; Country of the client IP address.",
	"ClientIP": "string; Client IP address.",
	"ClientMatchedIpFirewall": "string; Whether the connection matched any IP Firewall rules. UNKNOWN = No match or Firewall not enabled for spectrum; UNKNOWN | ALLOW | BLOCK_ERROR | BLOCK_IP | BLOCK_COUNTRY | BLOCK_ASN | WHITELIST_IP | WHITELIST_COUNTRY | WHITELIST_ASN.",
	"ClientPort": "int; Client port.",
	"ClientProto": "string; Transport protocol used by client; tcp | udp | unix.",
	"ClientTcpRtt": "int; The TCP round-trip time in nanoseconds between the client and Spectrum.",
	"ClientTlsCipher": "string; The cipher negotiated between the client and Spectrum. In v1, an unknown cipher returned as \"Unknown.\" In v2, it's returned as \"UNK.\"",
	"ClientTlsClientHelloServerName": "string; The server name in the Client Hello message from client to Spectrum.",
	"ClientTlsProtocol": "string; The TLS version negotiated between the client and Spectrum; unknown | none | SSLv3 | TLSv1 | TLSv1.1 | TLSv1.2 | TLSv1.3.",
	"ClientTlsStatus": "string; Indicates state of TLS session from the client to Spectrum; UNKNOWN | OK | INTERNAL_ERROR | INVALID_CONFIG | INVALID_SNI | HANDSHAKE_FAILED | KEYLESS_RPC.",
	"ColoCode": "string; IATA airport code of data center that received the request.",
	"ConnectTimestamp": "int or string; Timestamp at which both legs of the connection (client/edge, edge/origin or nexthop) were established.",
	"DisconnectTimestamp": "int or string; Timestamp at which the connection was closed.",
	"Event": "string; connect | disconnect | clientFiltered | tlsError | resolveOrigin | originError.",
	"IpFirewall": "bool; Whether IP Firewall was enabled at time of connection.",
	"OriginBytes": "int; The number of bytes read from the origin by Spectrum.",
	"OriginIP": "string; Origin IP address.",
	"OriginPort": "int; Origin port.",
	"OriginProto": "string; Transport protocol used by origin; tcp | udp | unix.",
	"OriginTcpRtt": "int; The TCP round-trip time in nanoseconds between Spectrum and the origin.",
	"OriginTlsCipher": "string; The cipher negotiated between Spectrum and the origin. In v1, an unknown cipher returned as \"Unknown.\" In v2, it's returned as \"UNK.\"",
	"OriginTlsFingerprint": "string; SHA256 hash of origin certificate. In v1, an unknown SHA256 hash is returned as \"0000000000000000000000000000000000000000000000000000000000000000.\" In v2, it's returned as an empty string.",
	"OriginTlsMode": "string; If and how the upstream connection is encrypted; unknown | off | flexible | full | strict.",
	"OriginTlsProtocol": "string; The TLS version negotiated between Spectrum and the origin; unknown | none | SSLv3 | TLSv1 | TLSv1.1 | TLSv1.2 | TLSv1.3.",
	"OriginTlsStatus": "string; The state of the TLS session from Spectrum to the origin; UNKNOWN | OK | INTERNAL_ERROR | INVALID_CONFIG | INVALID_SNI | HANDSHAKE_FAILED | KEYLESS_RPC.",
	"ProxyProtocol": "string; Which form of proxy protocol is applied to the given connection; off | v1 | v2 | simple.",
	"Status": "int; A code indicating reason for connection closure.",
	"Timestamp": "int or string; Timestamp at which the event took place."
}
