{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2013/cloudflare-breaks-the-speed-limit-with-railgun-web-optimization-technology/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "2486a71f-3ec3-5b0f-9742-e80bd2fbfd13",
				"title": "Cloudflare Breaks the Speed Limit With Railgun Web Optimization Technology",
				"contentfulId": "3JfbdVJozZyoLubXVrqu4H",
				"metaTags": null,
				"subtitle": "Majority of Web Hosting Providers Roll Out Cloudflare's Railgun; First to Cache at Byte-Level for Dynamic Content Performance",
				"orderDate": "2013-02-26",
				"body": "<p><strong>SAN FRANCISCO, CA -- (Marketwire) -- 02/26/13 -- </strong>\n  <a href=\"https://www.cloudflare.com\">Cloudflare</a>, the web performance and security company, today announced that the company's Railgun web optimization protocol is now accelerating web performance for hundreds of customers, and has been adopted by a majority of the world's leading hosting providers.</p>\n<p>\"At Cloudflare, our mission is to build a faster, safer web,\" explained Matthew Prince, Co-founder and CEO of Cloudflare. \"To further improve the performance of an increasingly dynamic, API-driven Internet, we needed to reinvent some of its 23-year-old protocols. Railgun goes beyond what traditional performance boosting technology has provided, making even highly dynamic content load faster than ever before.\"\nCloudflare's Railgun protocol is based on delta compression technology. Rather than caching at the object level, as is standard with traditional web protocols and last-generation content delivery networks, Railgun allows content caching down to the individual bytes within an object. This allows even highly dynamic content to be accelerated for the first time. Based on tests of hundreds of sites and mobile apps, Railgun's byte-level caching optimizes dynamic content to achieve an average 143 percent improvement in load times, a 50 percent reduction in bandwidth usage and a 90 percent decrease in the time to first byte (TTFB).</p>\n<p>The majority of the world's largest hosting providers and platforms are now Cloudflare Optimized Hosting Partners, who have adopted the Railgun protocol. As of today, 040hosting, A2 Hosting, Arvixe, Bluehost, ByetHost, CoreCommerce, DreamHost, ELServer, FastDomain, GreenGeeks, HostPapa, HostMonster, Just Host, InterServer, MapleTime, (mt) Media Temple, MDDHosting, NameCheap, PacificHost, PRO ISP, SiteGround, Sliqua Enterprise Hosting, Softcloud Hosting, SparkRed, VentraIP, VEXXHOST, WebHostingBuzz, WebHostingPad, x10Hosting and Zuver offer Railgun to customers through a single click and without any software installation or code changes. In addition, Cloudflare today released packages that make it easy for Rackspace and Amazon Web Services customers to install Railgun.</p>\n<p>\"While Railgun's performance gains are ground-breaking, we knew that would mean nothing if the technology never made it out of the lab,\" said Michelle Zatlyn, Co-founder and Head of User Experience at Cloudflare. \"Cloudflare's rapidly growing community of Optimized Hosting Partners means there is a new standard for speed and performance online, and it has never been easier for businesses to delight their customers and recognize the full potential of their sites and apps.\"</p>\n<p>End Users of Cloudflare's Railgun are raving about the speed improvement, bandwidth savings, and ease of use:\n\"Speed is an important feature at Imgur, and the entire site is designed to run as fast as possible,\" said Alan Schaaf, CEO of the high traffic image sharing site, Imgur. \"We're really excited to use Railgun to take it even further. Not only has it helped speed up the delivery of our HTML content so far, it's also saving us 50 percent on our HTML bandwidth.\"</p>\n<p>\"thredUP.com serves parents, the busiest of all consumers. We're competing against epic tantrums for mom's time, so our children's clothing shopping experience needs to be fast and flawless,\" said Chris Homer, CTO of thredUP. \"Getting Railgun enabled was incredibly easy and has allowed us to deliver the fastest possible web experience for our customers, so mom can get back to what matters.\"</p>\n<p>\"I feel Cloudflare is the most relevant thing to happen to the Internet since Google,\" said Chris Holland, Director of Technology at Luxury Link. \"Using Railgun, the HTML for our home page loads 40 percent faster from the East Coast in the United States. Measurements we've run from London showed a 2x speedup, which will be invaluable in positioning ourselves as a global player in the travel industry.\"\nCloudflare's Optimized Hosting partners see Railgun as a significant advancement in Web technology:</p>\n<p>\"Bluehost is excited to offer Cloudflare's amazing Railgun technology to our customers,\" said Dan Handy, CEO of Bluehost. \"We love that our customers can have performance gains above and beyond an already great Cloudflare offering. The improvement in speed between Railgun and a standard website is surprisingly large in our testing.\"</p>\n<p>\"Installing Railgun was fast and easy,\" said Jonathan LaCour, Vice President of Product and Development at DreamHost. \"We've connected our data centers directly to the Cloudflare network, turbocharging customer sites that were previously difficult to accelerate. Cloudflare's Railgun is a real performance breakthrough.\"</p>\n<p>\"(mt) Media Temple strives to offer unique, compelling, and innovative services to our customers. Our partners at Cloudflare have always helped us exceed our customer's high expectations in the past, but this time they have raised the bar with the release of Railgun,\" said Dante Baker, Shared Hosting Product Manager of Media Temple. \"We're very excited to be one of the first digital service companies providing a solution that was previously thought to not be feasible in the Web Hosting industry. We know it will be a great tool in helping clients achieve improved performance results, while still maintaining the levels of security that Cloudflare has become known for.\"</p>",
				"omitBoilerplate": true,
				"boilerplate": "<p><strong>About Cloudflare</strong><br>\nCloudflare, Inc. (<a href=\"https://www.cloudflare.com\">www.cloudflare.com</a> / @cloudflare) makes sites twice as fast, protects them from attacks, ensures they are always online, and makes it simple to add web apps with a single click. Cloudflare supercharges websites regardless of size or platform with no need to add hardware, install software, or change a line of code. The Cloudflare community gets stronger as it grows; every new site makes the network smarter. Thanks to our awesome sauce technology, every month more than 1 billion people experience a faster, safer, better Internet. Cloudflare is recognized by the World Economic Forum as a Technology Pioneer, was named the 2011 &amp; 2012 Most Innovative Network &amp; Internet Technology Company of the Year by the Wall Street Journal, and ranked among the World's Most Innovative Companies of 2012 by Fast Company. Cloudflare is based in San Francisco, California, USA.</p>\n\n<pre>Daniella Vallurupalli\nCommunications\ndaniella@cloudflare.com\npress@cloudflare.com\n650-483-4463</pre>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "2486a71f-3ec3-5b0f-9742-e80bd2fbfd13",
			"locale": "en-US",
			"pathname": "/press-releases/2013/cloudflare-breaks-the-speed-limit-with-railgun-web-optimization-technology/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}