{
	"app_name": "1.1.1.1-macOS",
	"app_display_name": "Cloudflare WARP macOS Beta",
	"app_os": "macOS",
	"owner": {
		"name": "Cloudflare",
		"display_name": "Cloudflare"
	},
	"is_external_build": false,
	"origin": "appcenter",
	"id": 2347,
	"version": "20230119.12",
	"short_version": "2022.12.595.1",
	"size": 47744840,
	"min_os": null,
	"device_family": null,
	"bundle_identifier": "fbcf73a90068800569bac2605de31bd8",
	"fingerprint": "58ca8ca9e415ce406159359daaef6cd2",
	"uploaded_at": "2023-01-19T20:26:39.950Z",
	"mandatory_update": false,
	"enabled": true,
	"fileExtension": "zip",
	"is_latest": true,
	"release_notes": "This release has support for new Zero Trust network location aware feature and contains improvements to stability and bug fixes.\n \n## Hotfix Updates\n- Fixed issue where clients could lose IPv4 connectivity (2nd hotfix applied).\n- Fixed issue where clients would attempt to configure DNS even when in posture-only, or proxy modes.\n- Increased MDM file timeout to improve compatibility with certain management solutions.\n  \n## Notable updates in previous GA (2022.12.475.0)\n- Added support for new Zero Trust network location aware WARP feature. More info to be released soon on how you can test.\n- Improved captive portal handling for some more captive portals.\n- Improved reconnect logic when a setting changes to no longer always do a full disconnect->reconnect cycle (for instance when turning on DNS logging).\n- Modified initial connectivity check behavior to now validate both IPv4 and IPv6 are working (previously we only checked IPv4). Test will pass if either connects successfully.\n- Fixed issue where client could be stuck on `Connecting` if certain DNS checks failed once.\n- Fixed DNS issue where TXT records were not being correctly returned when at the end of a CNAME chain.\n- Fixed issue where the client may not receive notifications of new settings, re-auth events or posture from the service until reboot.\n- Fixed issue where users could be pointing at an old gateway_doh_subdomain if you have `Allowed to Leave` set to true and they've manually joined their client to your organization.\n- Fixed slow DNS timeout issue that could occur when IPv6 is enabled and an NXDOMAIN record is returned.\n- Fixed issue with `Gateway with DoH` mode could say `Connected` when it wasn't really connected as we could sometimes test the wrong endpoint.\n- Fixed issue where our local DNS proxy server could get unset with an overly active DHCP renew time or by plugging in/out a tethered device.\n- Fixed issue where `warp-cli teams-enroll` wouldn't work when an mdm file was present.\n- Fixed issue where our localhost dns endpoints (ex. 127.0.2.2) c",
	"is_udid_provisioned": null,
	"can_resign": null,
	"package_hashes": [],
	"destination_type": "group",
	"status": "available",
	"distribution_group_id": "8d228a4a-99fe-426c-ad9f-623db9d82323",
	"distribution_groups": [
		{
			"id": "8d228a4a-99fe-426c-ad9f-623db9d82323",
			"name": "Beta",
			"origin": "appcenter",
			"display_name": "Beta",
			"is_public": true
		}
	]
}