{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-and-28-partner-organizations-celebrate-fifth-anniversary-of/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "891baa04-0647-5247-a435-264a9144a02d",
				"title": "Cloudflare and 28 Partner Organizations Celebrate Fifth Anniversary of Project Galileo ",
				"contentfulId": "2jS8rTtXeYqGbVMT5im3l",
				"metaTags": null,
				"subtitle": "Project Galileo protects nearly 600 vulnerable groups online, for free ",
				"orderDate": "2019-06-12",
				"body": "San Francisco, CA, June 12, 2019 — [Cloudflare](https://www.cloudflare.com), a leading Internet performance, security, and reliability company, is today celebrating the fifth anniversary of [Project Galileo](https://www.cloudflare.com/galileo), an initiative that equips politically and artistically important organizations and journalists with powerful tools to defend themselves against attacks that would otherwise censor their work, at no cost. To mark the anniversary, Cloudflare is offering a look at the program's momentum, statistics, and growing recipient base. \n\nThe Internet is a powerful tool for spreading and amplifying ideas. Cloudflare launched Project Galileo in 2014 as a response to cyber attacks launched against important, yet vulnerable targets, such as artistic groups, humanitarian organizations, and the voices of political dissent. Such organizations often face attacks from powerful and entrenched opponents, yet operate on limited budgets and lack the resources to secure themselves against malicious traffic intended to silence them. \n\n\"Cloudflare's mission is to help build a better Internet. When journalists, social activists, and social welfare groups are repeatedly flooded with malicious traffic in an attempt to knock them offline, and keep them offline, the Internet stops fulfilling its promise,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Project Galileo is one of the initiatives I'm most proud of, and in concert with our critical partners, the program has helped to keep vulnerable voices online.\"\n\nKey attack statistics from the last month include: \n- Every single Project Galileo recipient has been subject to attacks in the last month\n- The average Project Galileo site saw malicious traffic for 27 days out of the 30 day period \n- 60% of sites experienced daily attacks \n- Cloudflare's Web Application Firewall (WAF) blocked more than 4.5 million requests\n\nThe nearly 600 recipients of Project Galileo include Bullying Canada, VOST Portugal, Women's March Global, Free Mom Hugs, and Majal.org (formerly Mideast Youth): \n\n  \"After we moved onto Cloudflare, our site reliability was restored. Without Galileo, we'd have to invest a lot of money into getting the same kind of protection. We're a non-profit with very limited resources and we need to invest them wisely. For us to be able to get this level of protection from Cloudflare for free—it's a huge help.\" - [Majal.org](https://Majal.org) \n\n  \"Free Mom Hugs provides a platform to help advocate for and provide resources to the LGBTQ+ community. Because we work to connect people and build community, our online presence is crucial. Cloudflare's Project Galileo has enabled us to withstand cyber attacks and carry out our mission.\" - [Free Mom Hugs](https://www.freemomhugs.org/) \n\n  \"At BullyingCanada, we focus on giving a voice and resources to bullied youth in our communities. We rely on Cloudflare through Project Galileo to keep our site accessible and secure at all times so that youth, families, and teachers have access to all of the resources necessary to stop bullying situations and achieve brighter, healthier futures.\" - [BullyingCanada](https://www.bullyingcanada.ca/)\n\n  \"Our mission at Women's March Global is to unite women worldwide in order to advance women's human rights. We use our online platform to achieve this goal and need it to be both reliable and affordable, no matter how many people visit our site or how many attacks we see. Using Project Galileo has allowed us to enormously reduce our costs and devote those funds instead to making our platform even better for users, and therefore, better for women worldwide.\" - [Women's March Global](https://womensmarchglobal.org/) \n\n  \"Digital citizenship really works. We still live under the impression that, for some of us, volunteering means stepping out of our comfort zone, and where our knowledge might not be needed, but that couldn't be farther from the truth. However, doing so requires having a reliable and secure website. With unplanned crises and events, such as natural disasters or strikes, happening at any given time, the tools provided through Project Galileo help us bring reliable information to the population and get people involved, in a timely and effective manner, with no downtime whatsoever.\" - [VOST Portugal](https://vost.pt/) \n\nCloudflare offers services through Project Galileo to any proposed recipient if referred or approved by any of the trusted partners. In five years, the number of Project Galileo partners has grown from 15 to 28, and includes groups such as the National Democratic Institute (NDI), the Center for Democracy and Technology (CDT), Fourth Estate, and Access Now: \n\n  \"Our partnership with Cloudflare has allowed many organizations on the frontlines of democracy development to stay online in the face of attacks from authoritarians or extremists. Doing so allows NDI to advance its mission to support and strengthen democratic institutions around the world,\" said Martin Colburn, Chief Technology Officer at the [National Democratic Institute](https://www.ndi.org/). \"We joined Project Galileo as a partner in 2017 to expand our role in keeping these voices and organizations online so that they can continue to do their important work.\"\n\n  \"We've been a proud partner of Project Galileo since its launch five years ago and continue to believe in its importance. Digital human rights are crucial to the future of the Internet, and Cloudflare has shown great leadership in ensuring that vulnerable content online cannot be silenced by attacks,\" said Joe Hall, Chief Technologist at the [Center for Democracy & Technology](https://cdt.org/).\n\n  \"A healthy society is only possible if it has a sustainable and vibrant free press,\" said Jeff Brown, Executive Director of Fourth Estate Public Benefit Corporation. \"As such, [Fourth Estate](https://www.fourthestate.org/) has partnered with Cloudflare's Project Galileo to help press organizations and independent journalists access free services to keep their voices online. It's a cause that is both worthy and necessary for the benefit of societies worldwide.\"\n\n  \"Attacks on civil society websites are a reality. In particular, DDoS attacks continue to censor speech and are a real threat to so many groups across the globe,\" said Brett Solomon, Executive Director of [Access Now](https://www.accessnow.org/). \"Cloudflare's Project Galileo stood up to this global threat five years ago, providing a reliable and effective mechanism to defend the most at-risk users from being taken off the Internet.\" \n\nTo learn more about Project Galileo and its recipients and partners, check out the resources below. \n\n- [Project Galileo](https://www.cloudflare.com/galileo)\n- [Project Galileo Anniversary Blog Post](https://blog.cloudflare.com/project-galileo-fifth-anniversary/)\n\n\n\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "891baa04-0647-5247-a435-264a9144a02d",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-and-28-partner-organizations-celebrate-fifth-anniversary-of/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}