{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-announces-strong-network-expansion-and-new-office-in-q4-2018/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "b775f08b-abd5-5a52-8713-a2141c87ccf8",
				"title": "Cloudflare Announces Strong Network Expansion and New Office in Q4 2018 ",
				"contentfulId": "60rmk5KDp02vC7GRb1F51O",
				"metaTags": null,
				"subtitle": "The company announced its first mobile application and reached nearly one million downloads in first month",
				"orderDate": "2019-02-07",
				"body": "San Francisco, CA, February 7, 2019 — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced results from the fourth quarter of 2018. In the final three months of the year, Cloudflare continued to expand its global footprint with 10 new data centers, launched its first mobile application, and opened a new office in Munich, Germany.\n\n“We closed out 2018 with significant network expansion, our first consumer application, and a new European office,” said Matthew Prince, co-founder and CEO of Cloudflare. “I’m proud of the growth our team accomplished in the final quarter, as we brought our network even closer to our global users and opened an office to be closer to our European users.” \n\nCloudflare’s new data centers bring its network to 165 global points of presence. With these additions in the United States, Bahrain, Russia, Vietnam, Pakistan, and France (Reunion), Cloudflare announced a total of 46 new cities in 2018. \n\nCloudflare also [announced](https://blog.cloudflare.com/1-thing-you-can-do-to-make-your-internet-safer-and-faster/) its first mobile application, the [1.1.1.1 app](https://1.1.1.1/). Cloudflare launched the 1.1.1.1 DNS offering in March 2018 to provide users with a faster and more private Internet browsing experience. The 1.1.1.1 app allows iOS and Android users to quickly toggle 1.1.1.1 on and off on their phones to easily access an encrypted browsing experience. Since launching the 1.1.1.1 app in November, nearly one million users have downloaded the app. \n\nCloudflare also [published an update](https://blog.cloudflare.com/protecting-elections-one-year-retrospective/) on the one year anniversary of the [Athenian Project](https://www.cloudflare.com/athenian/), an effort to restore confidence in democracy by providing vulnerable election websites with Cloudflare’s enterprise-level service, for free. \n\nIn December 2018, Cloudflare received high scores from the [2018 Gartner Critical Capabilities report for Cloud Web Application Firewalls (WAFs)](https://www.cloudflare.com/lp/cloudflare-gets-high-scores-gartner-critical-capabilities/)*. In addition, Cloudflare is continuing to expand its network across the world and now has a network capacity of 20Tbps. \n\nCloudflare had more than 865 employees at the end of 2018, up from 539 just over a year ago as the company continues to grow its engineering, sales, marketing, and support teams across its offices worldwide. \n\nTo learn more about Cloudflare, please check out the resources below. \n\n\n- [Cloudflare Network Map](https://www.cloudflare.com/network)\n\n- [Cloudflare Blog](https://blog.cloudflare.com)\n\n*Gartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "b775f08b-abd5-5a52-8713-a2141c87ccf8",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-announces-strong-network-expansion-and-new-office-in-q4-2018/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}