{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-announces-pricing-of-initial-public-offering/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "5082b583-06e6-5b2b-96df-bf1f620f0dde",
				"title": "Cloudflare Announces Pricing of Initial Public Offering",
				"contentfulId": "XtE1VMGOac9ncHVqEmHfM",
				"metaTags": null,
				"subtitle": null,
				"orderDate": "2019-09-12",
				"body": "San Francisco, CA, September 12, 2019 – [Cloudflare](https://www.cloudflare.com) (NYSE: NET) today announced the pricing of its initial public offering of its Class A common stock at a price to the public of $15 per share. Cloudflare is offering 35,000,000 shares of its Class A common stock, plus up to an additional 5,250,000 shares that the underwriters have the option to purchase at the initial public offering price less underwriting discounts. The shares are expected to begin trading on the New York Stock Exchange on September 13, 2019 under the ticker symbol “NET” and the offering is expected to close on September 17, 2019, subject to customary closing conditions. \n\nGoldman Sachs & Co. LLC, Morgan Stanley & Co. LLC, and J.P. Morgan Securities LLC are acting as joint lead book-running managers for the offering. Jefferies LLC, Wells Fargo Securities, LLC, and RBC Capital Markets, LLC are also acting as joint book-running managers. JMP Securities LLC, Evercore Group L.L.C., Needham & Company, LLC, Oppenheimer & Co. Inc., BTIG, LLC, and SunTrust Robinson Humphrey, Inc. are acting as co-managers for the offering.\n\nA registration statement relating to these securities has been filed with, and declared effective by, the Securities and Exchange Commission on September 12, 2019. This offering is being made only by means of a prospectus, copies of which may be obtained from: Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, or by telephone at (866) 471-2526; Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014; or J.P. Morgan Securities LLC, Attention: Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, or by telephone, at (866) 803-9204.\n\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\n\n__Contacts:__\n\n__Press__\n\nDaniella Vallurupalli\n\npress@cloudflare.com\n\n__Investors__\n\nJayson Noland\n\nIR@cloudflare.com\n\n",
				"omitBoilerplate": true,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "5082b583-06e6-5b2b-96df-bf1f620f0dde",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-announces-pricing-of-initial-public-offering/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}