{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-launches-amp-real-url-to-give-publishers-and-site-owners-more/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "f5075cab-8532-5237-a5cc-c776c35246ad",
				"title": "Cloudflare Launches AMP Real URL to Give Publishers and Site Owners More Control Over Their Brands",
				"contentfulId": "McA9GjLX20GTt3nnsTcda",
				"metaTags": null,
				"subtitle": "Teaming up with Google, AMP Real URL will extend the benefits of AMP while giving publishers more control of their content and analytics ",
				"orderDate": "2019-04-16",
				"body": "San Francisco, CA, April 16, 2019 — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced that it is launching AMP Real URL, to give Accelerated Mobile Pages (AMP) publishers the ability to display content under their own unique domains, rather than AMP-generated domains. With AMP Real URL, Cloudflare customers using AMP can get all the performance benefits of AMP without sending visitors to a domain they do not control.\n\nThe [AMP Project](https://amp.dev/), founded by Google, is an open-source initiative aimed at optimizing mobile content and making it available anywhere, instantly. AMP is great at providing content quickly to users and is especially crucial for driving traffic to eCommerce sites and news publishers. Google Search directs Internet users to AMP-enabled results (identified by a lightning bolt). Historically, AMP required the Google URL to appear in a browser’s address bar, meaning that publishers could not display their own domains and direct visitors to their own sites. AMP Real URL keeps traffic on publishers’ sites, giving them control over their pages, analytics, and the way their content is displayed to users. \n\nTo build this at scale, Cloudflare worked with Google to implement an emerging standard called [Signed Exchanges](https://tools.ietf.org/id/draft-yasskin-http-origin-signed-responses-04.html). This technology, paired with Cloudflare’s global network of 175 data centers in 75+ countries, allows Cloudflare to digitally sign each AMP page it delivers to Google’s AMP Cache. Supported browsers will now show actual domains (example.com) instead of the Google AMP URL (google.com/amp/example.com) so that publishers can control their own cookies, analytics, and brand in their URL bar. Cloudflare is currently the only company with a CDN solution to implement AMP Signed Exchanges. Cloudflare customers can enable this feature with one-click on their dashboards, and it will roll out over the next few weeks. \n\n“The AMP Project has allowed site owners and publishers to deliver fast content globally and monetize their sites. We’ve enjoyed working with Cloudflare to develop solutions to make AMP the best it can be,” said Malte Ubl, Technical Lead for the AMP Project at Google. “Cloudflare Workers made this seamless to develop and deploy, and will help scale better AMP URLs to the web community.” \n\nPublishers and website owners using Cloudflare and AMP will experience:\n- __Brand Protection:__ Instead of featuring content on a Google domain, publishers will now be able to direct AMP traffic to their primary website domain. \n- __Easier Analytics:__ AMP Real URL greatly simplifies web analytics for its users by ensuring all visitors, AMP or otherwise, can coexist on the same domain.\n- __Increased Screen Space:__ Publishers can enjoy more space to display their content on mobile screens. Previously, publishers using AMP had to make room for a “grey bar” at the top of their pages—space they could otherwise use for their own branding and monetization purposes.\n- __Reduced Bounce Rate:__ Website visitors may be more likely to stay on sites with publisher-branded domains.\n- __Content Signing:__ By relying on cryptographic techniques, AMP Real URL ensures that the content delivered to visitors has not been manipulated, protecting the sites and brands it is used on.\n\n“AMP has been a great solution to improve the performance of the Internet and we were eager to work with the AMP Project to help eliminate one of AMP’s biggest issues—that it wasn’t served from a publisher's perspective,” said Matthew Prince, co-founder and CEO of Cloudflare. “As the only provider currently enabling this new solution, our global scale will allow publishers everywhere to benefit from a faster and more brand-aware mobile experience for their content.” \n\nMedia, eCommerce, and recruiting organizations are eager to use AMP Real URL to further take advantage of the benefits of AMP:\n \n“AMP has played a key role in helping us to more effectively reach our audience and develop our online community. We’re keen to use AMP Real URL to better manage our online presence and keep our users engaged on the site,\" said Andrew Warner, CTO of Genius. \n\n“AMP is a crucial part of helping our business to grow and reach consumers everywhere, said Sumantro Das, Senior Director, Product Innovations & Growth Brands GM, 1-800-FLOWERS.COM. “With AMP Real URL, we now have more control over our brand and can run analytics on our business site.”\n\n“The performance benefits of AMP deliver value to our business and we are excited to see how AMP Real URL is able to take that even further,” said Solomon Moskalenko, Director of Interactive, US Xpress Trucking, The Johnson Group.\n\nAMP Real URL is built on top of the same [Cloudflare Workers](https://www.cloudflare.com/products/cloudflare-workers/) infrastructure which thousands of developers use to deploy code on top of Cloudflare’s global network. Today, Cloudflare customers can enable AMP Real URL, for free. To learn more about AMP Real URL, check out the resources below. \n\n- [AMP Real URL Product Page](https://www.cloudflare.com/website-optimization/amp-real-url/) \n- [AMP Real URL Blog](https://blog.cloudflare.com/announcing-amp-real-url/) \n\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "f5075cab-8532-5237-a5cc-c776c35246ad",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-launches-amp-real-url-to-give-publishers-and-site-owners-more/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}