{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-announces-magic-transit-to-make-enterprise-networks-smarter/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "a48f16e3-adcf-5c7b-9208-299d4ba29d06",
				"title": "Cloudflare Announces Magic Transit to Make Enterprise Networks Smarter, Faster, and More Secure",
				"contentfulId": "3MzJwL0TtR8FWpLatoU6IC",
				"metaTags": null,
				"subtitle": "Magic Transit connects and protects customers’ data center networks and simplifies IT operations ",
				"orderDate": "2019-08-13",
				"body": "San Francisco, CA, August 13, 2019 — [Cloudflare](https://www.cloudflare.com), a leading Internet security, performance, and reliability company, today announced Magic Transit, a product that extends the benefits of Cloudflare’s network to customers’ on-premise and data center networks. Magic Transit allows customers to send any packet of data, of any protocol, across Cloudflare’s network.\n\nMagic Transit deployed in front of an enterprise network protects it from DDoS attacks and enables provisioning of a full suite of virtual network functions, including IP packet filtering and firewalling, load balancing, and traffic management tools. Cloudflare's network, which spans 193 cities in more than 90 countries, has more capacity to stop DDoS attacks than Akamai Prolexic, Imperva, Neustar, and Radware—combined. \n\nCloudflare has always focused on protecting and accelerating specific applications, typically websites and APIs. Cloudflare started with support for HTTP. In April 2018, Cloudflare launched [Spectrum](https://www.cloudflare.com/products/cloudflare-spectrum/) to extend the benefits of Cloudflare’s network to protect and accelerate a broader set of Transmission Control Protocol (TCP) and Universal Datagram Protocol (UDP) applications, such as email servers, gaming servers, and IoT devices. With Magic Transit, Cloudflare’s network benefits extend beyond just sites and applications to a customer’s entire Internet Protocol (IP) network footprint.\n\n\n“We have gotten very good at securing and accelerating anything on the web, but wanted to extend our capabilities to everyone,” said Matthew Prince, co-founder and CEO of Cloudflare. “With Magic Transit, customers can use us to secure and accelerate any packet for any protocol, across any path.” \n\nMagic Transit uses all of Cloudflare’s global Anycast network to intelligently route good traffic and filter attacks. This is in contrast to traditional network security hardware and service offerings that concentrate traffic in a limited set of locations, adding latency and reducing security effectiveness.\n\n“When we showed the product to customers that were using traditional DDoS mitigation and security tools, they were blown away,” explained Rustam Lalkaka, a director of product at Cloudflare. “They kept saying, ‘This is like magic!’ So there was only one logical name for the product: Magic Transit.”\n\nFor customers using Magic Transit, the benefits will include: \n\n- __Layer 3 DDoS Mitigation:__ Virtually instantaneous mitigation across Cloudflare’s network protects L3 IP traffic from DDoS attacks. \n- __Improved Performance:__ More than 19 million Internet properties currently run on Cloudflare’s network, and with every bit it moves, the network gets smarter and faster. When integrated with Argo Smart Routing, Cloudflare’s solution will deliver clean traffic back to customers’ networks using the fastest, most reliable links in real-time.\n- __Lower Total Cost of Ownership:__ Customers can protect their networks without large hardware expenditures and recurring maintenance contracts. \n\nCustomers and partners have expressed a need for Magic Transit: \n\n> “I’m excited about Magic Transit — the potential to unify our IP transit, DDoS mitigation, and traffic steering solutions into something we can manage with a single pane of glass will be game-changing,” said Jesse Heraldson, Principal Software Architect at Thomson Reuters. “Cloudflare continues to impress me with its network’s scale, in terms of geography, capacity, and product breadth.”\n> \n> “As the lines between corporate infrastructure and cloud services continue to converge, Cloudflare's modern approach to protecting infrastructure is a much-needed solution for the industry,” said Aaron Edwards, Field CTO at Cloudgenix. “The ability for Magic Transit to leverage the power and scale of cloud services to protect infrastructure, while maintaining per IP configuration and optionality, all while routing traffic performantly across Cloudflare's global network, makes it a no-brainer.”\n\nTo learn more about Magic Transit, please check out the resources below. \n\n- [Magic Transit](https://www.cloudflare.com/magic-transit) \n- [Magic Transit Blog](https://blog.cloudflare.com/magic-transit) \n- [Magic Transit Technical Blog](https://blog.cloudflare.com/magic-transit-network-functions/)\n\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "a48f16e3-adcf-5c7b-9208-299d4ba29d06",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-announces-magic-transit-to-make-enterprise-networks-smarter/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}