{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-registers-trademark-for-the-network-is-the-computer/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "38e39167-eb98-530c-808d-fca8b9f97c17",
				"title": "Cloudflare Registers Trademark for The Network is the Computer®",
				"contentfulId": "7laDjjiYB9y0YrhbjqKnE8",
				"metaTags": null,
				"subtitle": "Former Sun Microsystems phrase highlights Cloudflare’s leadership in serverless edge computing",
				"orderDate": "2019-07-11",
				"body": "San Francisco, CA, July 11, 2019 — [Cloudflare](https://www.cloudflare.com), a leading Internet security, performance, and reliability company, today announced that it has successfully registered with the United States Patent and Trademark Office the trademark for the phrase, “The Network is the Computer.” Cloudflare took on this trademark as it embodies the company’s approach to utilizing its network to pave the way for the future of the Internet. \n\nThe phrase was first coined in 1984 by John Gage, the 21st employee of Sun Microsystems, where he was credited with building Sun’s vision around “The Network is the Computer.” When Sun was acquired in 2010, the trademark was not renewed, but the vision remained. \n\n“When we built Sun Microsystems, every computer we made had the network at its core. But we could only imagine, over thirty years ago, today’s billions of networked devices, from the smallest camera or light bulb to the largest supercomputer, sharing their packets across Cloudflare’s distributed global network,” said John Gage, former Vice President, Chief Researcher, and Head of the Science Office at Sun Microsystems. “We based our vision of an interconnected world on open and shared standards. Cloudflare extends this dedication to new levels by openly sharing designs for security and resilience in the post-quantum computer world.\"\n\nCloudflare's massive network, which spans more than 180 cities in 80 countries, enables the company to deliver its suite of security, performance, and reliability products, including its serverless edge computing offerings. \n\nIn March of 2018, Cloudflare launched its serverless solution, [Cloudflare Workers](https://www.cloudflare.com/products/cloudflare-workers/), for anyone to deploy code at the edge of its network across the world. Cloudflare also recently announced [advancements to Cloudflare Workers](https://workers.cloudflare.com/) in June of 2019 to give application developers the ability to do away with cloud regions, VMs, servers, containers, load balancers—all they need to do is write the code, and Cloudflare does the rest. With each of Cloudflare’s data centers acting as a highly scalable application origin to which users are automatically routed via Anycast, code is run within milliseconds of users worldwide. \n\n“We stand on the shoulders of giants and I’ve always looked to Sun Microsystems as a computing company that was years ahead of its time. Their incredible achievements in computing paved the way for us to become the company we are today,” said Matthew Prince, co-founder and CEO of Cloudflare. “We’ve long been focused on helping to build a better Internet, and our sights are set on building the world’s best edge computing platform, so adopting this visionary phrase was a no-brainer for us.” \n\nCloudflare has experienced continuous network growth, with its global Anycast network now powering more than 18 million domains, websites, APIs, and mobile applications and now interconnected with more than 7,500 networks globally, including major ISPs, cloud services, and enterprises. The company operates within approximately 100 milliseconds of 98 percent of the Internet-connected population in the developed world and 93 percent of the Internet-connected population globally.  \n\nIn honor of acquiring Sun’s former trademark, John Graham-Cumming, CTO of Cloudflare, spoke with John Gage, Greg Papadopoulos, former CTO of Sun Microsystems, and Ray Rothrock, former Director of CAD/CAM Marketing at Sun Microsystems, to learn more about the history of the phrase and what it means for the future: \n\n- [John Gage](https://blog.cloudflare.com/john-gage/) \n- [Ray Rothrock](https://blog.cloudflare.com/ray-rothrock/)\n- [Greg Papadopoulos](https://blog.cloudflare.com/greg-papadopoulos/)\n\nTo learn more about Cloudflare, please check out the resources below. \n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [Cloudflare Blog](https://blog.cloudflare.com/) \n\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "38e39167-eb98-530c-808d-fca8b9f97c17",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-registers-trademark-for-the-network-is-the-computer/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}