{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-announces-the-1-1-1-1-app-with-warp-to-make-mobile-internet-suck-less/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "99ec0d68-a5f4-5f4f-be39-0330ce5acc88",
				"title": "Cloudflare Announces the 1.1.1.1 App with Warp to Make Mobile Internet Suck Less ",
				"contentfulId": "6N7UE9dlMIcyVRB21kX8ba",
				"metaTags": null,
				"subtitle": "Warp technology makes the mobile experience faster, more reliable, and more secure for all connections and mobile applications",
				"orderDate": "2019-04-01",
				"body": "San Francisco, CA, April 1, 2019 — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced the [1.1.1.1 App with Warp,](https://1.1.1.1) which will give users a faster, more reliable, more private, and more secure Internet experience automatically for every request on every mobile app on iOS and Android. \n\nCloudflare operates one of the world’s largest networks. A year ago it used the power of that network to launch the world’s [fastest public DNS resolver: 1.1.1.1](https://blog.cloudflare.com/announcing-1111/). The 1.1.1.1 App with Warp ensures that all connections from mobile devices are encrypted to prevent third-parties from snooping. The app takes advantage of Cloudflare’s global network to improve mobile Internet reliability, automatically routing around Internet brownouts and slowdowns, and it speeds up connections for better performance. \n\nCloudflare’s global network of more than 175 data centers provides the backbone for this advancement. Today, Cloudflare runs one of the most interconnected networks in the world, allowing it to directly interconnect with the majority of the world’s largest mobile networks. “Cloudflare is already the largest provider of reverse-proxy services,” said John Graham-Cumming, CTO of Cloudflare. “With the launch of the 1.1.1.1 App with Warp, we bring the power of our massive global network to the forward-proxy market.”\n\nBehind the scenes, the 1.1.1.1 App with Warp provides full Virtual Private Network (VPN) functionality. VPNs have typically been slow and have sucked up battery life for mobile devices. Cloudflare completely rethought how VPNs should work and discarded old, slow approaches, creating new technology that is significantly more performant, secure, and flexible, and less resource-intensive for devices. By leveraging modern encryption methods from the Noise Protocol Framework, and building on recent Internet protocol advances such as QUIC and HTTP/3, the 1.1.1.1 App with Warp is more performant, secure, and lighter-weight than existing VPN technologies, all while saving battery life. \n\n“At the end of the day, our mission is to help build a better Internet by making it faster, more secure and more reliable for everyone in the world,” said Matthew Prince, co-founder and CEO of Cloudflare. “We’ve fundamentally changed how web properties connected to the Internet; now we are bringing the same technology to anyone who wants a faster, more secure, and more reliable mobile Internet experience.” \n\n1.1.1.1 App with Warp users will experience: \n\n- __Better Performance Across All Mobile Apps:__ Mobile connections are even faster while using less data and conserving battery life. \n- __Heightened Privacy & Security:__ All connections from mobile devices will be encrypted, preventing snooping from ISPs and third parties. \n- __Increased Reliability:__ Optimized mobile connections improve the mobile experience in “dead spot” areas or during times of congestion (e.g. at concerts or sporting events). \n\nTo sign up for the beta of the 1.1.1.1 App with Warp, users should download the free 1.1.1.1 App on [iOS](https://itunes.apple.com/us/app/1-1-1-1-faster-internet/id1423538627?mt=8) or [Android](https://play.google.com/store/apps/details?id=com.cloudflare.onedotonedotonedotone&hl=en_US), or update their existing 1.1.1.1 app to be placed in a queue. Each user will be notified when Warp is available for them to use. Users who do not want to use Warp will be able to continue using the 1.1.1.1 App in DNS-only mode. Basic Warp will be free and the even faster Warp+ will be available for a monthly fee. \n\nTo learn more about the 1.1.1.1 App with Warp, check out the resources below. \n\n- [1.1.1.1 App with Warp Blog](https://blog.cloudflare.com/1111-warp-better-VPN) \n- [1.1.1.1 Product Page](https://1.1.1.1)\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "99ec0d68-a5f4-5f4f-be39-0330ce5acc88",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-announces-the-1-1-1-1-app-with-warp-to-make-mobile-internet-suck-less/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}