{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-partners-with-tencent-cloud-to-further-expand-bandwidth-alliance/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "da30a679-930f-5029-b83e-c296d4d9f1b1",
				"title": "Cloudflare Partners with Tencent Cloud to Further Expand Bandwidth Alliance ",
				"contentfulId": "7jb4bu2BYh2iLqg3WGIPeh",
				"metaTags": null,
				"subtitle": null,
				"orderDate": "2019-06-24",
				"body": "San Francisco, CA, June 24, 2019 — [Cloudflare](https://www.cloudflare.com), a leading Internet performance, security, and reliability company, today announced that it has expanded the Bandwidth Alliance by partnering with [Tencent Cloud](https://intl.cloud.tencent.com/), one of the world's leading providers of cloud computing and Internet value-added services. Now, joint customers of Cloudflare and Tencent Cloud will pay zero data transfer fees for all traffic between their networks outside of China. \n\nIn September 2018, Cloudflare [announced](https://blog.cloudflare.com/bandwidth-alliance/) the [Bandwidth Alliance](https://www.cloudflare.com/bandwidth-alliance/), a group of forward-thinking cloud and networking companies that are committed to discounting or waiving data transfer fees (also known as bandwidth fees) for shared customers. The Bandwidth Alliance was launched with 10 partners, all committed to providing the most performant and cost-efficient experience for mutual customers, and has now nearly doubled to 18 partners. Tencent Cloud is a division of Tencent Holdings Limited, one of the world's largest Internet services providers.\n\n\"People everywhere want faster, more secure, and more reliable Internet,\" said Cloudflare co-founder and CEO, Matthew Prince. \"In working with Tencent, and other partners, we are better positioned to address the numerous challenges that are faced by enterprises as they expand internationally, to help users everywhere experience the best Internet possible.\" \n\nTencent Cloud's global presence and decades of experience in delivering digital engagement to its massive user base make it an ideal addition to the Bandwidth Alliance. Tencent Cloud offers powerful and robust cloud solutions that are used extensively across the gaming and media industries in key regions such as Silicon Valley, Frankfurt, Singapore, and Bangkok, in addition to its extensive presence in China. Both Tencent and Cloudflare have long supported enterprises and users within the gaming and media industries, and this alignment will help both companies expand these relationships internationally. \n\n\"Tencent Cloud is committed to providing leading cloud services to enterprises and developers across the globe. By joining the Bandwidth Alliance, we hope to elevate our efforts in serving our global customers and contribute to the global cloud ecosystem together with partners like Cloudflare,\" commented Davy Wang, Associate General Manager of Tencent Cloud International. \n\nCloudflare has long had an international presence, with co-location facilities in more than 180 cities across more than 80 countries, including China. \n\nTo learn more about Cloudflare and the Bandwidth Alliance, please check out the resources below. \n\n- [Bandwidth Alliance](https://www.cloudflare.com/bandwidth-alliance/) \n- [Bandwidth Alliance Blog](https://blog.cloudflare.com/bandwidth-alliance/) \n- [Bandwidth Alliance Expansion Blog](https://blog.cloudflare.com/expanding-the-bandwidth-alliance-sharing-the-benefits-of-interconnected-networks/)\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "da30a679-930f-5029-b83e-c296d4d9f1b1",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-partners-with-tencent-cloud-to-further-expand-bandwidth-alliance/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}