{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-partners-with-top-analytics-providers-to-give-customers-even/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "d7f9140f-7024-5349-99fe-f8069f948bf3",
				"title": "Cloudflare Partners with Top Analytics Providers to Give Customers Even More Insights Into Their Internet Properties",
				"contentfulId": "7MaLeBOVtxD6QCsmAHQImN",
				"metaTags": null,
				"subtitle": "Integrations with Chronicle Security, Datadog, Elastic, Looker, Splunk, and Sumo Logic simplify log metrics",
				"orderDate": "2019-06-25",
				"body": "San Francisco, CA, June 25th, 2019 — [Cloudflare](https://www.cloudflare.com), a leading Internet performance, security, and reliability company, today announced that it has partnered with Chronicle Security, Datadog, Elastic, Looker, Splunk, and Sumo Logic to make Internet performance and security analytics easier than ever. Shared customers can now view security events and traffic trends from any of their Internet properties, while combining Cloudflare logs with other data sources. This provides customers with improved end-to-end visibility along with customized monitoring and alerting for prioritized events—all in their preferred analytics platform.\n\nHistorically, extracting and analyzing information from raw data logs through third-party analytics platforms required technical expertise. Cloudflare's integrations remove that complexity. Now shared customers can easily access and customize their Cloudflare logs and metrics within the analytics tools they already use. Pre-built Cloudflare dashboards can be used to analyze detailed web traffic attributes, understand attacks and mitigations, and gain performance insights. These new integrations offer numerous filters to narrow the analysis by date and time, geographic location, device type, and other attributes to analyze events down to each individual HTTP request.\n\n\"Customers should have access to easy-to-use tools that give them insights into their Internet properties,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Now Cloudflare customers can seamlessly integrate with the analytics platforms they are already using.\" \n\nCustomers using Cloudflare's Analytics Partnerships will experience:\n\n- __Platform Flexibility:__ Gives customers the flexibility to use the analytics platform which best suits their analytics needs.\n- __Ease of Use:__ Simplifies the setup experience to give customers quick access to integrations. \n- __Granular Insights:__ Features pre-built and customizable dashboards with nearly 100 reports which enable customers to gain visibility into the security, performance, and reliability of their Internet properties on Cloudflare's global network.\n- __End-to-End Visibility:__ Combines Cloudflare logs with other data sources, such as origin server data, for improved end-to-end visibility.\n- __Monitoring & Alerting:__ Allows customers to specify which events to be notified on, such as 404 errors or Firewall rules triggered.\n\n__Cloudflare Analytics Partners:__\n\n\"Companies need continuous intelligence from their modern applications and security solutions in order to provide their customers with the best digital experiences possible. We're excited to partner with Cloudflare and provide a cloud-native machine data analytics platform to help our mutual customers get rich and fast insights about events and trends from their websites and applications on the Cloudflare network.\" - John Coyle, VP of Business Development, Sumo Logic.\n\n\"Our customers rely on Datadog for complete observability across their services, so they can catch issues before they become outages. Our partnership with Cloudflare adds valuable traffic, performance, and security metrics that provide greater context and save time when it counts.\" - Marc Weisman, Director of Product Management, Datadog\n\n\"Cloudflare provides a new and unique level of context within our analytics system. The integration provides our customers with world-class visibility into threats within their networks.\" - Ansh Patnaik, Chief Product Officer, Chronicle Security. \n\n__Cloudflare Analytics Customers:__ \n\n\"The Cloudflare integration and dashboard for Sumo Logic have helped us keep our eye directly on traffic, security, and performance. The integration was simple and worked straight out of the box. This collection of dashboards saves me hours of work and has provided value since day one.\" - Matthew Justice, Director of Engineering, TicketCity\n\n\"Cloudflare's Log Push and Dashboard App [Sumo Logic] allows us to obtain complete end-to-end visibility of our logs and ensures we can build a holistic threat intel view for our entire platform.\" - Steven Rogers, Senior Systems Security Specialist, Ansarada \n\n\"The dashboards are very well structured—we couldn't track the data with this level of granularity before, which is useful for monitoring on a day-to-day basis, but also in the context of new feature launches or troubleshooting. The app doesn't require my constant intervention, and data flows in automatically, which is a big bonus for my time management. This has brought us value that we didn't have before.\" - Diana Streche, Data Engineer, Adore Me. \n\nToday, Cloudflare customers can make use of Cloudflare's integrations with their preferred analytics provider. To learn more about Cloudflare's Analytics Partnerships, check out the resources below. \n\n- [Cloudflare Logs](https://www.cloudflare.com/products/cloudflare-logs/)\n- [Cloudflare Analytics Partnerships Blog](https://blog.cloudflare.com/cloudflare-partners-with-analytics-providers) \n- [Cloudflare Analytics Partnerships Page](https://www.cloudflare.com/partners/analytics/)\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "d7f9140f-7024-5349-99fe-f8069f948bf3",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-partners-with-top-analytics-providers-to-give-customers-even/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}