{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-announces-global-growth-in-first-quarter-of-2019/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "2eacd4f2-a5d4-5311-8cc0-496207f45aad",
				"title": " Cloudflare Announces Global Growth in First Quarter of 2019",
				"contentfulId": "4BUAeJHMI1JMCfXE8x8PrY",
				"metaTags": null,
				"subtitle": "The company now protects more than 16 million Internet properties and has more than 175 data centers globally ",
				"orderDate": "2019-05-02",
				"body": "San Francisco, CA, May 2, 2019 — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced company momentum and growth from the first quarter of 2019. Cloudflare now protects more than 16 million domains, websites, APIs, mobile applications, and anything connected to the Internet, up from just 8 million one year ago. \n\n\"The first quarter is an important one for any company, and we took the opportunity to build out our board, grow our global footprint, and open new offices in key locations around the world,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Cloudflare has continued to expand its network to bring our services to users everywhere, while continuing to scale our company.\" \n\n__Board Members__<br>\nIn February, the company announced two appointments to its board of directors, Stan Meresman, former CFO of Silicon Graphics, and Maria Eitel, founder and co-chair of the Nike Foundation. Eitel and Meresman joined Cloudflare's existing board of directors, which includes NEA Managing Director Scott Sandell, Pelion Venture Managing Partner Carl Ledbetter, Cloudflare Co-Founder and CEO Matthew Prince, and Cloudflare Co-Founder and COO Michelle Zatlyn.\n\n__Network Growth__<br>\nCloudflare's network has seen tremendous growth over the last year. In Q1, Cloudflare added 10 new cities, growing its network to 175 data centers across more than 75 countries globally, Cloudflare also increased its network capacity to 30Tbps. \n\n__Industry Recognition__<br>\nCloudflare was named a \"Leader\" in the [IDC MarketScape: Worldwide DDoS Prevention Solutions 2019 Vendor Assessment](https://www.cloudflare.com/lp/idc-ddos-marketscape/). The IDC MarketScape recognized Cloudflare for its strengths, including rapid onboarding process, unique architecture, flexible pricing options, and unmetered and always-on DDoS protection.\n\n__Employees__<br>\nCloudflare had 960 employees at the end of Q1, up from 625 just one year ago, and opened an office in Beijing, China, in addition to an office in Sydney, Australia. Cloudflare now has eleven offices globally and continues to grow its engineering, sales, marketing, and support teams worldwide. \n\nTo learn more about Cloudflare, please check out the resources below. \n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [Cloudflare Blog](https://blog.cloudflare.com) \n\n\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "2eacd4f2-a5d4-5311-8cc0-496207f45aad",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-announces-global-growth-in-first-quarter-of-2019/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}