{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-announces-support-for-http-3-to-serve-the-modern-internet/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "fbc0c14e-a4de-5b6d-b028-66e9e8c7d6c6",
				"title": "Cloudflare Announces Support for HTTP/3 to Serve the Modern Internet",
				"contentfulId": "9u3ENk5pGZWi2eIzb4juZ",
				"metaTags": null,
				"subtitle": "In concert with Google Chrome and Mozilla Firefox, Cloudflare is bringing the next-generation protocol to Internet users, at scale",
				"orderDate": "2019-09-26",
				"body": "San Francisco, CA, September 26, 2019 — [Cloudflare](https://www.cloudflare.com) (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, today announced support for HTTP/3, the new standard of the web that will make the Internet faster, more secure, and more reliable, for everyone. Cloudflare has been collaborating with industry peers, including Google Chrome and Mozilla Firefox, to bring HTTP/3 to the masses and progress the Internet into the future. \n\nAn efficient Internet requires the adoption of common, shared protocols to allow computers all over the world to communicate with each other. HTTP is the protocol modern websites, APIs, apps, and browsers are built on. Older versions of HTTP suffer from problems that frustrate users operating in real world conditions. HTTP/3, built on top of [QUIC](https://cloudflare-quic.com/), is designed for the modern Internet. It will speed up connections and make use of the web more reliable and secure, especially for mobile devices. \n\n\"Pushing forward next-generation protocols is part of our mission to help build a better Internet,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Previously, the benefits of HTTP/3 were limited to the Internet giants like Facebook and Google. Now, we're democratizing access to the next generation of Internet technologies by bringing HTTP/3 to everyone, for free.\"\n\n\"In 2015, Cloudflare helped pioneer the widespread use of HTTP/2 and today HTTP/2 is the dominant standard used by millions every day,\" said John Graham-Cumming, CTO of Cloudflare. \"As we roll out HTTP/3 at scale, we expect millions to use it before the end of the month and help upgrade the web once again.\" \n\nStaying up to date on the latest protocols is vital to get the most secure and performant Internet experience. Older protocols get ripped out and replaced, meaning anyone lagging behind eventually gets cut off. Innovations in the HTTP/3 standard include: \n- __Encryption by default:__ Connections are automatically encrypted with faster connection establishment than the traditional combination of TCP handshake and TLS negotiation.\n- __Improved performance:__ Through the elimination of head of line blocking, addition of zero round trip time connection establishment, simplification of loss recovery, and other changes to make connections more robust, performance will be improved. This is especially true in the suboptimal network conditions often experienced by mobile devices. \n- __Support for network migration:__ Connections can move across networks and IP addresses without interruption. \n\nCloudflare worked closely with the teams at Google Chrome and Mozilla Firefox, among others, to make HTTP/3 a reality. \n\n\"HTTP/3 should make the web better for everyone. The Chrome and Cloudflare teams have worked together closely to bring HTTP/3 and QUIC from nascent standards to widely adopted technologies for improving the web,\" said Ryan Hamilton, Staff Software Engineer at Google. \"Strong partnership between industry leaders is what makes Internet standards innovations possible, and we look forward to our continued work together.\"\n\n\"Developing a new network protocol is hard, and getting it right requires everyone to work together,\" said Eric Rescorla, CTO of Firefox. \"Over the past few years, we've been working with Cloudflare and other industry partners to test TLS 1.3 and now HTTP/3 and QUIC. Cloudflare's early server-side support for these protocols has helped us work the interoperability kinks out of our client-side Firefox implementation. We look forward to advancing the security and performance of the Internet together.\"\n\nAll Cloudflare customers can enable HTTP/3 in their dashboard today, for free. The latest version of Chrome includes support for HTTP/3 and Firefox support for HTTP/3 is expected soon. \n\nTo learn more about Cloudflare's support of HTTP/3, please check out the resources below. \n\n- [HTTP/3 Overview Blog](https://blog.cloudflare.com/http3-the-past-present-and-future/)\n",
				"omitBoilerplate": false,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "fbc0c14e-a4de-5b6d-b028-66e9e8c7d6c6",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-announces-support-for-http-3-to-serve-the-modern-internet/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}