{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-grows-network-and-launches-performance-and-cryptography/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "4b87e591-8fd0-5b4e-aa68-2386b3c8b2f1",
				"title": "Cloudflare Grows Network and Launches Performance and Cryptography Solutions in Q2",
				"contentfulId": "1Xh4EizDLC0acd5NMiLyXY",
				"metaTags": null,
				"subtitle": "Cloudflare’s global network now serves more than 18 million Internet properties ",
				"orderDate": "2019-07-11",
				"body": "San Francisco, CA, July 11, 2019 — [Cloudflare](https://www.cloudflare.com), a leading Internet security, performance, and reliability company, today announced that it protects and optimizes more than 18 million Internet properties as of the second quarter of 2019, an increase of more than two million from last quarter. This is made possible through Cloudflare’s global network, which spans more than 180 cities in 80 countries and counts millions of websites as paying customers. \n\nCloudflare announced a number of partnerships in the second quarter of 2019. Tencent Cloud, one of the world’s leading providers of cloud computing and Internet value-added services, joined the [Bandwidth Alliance](https://www.cloudflare.com/bandwidth-alliance/). Now, joint customers of Cloudflare and Tencent Cloud pay zero data transfer fees for all traffic between their networks outside of China. Cloudflare also [partnered with analytics platforms](https://www.cloudflare.com/partners/analytics/) such as Chronicle Security, Datadog, Elastic, Looker, Splunk, and Sumo Logic to enhance Internet performance and security analytics. Shared customers can now view security events and traffic trends from any of their Internet properties while combining Cloudflare logs with other data sources.\n\nCloudflare also [celebrated](https://www.cloudflare.com/press-releases/2019/cloudflare-and-28-partner-organizations-celebrate-fifth-anniversary-of/) the fifth anniversary of [Project Galileo](https://www.cloudflare.com/galileo) in June, an initiative that equips politically and artistically important organizations and journalists with powerful tools to defend themselves against attacks that would otherwise censor their work, at no cost. The Project protects nearly 600 vulnerable groups and works with 28 partner organizations.\n\n“I’m proud that for the last five years we’ve protected some of the most vulnerable groups online from cyber attacks through Project Galileo,” said Matthew Prince, co-founder and CEO of Cloudflare. “Achieving our mission of helping to build a better Internet is only possible if the most at-risk groups online have access to the services necessary to make their voices heard.” \n\nCloudflare also teamed up with Google to [launch](https://www.cloudflare.com/press-releases/2019/cloudflare-launches-amp-real-url-to-give-publishers-and-site-owners-more/) [AMP Real URL](https://www.cloudflare.com/website-optimization/amp-real-url/), a solution that gives publishers and site owners increased control over their brands, while simultaneously improving the speed and performance of mobile content. AMP Real URL enables browsers to natively display the canonical URL for publishers’ AMP content in the browser, with no additional coding required. \n\nIn May, Cloudflare announced five advancements during its first [Speed Week](https://blog.cloudflare.com/welcome-to-speed-week/) that enable a faster and more efficient Internet. Over the course of the week, Cloudflare launched the [Cloudflare Global Private Backbone](https://blog.cloudflare.com/argo-and-the-cloudflare-global-private-backbone/), improved  [HTTP/2 Prioritization](https://blog.cloudflare.com/better-http-2-prioritization-for-a-faster-web/), [parallel streaming of progressive images](https://blog.cloudflare.com/announcing-cloudflare-image-resizing-simplifying-optimal-image-delivery/), [Concurrent Streaming Acceleration](https://blog.cloudflare.com/introducing-concurrent-streaming-acceleration/), and [BinaryAST](https://blog.cloudflare.com/binary-ast/). \n\nLast month, Cloudflare celebrated its annual [Crypto Week](https://blog.cloudflare.com/welcome-to-crypto-week-2019/) by announcing five new cryptography technologies it is supporting and helping to advance, to help build a more secure Internet. These include the [League of Entropy](https://blog.cloudflare.com/league-of-entropy/), [Domain Control Validation](https://blog.cloudflare.com/secure-certificate-issuance/), [Cloudflare’s Ethereum Gateway](https://blog.cloudflare.com/cloudflare-ethereum-gateway/), the [CIRCL](https://blog.cloudflare.com/introducing-circl/) cryptographic library, and [time.cloudflare.com](https://blog.cloudflare.com/secure-time/). \n\nIn the second quarter, more than five new cities were added to Cloudflare’s global network, which now spans more than 180 cities in 80 countries worldwide. Cloudflare had 1,069 employees at the end of the second quarter, compared to 709 employees one year ago, and continues to seek talent for its engineering, sales, marketing, and support teams across its eleven offices globally. \n\nTo learn more about Cloudflare, please check out the resources below. \n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [Cloudflare Blog](https://blog.cloudflare.com) \n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "4b87e591-8fd0-5b4e-aa68-2386b3c8b2f1",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-grows-network-and-launches-performance-and-cryptography/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}