{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-to-open-office-in-lisbon-to-further-support-emea-operations/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "96150e12-eafc-531a-a77e-c2db898bb417",
				"title": "Cloudflare To Open Office in Lisbon to Further Support EMEA Operations",
				"contentfulId": "2n5nxZ3V4oyDwN94eeevtg",
				"metaTags": null,
				"subtitle": "The company expands its presence in Europe with new office in Lisbon",
				"orderDate": "2019-07-16",
				"body": "San Francisco, CA, July 16, 2019 — [Cloudflare](https://www.cloudflare.com), a leading Internet security, performance, and reliability company, today announced that Lisbon, Portugal, will be the home of its third European office, joining the company's European headquarters in London, as well as its Munich office, which opened in 2018.  The initial functions prioritized for the Lisbon location include Engineering, Security, Product, Product Strategy, Technology Research, and Customer Support. \n\n\"As Cloudflare considered locations for its third European office, Lisbon, a well-connected international hub brimming with strong local engineering talent, seemed like a clear choice,\" said Matthew Prince, co-founder and CEO of Cloudflare. \"Opening an office in Lisbon offers Cloudflare the invaluable opportunity to access a new pool of technical talent that will allow us to bring better products to market.\"\n\nCloudflare's network currently spans 71 cities in the EMEA region, compared to 59 cities in the region at the end of 2018. Cloudflare announced its network expansion into Lisbon in [2016](https://blog.cloudflare.com/amsterdam-to-zhuzhou-cloudflare-global-network/), and with data centers now in more than 180 cities around the world today, the company continues to grow its presence to be even closer to Internet-connected users everywhere. \n\nFrom the end of the first quarter of 2018 to the end of the second quarter of 2019, Cloudflare grew its EMEA team by 87 percent. Today, Cloudflare has more than 230 employees in EMEA. Cloudflare's CTO, John Graham-Cumming, will be relocating to Lisbon to build and lead this new office. Graham-Cumming said, \"Lisbon has the potential to be the next great European technology ecosystem, and I'm looking forward to this next chapter for Cloudflare. Part of our strength comes from offering a variety of locations to which we can attract people from diverse backgrounds who are excited about working at Cloudflare. I fully expect we'll build a new Cloudflare team in Lisbon that shares our culture and values but that has its own local flavour.\"\n\nAICEP Portugal Global is an independent public entity of the Government of Portugal, with the goal of attracting foreign investment to Portugal and supporting the internationalization of Portuguese companies into the global economy. AICEP's President, Luís Castro Henriques, said, \"Portugal has been able to attract technological centers that are increasingly specialized, and AICEP has been actively working to materialize these projects into more highly qualified jobs. Lisbon is proud to welcome Cloudflare, an innovative global tech company who is helping to change the way the Internet works. Cloudflare's decision to build a team in Lisbon is excellent news for our country.\"\n\n\"It was with great satisfaction that we learned of the decision of Cloudflare, another leading tech company, of North American origin, to come to Portugal and Lisbon in particular,\" said Fernando Medina, Mayor of Lisbon. \"This new investment shows that our city is doing well on the way to support the innovation and creativity that are generating highly skilled employment. This is also a contribution to the development of Lisbon and its positioning at a global level.\"\n\nFor Portugal's Secretary of State for Internationalisation Affairs, Eurico Brilhante Dias, \"another choice that reinforces Portugal as a competitive destination is its ability to attract Foreign Direct Investment of high technological value.\"\n\nWith more than 18 million Internet properties on Cloudflare's network, the company already has many customers across the EMEA region and in Portugal specifically. Cloudflare's Lisbon location will join its other global offices in San Francisco, CA, San Jose, CA, Austin, TX, Champaign, IL, New York, NY, Washington, D.C., London, Munich, Singapore, Sydney, and Beijing. \n\nTo learn more about Cloudflare, please check out the resources below:\n\n- [Cloudflare Network Map](https://www.cloudflare.com/network/)\n- [Cloudflare Careers Page](https://www.cloudflare.com/careers/locations/)\n- [Lisbon Expansion Blog (English)](https://blog.cloudflare.com/cloudflare-lisbon-office/) \n- [Lisbon Expansion Blog (Portuguese)](https://blog.cloudflare.com/cloudflare-lisbon-office-portuguese/) ",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "96150e12-eafc-531a-a77e-c2db898bb417",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-to-open-office-in-lisbon-to-further-support-emea-operations/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}