{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-named-a-leader-in-idc-marketscape-ddos-prevention-solutions/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "712c1d7d-d5a4-57b2-ab44-d22736e5e6d8",
				"title": "Cloudflare Named a Leader in IDC MarketScape DDoS Prevention Solutions Report ",
				"contentfulId": "2mp4f5uy9ZSr95PCnmxB46",
				"metaTags": null,
				"subtitle": "The company was recognized for having a unique architecture and rapid onboarding process ",
				"orderDate": "2019-03-07",
				"body": "San Francisco, CA, March 7, 2019 — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced that it has been named a Leader in the IDC MarketScape: Worldwide DDoS Prevention Solutions 2019 Vendor Assessment (doc #US43699318, March 2019), among nine other vendors. The IDC MarketScape recognized Cloudflare for its strengths, including rapid onboarding process, unique architecture, flexible pricing options, and unmetered and always-on DDoS protection.\n\nAccording to the report, “Customer feedback praised Cloudflare for its customer support, and customers were happy that support was present from implementation of the service to the end and continued to assist them every step of the way. Customers described Cloudflare as a ‘good value’ service for DDoS prevention.”\n\nThe report also noted, “Cloudflare's architecture presents a unified view of attacks across integrated stack of network, DNS, and application. Since there is no hardware component to the solution, Cloudflare can provide a cost-effective, yet high-value solution that does not consist of any upfront hardware costs or need for an OEM/third-party hardware vendor.” \n\n“At Cloudflare we are focused on helping to build a better Internet, and a huge part of that is by providing unparalleled protection against DDoS attacks of all kinds,” said Matthew Prince, co-founder and CEO of Cloudflare. “Being recognized as a leader by the IDC MarketScape is an indication that we’re addressing our customers’ needs and making the Internet better for users everywhere.” \n\nCloudflare continues to add to its network, which now includes 165+ points of presence in 76 countries. The company [announced](https://www.cloudflare.com/press-releases/2017/cloudflare-announces-unmetered-mitigation-to-make-attacks-a-thing-of-the-past/) that it was offering unmetered mitigation for all DDoS attacks in September 2017. \n\nFor more information, check out an excerpt of the IDC MarketScape: Worldwide DDoS Prevention Solutions 2019 Vendor Assessment [here](https://www.cloudflare.com/lp/idc-ddos-marketscape).\n\n__About IDC MarketScape__\n\nIDC MarketScape vendor analysis model is designed to provide an overview of the competitive fitness of ICT (information and communications technology) suppliers in a given market. The research methodology utilizes a rigorous scoring methodology based on both qualitative and quantitative criteria that results in a single graphical illustration of each vendor’s position within a given market. IDC MarketScape provides a clear framework in which the product and service offerings, capabilities and strategies, and current and future market success factors of IT and telecommunications vendors can be meaningfully compared. The framework also provides technology buyers with a 360-degree assessment of the strengths and weaknesses of current and prospective vendors.\n",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "712c1d7d-d5a4-57b2-ab44-d22736e5e6d8",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-named-a-leader-in-idc-marketscape-ddos-prevention-solutions/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}