{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2019/cloudflare-raises-usd150m-and-adds-to-board-of-directors/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "ffaaac2b-826f-5480-a4a8-0e1aab3d76df",
				"title": "Cloudflare Raises $150M and Adds to Board of Directors",
				"contentfulId": "2zSmG7xCnSJiG79KmHE8eB",
				"metaTags": null,
				"subtitle": "Founder and co-chair of Nike Foundation, Maria Eitel, and Stan Meresman join Cloudflare board",
				"orderDate": "2019-03-12",
				"body": "San Francisco, CA, March 12, 2019 — [Cloudflare](https://www.cloudflare.com), the leading Internet performance and security company, today announced that it raised $150 million in its latest round of funding, led by Franklin Templeton. The company is also announcing two appointments to its board of directors, Stan Meresman, former CFO of Silicon Graphics, and Maria Eitel, founder and co-chair of the Nike Foundation.\n\nCloudflare last raised funding in 2014, closing a round of $110 million. To date, Cloudflare has raised more than $330 million from investors including New Enterprise Associates, Union Square Ventures, Venrock, Pelion Venture Partners, Greenspring Associates, CapitalG (formerly Google Capital), Microsoft, Baidu, Qualcomm, and Fidelity. Franklin Templeton joins these investors leading this latest round of funding, which will be used to support Cloudflare’s growth, extend product ranges, and continue its international expansion into new markets.\n\nCloudflare has also continued to strengthen its board of directors with the additions of Maria Eitel and Stan Meresman. “I’m honored to welcome Maria and Stan to our board of directors,” said Matthew Prince, co-founder and CEO of Cloudflare. “Both of them bring a wealth of knowledge and experience to our board and know what it takes to propel companies forward. Our entire board looks forward to working with them as we continue to help build a better Internet.”\n\nEitel served as the president and CEO and is now the co-chair of the Nike Foundation and chair of Girl Effect, an independent nonprofit created by Nike in 2008 to focus on ending poverty globally. Eitel joined Nike in 1998 as its first vice president of corporate responsibility. She previously ran European corporate affairs for Microsoft and worked in media affairs at the White House, where she was a special assistant to President George H.W. Bush. \n\n“My career has been focused on creating global change, and the Internet is a huge part of that,” said Eitel. “The Internet has the ability to unleash human potential, and I believe that Cloudflare is one of the major players able to drive the change that’s necessary for the world and Internet community.” \n\nMeresman is a board member and chair of the Audit Committee of Guardant Health (GH), Snap (SNAP) and Medallia, and formerly served in such roles at LinkedIn, Palo Alto Networks, Zynga, Meru, Riverbed Technology, and Polycom. He was previously CFO of Silicon Graphics (SGI) and Cypress Semiconductor (CY). Meresman holds a BS in Industrial Engineering and Operations Research from University of California, Berkeley, and an MBA from Stanford Graduate School of Business.\n\n“Cloudflare’s technologies, customer base, and global network have helped propel the company to a position of leadership in the Internet ecosystem,” said Meresman. “I look forward to lending my skills and expertise to Cloudflare’s board in order to continue this growth and make even more of an impact.” \n\nEitel and Meresman join Cloudflare’s existing board of directors, which includes NEA Managing Director Scott Sandell, Pelion Venture Managing Partner Carl Ledbetter, Cloudflare Co-Founder and CEO Matthew Prince, and Cloudflare Co-Founder and COO Michelle Zatlyn.",
				"omitBoilerplate": null,
				"boilerplate": null
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "ffaaac2b-826f-5480-a4a8-0e1aab3d76df",
			"locale": "en-US",
			"pathname": "/press-releases/2019/cloudflare-raises-usd150m-and-adds-to-board-of-directors/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}