{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2014/access-electronic-frontier-foundation-eff-the-center-for-democracy-and-amp/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "c9221824-806f-5727-8c4b-f5e51f15db49",
				"title": "Access, Electronic Frontier Foundation (EFF), The Center for Democracy &amp; Technology (CDT) and Others Partner with Cloudflare to Protect Freedom of Expression on the Internet",
				"contentfulId": "4Fsc6acW4p55qu9TIvp3Hq",
				"metaTags": null,
				"subtitle": "Project Galileo provides vulnerable public interest websites with industry-leading Distributed Denial of Service (DDoS) attack protection — for free",
				"orderDate": "2014-06-12",
				"body": "<strong>San Francisco, CA, June 12, 2014</strong>\n<p>\nCloudflare, the leading Internet performance and security\ncompany, today announced Project Galileo to protect free\nexpression online. The company is working with global NGOs\nto find websites at risk of attack and provide, at no cost,\nthe same state-of-the-art mitigation technology already used\nby Cloudflare’s thousands of enterprise customers including\nnational government and Fortune 500 customers. Project Galileo\nequips politically and artistically important organizations\nand journalists with powerful tools to defend themselves\nagainst attacks that would otherwise censor their work.\n</p>\n<p>\n“Cloudflare’s mission is to build a better Internet. Bullies\nshould not be able to knock sites offline simply because they\ndisagree with their content. We realized this was an increasing\nproblem and there was something important Cloudflare could do\nto solve it,” explained Matthew Prince, co-founder and CEO of\nCloudflare. “Critical to Project Galileo’s success is that we\nalone aren’t picking who deserves protection. That’s why we’re\nproud to be working with some of the leading NGOs, spanning\nthe political spectrum, in order to identify the websites\nthat should qualify for the Project.”\n</p>\n<h3 class=\"marketing-h3\">Project Galileo partners</h3>\n<p>\nCloudflare is partnering with more than 15 civil society\norganizations — including Access, the Electronic Frontier\nFoundation (EFF), the Center for Democracy &amp; Technology\n(CDT) and the Freedom of the Press Foundation — to help\nidentify and protect politically and artistically important\nwebsites that come under DDoS attack.\n</p>\n<p>\n“Project Galileo is a breakthrough. It shows how Silicon\nValley tech companies can actively create a more secure and\nsafe Internet for the world’s most vulnerable Internet users.\nCivil society actors around the world are under attack and this\n service helps create a level of protection we would otherwise\nnot be able to access,” said Brett Solomon, executive director\nat Access. “The right to freedom of expression now has a new\nally online.”\n</p>\n<p>\nThrough Project Galileo, Cloudflare provides partnering NGOs\nwith an effective “bat phone” to call when they know a\npolitically or artistically important website is under\nattack. Once notified, Cloudflare is committed to providing,\nat no cost, the at-risk organization with the company’s most\nadvanced DDoS protection.\n</p>\n<p>\n“Cloudflare has shown remarkable leadership in its commitment\nto digital human rights, and Project Galileo is a bold\nstep in ensuring that important and often controversial\ncontent online cannot be silenced by blunt, brute-force\ndenial-of-service attacks,” said Joe Hall, chief technologist\nat the Center for Democracy &amp; Technology.\n</p>\n<h3 class=\"marketing-h3\">Project Galileo participants</h3>\n<p>\nProject Galileo website participants have come under\nincreasingly virulent, even state-sponsored, attacks.\nThe Project already protects sites including minority\nrights organizations, LGBT groups in Africa and the Middle\nEast, global citizen journalists and independent media\noutlets in the developing world.\n</p>\n<p>\n“Cloudflare’s Project Galileo can significantly help secure\nwebsites at risk, adding a layer of protection otherwise\nbeyond the reach of most NGOs, grassroots civil society\norganizations, independent journalists and activists,”\nexplained Sanjana Hattotuwa, founding editor at\n<a href=\"http://groundviews.org/\" target=\"_blank\">Groundviews</a>,\na Sri Lankan citizen journalist website protected by the\nProject. “Cloudflare helps secure information in the public\ndomain vital for accountability, human rights and justice in\nSri Lanka — and globally.”\n</p>\n<p>\nFor more information about becoming a partner or an NGO\nparticipant please visit\n<a href=\"http://www.projectgalileo.org\" target=\"_blank\">www.projectgalileo.org</a>.\n</p>",
				"omitBoilerplate": true,
				"boilerplate": "<hr>\n<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>)\nmakes sites lightning fast, protects them from attacks, ensures\nthey are always online, and makes it simple to add web apps\nwith a single click. Regardless of size or platform, Cloudflare\nsupercharges websites with no need to add hardware, install\nsoftware, or change a line of code. The Cloudflare community\ngets stronger as it grows: every new site makes the network\nsmarter. More than 5% of global web requests flow through\nCloudflare’s network daily. And, thanks to our awesome sauce\ntechnology, every month billions of people experience a\nfaster, safer, better Internet. Cloudflare was recognized by\nthe World Economic Forum as a Technology Pioneer, named the\nMost Innovative Network &amp; Internet Technology Company for two\nyears running by the Wall Street Journal, and ranked among the\nworld’s 50 most innovative companies by Fast Company.\n Cloudflare is based in San Francisco, California, USA.\n</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "c9221824-806f-5727-8c4b-f5e51f15db49",
			"locale": "en-US",
			"pathname": "/press-releases/2014/access-electronic-frontier-foundation-eff-the-center-for-democracy-and-amp/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}