{
	"componentChunkName": "component---src-components-press-releases-templates-press-release-template-tsx",
	"path": "/press-releases/2014/cloudflare-certified-at-the-highest-level-of-payment-card-industry-pci/",
	"result": {
		"data": {
			"pressRelease": {
				"id": "a7af82ea-cade-5a94-8296-4e830efcf4f0",
				"title": "Cloudflare Certified at the Highest Level of Payment Card Industry (PCI) Compliance",
				"contentfulId": "3U2xe4L7xgiLovCymoYdWI",
				"metaTags": null,
				"subtitle": "Independent assessor finds Cloudflare’s Web Application Firewall (WAF) helps companies meet PCI requirements",
				"orderDate": "2014-06-04",
				"body": "<strong>San Francisco, CA, June 4, 2014</strong>\n<p>\nCloudflare, the leading Web performance and security company,\nannounced today that it has undergone a Payment Card Industry\n(PCI) Data Security Standard (DSS) 2.0 security control\nassessment, and that it has been certified as a Level 1\nservice provider—the highest level of certification.\nCloudflare is also announcing to customers seeking PCI\ncompliance, either as merchants or service providers, that\nthey can now utilize Cloudflare’s Web Application Firewall\n(WAF) to meet Requirement 6.6 of PCI DSS 2.0 and PCI DSS 3.0.\n</p>\n<p>\nPCI DSS is a worldwide payment card security standard. The\nrequirements of this standard are designed to optimize the\nsecurity of digitally-transferred user information. This\nrecent certification not only benefits Cloudflare and its\ncustomers, but it also helps protect online consumers making\npurchases on a site within the Cloudflare network.\n</p>\n<p>\n“Cloudflare’s mission is to build a better Internet. Critical\nto that is ensuring our network meets the highest standards\nfor security,” explained Matthew Prince, co-founder and CEO\nof Cloudflare. “Being Level 1 certified means our clients are\nassured that their data is secure while it travels across\nCloudflare’s global network. Moreover, we’re proud that our\nstate-of-the-art web application firewall is now certified\nto help our customers meet their own PCI requirements.”\n</p>\n<p>\nWith tens of thousands of e-commerce and financial service\ncompanies relying on Cloudflare to keep them fast and safe\nonline, Cloudflare is staying on top of the latest procedures\nand compliance requirements in the payment card industry so\nit can provide stellar service to clients like Gilt Groupe,\nElance/oDesk, NASDAQ Private Market and eHarmony.\n</p>\n<p>\nCloudflare achieved the highest level of PCI compliance while\nstill allowing for expansion of the company’s rapidly growing\nnetwork of global data centers. Over the coming weeks,\nCloudflare will turn up four new data centers in Madrid,\nSpain; Milan, Italy; Medellin, Columbia; and São Paulo, Brazil.\n</p>",
				"omitBoilerplate": true,
				"boilerplate": "<hr>\n<h4 class=\"marketing-h4\">About Cloudflare</h4>\n<p>\nCloudflare, Inc. (<a href=\"/\" target=\"_blank\">www.cloudflare.com</a> /\n<a href=\"http://www.twitter.com/cloudflare\" target=\"_blank\"> @cloudflare</a>)\nmakes sites lightning fast, protects them from attacks, ensures\nthey are always online, and makes it simple to add web apps\nwith a single click. Regardless of size or platform, Cloudflare\nsupercharges websites with no need to add hardware, install\nsoftware, or change a line of code. The Cloudflare community\ngets stronger as it grows: every new site makes the network\nsmarter. More than 5% of global web requests flow through\nCloudflare’s network daily. And, thanks to our awesome sauce\ntechnology, every month billions of people experience a\nfaster, safer, better Internet. Cloudflare was recognized by\nthe World Economic Forum as a Technology Pioneer, named the\nMost Innovative Network &amp; Internet Technology Company for two\nyears running by the Wall Street Journal, and ranked among\nthe world’s 50 most innovative companies by Fast Company.\nCloudflare is based in San Francisco, California, USA.\n</p>"
			},
			"baseURL": {
				"siteMetadata": {
					"baseURL": "https://www.cloudflare.com"
				}
			}
		},
		"pageContext": {
			"id": "a7af82ea-cade-5a94-8296-4e830efcf4f0",
			"locale": "en-US",
			"pathname": "/press-releases/2014/cloudflare-certified-at-the-highest-level-of-payment-card-industry-pci/",
			"baseURL": "https://www.cloudflare.com"
		}
	}
}