{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Elaine Dzuba",
				"slug": "elaine",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/701P8pHVikGOEKf3oXsrSl/f8675df50bf4bb92cd73d008757fc1b5/elaine.jpeg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Cyber criminals target Amazon Prime members. 2020 Prime Day phishing attacks attempt to steal credit card details, PII data.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/28zIm6mcMkIuyq81ZAtq3K/30a35af89f28eb4e099e89292f71c2a4/2020-amazon-prime-day-phishing.png",
		"featured": false,
		"html": "<p><i>This blog originally appeared in October 2020 on the Area 1 Security website, and was issued in advance of Cloudflare&#39;s acquisition of Area 1 Security on April 1, 2022. </i><a href=\"/why-we-are-acquiring-area-1/\"><i>Learn more</i></a><i>.</i></p><p>Mark your calendars, October 13-14 is Amazon’s Prime Day! A whole 24 hours of exclusive deals just for Prime members. For most of us who haven’t been impulsively buying during the quarantine after spending all day sitting on our laptops, this means it might be time to open up Amazon and check out the latest deals.</p><p><b>However, cyber criminals have also prepared for what may likely be the biggest Prime Day ever. Each year, they</b> ramp up their Amazon phishing schemes, to steal login credentials and credit card details with convincing lures regarding Prime membership.</p><p>Amazon is a highly spoofed company. Criminals commonly use Amazon to steal sensitive information as a means to bolster their ill-gotten coffers. Targets can be easily tricked by these phishing messages as attackers continually update to more and more timely and convincing lures.Coronavirus-related lockdowns, combined with Prime Day sales, gives cyber criminals the ideal scenario for criminal activity. Instead of perusing shopping aisles with limited capacity and reduced hours, customers <a href=\"https://www.wsj.com/articles/amazons-sales-jump-as-coronavirus-prompts-surge-in-online-shopping-11588278740\">rely more than ever</a> on Amazon for daily necessities and now, of course, the highly-anticipated Prime Day deals.</p><p>What else makes Prime Day risky in 2020? Many big box retailers cancelling their Black Friday sales in light of the pandemic. This makes Prime Day an even bigger focus for cyber criminals.</p><p>This year, attackers are using several advanced tactics to create more convincing messages.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"your-amazon-accounts-on-hold-update-payment-info\">Your Amazon Account’s On Hold - Update Payment Info</h3>\n            <a href=\"#your-amazon-accounts-on-hold-update-payment-info\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Amazon shoppers should understand the latest methods employed by cyber criminals, in order to avoid falling victim to these types of scams.</p><p>Here is the most prevalent phishing lure uncovered by Area 1 Security researchers: An Amazon-branded email states that there is a problem with the credit card linked to the user’s Amazon account, and the customer’s account is “on hold” until the customer can provide updated card information.</p><p>This scam, of course, is just an attempt to steal an Amazon Prime member’s credit card data.</p><p>We’ve found a number of disparate campaigns leveraging similar lures but with varying levels of sophistication.</p><p>The more stealthy phishing messages reveal convincing brand-specific content, carefully constructed to imitate a real Amazon email.</p><p>As shown in Figure 1, the content, logo and graphics are in line with what you might encounter in an actual Amazon notification email. The attacker behind this campaign used several advanced tactics to create a convincing message, including:</p><ul><li><p>Meticulous HTML/CSS coding</p></li><li><p>Embedding images from Amazon in the source code</p></li><li><p>Hosting malicious content on a legitimate website</p></li><li><p>Leveraging Newly Registered Domains (NRDs) to send the phishing messages</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3sjy28uZRUFekenfGijzfP/6f4595baa3678db5f4f82286979bcc22/image9-1.png\" alt=\"\" class=\"kg-image\" width=\"1054\" height=\"1286\" loading=\"lazy\"/>\n            \n            </figure><p>This particular campaign used numerous domains to send their phishing messages, all of which were newly registered. The sender email accounts containing these domains followed either one of two patterns:</p><ul><li><p>no-reply-amazon-notify&lt;<i>11 alphanumeric characters</i>&gt;@&lt;<i>newly registered domain</i>&gt;</p></li><li><p>mail-services-amazon-prime-&lt;<i>11 alphanumeric characters</i>&gt;@&lt;<i>newly registered domain</i>&gt;</p></li></ul><p>The phishing messages sent from these accounts contained malicious links that revealed the attacker either leveraged NRDs, or abused the legitimate services of <a href=\"https://snip.ly/whatis#:~:text=Sniply%20is%20a%20simple%20tool,with%20every%20link%20you%20share.\">Sniply</a> to host their Amazon look-alike sites.</p><p>What is Sniply? It allows users to create custom links with a free user account. As a result, Sniply is an attractive option for attackers looking to find unsuspecting sites to host their nefarious content.</p><p>The text “Update Payment Information” in the body of the message is a hyperlink to a presumably spoofed Amazon login page. Area 1 Security observed yet another pattern, this time with the Sniply links:</p><ul><li><p>hxxps://snip[.]ly/xjey66?.amazon-prime-services=</p></li><li><p>hxxps://snip[.]ly/o1u9cb?amazon.data.prime=</p></li><li><p>hxxps://snip[.]ly/9axm0u?ad-amazon.isuue-id=</p></li></ul><p>The identification of these patterns in both the sender addresses and malicious links is highly suggestive of a phishing kit.</p><p>At the time of our analysis, the pages for these links were no longer accessible. Fortunately, Sniply was quick to the draw and blocked access to the attacker’s malicious content. However, with attackers easily creating Newly Registered Domains, it won’t take long to create a new malicious website and begin another wave of phishing messages.</p><p>These ever-evolving Amazon-themed campaigns are an ongoing threat to many individuals and businesses alike. The use of NRDs, as well as abuse of legitimate services, make these phish particularly difficult to detect.</p><p>To make matters worse, because the URLs used in the attacks point to legitimate domains and the messages contain no malicious payloads, traditional defenses will continually miss phish like this.</p><p>Although we recognized and stopped this campaign from reaching users’ inboxes before any damage could be done, there are still similar and ongoing campaigns with active links that are hitting the inboxes of targets without adequate email security.</p><p>As malicious actors create new campaigns with increasingly sophisticated tactics, users need to be aware of the latest techniques to stay safe from these opportunistic attacks.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"your-amazon-prime-membership-has-expired\">Your Amazon Prime Membership Has Expired</h3>\n            <a href=\"#your-amazon-prime-membership-has-expired\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Another Amazon-themed phishing campaign, launched in the days leading up to Prime Day, attempts to convince shoppers that their Prime membership has expired.</p><p>This campaign entices the customer to click a link to update card information on file in order to continue enjoying their Prime benefits. In the figure below, you can see that the message is simple, to the point, and — again — contains Amazon branding.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2Phnok9aqhiGebxUEhYcQL/e6c2a8db1fad5bca5662442695a0508f/image10.png\" alt=\"\" class=\"kg-image\" width=\"1098\" height=\"894\" loading=\"lazy\"/>\n            \n            </figure><p>In the example above, the fraudsters used Display Name Spoofing to make the email appear as if it originated from “Amazon Prime”.</p><p>However, Area 1 Security’s closer inspection of the email headers reveals that the message has an “envelope-from” address of ad4@dianefloresbrown[.]com and was sent by way of wineu[.]mail.</p><p>At the time of analysis, these domains did not resolve to any IP addresses. Further, all IPs appearing in the header were private (or for internal network use only), having no significance outside the local network, and thus providing some degree of anonymity for the attacker.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5IPKxqsP8G4ifFkzyqqOHh/98fa8618333c01a7d877fcafb99be3b9/image2-6.png\" alt=\"\" class=\"kg-image\" width=\"704\" height=\"392\" loading=\"lazy\"/>\n            \n            </figure><p>This particular campaign has been linked to malicious Amazon-related spoofs dating back to 2016, and is still being updated on an almost daily basis.</p><p>A number of the phishing websites used by this cyber criminal happen to share a unique URL pattern, allowing for easier tracking of the fraudulent activity.</p><p>For example, clicking on the hyperlink for the text “Update your payment method” will result in the victim’s browser loading the malicious content located at, hxxps://asxtbibcx[.]com/amazon/ama/ACCESS744558886441BNG5F7558DERS85699SVB/F92a1dd58f9544ab8efd1c744612385a9/?dispatch=KNE0iodoOoqK5tDxLF7q0bbIsyFnO28x2xuq3Qvu5sVyxSL3EE. In an effort to avoid detection and being indexed by various web crawlers, every time the link is clicked, a new URL is generated. Parameters within the URL that vary are detailed below:</p><ul><li><p>hxxps://asxtbibcx[.]com/amazon/ama/ACCESS744558886441BNG5F7558DERS85699SVB/F&lt;<i>hashed and base64-encoded GMT/UTC timestamp</i>&gt;/?dispatch=&lt;<i>randomly generated alphanumeric characters</i>&gt;</p></li></ul><p>After clicking the malicious link, the victim is directed through a series of steps to verify their identity and input payment information. Before being redirected to the real Amazon site, the victim is presented with a screen that displays their account has been successfully updated, and they will be logged out.</p><p>The figure below exposes the victim’s journey across multiple Amazon-branded sites:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/xzK7lC0rpLGZG4tqVhQyl/daed17a5d873fa7bd2675261dbb67598/Screenshot-2022-11-02-at-11.32.51.png\" alt=\"\" class=\"kg-image\" width=\"1624\" height=\"482\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/51HolmsXKZeQwsybQSBHMb/1d164b741cc967af43c39f19dbcb765d/Screenshot-2022-11-02-at-11.33.15.png\" alt=\"\" class=\"kg-image\" width=\"1604\" height=\"512\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 4. Sequence of Phishing Attack</p><p>As evidenced above, the attacker is attempting to steal not only credit card, but also personally identifying information (PII).</p><p>This sensitive data is then sent to the attacker at the addresses btsmpil@gmail[.]com and kabiyesi@zoho[.]com. There are no cookies stored once the target is redirected to the Amazon homepage, indicating that the attack does not attempt to get additional information from the Amazon session.</p><p>In a misstep by the attacker, the index of their malicious website was made public (as shown in Figure 5), allowing anyone to view the technical details behind their operation.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/21BjrDPgCpOPlvHnMVTIta/4d25ffefc71a8b3b2b14948517fcaa75/image3-4.png\" alt=\"\" class=\"kg-image\" width=\"404\" height=\"205\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 5. Index of Malicious Website</p><p>This oversight allowed researchers at Area 1 Security to access the source code for the website and delve into the numerous scripts used to carry out the attack.</p><p>Several unique artifacts were discovered that can be used to possibly identify any additional or future campaigns carried out by this attacker. For instance, a number of div classes follow a very similar format:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2Ax2v1h6HqElAXR5Lt7ZqS/3d7ed22e3eb53a4de89890d2bcbd814e/image4-5.png\" alt=\"\" class=\"kg-image\" width=\"465\" height=\"197\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 6. HTML of Malicious Website</p><p>As revealed in the figure above, each of the div classes uses “tajouri” as a prefix for containers, as well as the name of “containtindex”. No information was found as to why this was used as a naming convention, however it might give researchers another possible avenue for associating this cyber criminal with future attacks or phishing kits.</p><p>The main index page for the malicious site contains the code responsible for safeguarding its contents from web crawlers and for generating unique URLs for each visitor. As highlighted below, a screen name was identified on this page, “AYB SCH”, among a trove of profanity-laced code. Whether this attacker wanted the code to be discovered in order to gain internet notoriety is up for debate.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3GlFwufBS7yFudbVVle7Pq/4fd13a2c7be11918a2de840c7a238da9/carbon.png\" alt=\"\" class=\"kg-image\" width=\"976\" height=\"1992\" loading=\"lazy\"/>\n            \n            </figure><p>An additional artifact was found that offers yet another interesting, if not unique, identifier used by this cyber criminal. The below code comes from the “Account Verification” step of the attack. The specific div class format can be seen once again, as well as what appears to be French text in the HTML’s  tags, which is slang for “shut up”.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2Uw2IhZyIrkapu2GsXyXXw/c417ba4279d6b5422f42ed118bfd2291/carbon--1-.png\" alt=\"\" class=\"kg-image\" width=\"808\" height=\"782\" loading=\"lazy\"/>\n            \n            </figure><p>This source code provides a little insight into the cyber criminals behind these Amazon-themed attacks.</p><p>Many of the phishing campaigns appear to originate from overseas, as seen in the ISPs used, and were orchestrated by individuals who are well-versed in programming, if not English expletives. These fraudsters clearly see this as a game, where they hope to outsmart defenses while taunting those that may be hot on their trail.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"recommendations\">Recommendations</h3>\n            <a href=\"#recommendations\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>With cyber criminals well-equipped for the upcoming rush to Prime Day deals, it is vital that companies prepare adequate defenses to protect users from falling victim to these Amazon-themed attacks.</p><p>As malicious actors invent new ways to bypass defenses, including the use of newly registered domains and legitimate online services, security practitioners need to turn to solutions on the cutting edge of <a href=\"https://www.cloudflare.com/zero-trust/products/email-security/\">email security technology</a> in order to block these highly-damaging, financially-driven phishing campaigns.</p><p>New tactics and methods may be able to trick legacy vendors and cloud email providers, but Area 1 Security’s anti-phishing solution stops these fraudsters dead in their tracks.</p><p>Our advanced Machine Learning and Artificial Intelligence technology allows our algorithms to uncover new tactics malicious actors are using to bypass defenses in real time versus waiting days or weeks for signature updates. Our time-zero detections lead the industry with reliable verdicts that <a href=\"https://www.cloudflare.com/learning/email-security/how-to-prevent-phishing/\">stop phishing attempt</a>s at delivery time. This has many advantages over post-delivery retraction in that users are never exposed to the attack.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"indicators-of-compromise\">Indicators of Compromise</h3>\n            <a href=\"#indicators-of-compromise\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p><b>Sender Domains:</b></p><p>Kimakxbisakok[.]com</p><p>kauadalahmantanterinda[.]com</p><p>Ikannilakayarasa[.]com</p><p>Bilangbabiamadia[.]com</p><p>com-accountingproved.com</p><p>ad4@dianefloresbrown[.]com</p><p>wineu[.]mail</p><p><b>Sender IP Addresses:</b></p><p>36[.]71[.]143[.]138</p><p>36[.]68[.]138[.]85</p><p><b>Sender Email Addresses:</b></p><p>no-reply-amazon-notify5jsciki79he@kimakxbisakok[.]com</p><p>no-reply-amazon-notify1os6uge0kzh@kimakxbisakok[.]com</p><p>no-reply-amazon-notifyhrbdqdoupsz@kauadalahmantanterinda[.]com</p><p>no-reply-amazon-notifym55jh93ft92@kauadalahmantanterinda[.]com</p><p>no-reply-amazon-notifykf9ul2d33jx@ikannilakayarasa[.]com</p><p>no-reply-amazon-notifymn5dzrjbwwc@bilangbabiamadia[.]com</p><p>mail-services-amazon-prime-pswrpeavczy@com-accountingproved[.]com</p><p>mail-services-amazon-prime-2av302jgvrp@com-accountingproved[.]com</p><p>mail-services-amazon-prime-5yww41luv8a@com-accountingproved[.]com</p><p>mail-services-amazon-prime-i7a98af4a29@com-accountingproved[.]com</p><p>mail-services-amazon-prime-xroq3gqfnm3@com-accountingproved[.]com</p><p><b>Attacker Email Addresses:</b></p><p>btsmpil@gmail[.]com</p><p>kabiyesi@zoho[.]com</p><p><b>Malicious Links:</b></p><p>hxxps://snip[.]ly/xjey66?.amazon-prime-services=</p><p>hxxps://snip[.]ly/o1u9cb?amazon.data.prime=</p><p>hxxps://snip[.]ly/9axm0u?ad-amazon.isuue-id=</p><p>hxxps://interistingkostins[.]com/MwM7tEjhxxps://asxtbibcx[.]com/amazon/ama/ACCESS744558886441BNG5F7558DERS85699SVB/F&lt;<i>hashed and base64 encoded GMT/UTC timestamp</i>&gt;/?dispatch=&lt;<i>randomly generated alphanumeric characters</i>&gt;</p>",
		"id": "7vDwIcMpft2wnTlIQ8J2H6",
		"localeList": {
			"name": "Spike in Amazon phishing for Prime Day: a new day of deals means new phishing campaigns Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Cyber criminals target Amazon Prime members. 2020 Prime Day phishing attacks attempt to steal credit card details, PII data.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2020-10-13T15:33:00.000+01:00",
		"slug": "2020-amazon-prime-day-phishing",
		"tags": [
			{
				"id": "2Kxh34kIQRA3gyymmhJpsR",
				"name": "Email Security",
				"slug": "email-security"
			},
			{
				"id": "73lXar1fZP6qrIIcgBA5Te",
				"name": "Cloud Email Security",
				"slug": "cloud-email-security"
			},
			{
				"id": "21DTsaKOfe5jbKfPDzYIBX",
				"name": "Phishing",
				"slug": "phishing"
			}
		],
		"title": "Spike in Amazon phishing for Prime Day: a new day of deals means new phishing campaigns",
		"updated_at": "2024-08-27T01:57:27.211Z",
		"url": "https://blog.cloudflare.com/2020-amazon-prime-day-phishing"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}