{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "11",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"ja-jp",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "João Tomé",
				"slug": "joao-tome",
				"bio": "After years as a journalist covering technology, cinema, sports (soccer/football), and mobility (including hosting a TV show about it), I’m now telling data-driven and other stories at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/KOYiYhfI8O9WNWxB8IWk7/a87510f59b05f585ec6a0e4fd71f7352/joao-tome.jpeg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": "@emot",
				"facebook": null
			}
		],
		"excerpt": "In 2022, cybersecurity, more than ever, is a must-have for those who don’t want to take chances on getting caught in a cyberattack with difficult to deal with consequences. Here’s a reading list what you need to know about attacks that is also a guide on how to be protected",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/179vD7WGOvit8IuLTuhD2F/ed4ab5fe29c75cafe724374f1fac7fc4/2022-attacks-an-august-reading-list-to-go-shields-up.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2WdxQhESmU4TimGkFrxvrP/7077735fe3062c62418a2df425ec5e44/image4-2.png\" alt=\"2022 attacks! An August reading list to go “Shields Up”\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>In 2022, <a href=\"https://www.cloudflare.com/learning/security/what-is-cyber-security/\">cybersecurity</a> is a must-have for those who don’t want to take chances on getting caught in a cyberattack with difficult to deal consequences. And with a war in Europe (<a href=\"/tag/ukraine/\">Ukraine</a>) still going on, cyberwar also doesn’t show signs of stopping in a time when there never were so many people online, 4.95 billion in early 2022, 62.5% of the world’s total population (<a href=\"https://datareportal.com/reports/digital-2022-global-overview-report\">estimates</a> say it grew around 4% during 2021 and <a href=\"https://datareportal.com/reports/digital-2021-global-overview-report\">7.3%</a> in 2020).</p><p>Throughout the year we, at Cloudflare, have been making new announcements of products, solutions and initiatives that highlight the way we have been <a href=\"https://www.cloudflare.com/learning/ddos/how-to-prevent-ddos-attacks/\">preventing</a>, mitigating and constantly learning, over the years, with several thousands of small and big cyberattacks. Right now, we block an average of 124 billion cyber threats per day. The more we deal with attacks, the more we know how to stop them, and the easier it gets to find and deal with new threats — and for customers to forget we’re there, protecting them.</p><p>In 2022, we have been onboarding many customers while they’re being attacked, something we know well from the past (<a href=\"https://www.cloudflare.com/case-studies/wikimedia-foundation/\">Wikimedia/Wikipedia</a> or <a href=\"https://www.cloudflare.com/case-studies/eurovision/\">Eurovision</a> are just two case-studies of <a href=\"https://www.cloudflare.com/case-studies\">many</a>, and last year there was a Fortune Global 500 company example we <a href=\"/ransom-ddos-attacks-target-a-fortune-global-500-company/\">wrote about</a>). Recently, we dealt and did a <a href=\"/2022-07-sms-phishing-attacks/\">rundown</a> about an SMS phishing attack.</p><p>Providing services for <a href=\"https://w3techs.com/technologies/overview/proxy/all\">almost 20%</a> of websites online and to millions of Internet properties and customers using our global network in more than <a href=\"/new-cities-april-2022-edition/\">270 cities</a> (recently we arrived to <a href=\"/cloudflare-deployment-in-guam/\">Guam</a>) also plays a big role. For example, in Q1’22 Cloudflare blocked an average of 117 billion cyber threats each day (much more than in previous quarters).</p><p>Now that August is here, and many in the Northern Hemisphere are enjoying the summer and vacations, let’s do a reading list that is also a sum up focused on cyberattacks that also gives, by itself, some 2022 guide on this more than ever relevant area.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"war-cyberwar-attacks-increasing\">War & Cyberwar: Attacks increasing</h2>\n            <a href=\"#war-cyberwar-attacks-increasing\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>But first, some context. There are all sorts of attacks, but they have been generally speaking increasing and just to give some of our data regarding <a href=\"/ddos-attack-trends-for-2022-q2/\">DDoS attacks in 2022 Q2</a>: ​​application-layer attacks increased by 72% YoY (Year over Year) and network-layer DDoS attacks increased by 109% YoY.</p><p>The US government gave “warnings” back in March, after the war in Ukraine started, to all in the country but also allies and partners to be aware of the need to “enhance cybersecurity”. The US Cybersecurity and Infrastructure Security Agency (CISA) created the <a href=\"https://www.cisa.gov/shields-up\">Shields Up</a> initiative, given how the “Russia’s invasion of Ukraine could impact organizations both within and beyond the region”. The <a href=\"/shields-up-free-cloudflare-services-to-improve-your-cyber-readiness/#:~:text=National%20Cyber%20Security%20Center\">UK</a> and <a href=\"https://www.meti.go.jp/press/2021/02/20220221003/20220221003.html\">Japan</a>, among others, also issued warnings.</p><p>That said, here are the two first and more general about attacks reading list suggestions:</p><p><b>Shields up: free Cloudflare services to improve your cyber readiness (</b><a href=\"/shields-up-free-cloudflare-services-to-improve-your-cyber-readiness/\"><b>✍️</b></a><b>)</b>After the war started and governments released warnings, we did this free Cloudflare services cyber readiness sum up <a href=\"/shields-up-free-cloudflare-services-to-improve-your-cyber-readiness/\">blog post</a>. If you’re a seasoned IT professional or a novice website operator, you can see a variety of services for websites, apps, or APIs, including DDoS mitigation and protection of teams or even personal devices (from phones to routers). If this resonates with you, this announcement of collaboration to simplify the adoption of Zero Trust for IT and security teams could also be useful: <a href=\"/cloudflare-crowdstrike-partnership/\">CrowdStrike’s endpoint security meets Cloudflare’s Zero Trust Services</a>.</p><p><b>In Ukraine and beyond, what it takes to keep vulnerable groups online (</b><a href=\"/in-ukraine-and-beyond-what-it-takes-to-keep-vulnerable-groups-online/\"><b>✍️</b></a><b>)</b>This <a href=\"/in-ukraine-and-beyond-what-it-takes-to-keep-vulnerable-groups-online/\">blog post</a> is focused on the eighth anniversary of our <a href=\"https://www.cloudflare.com/galileo/\">Project Galileo</a>, that has been helping human-rights, journalism and non-profits public interest organizations or groups. We highlight the trends of the past year, including the dozens of organizations related to <a href=\"/tag/Ukraine\">Ukraine</a> that were onboarded (many while being attacked) since the war started. Between July 2021 and May 2022, we’ve blocked an average of nearly 57.9 million cyberattacks per day, an increase of nearly 10% over last year in a total of 18 billion attacks.</p><p>In terms of attack methods to Galileo protected organizations, the largest fraction (28%) of mitigated requests were classified as “HTTP Anomaly”, with 20% of mitigated requests tagged as <a href=\"https://www.cloudflare.com/learning/security/threats/sql-injection/\">SQL injection or SQLi attempts</a> (to target databases) and nearly 13% as attempts to exploit specific <a href=\"https://www.cve.org/\">CVEs</a> (publicly disclosed cybersecurity vulnerabilities) — you can find more insights about those <a href=\"/tag/cve/\">here</a>, including the <a href=\"/waf-mitigations-spring4shell/\">Spring4Shell</a> vulnerability, the <a href=\"/tag/log4j/\">Log4j</a> or the <a href=\"/cloudflare-customers-are-protected-from-the-atlassian-confluence-cve-2022-26134/\">Atlassian</a> one.</p><p>And now, without further ado, here’s the full reading list/attacks guide where we highlight some blog posts around four main topics:</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"1-ddos-attacks-solutions\">1. DDoS attacks & solutions</h2>\n            <a href=\"#1-ddos-attacks-solutions\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          \n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2xhurw0Ra8EQ5RTgWXrEIz/6b1f10022bd374152787bf480ac3c844/image5-2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>The most powerful botnet to date, <a href=\"/mantis-botnet/\">Mantis</a>.</p><p><b>Cloudflare mitigates 26 million request per second DDoS attack (</b><a href=\"/26m-rps-ddos/\"><b>✍️</b></a><b>)</b><a href=\"https://www.cloudflare.com/learning/ddos/what-is-a-ddos-attack/\">Distributed Denial of Service (DDoS)</a> are the bread and butter of <a href=\"https://portswigger.net/daily-swig/nation-state-threat-how-ddos-over-tcp-technique-could-amplify-attacks\">state-based</a> attacks, and we’ve been <a href=\"/deep-dive-cloudflare-autonomous-edge-ddos-protection/\">automatically</a> detecting and mitigating them. Regardless of which country initiates them, bots are all around the world and <a href=\"/26m-rps-ddos/\">in this blog post</a> you can see a specific example on how big those attacks can be (in this case the attack targeted a customer website using Cloudflare’s Free plan). We’ve named this most powerful botnet to date, <a href=\"/mantis-botnet/\">Mantis</a>.</p><p>That said, we also explain that although most of the attacks are small, e.g. cyber vandalism, even small attacks can severely impact unprotected Internet properties.</p><p><b>DDoS attack trends for 2022 Q2 (</b><a href=\"/ddos-attack-trends-for-2022-q2/\"><b>✍️</b></a><b>)</b>We already mentioned how application (72%) and network-layer (109%) attacks have been growing year over year — in the latter, attacks of 100 Gbps and larger increased by 8% QoQ, and attacks lasting more than 3 hours increased by 12% QoQ. <a href=\"/ddos-attack-trends-for-2022-q2/\"><b>Here</b></a> you can also find interesting trends, like how Broadcast Media companies in Ukraine were the most targeted in Q2 2022 by DDoS attacks. In fact, all the top five most attacked industries are all in online/Internet media, publishing, and broadcasting.</p><p><b>Cloudflare customers on Free plans can now also get real-time DDoS alerts</b> <b>(</b><a href=\"/free-ddos-alerts/\"><b>✍️</b></a><b>)</b>A DDoS is cyber-attack that attempts to disrupt your online business and can be used in any type of Internet property, server, or network (whether it relies on <a href=\"/attacks-on-voip-providers/\">VoIP</a> servers, UDP-based gaming servers, or HTTP servers). That said, our <a href=\"https://www.cloudflare.com/plans/free/\">Free plan</a> can now get real-time alerts about HTTP DDoS attacks that were automatically detected and mitigated by us.</p><p>One of the benefits of Cloudflare is that all of our services and features can work together to protect your website and also improve its performance. Here’s our specialist, <a href=\"/author/omer/\">Omer Yoachimik</a>, top 3 tips to leverage a <a href=\"https://www.cloudflare.com/plans/free/\">Cloudflare free account</a> (and put your settings more efficient to deal with DDoS attacks):</p><ol><li><p>Put Cloudflare in front of your website:</p><ul><li><p><a href=\"https://developers.cloudflare.com/dns/zone-setups/full-setup/setup/\">Onboard your website to Cloudflare</a> and ensure all of your HTTP traffic routes through Cloudflare. Lock down your origin server, so it only accepts traffic from <a href=\"https://developers.cloudflare.com/fundamentals/get-started/setup/allow-cloudflare-ip-addresses/\">Cloudflare IPs</a>.</p></li></ul></li><li><p>Leverage Cloudflare’s free security features</p><ul><li><p><b>DDoS Protection</b>: it’s enabled by default, and if needed you can also <a href=\"https://developers.cloudflare.com/ddos-protection/managed-rulesets/adjust-rules/false-negative/#incomplete-mitigations\">override the action to Block</a> for rules that have a different default value.</p></li><li><p><b>Security Level</b>: this feature will automatically issue challenges to requests that originate from IP addresses with low IP reputation. Ensure it&#39;s <a href=\"https://support.cloudflare.com/hc/en-us/articles/200170056-Understanding-the-Cloudflare-Security-Level\">set to Medium</a> at least.</p></li><li><p><b>Block bad bots</b> - Cloudflare’s free tier of <a href=\"https://developers.cloudflare.com/bots/plans/free/\">bot protection</a> can help ward off simple bots (from cloud ASNs) and headless browsers by issuing a computationally expensive challenge.</p></li><li><p><b>Firewall rules</b>: you can create up to five free <a href=\"https://developers.cloudflare.com/firewall/\">custom firewall rules</a> to block or challenge traffic that you never want to receive.</p></li><li><p><b>Managed Ruleset</b>: in addition to your custom rule, enable Cloudflare’s <a href=\"https://developers.cloudflare.com/waf/managed-rulesets/\">Free Managed Ruleset</a> to protect against high and wide impacting vulnerabilities</p></li></ul></li><li><p>Move your content to the cloud</p><ul><li><p><a href=\"https://developers.cloudflare.com/cache/\">Cache</a> as much of your content as possible on the Cloudflare network. The fewer requests that hit your origin, the better — including unwanted traffic.</p></li></ul></li></ol>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"2-application-level-attacks-waf\">2. Application level attacks & WAF</h2>\n            <a href=\"#2-application-level-attacks-waf\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p><b>Application security: Cloudflare’s view (</b><a href=\"/application-security/\"><b>✍️</b></a><b>)</b>Did you know that around 8% of all Cloudflare HTTP traffic is mitigated? That is something we explain in this application&#39;s general trends March 2022 <a href=\"/application-security/\">blog post</a>. That means that overall, ~2.5 million requests per second are mitigated by our global network and never reach our caches or the origin servers, ensuring our customers’ bandwidth and compute power is only used for clean traffic.</p><p>You can also have a sense here of what the top mitigated traffic sources are — Layer 7 DDoS and Custom WAF (<a href=\"https://www.cloudflare.com/learning/ddos/glossary/web-application-firewall-waf/\">Web Application Firewall</a>) rules are at the top — and what are the most common attacks. Other highlights include that at that time 38% of HTTP traffic we see is automated (right the number is actually lower, 31% — current trends can be seen on <a href=\"https://radar.cloudflare.com/\">Radar</a>), and the already mentioned (about Galileo) SQLi is the most common attack vector on API endpoints.</p><p><b>WAF for everyone: protecting the web from high severity vulnerabilities (</b><a href=\"/waf-for-everyone/\"><b>✍️</b></a><b>)</b>This <a href=\"/waf-for-everyone/\">blog post</a> shares a relevant announcement that goes hand in hand with Cloudflare mission of &quot;help build a better Internet&quot; and that also includes giving some level of protection even without costs (something that also help us be better in preventing and mitigating attacks). So, since March we are providing a Cloudflare WAF Managed Ruleset that is running by default on all FREE zones, free of charge.</p><p>On this topic, there has also been a growing client side security number of threats that concerns CIOs and security professionals that we mention when we gave, in December, all paid plans access to <a href=\"/page-shield-generally-available/\">Page Shield features</a> (last <a href=\"/making-page-shield-malicious-code-alerts-more-actionable/\">month</a> we made Page Shield malicious code alerts more actionable. Another example is how we detect <a href=\"/detecting-magecart-style-attacks-for-pageshield/\">Magecart-Style attacks</a> that have impacted large organizations like <a href=\"https://www.bbc.co.uk/news/technology-54568784\">British Airways</a> and <a href=\"https://ico.org.uk/about-the-ico/news-and-events/news-and-blogs/2020/11/ico-fines-ticketmaster-uk-limited-125million-for-failing-to-protect-customers-payment-details/\">Ticketmaster</a>, resulting in substantial GDPR fines in both cases.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"3-phishing-area-1\">3. Phishing (Area 1)</h2>\n            <a href=\"#3-phishing-area-1\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p><b>Why we are acquiring Area 1 (</b><a href=\"/why-we-are-acquiring-area-1/\"><b>✍️</b></a><b>)</b>Phishing remains the primary way to breach organizations. According to <a href=\"https://www.cisa.gov/stopransomware/general-information\">CISA</a>, 90% of cyber attacks begin with it. And, in a recent report, the <a href=\"https://www.ic3.gov/Media/Y2022/PSA220504\">FBI</a> referred to Business Email Compromise as the $43 Billion problem facing organizations.</p><p>It was in late February that it was announced that Cloudflare had agreed to acquire Area 1 Security to help organizations combat <a href=\"https://www.cloudflare.com/learning/email-security/what-is-email-fraud/\">advanced email attacks and phishing campaigns</a>. Our <a href=\"/why-we-are-acquiring-area-1/\">blog post</a> explains that “Area 1’s team has built exceptional cloud-native technology to protect businesses from email-based security threats”. So, all that technology and expertise has been integrated since then with our global network to give customers the most complete Zero Trust security platform available.</p><p><b>The mechanics of a sophisticated phishing scam and how we stopped it (</b><a href=\"/2022-07-sms-phishing-attacks/\"><b>✍️</b></a><b>)</b>What’s in a message? Possibly a sophisticated attack targeting employees and systems. On August 8, 2022, Twilio shared that they’d been compromised by a targeted SMS phishing attack. We saw an attack with very similar characteristics also targeting Cloudflare’s employees. <a href=\"/2022-07-sms-phishing-attacks/\">Here</a>, we do a rundown on how we were able to thwart the attack that could have breached most organizations, by using our Cloudflare One products, and physical security keys. And how others can do the same. No Cloudflare systems were compromised.</p><p>Our <a href=\"/introducing-cloudforce-one-threat-operations-and-threat-research/\">Cloudforce One</a> threat intelligence team dissected the attack and assisted in tracking down the attacker.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/br7n6YlxPChn033jKhwTR/afe1eb6cf6e17d30e254e4bd78ca5c05/image3-6.png\" alt=\"\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p><b>Introducing browser isolation for email links to stop modern phishing threats (</b><a href=\"/email-link-isolation/\"><b>✍️</b></a><b>)</b>Why do humans <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7005690/\">still click</a> on malicious links? It seems that it’s easier to do it than most people think (“human error is human”). <a href=\"/email-link-isolation/\">Here</a> we explain how an organization nowadays can&#39;t truly have a <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust security posture</a> without securing email; an application that end users implicitly trust and threat actors take advantage of that inherent trust.</p><p>As part of our journey to integrate Area 1 into our broader Zero Trust suite, Cloudflare Gateway customers can enable <a href=\"https://www.cloudflare.com/learning/access-management/what-is-browser-isolation/\">Remote Browser Isolation</a> for email links. With that, we now give unmatched level of protection from modern multi-channel email-based attacks. While we’re at it, you can also learn <a href=\"/replace-your-email-gateway-with-area-1/\">how to replace your email gateway with Cloudflare Area 1</a>.</p><p>About account takeovers, we explained back in March 2021 <a href=\"https://www.cloudflare.com/zero-trust/solutions/account-takeover-prevention/\">how we prevent account takeovers</a> on our own applications (on the phishing side we were already using, as a customer, at the time, Area 1).</p><p>Also from last year, <a href=\"/research-directions-in-password-security/\">here’s</a> our research in <b>password security</b> (and the problem of password reuse) — it gets technical. There’s a new password related protocol called OPAQUE (<a href=\"https://opaque-full.research.cloudflare.com/\">we added a new demo about it on January 2022</a>) that could help better store secrets that our research team is excited about.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"4-malware-ransomware-other-risks\">4. Malware/Ransomware & other risks</h2>\n            <a href=\"#4-malware-ransomware-other-risks\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p><b>How Cloudflare Security does Zero Trust (</b><a href=\"/how-cloudflare-security-does-zero-trust/\"><b>✍️</b></a><b>)</b>Security is more than ever part of an ecosystem that the more robust, the more efficient in avoiding or mitigating attacks. In this <a href=\"/how-cloudflare-security-does-zero-trust/\">blog post</a> written for our <a href=\"https://www.cloudflare.com/cloudflare-one-week/\">Cloudflare One week</a>, we explain how that ecosystem, in this case inside our Zero Trust services, can give protection from malware, ransomware, phishing, command &amp; control, shadow IT, and other Internet risks over all ports and protocols.</p><p>Since 2020, we launched <a href=\"/announcing-antivirus-in-cloudflare-gateway/\">Cloudflare Gateway</a> focused on malware detection and prevention directly from the Cloudflare edge. Recently, we also include our new <a href=\"https://www.cloudflare.com/products/zero-trust/casb/\">CASB</a> product (to secure workplace tools, personalize access, secure sensitive data).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4JXI6TtKH5z3SNlVUOM4P4/feaf4be7bfafadebba1940a6f776406c/image1-14.png\" alt=\"\" class=\"kg-image\" width=\"1815\" height=\"738\" loading=\"lazy\"/>\n            \n            </figure><p><b>Anatomy of a Targeted Ransomware Attack (</b><a href=\"/targeted-ransomware-attack/\"><b>✍️</b></a><b>)</b>What a ransomware attack looks like for the victim:</p><blockquote><p><i>“Imagine your most critical systems suddenly stop operating. And then someone demands a ransom to get your systems working again. Or someone launches a DDoS against you and demands a ransom to make it stop. That’s the world of ransomware and ransom DDoS.”</i></p></blockquote><p>Ransomware attacks continue <a href=\"https://www.kroll.com/en/insights/publications/cyber/ransomware-attack-trends-2020\">to be on the rise</a> and there’s no sign of them slowing down in the near future. That was true more than a year ago, when this <a href=\"/targeted-ransomware-attack/\">blog post</a> was written and is still <a href=\"https://www.fitchratings.com/research/corporate-finance/ransomware-growing-cyber-risk-for-us-corporates-financials-govt-27-04-2022\">ongoing</a>, up 105% YoY according to a Senate Committee March 2022 report. And the nature of ransomware attacks is changing. Here, we highlight how <a href=\"https://www.cloudflare.com/learning/ddos/ransom-ddos-attack/\">Ransom DDoS (RDDoS)</a> attacks work, how Cloudflare onboarded and <a href=\"/ransom-ddos-attacks-target-a-fortune-global-500-company/\">protected</a> a Fortune 500 customer from a targeted one, and how that <a href=\"/announcing-antivirus-in-cloudflare-gateway/\">Gateway with antivirus</a> we mentioned before helps with just that.</p><p>We also show that with ransomware as a service (<a href=\"https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-as-a-service-raas/\">RaaS</a>) models, it’s even easier for inexperienced threat actors to get their hands on them today (“RaaS is essentially a franchise that allows criminals to rent ransomware from malware authors”). We also include some general recommendations to help you and your organization stay secure. Don’t want to click the link? Here they are:</p><ul><li><p>Use 2FA everywhere, especially on your remote access entry points. This is where Cloudflare Access really helps.</p></li><li><p>Maintain multiple redundant backups of critical systems and data, both onsite and offsite</p></li><li><p>Monitor and block malicious domains using Cloudflare Gateway + AV</p></li><li><p>Sandbox web browsing activity using Cloudflare RBI to isolate threats at the browser</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2A9QpWsLw6VCvL1l757YgV/272c3ba9cd696422fa3fcc00435a75b2/image2-7.png\" alt=\"\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p><b>Investigating threats using the Cloudflare Security Center (</b><a href=\"/security-center-investigate/\"><b>✍️</b></a><b>)</b><a href=\"/security-center-investigate/\">Here</a>, first we announce our new threat investigations portal, <i>Investigate</i>, right in the Cloudflare Security Center, that allows all customers to query directly our intelligence to streamline security workflows and tighten feedback loops.</p><p>That’s only possible because we have a global and in-depth view, given that we <a href=\"https://www.cloudflare.com/products/zero-trust/threat-defense/\">protect millions of Internet properties from attacks</a> (the free plans help us to have that insight). And the data we glean from these attacks trains our machine learning models and improves the efficacy of our network and <a href=\"https://www.cloudflare.com/application-services/solutions/\">application security products</a>.</p><p><b>Steps we&#39;ve taken around Cloudflare&#39;s services in Ukraine, Belarus, and Russia (</b><a href=\"/steps-taken-around-cloudflares-services-in-ukraine-belarus-and-russia/\"><b>✍️</b></a><b>)</b>There’s an emergence of the known as <a href=\"https://en.wikipedia.org/wiki/Wiper_(malware)\">wiper</a> malware attacks (intended to erase the computer it infects) and in this <a href=\"/steps-taken-around-cloudflares-services-in-ukraine-belarus-and-russia/\">blog post</a>, among other things, we explain how when a wiper malware was identified in Ukraine (it took offline government agencies and a major bank), we successfully adapted our Zero Trust products to make sure our customers were protected. Those protections include many Ukrainian organizations, under our <a href=\"/in-ukraine-and-beyond-what-it-takes-to-keep-vulnerable-groups-online/\">Project Galileo</a> that is having a busy year, and they were automatically put available to all our customers. More recently, the satellite provider Viasat was <a href=\"https://techcrunch.com/2022/05/10/russia-viasat-cyberattack/\">affected</a>.</p><p><b>Zaraz use Workers to make third-party tools secure and fast (</b><a href=\"/zaraz-use-workers-to-make-third-party-tools-secure-and-fast/\"><b>✍️</b></a><b>)</b>Cloudflare announced it acquired <a href=\"/cloudflare-acquires-zaraz-to-enable-cloud-loading-of-third-party-tools/\">Zaraz</a> in December 2021 to help us enable cloud loading of third-party tools. Seems unrelated to attacks? Think again (this takes us back to the secure ecosystem I already mentioned). Among other things, <a href=\"/zaraz-use-workers-to-make-third-party-tools-secure-and-fast/\"><b>here</b></a> you can learn how Zaraz can make your website more secure (and faster) by offloading third-party scripts.</p><p>That allows to avoid problems and attacks. Which? From code tampering to lose control over the data sent to third-parties. My colleague <a href=\"/author/yoav/\">Yo&#39;av Moshe</a> elaborates on what this solution prevents: “the third-party script can intentionally or unintentionally (due to being hacked) collect information it shouldn&#39;t collect, like credit card numbers, Personal Identifiers Information (PIIs), etc.”. You should definitely avoid those.</p><p><b>Introducing Cloudforce One: our new threat operations and research team (</b><a href=\"/introducing-cloudforce-one-threat-operations-and-threat-research/\"><b>✍️</b></a><b>)</b><a href=\"/introducing-cloudforce-one-threat-operations-and-threat-research/\">Meet</a> our new threat operations and research team: <b>Cloudforce One</b>. While this team will publish research, that’s not its reason for being. Its primary objective: track and disrupt threat actors. It’s all about being protected against a great flow of threats with minimal to no involvement.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"wrap-up\">Wrap up</h2>\n            <a href=\"#wrap-up\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>The expression “if it ain&#39;t broke, don&#39;t fix it” doesn’t seem to apply to the fast pacing Internet industry, where attacks are also in the fast track. If you or your company and services aren’t properly protected, attackers (human or bots) will probably find you sooner than later (maybe they already did).</p><p>To end on a popular quote used in books, movies and in life: “You keep knocking on the devil&#39;s door long enough and sooner or later someone&#39;s going to answer you”. Although we have been onboarding many organizations while attacks are happening, that’s not the less hurtful solution — preventing and mitigating effectively and forget the protection is even there.</p><p>If you want to try some security features mentioned, the <a href=\"https://www.cloudflare.com/securitycenter/\">Cloudflare Security Center</a> is a good place to start (free plans included). The same with our <a href=\"https://www.cloudflare.com/plans/zero-trust-services/\">Zero Trust ecosystem</a> (or <a href=\"https://www.cloudflare.com/cloudflare-one/\">Cloudflare One</a> as our <a href=\"https://www.cloudflare.com/learning/access-management/what-is-sase/\">SASE</a>, Secure Access Service Edge) that is available as self-serve, and also includes a free plan (this vendor-agnostic <a href=\"https://zerotrustroadmap.org/\">roadmap</a> shows the general advantages of the Zero Trust architecture).</p><p>If trends are more your thing, <a href=\"https://radar.cloudflare.com/\">Cloudflare Radar</a> has a near real-time dedicated area about attacks, and you can browse and interact with our <a href=\"https://radar.cloudflare.com/notebooks/ddos-2022-q2\">DDoS attack trends for 2022 Q2</a> report.</p>",
		"id": "5OwoJQTgAgPoadve5G7UsL",
		"localeList": {
			"name": "2022 attacks! An August reading list to go “Shields Up” Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "In 2022, cybersecurity, more than ever, is a must-have for those who don’t want to take chances on getting caught in a cyberattack with difficult to deal with consequences. Here’s a reading list what you need to know about attacks that is also a guide on how to be protected.",
		"metadata": {
			"title": "2022 attacks! An August reading list to go “Shields Up”",
			"description": "In 2022, cybersecurity, more than ever, is a must-have for those who don’t want to take chances on getting caught in a cyberattack with difficult to deal with consequences. Here’s a reading list what you need to know about attacks that is also a guide on how to be protected.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2NBJIKQYxa9lkFLKXjAZh7/54609fa5b1b35f3bd0657124624597cf/2022-attacks-an-august-reading-list-to-go-shields-up-nddbaS.png"
		},
		"primary_author": {},
		"published_at": "2022-08-11T14:00:00.000+01:00",
		"slug": "2022-attacks-an-august-reading-list-to-go-shields-up",
		"tags": [
			{
				"id": "3f0KVCQugRsQZ0qHiifqCV",
				"name": "Reading List",
				"slug": "reading-list"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "5kIxDMJCg3PXQxVINDL0Cw",
				"name": "Attacks",
				"slug": "attacks"
			},
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "3A8zENWUQfuFg8Pwk89BtL",
				"name": "Ransom Attacks",
				"slug": "ransom-attacks"
			},
			{
				"id": "21DTsaKOfe5jbKfPDzYIBX",
				"name": "Phishing",
				"slug": "phishing"
			}
		],
		"title": "2022 attacks! An August reading list to go “Shields Up”",
		"updated_at": "2024-08-27T01:55:12.235Z",
		"url": "https://blog.cloudflare.com/2022-attacks-an-august-reading-list-to-go-shields-up"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}