{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Aaron Snell",
				"slug": "aaron-snell",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6YMUH0NN1vKuVrHqF1x4pG/5c2a642fc3b7845b4268417b56387840/Screenshot_20230605-131538.png"
			},
			{
				"name": "Shaheen Fattoe",
				"slug": "shaheen",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6vEUdKKymiCnhfaFDX2H3N/1b5a0649abda82189235559166a61cc1/face.jpg"
			},
			{
				"name": "Jada Klein",
				"slug": "jada",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2buETB6a7eDYp3R5PYlfIB/0a552fdbfd5be02cdba30b54f9fd5e39/jadakleinphoto.jpg"
			}
		],
		"excerpt": "This summer, Cloudflare welcomed approximately 60 interns from all around the globe, on a mission to #HelpBuildABetterInternet. Join us as we dive into what we were able to accomplish and our experiences!",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3BKvJNEqZLFh3G7P6inOch/4ad065e9df383ccc543b6a00ac6b501b/2494-Hero.png",
		"featured": false,
		"html": "\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3BKvJNEqZLFh3G7P6inOch/4ad065e9df383ccc543b6a00ac6b501b/2494-Hero.png\" alt=\"2494-Hero\" class=\"kg-image\" width=\"1200\" height=\"675\" loading=\"lazy\"/>\n          </figure><p>During the summer of 2024, Cloudflare welcomed approximately 60 Intern-ets from all around the globe on a mission to #HelpBuildABetterInternet. Over the course of their internships, our wonderful interns tackled real-world challenges from different teams all over the company and contributed to cutting-edge projects. As returning interns, we – Shaheen, Aaron, and Jada – would like to show off the great work our cohort has done and experiences we’ve had throughout our time here.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3jVnbXtD1UjhQx2TBhyujn/81033259ef3f269a1b29d95745178f8e/2494-2.png\" alt=\"2494-2\" class=\"kg-image\" width=\"1450\" height=\"1041\" loading=\"lazy\"/>\n          </figure><p><sub>Austin Interns after volunteering at the Central Texas Food Bank.</sub></p><h2>Putting the SHIP in internSHIP</h2><p>Cloudflare interns take pride in driving high-impact initiatives, playing a vital role in advancing Cloudflare&#39;s mission. With our diverse roles and projects this summer, we&#39;d love to highlight some of the exciting work we&#39;ve been involved in:</p><p><b>Rahul, </b>a Software Engineer intern<b>, </b>built a system to autograde intern application assignments for future students looking to join Cloudflare. It was built entirely on the <a href=\"https://www.cloudflare.com/developer-platform/\"><u>Cloudflare Developer Platform</u></a>, using <a href=\"https://developers.cloudflare.com/cloudflare-one/\"><u>Cloudflare Access</u></a>, <a href=\"https://developers.cloudflare.com/browser-rendering/\"><u>Browser Rendering</u></a>, <a href=\"https://developers.cloudflare.com/d1/\"><u>D1</u></a>, <a href=\"https://developers.cloudflare.com/durable-objects/\"><u>Durable Objects</u></a>, <a href=\"https://developers.cloudflare.com/r2/\"><u>R2</u></a>, and <a href=\"https://developers.cloudflare.com/workers/\"><u>Workers</u></a>!</p><p><b>Jessica</b>, a Software Engineer intern, created a new threads api for the <a href=\"https://developers.cloudflare.com/workers-ai/\"><u>Workers AI</u></a> team that automatically recalls past messages when running inference, helping developers to generate chat sessions when building personalized chatbots.</p><p><b>Anshika, </b>an Internal Audit intern<b>,</b> worked on <a href=\"https://www.auditboard.com/blog/sox-testing/\"><u>SOX</u></a> &amp; <a href=\"https://www.auditboard.com/blog/what-is-iso-audit/\"><u>ISO</u></a> testing for the first quarter of 2024, a data center audit, and is helping to roll out the automation of <a href=\"https://www.auditboard.com/blog/soc-2-framework-guide-the-complete-introduction/\"><u>SOC 2 testing</u></a>.</p><p><b>Jake, </b>a Business Development Relations intern<b>,</b> led the creation and launch of an outbound BDR campaign that generated new pipeline for Cloudflare involving tailored messaging, account criteria, and enablement materials.</p><p><b>Utkarsh,</b> a Software Engineer intern, built an internal tool for the Capacity Planning team to simulate unforeseen scenarios and changes within the Cloudflare network infrastructure, to help them provision new servers more efficiently.</p><p><b>Shaheen</b>, a Product Management intern, and<b> Anantharaman</b>, a Software Engineer Intern, collaboratively enhanced <a href=\"https://www.cloudflare.com/developer-platform/d1/\"><u>Cloudflare D1</u></a> with improvements in billing observability, the dashboard, and <a href=\"https://developers.cloudflare.com/workers/wrangler/\"><u>Wrangler</u></a> commands while also launching billing alerts and audit logs.</p><p><b>Jada, </b>a Software Engineer intern, developed a Policy Tester feature for the <a href=\"https://developers.cloudflare.com/cloudflare-one/policies/access/\"><u>Zero Trust Access Policies</u></a> page to enable Cloudflare customers to view policy update statistics, using <a href=\"https://www.cloudflare.com/developer-platform/durable-objects/\"><u>Cloudflare Durable Objects</u></a> for the RESTful API.</p><p><b>Dhravya, </b>a Software Engineer intern<b>, </b>helped launch <a href=\"https://blog.cloudflare.com/embedded-function-calling\"><u>function calling in Workers AI</u></a>, a feature that enables LLMs to dynamically perform actions or retrieve data.</p><p><b>Prajjwal, </b>a Research intern,<b> </b>focused on personalizing the <a href=\"https://developers.cloudflare.com/waf/about/waf-attack-score/\"><u>WAF attack score</u></a> and enhancing the overall user experience while experimenting with <a href=\"https://encord.com/blog/zero-shot-learning-explained/\"><u>zero-shot learning techniques</u></a> to detect new and evolving attacks.</p><p><b>Megan</b>, a Security Analytics intern, ensured a smooth transition to an in-house security access tool by managing internal user access, aligning group rules, and addressing missing or duplicated groups/users during system migrations.</p><h2>Intern events</h2><h3>In-person</h3><p>For the first time since the pandemic, Cloudflare had over half of our interns in-person in our Austin, Lisbon and London offices. As the saying goes, everything is bigger in Texas and our new Austin office intern class shows it, with over 20 interns working in-person throughout the summer! Some of our favorite events were…</p><p><b>Intern ping-pong tournament\n</b>After weeks of ping-pong classes, our interns got to put their skills to the test with a ping-pong tournament! The competition was fierce, with paddles flying and cheers echoing throughout the office as everyone battled for the title of Ping-Pong Champion. In the end, Josh, a PM intern on Workers, stole the show and was crowned as the 2024 Ping-Pong Champion.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5XSvtm3XL0g8g9kkLszpRP/b4e6ab7cb2638bb48342838440fc08d6/2494-3.jpg\" alt=\"2494-3\" class=\"kg-image\" width=\"1999\" height=\"1500\" loading=\"lazy\"/>\n          </figure><p><sub>Interns in the Austin office participating in the Ping-Pong tournament.</sub></p><p><b>Food Bank Volunteering\n</b>The Austin interns got the opportunity to give back to the community this summer at the <a href=\"https://www.centraltexasfoodbank.org/\"><u>Central Texas Food Bank</u></a>. With the help of our full-timers the team got to work instantly, from packing food boxes to helping organize donations. Thanks to all the hard work, the team was able to feed a total of 9,000 people!\n</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/792ufHahwVslL7zPU050OL/94b036120037165d2124dca86dac2174/2494-4.png\" alt=\"2494-4\" class=\"kg-image\" width=\"1500\" height=\"1037\" loading=\"lazy\"/>\n          </figure><p><sub>Austin Interns volunteering at the Central Texas Food Bank.</sub></p><p><b>Austin Game Show\n</b>The Austin interns had the exciting opportunity to participate in an exciting game show with their wonderful recruiters. This competitive showdown saw the “Winter-nets” face off against the “Return-ets” in a series of fun and challenging activities, including Family Feud and Wheel of Fortune. In the end, the Return-ets took the victory, with perhaps one too many pictures to prove it. Events like this are among the best, fostering bonding and friendly competition that bring everyone closer together.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/38AAvkHN6XRibIbvcj5Igl/1987b1499d83a86ad8b4c0eb5710d62a/2494-5.png\" alt=\"2494-5\" class=\"kg-image\" width=\"1498\" height=\"1143\" loading=\"lazy\"/>\n          </figure><p><sub>“Return-ets” posing with the trophy they won.</sub></p><p>Our Lisbon office also had 10 interns join Cloudflare and spend time doing some awesome things, including…</p><p><b>Visiting the Lisbon Data Center\n</b>One of the most impressive parts of Cloudflare is its infrastructure, which spans <a href=\"https://www.cloudflare.com/network/\"><u>hundreds</u></a> of data centers worldwide. This summer, our interns were able to get up close and personal with our Lisbon data center where they ventured through Cloudflare’s state-of-the-art server rooms. They witnessed the security measures that are in place to ensure the safety of our data and the support systems that ensure that the facility is able to run nonstop.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7na6jcN5Ari4OBtsicAlZ6/44001348bafeb57f2a78f724d9423b31/2494-6.png\" alt=\"2494-6\" class=\"kg-image\" width=\"512\" height=\"384\" loading=\"lazy\"/>\n          </figure><p><sub>Interns and Cloudflarians taking a photo in the Lisbon data center.</sub></p><h3>Remote</h3><p>Our remote interns got to take on some virtual adventures throughout the summer, building friendships and memories from all around the globe! Some of the highlights were…</p><h4>Snack time</h4><p>Interns all over the globe were shipped a box filled with an assortment of Japanese snacks and got to spend time together snacking on unique and new foods. This event not only satisfied our snack cravings but also strengthened our global connections with a fun, shared experience.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1QsvmJtnnNyLQgd1QaDXuo/5b4b33a97f25d9198953d40f74d99502/2494-7.png\" alt=\"2494-7\" class=\"kg-image\" width=\"1999\" height=\"1121\" loading=\"lazy\"/>\n          </figure><p><sub>Remote interns showing their favorite snacks from the snack boxes we received.</sub></p><h4>Mingling meetups</h4><p>Throughout the summer, interns got the chance to mingle with one another as well as the rest of the company. For a break from project work and a time to socialize, interns looked forward to Virtual Intern Game Days and Gatheround meetups. These designated online hangout blocks made for a more fun and inclusive experience for the remote interns. Along with that, remote interns near Cloudflare offices were welcome to join in-person events throughout the summer: from team lunches to arts &amp; crafts and social mixers, visiting the office is always worth the trip!</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4d8Iy9W5w0Yr0ZsDv6ZhqQ/5efffef6e8e10c1895295a7bd97499f1/2494-8.png\" alt=\"2494-8\" class=\"kg-image\" width=\"1128\" height=\"819\" loading=\"lazy\"/>\n          </figure><p><sub>Group photo of a Gatherround session with the interns and Cloudfriends.</sub></p><h4>Executive chats</h4><p>Executive chats have been a key part of ensuring our interns get to truly know our top leaders and ask them questions 1-on-1. This summer was no exception, with interns hosting over eight executive chats filled with inspiring stories, valuable knowledge, and meaningful connections. Here’s what our interns had to say about it…</p><p><b>Alex</b> enjoyed talking with <b>Matthew Prince</b>, Chief Executive Officer: “It was so heartfelt and emotional. I had heard the story of Lee Holloway before, but hearing it from Matthew himself was really impactful.” </p><p><b>Chantal</b> loved the talk with <b>Michele Yetman</b>, Chief People Officer: “I enjoyed hearing about her job history and how she carefully adapted skill sets from her previous jobs to craft her career. Also, she was curious to hear our perspective and answered our questions in honest detail.”</p><p><b>Anantharaman </b>liked the talk with <b>Dane Knecht</b>, SVP of Emerging Technology and Innovation: “Learning about the growth of ETI, the Austin office and the mission to move fast and break things within ETI to nurture a startup-y culture was very interesting.”</p><p><b>Matilde</b> valued the talk with <b>Nitin Rao</b>, Interim Chief Product Officer: “I didn&#39;t know much about him beforehand, but I found it fascinating to learn about his role at the company and the great impact of his contributions to Cloudflare&#39;s current infrastructure.”</p><h4>Company-wide intern presentations</h4><p>Each summer, Cloudflare Intern-ets have the opportunity to showcase their work during the annual Intern Presentations series. Hundreds of Cloudflarians join in to support and celebrate the interns including Matthew Prince and Michelle Zatlyn. As <b>Jake</b>, a BDR Operations Intern, puts it, “The opportunity to present in front of the founders and the rest of the company speaks volumes about how much Cloudflare values its interns&#39; projects.”</p><h4>Cloudfriends</h4><p>Cloudfriends is a program specifically for interns to socialize with people throughout Cloudflare. Cloudflare employees from various departments signed up, and we were able to schedule meetings with all of them. These meetings let us get to know more people, share experiences, and keep in touch (even after our internships have ended). On a similar note, Cloudflare has a program for <a href=\"https://blog.cloudflare.com/random-employee-chats-cloudflare\"><u>Random Employee Chats</u></a> that interns can also take part in. These chats randomly pair you with another Cloudflare employee once a week and allow you to do even more socializing.</p><h2>Unforgettable memories</h2><p>Throughout our time here at Cloudflare, we formed numerous unforgettable memories that truly made our internship experience one of a kind.</p><h3>The people</h3><p>Cloudflare is filled with the most driven, passionate, and all around amazing people, so it’s no wonder that we all had a spectacular time interacting with everyone!</p><p><b>Ananya</b> took networking to the next level by engaging with 49 people throughout her internship, forging valuable connections across the company. Meanwhile, <b>Yomna</b> wasted no time setting up 25 1:1s by the end of her second week, meeting a bunch of awesome people along the way.</p><p><b>Alex</b>,<b> Shaheen</b>,<b> Jack</b>,<b> Jake</b>,<b> Jaden</b>,<b> </b>and <b>Josh </b>hit up a local Austin restaurant and spent SIX hours bonding over laughs, talks, and good vibes. From strangers to friends, this was a moment that will last well beyond their internships.</p><p><b>Carol </b>and <b>Jessica</b> enjoyed their teams’ on-site events in the Austin office. They were able to meet all of their team members face-to-face and work and have fun together. The numerous on-site events that took place over the summer let the Austin Intern-ets connect with people from all over the company, including other Intern-ets that were remote or working out of another office.</p><p><b>Dhanush </b>and <b>Utkarsh</b> gathered the interns to enjoy the Olympics in the Austin office. They all sat in the same area, talked with each other, and while watching the intense competition.</p><h3>The activities</h3><p><b>Aaron</b>, <b>Carol</b>,<b> </b>and <b>Tara</b> enjoyed all the game nights the <a href=\"https://www.cloudflare.com/developer-platform/r2/\"><u>R2</u></a> team hosted. They played a variety of board and card games from <i>For Sale</i> to <i>Brass: Birmingham</i> that everyone enjoyed, and they even did some late-night karaoke. <b>Anshika</b> also enjoyed the games that the Internal Audit team played before their all-hands meetings, such as <a href=\"http://skribbl.io\"><u>skribbl.io</u></a>. These events let everyone on the team be more connected and overall just have fun.</p><p>The Austin interns filled their time with loads of different activities. From a dinner with Matthew, to visiting Barton Springs, to hosting a 4th of July barbecue party on top of a high-rise and overlooking Austin’s skyline, they certainly didn’t miss an opportunity to get out and have fun.</p><p>Meanwhile, in Europe, the London interns enjoyed their lunches on the beach. They were able to talk, swim, and get to know each other. The Lisbon office also hosted a bunch of team lunches that allowed everyone to work together and enjoy the sun.</p><h2>Summer shenanigans</h2><p><b>Dhravya&#39;s caffeine fix:</b> Dhravya drank around 250 cups of coffee over the course of his 12-week internship.</p><p><b>Matilde the bus marathoner</b>: Every week, Matilde traveled 740 km from Braga to the Lisbon office by bus. By the end of her internship, she had accumulated 108 hours and 8880 km.</p><p><b>Anantharaman&#39;s epic commute: </b>Anantharaman chose to turn his daily commute into a marathon, walking over 100 miles during his 14-week internship.</p><p><b>Jack the Linux legend</b>: Jack was the second most active Linux-based developer for dash.cloudflare.com.</p><p><b>Josh the Ping-Pong prodigy</b>: Josh started his internship as a ping-pong newbie but after daily break-time practice, he smashed his way to win the intern ping-pong tournament.</p><p><b>Wing night warriors:</b> The Austin interns PROUDLY placed 24th in the Pluckers Wing night trivia.</p><h2>Byte-sized intern advice</h2><p>Wondering how to get the most out of your time as an intern? We surveyed the Intern-ets for some insider hints…</p><p><b>Be curious and don’t be afraid to ask questions: </b>An overwhelming number of Intern-ets and executives alike emphasized the importance of staying curious and keeping an open mind. Aside from that, asking questions can make a huge difference to get unstuck or even think ahead on problems; As <b>Nikhil</b>, a SWE Intern, points out, “Cloudflare is vast, and people are super friendly + eager to help.”</p><p><b>The importance of introductions: </b>PM Intern <b>Yomna </b>notes how “cross-functional work…always works best when you are able to establish proper connections, a unified voice, and an open space that is dedicated to tackling the problem/situation at hand” and BDR Operations Intern <b>Blaise </b>recommends that interns “...make meetings with everyone on your team just to understand what each person is working on, and where you may be able to slot in”</p><p><b>Data on data: </b>Marketing Analytics Intern <b>Tanuj </b>provides some insight, highlighting how “In analytics, it&#39;s crucial to be data-informed rather than just data-driven. For instance, data might suggest cutting a high-spend marketing campaign due to low short-term ROI. However, understanding the business context – such as the campaign&#39;s role in building brand loyalty can reveal its long-term value. Always consider the broader picture for more impactful insights.”</p><h2>Want to become an Intern-et or Cloudflarian?</h2><p>Sign up<b> </b><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSf4_l818Im_k-hVwD_yocilk9ZUcWInd0Ttr9LrQQdjKTvrGA/viewform\"><u>here</u></a><b> </b>to be notified of new graduate and internship opportunities for 2025. Cloudflare is also hiring for full-time opportunities: check out <a href=\"https://www.cloudflare.com/careers/jobs/\"><u>open positions</u></a> and apply today!</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7mtKCdM8dhj3nPF7wN5yza/219bac93ac274995cedd5c925772910a/2494-End.png\" alt=\"2494-End\" class=\"kg-image\" width=\"1800\" height=\"628\" loading=\"lazy\"/>\n          </figure><p></p>",
		"id": "2wNtV7QL6cbw0MRekvJYks",
		"localeList": {
			"name": "blog-english-only",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"metadata": {
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/37a8AMLbvzy8FToncJbnmY/288c3813a41351e0f4638146363e0535/2494-OG.png"
		},
		"primary_author": {},
		"published_at": "2024-08-19T14:00-07:00",
		"slug": "2024-interns",
		"tags": [
			{
				"id": "3vILtHLIQU7d8BaWzXAPv4",
				"name": "Internship Experience",
				"slug": "internship-experience"
			},
			{
				"id": "5qlZm2rbAGLnU2ylylozmO",
				"name": "Careers",
				"slug": "careers"
			},
			{
				"id": "4g8tPriKOAUwdUT4jNPebe",
				"name": "Life at Cloudflare",
				"slug": "life-at-cloudflare"
			}
		],
		"title": "Summer 2024 weather report: Cloudflare with a chance of Intern-ets",
		"updated_at": "2024-08-19T21:44:35.849Z",
		"url": "https://blog.cloudflare.com/2024-interns"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}