{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"ko-kr",
		"pt-br",
		"es-es",
		"nl-nl"
	],
	"post": {
		"authors": [
			{
				"name": "John Cosgrove",
				"slug": "john-cosgrove",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/aQvqUtMeYIUH7r1CngAse/617a3469f3849bda469a80ae5001c785/john-cosgrove.jpg",
				"location": null,
				"website": null,
				"twitter": "@cameracoz",
				"facebook": null
			},
			{
				"name": "Sabina Zejnilovic",
				"slug": "sabina",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/TsYW8cvR78gk1niJXS2fK/682d64acfe70c4148f7140a388897600/sabina.JPG",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Today, we’re releasing our 2024 API Security and Management Report. This blog introduces and is a supplement to the API Security and Management Report for 2024 where we detail exactly how we’re protecting our customers, and what it means for the future of API security",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5zyCUwG1rWsB8ILMVR3yid/4a7fa3dd7b01fb8b2e8884dfe0e5bf51/2024-api-security-report.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2wnkskFDuLFCKg3bJKxdEA/2e142c77baef95b1154d2ce418951dea/Artboard-1-1.png\" alt=\"Introducing Cloudflare’s 2024 API security and management report\" class=\"kg-image\" width=\"1465\" height=\"845\" loading=\"lazy\"/>\n            \n            </figure><p>You may know Cloudflare as the company powering nearly 20% of the web. But powering and protecting websites and static content is only a fraction of what we do. In fact, well over half of the dynamic traffic on our network consists not of web pages, but of Application Programming Interface (API) traffic — the plumbing that makes technology work. This blog introduces and is a supplement to the <a href=\"https://www.cloudflare.com/lp/api-security-report/\">API Security Report for 2024</a> where we detail exactly how we’re protecting our customers, and what it means for the future of API security. Unlike other industry API reports, our report isn’t based on user surveys — but instead, based on real traffic data.</p><p>If there’s only one thing you take away from our report this year, it’s this: many organizations lack accurate API inventories, <i>even when they believe they can correctly identify API traffic</i>. Cloudflare helps organizations discover all of their public-facing APIs using <a href=\"/ml-api-discovery-and-schema-learning/\">two approaches</a>. First, customers configure our API discovery tool to monitor for identifying tokens present in their known API traffic. We then use a machine learning model that scans not just these known API calls, but <i>all</i> HTTP requests, identifying API traffic that may be going unaccounted for. The difference between these approaches is striking: <b>we found 30.7% more API endpoints through machine learning-based discovery</b> than the self-reported approach, suggesting that nearly a third of APIs are “<a href=\"https://www.cloudflare.com/learning/security/api/what-is-shadow-api/\">Shadow APIs</a>” — and may not be properly inventoried and secured.</p><p>Read on for extras and highlights from our inaugural API security report. In the <a href=\"https://www.cloudflare.com/2024-api-security-management-report/\">full report</a>, you’ll find updated statistics about the threats we see and prevent, along with our predictions for 2024. We predict that a lack of API security focus at organizations will lead to increased complexity and loss of control, and increased access to generative AI will lead to more API risk. We also anticipate an increase in API business logic attacks in 2024. Lastly, all of the above risks will necessitate growing governance around API security.</p><h3>Hidden attack surfaces</h3><p>How are web pages and APIs different? APIs are a quick and easy way for applications to retrieve data in the background, or ask that work be done from other applications. For example, anyone can write a weather app without being a meteorologist: a developer can write the structure of the page or mobile application and ask a weather API for the forecast using the user’s location. Critically, most end users don’t know that the data was provided by the weather API and not the app’s owner.</p><p>While APIs are the critical plumbing of the Internet, they&#39;re also ripe for abuse. For example, flaws in API authentication and authorization at Optus <a href=\"https://www.bleepingcomputer.com/news/security/optus-hacker-apologizes-and-allegedly-deletes-all-stolen-data/\">led to a threat actor offering</a> 10 million user records for sale, and government agencies have <a href=\"https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-208a\">warned about</a> these exact API attacks. Developers in an organization will often create Internet-facing APIs, used by their own applications to function more efficiently, but it&#39;s on the security team to protect these new public interfaces. If the process of documenting APIs and bringing them to the attention of the security team isn&#39;t clear, they become Shadow APIs — operating in production but without the organization&#39;s knowledge. This is where the <a href=\"https://www.cloudflare.com/learning/security/what-is-an-attack-surface/\">security challenge</a> begins to emerge.</p><p>To help customers solve this problem, we shipped <a href=\"https://developers.cloudflare.com/api-shield/security/api-discovery/\">API Discovery</a>. When we <a href=\"/ml-api-discovery-and-schema-learning/\">introduced</a> our latest release, we mentioned how few organizations have accurate API inventories. Security teams sometimes are forced to adopt an “email and ask” approach to build an inventory, and in doing so responses are immediately stale upon the next application release when APIs change. Better is to track API changes by code base changes, keeping up with new releases. However, this still has a drawback of only inventorying actively maintained code. Legacy applications may not see new releases, despite receiving production traffic.</p><p>Cloudflare&#39;s approach to API management involves creating a comprehensive, accurate API inventory using a blend of machine learning-based API discovery and network traffic inspection. This is integral to our <a href=\"https://www.cloudflare.com/application-services/products/api-gateway/\">API Gateway</a> product, where customers can manage their Internet-facing endpoints and monitor API health. The API Gateway also allows customers to identify their API traffic using session identifiers (typically a header or cookie), which aids in specifically identifying API traffic for the discovery process.</p><p>As noted earlier, our analysis reveals that even knowledgeable customers often overlook significant portions of their API traffic. By comparing session-based API discovery (using API sessions to pinpoint traffic) with our machine learning-based API discovery (analyzing <i>all</i> incoming traffic), we found that the latter uncovers on average 30.7% more endpoints! Without broad traffic analysis, you may be missing almost a third of your API inventory.</p><p>If you aren’t a Cloudflare customer, you can still get started building an API inventory. APIs are typically cataloged in a standardized format called <a href=\"https://spec.openapis.org/oas/latest.html\">OpenAPI</a>, and many development tools can build OpenAPI formatted schema files. If you have a file with that format, you can start to build an API inventory yourself by collecting these schemas. Here is an example of how you can pull the endpoints out of a schema file, assuming your have an OpenAPI v3 formatted file named <code>my_schema.json</code>:</p>\n            <pre class=\"language-python\"><code class=\"language-python\">import json\nimport csv\nfrom io import StringIO\n\n# Load the OpenAPI schema from a file\nwith open(&quot;my_schema.json&quot;, &quot;r&quot;) as file:\n    schema = json.load(file)\n\n# Prepare CSV output\noutput = StringIO()\nwriter = csv.writer(output)\n\n# Write CSV header\nwriter.writerow([&quot;Server&quot;, &quot;Path&quot;, &quot;Method&quot;])\n\n# Extract and write data to CSV\nservers = schema.get(&quot;servers&quot;, [])\nfor server in servers:\n    url = server[&#039;url&#039;]\n    for path, methods in schema[&#039;paths&#039;].items():\n        for method in methods.keys():\n            writer.writerow([url, path, method])\n\n# Get and print CSV string\ncsv_output = output.getvalue().strip()\nprint(csv_output)</pre></code>\n            <p>Unless you have been generating OpenAPI schemas and tracking API inventory from the beginning of your application’s development process, you’re probably missing some endpoints across your production application API inventory.</p><h3>Precise rate limits minimize attack potential</h3><p>When it comes to stopping abuse, most practitioners’ thoughts first come to <a href=\"https://www.cloudflare.com/learning/bots/what-is-rate-limiting/\">rate limiting</a>. <b>Implementing limits on your API is a valuable tool to keep abuse in check and prevent accidental overload of the origin.</b> But how do you know if you’ve chosen the correct rate limiting approach? Approaches can vary, but they generally come down to the error code chosen, and the basis for the limit value itself.</p><p>For some APIs, practitioners configure rate limiting errors to respond with an HTTP 403 (forbidden), while others will respond with HTTP 429 (too many requests). Using HTTP 403 sounds innocent enough until you realize that other security tools are also responding with 403 codes. When you’re under attack, it can be hard to decipher which tools are responsible for which errors / blocking.</p><p>Alternatively, if you utilize HTTP 429 for your rate limits, attackers will instantly know that they’ve been rate limited and can “surf” right under the limit without being detected. This can be OK if you’re only limiting requests to ensure your back-end stays alive, but it can tip your cards to attackers. In addition, attackers can “scale out” to more API clients to effectively request above the rate limit.</p><p>There are pros and cons to both approaches, but we find that by far most APIs respond with HTTP 429 out of all the 4xx and 5xx error messages (almost 52%).</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6cJjGIFScYgWUrc7KizhvE/68bf77157f9a0b94d5599205d81ba658/Untitled.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"885\" loading=\"lazy\"/>\n            \n            </figure><p>What about the logic of the rate limit rule itself, not just the response code? Implementing request limits on IP addresses can be tempting, but <b>we recommend you base the limit on a session ID as a best practice and only fall back to IP address (or IP + JA3 fingerprint) when session IDs aren’t available</b>. Setting rate limits on user sessions instead of IPs will reliably identify your real users and minimize false positives due to shared IP space. Cloudflare’s <a href=\"https://www.cloudflare.com/application-services/products/rate-limiting/\">Advanced Rate Limiting</a> and API Gateway’s <a href=\"https://developers.cloudflare.com/api-shield/security/volumetric-abuse-detection/\">volumetric abuse protection</a> make it easy to enforce these limits by profiling session traffic on each API endpoint and giving one-click solutions to set up the per-endpoint rate limits.</p><p>To find values for your rate limits, Cloudflare API Gateway computes session request statistics for you. We suggest a limit by looking at the distribution of requests per session across <i>all</i> sessions to your API as identified by the customer-configured API session identifier. We then <a href=\"https://developers.cloudflare.com/api-shield/security/volumetric-abuse-detection/#observe-rate-limits\">compute statistical p-levels</a> — which describe the request rates for different cohorts of traffic — for p50, p90, and p99 on this distribution and use the variance of the distribution to come up with a recommended threshold for every single endpoint in your API inventory. The recommendation might not match the p-levels, which is an important distinction and a reason not to use p-levels alone. Along with the recommendation, API Gateway informs users of our confidence in the recommendation. Generally, the more API sessions we’re able to collect, the more confident we’ll be in the recommendation.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5b6UZSSACJxBUGIBkD7lBL/eb2c9847b745da597036bf162a103cc7/Screenshot-2024-01-04-at-12.50.45-1.png\" alt=\"\" class=\"kg-image\" width=\"2082\" height=\"1116\" loading=\"lazy\"/>\n            \n            </figure><p>Activating a rate limit is as easy as clicking the ‘create rule’ link, and API Gateway will automatically bring your session identifier over to the advanced rate limit rule creation page, ensuring your rules have pinpoint accuracy to defend against attacks and minimize false positives compared to traditional, overly broad limits.</p><h3>APIs are also victim to web application attacks</h3><p>APIs aren’t immune from normal OWASP Top 10 style attacks like <a href=\"https://www.cloudflare.com/learning/security/threats/sql-injection/\">SQL injection</a>. The body of API requests can also find its way as a database input just like a web page form input or URL argument. It’s important to ensure that you have a <a href=\"https://www.cloudflare.com/learning/ddos/glossary/web-application-firewall-waf/\">web application firewall (WAF)</a> also protecting your API traffic to defend against these styles of attacks.</p><p>In fact, when we looked at Cloudflare’s WAF managed rules, injection attacks were the second most common threat vector Cloudflare saw carried out on APIs. The most common threat was HTTP Anomaly. Examples of HTTP anomalies include malformed method names, null byte characters in headers, non-standard ports or content length of zero with a POST request. Here are the stats on the other top threats we saw against APIs:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4RAYOdH61ox07Ps1INKxO2/43a0019dd046c38887bacf95eca053a6/Untitled--1---1-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"822\" loading=\"lazy\"/>\n            \n            </figure><p>Absent from the chart is broken authentication and authorization. Broken authentication and authorization occur when an API fails to check whether the entity sending requests for information to an API actually has the permission to request that data or not. It can also happen when attacks try to forge credentials and insert less restricted permissions into their existing (valid) credentials that have more restricted permissions. OWASP categorizes these attacks in a few different ways, but the main categories are Broken Object Level Authorization (BOLA) and Broken Function Level Authorization (BFLA) attacks.</p><p>The root cause of a successful BOLA / BFLA attack lies in an origin API not checking proper ownership of database records against the identity requesting those records. Tracking these specific attacks can be difficult, as the permission structure may be simply absent, inadequate, or improperly implemented. Can you see the chicken-and-egg problem here? It would be easy to stop these attacks if we knew the proper permission structure, but if we or our customers knew the proper permission structure or could guarantee its enforcement, the attacks would be unsuccessful to begin with. Stay tuned for future API Gateway feature launches where we’ll use our knowledge of API traffic norms to automatically suggest security policies that highlight and stop BOLA / BFLA attacks.</p><p>Here are four ways to plug authentication loopholes that may exist for your APIs, even if you don’t have a fine-grained authorization policy available:</p><ol><li><p>First, enforce authentication on each publicly accessible API unless there&#39;s a business approved exception. Look to technologies like mTLS and JSON Web Tokens.</p></li><li><p>Limit the speed of API requests to your servers to slow down potential attackers.</p></li><li><p>Block abnormal volumes of sensitive data outflow.</p></li><li><p>Block attackers from skipping legitimate sequences of API requests.</p></li></ol><h3>APIs are surprisingly human driven, not machine driven anymore</h3><p>If you’ve been around technology since the pre-smartphone days when fewer people were habitually online, it can be tempting to think of APIs as only used for machine-to-machine communication in something like an overnight batch job process. However, the truth couldn’t be more different. As we’ve discussed, many web and mobile applications are powered by APIs, which facilitate everything from authentication to transactions to serving media files. As people use these applications, there is a corresponding increase in API traffic volume.</p><p>We can illustrate this by looking at the API traffic patterns observed during holidays, when people gather around friends and family and spend more time socializing in person and less time online. We’ve annotated the following Worldwide API traffic graph with common holidays and promotions. Notice how traffic peaks around Black Friday and Cyber Monday around the +10% level when people shop online, but then traffic drops off for the festivities of Christmas and New Years days.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7aETzYYdiYbkQws35HSDlK/71637ed0e1b502b7b17ba376876110b5/Untitled--2-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"647\" loading=\"lazy\"/>\n            \n            </figure><p>This pattern <a href=\"/cyber-week-analyzing-internet-traffic-and-e-commerce-trends\">closely resembles</a> what we observe in regular HTTP traffic. It’s clear that APIs are no longer just the realm of automated processes but are intricately linked with human behaviors and social trends.</p><h3>Recommendations</h3><p>There is no silver bullet for holistic API security. For the best effect, Cloudflare recommends four strategies for increasing API security posture:</p><ol><li><p>Combine API application development, visibility, performance, and security with a unified control plane that can keep an up-to-date API inventory.</p></li><li><p>Use security tools that utilize machine learning technologies to free up human resources and reduce costs.</p></li><li><p>Adopt a positive security model for your APIs (see below for an explanation on positive and negative security models).</p></li><li><p>Measure and improve your organization’s API maturity level over time (also see below for an explanation of an API maturity level).</p></li></ol><p>What do we mean by a ‘positive’ or ‘negative’ security model? In a negative model, security tools look for known signs of attack and take action to stop those attacks. In a positive model, security tools look for known good requests and only let those through, blocking all else. APIs are often so structured that positive security models make sense for the highest levels of security. You can also combine security models, such as using a WAF in a negative model sense, and using API Schema Validation in a positive model sense.</p><p>Here’s a quick way to gauge your organization’s API security maturity level over time: Novice organizations will get started by assembling their first API inventory, no matter how incomplete. More mature organizations will strive for API inventory accuracy and automatic updates. The most mature organizations will actively enforce security checks in a positive security model on their APIs, enforcing API schema, valid authentication, and checking behavior for signs of abuse.</p><h3>Predictions</h3><p>In closing, our top four predictions for 2024 and beyond:</p><p><b>Increased loss of control and complexity:</b> we surveyed practitioners in the API Security and Management field and 73% responded that security requirements interfere with their productivity and innovation. Coupled with increasingly sprawling applications and inaccurate inventories, API risks and complexity will rise.</p><p><b>Easier access to AI leading to more API risks:</b> the rise in generative AI brings potential risks, including AI models’ APIs being vulnerable to attack, but also developers shipping buggy, AI-written code. Forrester predicts that, in 2024, without proper guardrails, “at least three data breaches will be publicly blamed on insecure AI-generated code – either due to security flaws in the generated code itself or vulnerabilities in AI-suggested dependencies.”</p><p><b>Increase in business logic-based fraud attacks:</b> professional fraudsters run their operations just like a business, and they have costs like any other. We anticipate attackers will run fraud bots efficiently against APIs even more than in previous years.</p><p><b>Growing governance:</b> The first version of <a href=\"https://www.cloudflare.com/learning/privacy/what-is-pci-dss-compliance/\">PCI DSS</a> that directly addresses API security will go into effect in March 2024. Check your industry’s specific requirements with your audit department to be ready for requirements as they come into effect.</p><p>If you’re interested in the full report, you can download the 2024 API Security Report <a href=\"https://www.cloudflare.com/2024-api-security-management-report/\">here</a>, which includes full detail on our recommendations.</p><p><i>Cloudflare API Gateway is our </i><a href=\"https://www.cloudflare.com/application-services/solutions/api-security/\"><i>API security solution</i></a><i>, and it is available for all Enterprise customers. If you aren’t subscribed to API Gateway,</i> <a href=\"http://dash.cloudflare.com/?to=/:account/:zone/security/api-shield\"><i>click here</i></a> <i>to view your initial API Discovery results and start a trial in the Cloudflare dashboard. To learn how to use API Gateway to secure your traffic,</i> <a href=\"https://developers.cloudflare.com/api-shield/\"><i>click here</i></a> <i>to view our development docs and</i> <a href=\"https://developers.cloudflare.com/api-shield/get-started/\"><i>here</i></a> <i>for our getting started guide.</i></p>",
		"id": "7dEgZBP69KIcuJAqhX5Ety",
		"localeList": {
			"name": "Introducing Cloudflare’s 2024 API security and management report Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "Translated for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "Translated for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Today, we’re releasing our 2024 API Security and Management Report. This blog introduces and is a supplement to the API Security and Management Report for 2024 where we detail exactly how we’re protecting our customers, and what it means for the future of API security.",
		"metadata": {
			"title": "Introducing Cloudflare’s 2024 API security and management report",
			"description": "Today, we’re releasing our 2024 API Security and Management Report. This blog introduces and is a supplement to the API Security and Management Report for 2024 where we detail exactly how we’re protecting our customers, and what it means for the future of API security.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1XOn3gHD4c2xyWHbik803i/68036c0df7a989a8dc47cf22913fd53f/2024-api-security-report-9kN975.png"
		},
		"primary_author": {},
		"published_at": "2024-01-09T14:00:03.000+00:00",
		"slug": "2024-api-security-report",
		"tags": [
			{
				"id": "7aSCe0ZArYqX0ThFK2gRm0",
				"name": "API Gateway",
				"slug": "api-gateway"
			},
			{
				"id": "4lmuF3Pb7F4hTBUe3svrD0",
				"name": "API Security",
				"slug": "api-security"
			},
			{
				"id": "6GvYnn2MD0ye88h10BplGd",
				"name": "API Shield",
				"slug": "api-shield"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			}
		],
		"title": "Introducing Cloudflare’s 2024 API security and management report",
		"updated_at": "2024-08-27T01:01:45.214Z",
		"url": "https://blog.cloudflare.com/2024-api-security-report"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}