{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Martin J Levy",
				"slug": "martin-levy",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1WFEW1m2I5kRmXiq1bAGLv/97bef2575960860f1d2fc20bad1e29ec/martin-levy.jpeg",
				"location": null,
				"website": null,
				"twitter": "@mahtin",
				"facebook": null
			}
		],
		"excerpt": "It was fifty years ago when the very first network packet took flight from the Los Angeles campus at UCLA to the Stanford Research Institute (SRI) building in Palo Alto. Those two California sites had kicked-off the world of packet networking, of the Arpanet, and of the modern Internet ...",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/63sZ4HcEjsOJr44nK0ck25/6b66ed60c01ff2ca6f853094ba6fcb36/50-years-of-the-internet-work-in-progress-to-a-better-internet.png",
		"featured": false,
		"html": "<p>It was fifty years ago when the very first network packet took flight from the Los Angeles campus at UCLA to the Stanford Research Institute (SRI) building in Palo Alto. Those two California sites had kicked-off the world of packet networking, of the Arpanet, and of the modern Internet as we use and know it today. Yet by the time the third packet had been transmitted that evening, the receiving computer at SRI had crashed. The “L” and “O” from the word “LOGIN” had been transmitted successfully in their packets; but that “G”, wrapped in its own packet, caused the death of that nascent packet network setup. Even today, software crashes, that’s a solid fact; but this historic crash, is exactly that — historic.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2TTNW1HbwIXlZyszMky7js/bf7721bb3239091ea838b63f4e6c2063/G69Dec.png\" alt=\"\" class=\"kg-image\" width=\"880\" height=\"628\" loading=\"lazy\"/>\n            \n            </figure><p>Courtesy of <a href=\"http://mercury.lcs.mit.edu/~jnc/tech/arpageo.html\"><b>MIT Advanced Network Architecture Group</b></a> </p><p>So much has happened since that day (October 29’th to be exact) in 1969, in fact it’s an understatement to say “so much has happened”! It’s unclear that one blog article would ever be able to capture the full history of packets from then to now. Here at Cloudflare we say we are helping build a “<b>better Internet</b>”, so it would make perfect sense for us to honor the history of the Arpanet and its successor, the Internet, by focusing on some of the other folks that have helped build a <b>better Internet</b>.</p><h3>Leonard Kleinrock, Steve Crocker, and crew - those first packets</h3><p>Nothing takes away from what happened that October day. The move from a circuit-based networking mindset to a packet-based network is momentus. The phrase <a href=\"https://www.wired.com/1996/10/atm-3/\">net-heads vs bell-heads</a> was born that day - and it’s still alive today! The basics of why the Internet became a <a href=\"https://www.ietf.org/blog/permissionless-innovation/\">permissionless innovation</a> was instantly created the moment that first packet traversed that network fifty years ago.</p><p>Professor Leonard (Len) Kleinrock continued to work on the very-basics of packet networking. The network used on that day expanded from two nodes to four nodes (in 1969, one IMP was delivered each month from BBN to various university sites) and created a network that spanned the USA from coast to coast and then beyond.</p><p>In the 1973 map there’s a series of boxes marked TIP. These are a version of the IMP that was used to connect computer terminals along with computers (hosts) to the ARPANET. Every IMP and TIP was managed by Bolt, Beranek and Newman (BBN), based in Cambridge Mass. This is vastly different from today’s Internet where every network is operated autonomously.</p><p>By 1977 the ARPANET had grown further with links from the United States mainland to Hawaii plus links to Norway and the United Kingdom.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2n5icuY7rTANONAut47vTw/a2f87304636c44504edd4cd4e2dcca83/Arpanet_logical_map-_march_1977.png\" alt=\"\" class=\"kg-image\" width=\"1000\" height=\"716\" loading=\"lazy\"/>\n            \n            </figure><p>ARPANET logical map 1977 via <a href=\"https://en.wikipedia.org/wiki/ARPANET\">Wikipedia</a></p><p>Focusing back to that day in 1969, Steve Crocker (who was a graduate student at UCLA at that time) headed up the development of the NCP software. The Network Control Program (later remembered as Network Control Protocol) provided the host to host transmission control software stack. Early versions of telnet and FTP ran atop NCP.</p><p>During this journey both Len Kleinrock, Steve Crocker, and the other early packet pioneers have always been solid members of the Internet community and continue to deliver daily to a better Internet.</p><p>Steve Crocker and Bill Duvall have written a <a href=\"/fifty-years-ago/\">guest blog</a> about that day fifty years ago. Please read it after you&#39;ve finished reading this blog.</p><p>BTW: Today, on this 50th anniversary, UCLA is celebrating history via this <a href=\"http://newsroom.ucla.edu/releases/internet-50-symposium-ucla\">symposium</a> (see also <a href=\"https://samueli.ucla.edu/internet50/\">https://samueli.ucla.edu/internet50/</a>).</p><p>Their collective accomplishments are extensive and still relevant today.</p><h3>Vint Cerf and Bob Kahn - the creation of TCP/IP</h3><p>In 1973 Vint Cerf was asked to work on a protocol to replace the original NCP protocol. The new protocol is now known as TCP/IP. Of course, everyone had to move from NCP to TCP and that was outlined in <a href=\"https://tools.ietf.org/html/rfc801\">RFC801</a>. At the time (1982 and 1983) there were around 200 to 250 hosts on the ARPANET, yet that transition was still a major undertaking.</p><p>Finally, on January 1st, 1983, fourteen years after that first packet flowed, the NCP protocol was retired and TCP/IP was enabled. The ARPANET got what would become the Internet’s first large scale addressing scheme (IPv4). This was better in so many ways; but in reality, this transition was just one more stepping stone towards our modern and better Internet.</p><h3>Jon Postel - The RFCs, The numbers, The legacy</h3><p>Some people write code, some people write documents, some people organize documents, some people organize numbers. Jon Postel did all of these things. Jon was the first person to be in charge of allocating numbers (you know - IP addresses) back in the early 80’s. In a way it was a thankless job that no-one else wanted to do. Jon was also the keeper of the early documents (Request For Comment or RFCs) that provide us with how the packet network should operate. Everything was available so that anyone could write code and join the network. Everyone was also able to write a fresh document (or update an existing document) so that the ecosystem of the Arpanet could grow. Some of those documents are still in existence and referenced today. <a href=\"https://tools.ietf.org/html/rfc791\">RFC791</a> defines the IP protocol and is dated 1981 - it’s still an active document in-use today! Those early days and Jon’s massive contributions have been <a href=\"https://www.internethalloffame.org/inductees/jon-postel\">well documented and acknowledged</a>. A better Internet is impossible without these conceptual building blocks.</p><p>Jon passed away in 1998; however, his legacy and his thoughts are still in active use today. He once said within the TCP world: “<i>Be conservative in what you send, be liberal in what you accept</i>”. This is called the <a href=\"https://en.wikipedia.org/wiki/Robustness_principle\">robustness principle</a> and it’s still key to writing good network protocol software.</p><h3>Bill Joy &amp; crew - Berkeley BSD Unix 4.2 and its TCP/IP software</h3><p>What’s the use of a protocol if you don’t have software to speak it. In the early 80’s there were many efforts to build both affordable and fast hardware, along with the software to speak to that hardware. At the University of California, Berkeley (UCB) there was a group of software developers tasked in 1980 by the Defense Advanced Research Projects Agency (DARPA) to implement the brand-new TCP/IP protocol stack on the VAX under Unix. They not-only solved that task; but they went a long way further than just that goal.</p><p>The folks at UCB (Bill Joy, Marshall Kirk McKusick, Keith Bostic, Michael Karels, and others) created an operating system called 4.2BSD (Berkeley Software Distribution) that came with TCP/IP ingrained in its core. It was based on the AT&amp;T’s Unix v6 and Unix/32V; however it had significantly deviated in many ways. The networking code, or sockets as its interface is called, became the underlying building blocks of each and every piece of networking software in the modern world of the Internet. We at Cloudflare have written numerous times about <a href=\"/revenge-listening-sockets/\">networking kernel code</a> and it all boils down to the code that was written back at UCB. Bill Joy went on to be a founder of Sun Microsystems (which commercialized 4.2BSD and much more). Others from UCB went on to help build other companies that still are relevant to the Internet today.</p><p>Fun fact: Berkeley’s Unix (or FreeBSD, OpenBSD, NetBSD as its variants are known) is now the basis of every iPhone, iPad and Mac laptops software in existence. Android’s and Chromebooks come from a different lineage; but still hold those BSD methodologies as the fundamental basis of all their networking software.</p><h3>Al Gore - The Information Superhighway - or retold as “funding the Internet”</h3><p>Do you believe that Al Gore invented the Internet? It’s actually doesn’t matter which side of this statement you want to argue; the simple fact is that the US Government funded the National Science Foundation (NSF) with the task of building an “information superhighway”. Al Gore himself said: “<i>how do we create a nationwide network of information superhighways? Obviously, the private sector is going to do it, but the Federal government can catalyze and accelerate the process</i>. &#39;&#39; He said that statement on September 19, 1994 and this blog post author knows that fact because I was there in the room when he said it!</p><p>The United States Federal Government help fund the growth of the Arpanet into the early version of the Internet. Without the government&#39;s efforts, we may not have been where we are today. Luckily, just a handful of years later, the NSF decided that in fact the commercial world could and should be the main building blocks for the Internet and instantly the Internet as we know it today was born. Packets that fly across commercial backbones are paid for via commercial contracts. The parts that are still funded by the government (any government) are normally only the parts used by universities, or military users.</p><p>But this author is still going to thank Al Gore for helping create a better Internet back in the early 90’s.</p><h3>Sir Tim Berners-Lee - The World Wide Web</h3><p>What can I say? In 1989 Tim Berners-Lee (who was later knighted and is now Sir Tim) invented the World Wide Web and we would not have billions of people using the Internet today without him. Period!</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7lWqjPOt0fjRD8A5Mnp7s9/b30778c4146c6f6c468222b61f15c5d4/pasted-image-0--1--1.png\" alt=\"\" class=\"kg-image\" width=\"840\" height=\"560\" loading=\"lazy\"/>\n            \n            </figure><p>via <a href=\"https://www.reddit.com/r/pcmasterrace/comments/b086lz/tim_bernerslee_and_vint_cerf_wearing_funny_shirts/\">Reddit</a></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6kgtCNxHJv59vs7lcxDNes/58f1584f18eddeb2b4a237bbc46d5779/pasted-image-0--2--1.png\" alt=\"\" class=\"kg-image\" width=\"840\" height=\"560\" loading=\"lazy\"/>\n            \n            </figure><p>via <a href=\"https://www.reddit.com/r/pcmasterrace/comments/b086lz/tim_bernerslee_and_vint_cerf_wearing_funny_shirts/\">Reddit</a></p><p>Yeah, let&#39;s clear up that subtle point. Sir Tim invented the World Wide Web (WWW) and Vint Cerf invented the Internet. When folks talk about using one or the other, it’s worth reminding then there is a difference. But I digress!</p><p>Sir Tim’s creation is what provides everyday folks with a window into information on the Internet. Before the WWW we had textual interfaces to information; but only if you knew where to look and what to type. We really need to remember every time we click on a link or press submit to buy something, that the only way that is usable is such mass and uniform form is because of Sir Tim’s creation.</p><h3>Sally Floyd - The subtle art of dropping packets</h3><p>Random Early Detection (RED) is an algorithm that saved the Internet back in the early 90’s. Built on earlier work by Van Jacobson, it defined a method to drop packets when a router was overloaded, or more importantly about to be overloaded. Packet network, before Van Jacobson’s or Sally Floyd’s work, would congest heavily and slow down. It seemed natural to never throw away data; but between the two inventors of RED, that all changed. Her follow-up work is described in an August 1993 <a href=\"https://www.icir.org/floyd/papers/early.twocolumn.pdf\">paper</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1wLPHC4YYSovaP5xyQYTok/c1d0b389afd76f35d1772ebdb3ffbf1e/download.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"947\" loading=\"lazy\"/>\n            \n            </figure><p>Networks have become much more complex since August 1993, yet the RED code still exists and is used in nearly every Unix or Linux kernel today. See the <a href=\"http://man7.org/linux/man-pages/man8/tc-red.8.html\">tc-red(8)</a> command and/or the Linux kernel <a href=\"https://github.com/torvalds/linux/blob/master/net/sched/sch_red.c\">code</a> itself.</p><p>It’s with great sorrow that Sally Floyd <a href=\"https://www.nytimes.com/2019/09/04/science/sally-floyd-dead.html\">passed away</a> in late August. But, rest assured, her algorithm will possibly be used to help keep a better Internet flowing smoothly forever.</p><h3>Jay Adelson and Al Avery - The datacenter that interconnect networks</h3><p>Remember that comment by Al Gore above saying that the private sector would build the Internet. Back in the late 90’s that’s exactly what happened. Telecom companies were selling capacity to fledgling ISPs. Nationwide IP backbones were being built by the likes of PSI, Netcom, UUnet, Digex, CAIS, ANS, etc. The telco’s themselves like MCI, Sprint, but interestingly not AT&amp;T at the time, were getting into providing Internet access in a big way.</p><p>In the US everything was moving very fast. By the mid-90’s there was no way to get a connection anymore from a regional research network for your shiny new ISP. Everything had all gone commercial and the NSF funded parts of the Internet were not available for commercial packets.</p><p>The NSF, in it’s goal to allow commercial networks to build the Internet, had also specified that those networks should interconnect at four locations around the country. New Jersey, Chicago, Bay Area, California, and Washington DC area.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/J2XRuQgRjwo6FJLsLFkFC/7e64feba0b685aa3a9f36958af32ea99/NewNSFNETArchitecture.jpg\" alt=\"\" class=\"kg-image\" width=\"730\" height=\"552\" loading=\"lazy\"/>\n            \n            </figure><p>Network Access Point via <a href=\"https://en.wikipedia.org/wiki/Network_access_point\">Wikipedia</a></p><p>The NAP’s, as they were called, were to provide interconnection between networks and to provide the research networks a way to interconnect with commercial network along with themselves. The NAPs suddenly exploded in usage, near-instantly needing to be bigger, The buildings they were housed in ran out of space or power or both! Yet those networks needed homes, interconnections needed a better structure and the old buildings that were housing the Internet’s routers just didn’t cut it anymore.</p><p>Jay and Al had a vision. New massive datacenters that could securely house the growing need for the power-hungry Internet. But that’s only a small portion of the vision. They realized that if many networks all lived under the same roof then interconnecting them could indeed build a better Internet. They installed Internet Exchanges and a standardized way of cross-connecting from one network to another. They were carrier neutral, so that everyone was treated equal. It was, what became known as the “<i>network effect</i>” and it was a success. The more networks you had under one roof, the more that other networks would want to be housed within those same roofs. The company they created was (and still is) called Equinix. It wasn’t the first company to realize this; but it sure has become one of the biggest and most successful in this arena.</p><p>Today, a vast amount of the Internet uses Equinix datacenters, it’s IXs along with similar offerings from similar companies. Jay and Al’s vision absolutely paved the way to a better internet.</p><h3>Everyone who’s a member of The Internet Society 1992-Today</h3><p>It turns out that people realized that the modern Internet is not all-commercial all-the-time. There is a need for other influences to be had. Civil society, governments, academics, along with those commercial entities should also have a say in how the Internet evolves. This brings into the conversation a myriad of people that have either been members of The Internet Society (ISOC) and/or have worked directly for ISOC over it’s 27+ years. This is the organization that manages and helps fund the IETF (where protocols are discussed and standardized). ISOC plays a decisive role at The Internet Governance Forum (IGF), and fosters a clear understanding of how the Internet should be used and protected to both the general public and regulators worldwide. ISOCs involvement with Internet Exchange development (vital as the Internet grows and connects users and content) has been a game changer for many-many countries, especially in Africa.</p><p>ISOC has an interesting funding mechanism centered around the dotORG domain. You may not have realized that you were helping the Internet grow when you registered and paid for your .org domain; however, you are!</p><p>Over the life of ISOC, the Internet has moved from being the domain of engineers and scientists into something used by nearly everyone; independent of technical skill or in-fact a full understanding of it’s inner workings. ISOC’s mission is &quot;<i>to promote the open development, evolution and use of the Internet for the benefit of all people throughout the world</i>&quot;. It has been a solid part of that growth.</p><p>Giving voice to everyone on how the Internet could grow and how it should (or should not be) regulated, is front-and-center for every person involved with ISOC globally. Defining both an inclusive Internet and a better Internet is the everyday job for those people.</p><h3>Kanchana Kanchanasut - Thailand and .TH</h3><p>In the 1988, amongst other things, Professor Kanchana Kanchanasut registered and operated the country Top Level Domain .TH (which is the two-letter <a href=\"https://www.iso.org/iso-3166-country-codes.html\">ISO 3166</a> code for Thailand). This was the first country to have a TLD; something all countries take for granted today.</p><p>Also in 1988, five Thai universities got dial-up connections to the Internet because of her work. However, the real breakthrough came when Prof. Kanchanasut’s efforts led to the first leased line interconnecting Thailand to the nascent Internet of the early 90’s. That was 1991 and since then Thailand’s connectivity has exploded. It’s an amazingly well connected country. Today it boasts a plethora of mobile operators, and international undersea and cross-border cables, along with Prof. Kanchanasut’s present-day work spearheading an independent and growing Internet Exchange within Thailand.</p><p>In 2013, the &quot;<i>Mother of the Internet in Thailand</i>&quot; as she is affectionately called, was <a href=\"https://www.eurekalert.org/pub_releases/2013-07/aiot-apk070813.php\">inducted</a> into the Internet Hall of Fame by the Internet Society. If you’re in Thailand, or South East Asia, then she’s the reason why you have a better Internet.</p><h3>The list continues</h3><p>In the fifty years since that first packet there have been heros, both silent and profoundly vocal that have moved the Internet forward. There’s no was all could be named or called out; however, you will find many listed if you go look. Wander through the thousands of RFC’s, or check out the <a href=\"https://www.internethalloffame.org/\">Internet Hall of Fame</a>. The Internet today is a better Internet because anyone can be a contributor.</p><h3>Cloudflare and the better Internet</h3><p>Cloudflare, or in fact any part of the Internet, would not be where it is today without the groundbreaking work of these people plus many others unnamed here. This fifty year effort has moved the needle in such a way that without all of them the runaway success of the Internet could not have been possible!</p><p>Cloudflare is just over <a href=\"/birthday-week-2019/\">nine years old</a> (that’s only 18% of this fifty year period). Gazillions and gazillions of packets have flowed since Cloudflare started providing it services and we sincerely believe we have done our part with those services to build a better Internet.. Oh, and we haven’t finished our work, far from it! We still have a long way to go in helping build a better Internet. <a href=\"/founders-letter/\">And we’re just getting started</a>!</p><blockquote><p>A letter from Matthew Prince (<a href=\"https://twitter.com/eastdakota?ref_src=twsrc%5Etfw\">@eastdakota</a>) and Michelle Zatlyn (<a href=\"https://twitter.com/zatlyn?ref_src=twsrc%5Etfw\">@zatlyn</a>) <a href=\"https://twitter.com/hashtag/BetterInternet?src=hash&ref_src=twsrc%5Etfw\">#BetterInternet</a> <a href=\"https://twitter.com/search?q=%24NET&src=ctag&ref_src=twsrc%5Etfw\">$NET</a> <a href=\"https://t.co/BHLI8MuuTS\">https://t.co/BHLI8MuuTS</a> <a href=\"https://t.co/Jirb0bPUzJ\">pic.twitter.com/Jirb0bPUzJ</a></p><p>— Cloudflare (@Cloudflare) <a href=\"https://twitter.com/Cloudflare/status/1172495649042046976?ref_src=twsrc%5Etfw\">September 13, 2019</a></p></blockquote><p>If you’re interested in helping build a better Internet and want to join Cloudflare in our offices in San Francisco, Singapore, London, Austin, Sydney, Champaign, Munich, San Jose, New York or our new Lisbon Portugal offices, then buzz over to our <a href=\"https://www.cloudflare.com/careers/\">jobs</a> page and come join us! #betterInternet</p>",
		"id": "5JGPsv6uz47ZFRnD7EAdGF",
		"localeList": {
			"name": "50 Years of The Internet. Work in Progress to a Better Internet Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2019-10-29T07:16:00.000+00:00",
		"reading_time": 12,
		"slug": "50-years-of-the-internet-work-in-progress-to-a-better-internet",
		"tags": [
			{
				"id": "3Fo5JgRZ6Fh2HHzhEr7AKn",
				"name": "Better Internet",
				"slug": "better-internet"
			},
			{
				"id": "546uBJtNvdfazwx1jzmH40",
				"name": "History",
				"slug": "history"
			}
		],
		"title": "50 Years of The Internet. Work in Progress to a Better Internet",
		"updated_at": "2024-08-27T02:08:02.099Z",
		"url": "https://blog.cloudflare.com/50-years-of-the-internet-work-in-progress-to-a-better-internet"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}