{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "15",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Brady Gentile",
				"slug": "brady-gentile",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2GE1aoJKcq3UtDIrqk7dAW/8761c8db96ca262b22d9d8fa8b898f9b/brady-gentile.jpg",
				"location": "San Francisco, CA",
				"website": null,
				"twitter": "@Bmgentile",
				"facebook": null
			}
		],
		"excerpt": "OnAir Video Presentation\n\n\n\n\nAbstract\n\n\nLooking to host your website, application, or API in the cloud, or migrate to a new cloud provider while keeping your data secure? In this webinar, Trey Guinn, Head of Solutions Engineering at Cloudflare, will discuss how companies should approach security, during and after migration. We'll highlight the migration story of LUSH, one of the largest global e-Commerce cosmetic retailers, and how they took the right steps to migrate from their previous cloud p",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7aLxutFLs0hOHHBwBykcum/3c02275187e6c38281a67ffbf9f71c89/a-fast-secure-migration-to-google-cloud-platform-using-cloudflare.jpg",
		"featured": false,
		"html": "\n          <div class=\"flex anchor relative\">\n            <h3 id=\"onair-video-presentation\">OnAir Video Presentation</h3>\n            <a href=\"#onair-video-presentation\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        \n          <div class=\"flex anchor relative\">\n            <h3 id=\"abstract\">Abstract</h3>\n            <a href=\"#abstract\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Looking to host your website, application, or API in the cloud, or migrate to a new cloud provider while keeping your data secure? In this webinar, Trey Guinn, Head of Solutions Engineering at Cloudflare, will discuss how companies should approach security, during and after migration. We&#39;ll highlight the migration story of LUSH, one of the largest global e-Commerce cosmetic retailers, and how they took the right steps to migrate from their previous cloud provider to Google Cloud Platform, in less than 3 weeks. Trey will be performing a live demo on setting up Cloudflare load balancing across cloud providers, as well as optimizing security through web application firewall (WAF), SSL / TLS Encryption, and Rate Limiting.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"speakers\">Speakers</h3>\n            <a href=\"#speakers\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p><b>Asad Baheri</b>Security &amp; Networking Partner ManagerGoogle Cloud Platform</p><p><b>Trey Guinn</b>Head of Solutions EngineeringCloudflare</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"webinar-transcription-and-load-balancing-demo\">Webinar Transcription and Load Balancing Demo</h3>\n            <a href=\"#webinar-transcription-and-load-balancing-demo\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p><b>Asad Baheri</b></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2PdSuOw9OvGXvtWwixUGB8/f347e150b316ec20e1352064aa134c70/Agenda-5.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>Today we&#39;re going to talk about LUSH&#39;s migration to Google Cloud and how Cloudflare, one of our top security and performance partners, can help you with your own cloud migration. Throughout our presentation, we&#39;ll be talking about security best practices, how CDNs and the CDN Interconnect program works, and we&#39;re also going to also give you a demo of Cloudflare&#39;s load balancing to start your migration.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/SOpK9zOoZoLdcweZ8fmkh/fa8351f1dfb8c2e97873abbf92101103/Timeline-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>One of the main things that many people don&#39;t realize is the amount of effort that Google has put into security. You may be familiar with safe browsing, which protects over three billion devices every day. That&#39;s something Google has done not for profit, but just out of our own commitment to security.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2j4ssiXrg86euDFy3J50mg/3f430c5419833a5641f0f24f42fc213a/Defense-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>If you actually look at what Google does, they have over 600 engineers dedicated to security and privacy with Google, which is more than a lot of other pure-play security companies. And the result of that is we&#39;re trying to make the Internet a more secure place for our users. We believe that raising the security awareness level makes it easier for our customers. So we&#39;ll talk about how that philosophy actually translates into Google cloud. If you look at some of the open source projects out there, even if you look at iOS, you&#39;ll see Google was one of the top reporters of bugs and security vulnerabilities. Again, we are trying to make the Internet more secure for everyone using our products.</p><p>When we talk about Google Cloud, it really starts from the bottom up, at the hardware level. From the second device boots up, the OS, the application, the network, the storage, etc. So if you look more in depth, you get a pretty good idea of all the different areas that we have security.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7oUq1pceefNskh2pqT9gzV/50298f5eae19ffe7e6b7ce369364de72/Titan-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>As you probably are aware, Google has many different data centers which are maintained by us, but we&#39;re also in a lot of third party data centers. When a hardware device boots up, we want to make sure that it is one of our devices. We know what it is, what it&#39;s supposed to do, and then we have actual Google written security codes to monitor that. And that works hand-in-hand with the Titan chip to actually make sure we have that secure level of trust from the second the device is powered-on, to when users can use it when network traffic is going across.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5cKCQCZD5qyswonLfnsGqC/ed3ce74e7691ea1a16795da023d81adb/GCP-Map-2.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>When we look at that, network plays a big part. As you can see here, there are a lot of data center locations; you&#39;ll see all of the lease and owned fiber that Google has. What that really translates to for our users is: No matter where you are in the world, you&#39;re going to be close to a Google data center or Google location that can handle your traffic.</p><p><b>Trey Guinn</b>Cloudflare also has one of the world&#39;s largest networks, although we are focused less on compute and infrastructure as a service, we&#39;re focused on providing a smart network which sits in-between the web visitor or API consumer and the origin infrastructure — which could be GCP. Cloudflare is something you may not have heard of, but you&#39;ve definitely used us if you use the Internet. Cloudflare proxies around 10% of all HTTP requests today. With over six million domains on Cloudflare, we&#39;re a fairly large presence. Our job is to make sure that we stop threats, and try to improve performance as as traffic is flowing through our network.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/YZlbdqxnaGGuY9pgA7ul2/f27305789b7bec4631c72de909756b46/CF-Map-2.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p><b>Asad Baheri</b>When you say 6 million domains, you mean you&#39;re actually managing the DNS records? Whether it&#39;s A records, CNAMEs, AAA zones, all of that?</p><p><b>Trey Guinn</b>Correct. One of the services at Cloudflare is to be an authoritative DNS provider; we&#39;re the world&#39;s <a href=\"https://www.cloudflare.com/cloudflare-vs-google-dns/\">largest and fastest authoritative DNS provider</a>. Customers can also CNAME specific subdomains over to us, and we&#39;re handling not only DNS for a lot of these customers, but we&#39;re also handling proxying of HTTP and HTTPS traffic.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2bBjkW8UILFbTMIBVExbPP/e2445c02b3550d8e4dab29a1e9b91d22/GCP-Interconnect-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>Through the Cloudflare CDN Interconnect program, you can see we sit in-between the visitor and the Google Cloud Platform. We try to remove all of the online threats, while at the same time speeding up the communication which goes from the visitor to GCP. The best thing is the direct interconnections between our services; it&#39;s essentially wire between the Cloudflare datacenter and the Google Cloud platform data centers at 53 locations (which is nearly half of the locations). This interconnection has all kinds of advantages because it&#39;s higher performance and you&#39;re not having to worry about congestion or fighting the public Internet. But on top of that, as GCP customer, you pay significantly discounted egress pricing when you&#39;re using CDN interconnect.</p><p>One of our many joint customers is our customer LUSH. They had a big migration over to GCP, and they had to do it really quickly. Interestingly enough, they were already a Cloudflare customer before they moved to GCP. Tell me a little bit about their migration to GCP.</p><p><b>Asad Baheri</b>This is something LUSH decided on a Friday, and they had to get started on Monday. They had 22 days to move everything. They had a very short period of time. Part of the reason for their migration was around general availability and scale during the holiday season traffic spikes. The other part of it was that they wanted to have their online presence match their corporate philosophy. A very large percentage of our network electrical costs come from renewable sources, and that was something that was important to them. From technology to philosophy, it was just very well aligned and made sense to make that move quickly. LUSH here had a great amount of savings, correct?</p><p><b>Trey Guinn</b>LUSH as a customer sees about a 75% bandwidth savings, but also a 95% reduction in the number of requests to their origin server. That reduces the amount of infrastructure that they need on the origin, because we&#39;re either filtering out bad traffic or caching content. Part of that, of course, is that we stop about 60,000 threats a month for LUSH. And that&#39;s something to be expected with Cloudflare&#39;s infrastructure and network. We run one of the largest security networks in the world, and are versed in stopping these threats.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7fsetuzUWZ3zvy2VRx6DmJ/778cb2d35055bdc5a4b4f124a13b5c33/Lush-Migration-1-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p><b>Asad Baheri</b>The hit rate seems dependent on the website or API using Cloudflare&#39;s services, correct? If you have a lot of cat pictures versus a super dynamic API, it&#39;s going to be a difference experience.</p><p><b>Trey Guinn</b>Exactly. If you&#39;re serving a bunch of GIFs, you can get your cache hit rate up into the high 90s, maybe over 99%. If you are a weather application, and someone&#39;s checking the weather, your cache hit rate might be a little bit lower because if you&#39;re delivering whether by zip code there&#39;s not that many people per zip code or checking for weather.</p><p><b>Asad Baheri</b>Can I actually set my cache rates by different regions and say &quot;Hey for this geography, I want this cached versus another geography I want to have something else cached?&quot;</p><p><b>Trey Guinn</b>It&#39;s possible to go into deeper levels of customization, but generally the caching is going to be around per URL; you can customize it based on certain headers, cookies etc. And the flip-side of that is you can get fine-grained control around rate limiting, in addition our web application firewall (WAF) and IP reputation database allow you to add security and performance at the same time.</p><p><b>Asad Baheri</b>One of the most important things is actually making sure you have a SSL certificate, that&#39;s following best practices; not all SSL certificates are created equally.</p><p><b>Trey Guinn</b>Independent of whatever origin network or security network that you run, we want to share some security best practices and, as you mentioned, everything should be on SSL. If you didn&#39;t know that, this is your last warning, and everything should be over SSL. Chrome as of next month is going to start positively identifying websites which are not encrypted with an &quot;insecure&quot; flag. If you want to be able to retain the trust of your customers, it&#39;s required. And a key thing is that not all SSL is created equal: some SSL is more secure than others, some SSL is faster than others, etc. We shared a link on on these slides for you to go look at the SSL labs best practices; they&#39;re a third party, but we want to do things like support session resumption and HTTP/2, etc.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/284t5fTk16zm338uyrmdEv/9965b7da84c0ac03e99de03744ceac35/Security-Checklist-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p><b>Asad Baheri</b>Google also has a series of <a href=\"https://support.google.com/webmasters/answer/6073543?hl=en\">SSL best practices</a> for anyone who&#39;s using SSL; it&#39;ll walk you through how to create the right type of key requests, where you want to load it, etc. And when using Cloudflare, where does the SSL session terminate?</p><p><b>Trey Guinn</b>Cloudflare will terminate the SSL session at the Cloudflare network edge, and we&#39;ll make sure that you have the best SSL. If you check your SSL grade, you&#39;ll get an A or an A+ with our SSL. We decrypt because we need to be able to protect against layer 7 attacks and look within the application layer. Then we re-encrypt we go back to the origin, so it sits and it&#39;s encrypted as it goes across the network.</p><p><b>Asad Baheri</b>And then also, you can provide protection for DNS services, because that&#39;s another vector of attack where someone can just knock out your DNS or try to inject a bad DNS record.</p><p><b>Trey Guinn</b>Exactly. A lot of things people look at DDoS prevention and security but they forget about the fact that DNS infrastructure is one of the key things that you need to protect. It&#39;s the Internet&#39;s phonebook and if you can find someone&#39;s phone number, you can&#39;t call them and you&#39;re knocked offline. We all number the Dyn attack in October of last year... it took around a third of the internet offline.</p><p>Beyond DNS and SSL, other things to be prepared for are large layer 3 and layer 4 floods, this is sort of like UDP floods from DNS amplification — that&#39;s sort of a “caveman with a club”, not very sophisticated, but it fills up your pipes. Luckily, if you&#39;re on GCP, you have very very big pipes. Beyond that though, you also have to worry about layer 7 attacks. Less sophisticated is: What if someone goes in and searches or scrapes the product pages on your ecommerce site, but they just decide to search your product pages 10,000 times a second? Can your application infrastructure handle that? And even if it can scale up to that, do you want to pay to scale up to that? And then beyond that, while those attacks are occurring, you should also be aware of application vulnerabilities. This is where attacks are going to try to extract data using SQL injection, cross-site scripting, etc. So these are the layers that we want to make sure that you&#39;re taking care of.</p><p><b>Asad Baheri</b>So those are the basics of it, but today we&#39;re going to actually show people a demo on how they can set up some of these service and protections on Cloudflare.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7cFxP6tWdyoyQAkRcTDeUC/5de244980105bcf6e50d6414214de72a/Demo-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p><b>Trey Guinn</b>We&#39;re going to jump into the Cloudflare demo, and see how it is that Cloudflare can be configured to sort of meet some of those requirements that we just talked about. This is going to be a live demo, so feel free to play along from home if you&#39;d like. We have a web application; let&#39;s assume we grew from a US-only audience. We had lots of folks in North America, but my business has taken off and it&#39;s doing great, and it&#39;s now distributed out to Australia and the UK.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4mkSfCwl4P0svAAZ9PHipc/e35385b6c0e055f8477751decd3d2ec6/distributed-out-to-Australia-and-the-UK.png\" alt=\"\" class=\"kg-image\" width=\"3840\" height=\"2092\" loading=\"lazy\"/>\n            \n            </figure><p><b>Trey Guinn</b>Previously, let&#39;s say I had a single origin on AWS. In order to support a geographically distributed origin, I needed the google Spanner database and I&#39;m moving over to GCP. Now I can have an origin within GCP in Australia, U.S. West, and Europe, all at the same time.</p><p><b>Asad Baheri</b>And for those not familiar with BigQuery or Google Spanner, this is really where some of Google&#39;s technologies shine, where you have these globally distributed databases.</p><p><b>Trey Guinn</b>But you know once I&#39;ve added a globally distributed database, I need to be able to access it from everywhere.</p><p>So we&#39;re going to set up a geographic load balancing that&#39;ll migrate our traffic over to GCP. We&#39;re also going to look at those layer 7 protections; we&#39;ll set up a rate limiting rule and see that come into effect. We&#39;ll also make sure that Cloudflare&#39;s SSL is working. We&#39;ll turn on our WAF and block SQL injections. And then, a little special thing, like any migration project there&#39;s always that extra person who wasn&#39;t reading their email or didn&#39;t check in at the meetings, and we’re going see how to handle that.</p><p>So I&#39;ve already added a domain <b>multicloud.tech</b> to Cloudflare. The signup process takes about five minutes, and most of that is part of the DNS change. And really what you&#39;re doing is making Cloudflare your authoritative DNS provider or you can CNAME specific subdomains. In our DNS infrastructure, we&#39;ve four records but we can see the WWW record is going to the domain apex, the domain apex is going to this IP address, and that&#39;s our AWS origin to start with. In our DNS servers listed, we&#39;ll see the orange cloud and grey cloud. And what is the difference there?</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/78nMYexB9dFmggHPfrFCQU/84ae033f4780c01ab57bbcdc7e9656eb/And-what-is-the-difference-there.png\" alt=\"\" class=\"kg-image\" width=\"2504\" height=\"1454\" loading=\"lazy\"/>\n            \n            </figure><p>If we do a dig on <a href=\"http://www.multicloud.tech\"><b>www.multicloud.tech</b></a>, we will see that these are a bunch of Cloudflare IPs. And so we see those are the orange clouded record, the <a href=\"http://WWW\">WWW</a>. But what I also had created here, just for usability, is this origin. Warning here: You shouldn&#39;t really have things pointing to your origin that are gray clouded, because it allows people to hit your origin directly. Just for demonstration purposes, I&#39;ve this record is grey clouded. If I do a DNS lookup on <b>origin.multicloud.tech</b>, then we&#39;ll see that it&#39;s returning back the origin IP address.</p><p>What this is doing is when you orange cloud a record in Cloudflare, it&#39;s routing all of your customers through the Cloudflare network. And if you gray cloud the record, then all traffic is just going to go straight to your origin server. So it&#39;s just a simple sort of &quot;on / off&quot; switch for the Cloudflare network.</p><p>So we&#39;re now sending traffic through Cloudflare. So if you went to <a href=\"http://www.multicloud.tech\"><b>www.multicloud.tech</b></a>, wherever you are, you&#39;d be going through the Cloudflare network to hit this website. So if I want to look at <b>multicloud.tech</b>, I&#39;m going through the website and we&#39;re hitting our AWS infrastructure.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5mLPXn37N7o8heaUGkormb/82e8e7ff3337a78c9f4972dd960015e0/we-re-hitting-our-AWS-infrastructure.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1460\" loading=\"lazy\"/>\n            \n            </figure><p>So let&#39;s go ahead and set up a load balancer. We&#39;ve got folks in Australia and UK, and we want to make sure it&#39;s fast for everybody. I&#39;m going to create a load balancer here called <b>lb1.multicloud.tech</b>. So when you create a load balancer, it just creates another DNS record that can be used to accept traffic. Now I&#39;m going to create a few origin pools because the idea is that we could have 10 origins in Australia, 30 in North America, and 15 in Europe.</p><p><b>Asad Baheri</b>Am I going to that one DNS record, and then that&#39;s getting sent out to different locations, or am I going to come to multiple DNS records that are just going to do round robin?.</p><p><b>Trey Guinn</b>That’s a great question; so what&#39;s happening is you&#39;re just seeing the Cloudflare IP on the outside. It&#39;s an Anycast network, so it&#39;s the same IP all over the world; you connect to Cloudflare and then this is all happening behind the scenes.</p><p><b>Asad Baheri</b>So, I don&#39;t need to worry about maintaining the DNS records, what I want to do for load balancing, etc... you&#39;ve taken care of all that?</p><p><b>Trey Guinn</b>Exactly. Now we&#39;re going to set up our first origin pool. This origin pool only to have one origin in it, because this is a demo. But we&#39;ll start with the first one in US West; we&#39;re going to go with our GCP origin in US West. And we&#39;re going to do an active health check of just the root page.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1Q8S79oVMXJc6QW4PjAipm/fc540f50b2620c87992a07e2b64d4a87/you-ve-taken-care-of-all-that.png\" alt=\"\" class=\"kg-image\" width=\"1596\" height=\"2194\" loading=\"lazy\"/>\n            \n            </figure><p><b>Asad Baheri</b>And I can customize that obviously, if I want something more specific?</p><p><b>Trey Guinn</b>Exactly. In that health check, that&#39;s where you can set the number of times it has to fail before it&#39;s unhealthy, and does it check specifically URL, does a check for certain status codes, etc.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6nGExesep2A5JwXAUtmPOp/bb7e5188a9ce3e525dc36c7e223fa8d9/does-a-check-for-certain-status-codes--etc.png\" alt=\"\" class=\"kg-image\" width=\"1596\" height=\"2174\" loading=\"lazy\"/>\n            \n            </figure><p>So we&#39;ve got our U.S. West set up, so let&#39;s also set up Australia. We&#39;re going to go ahead and set the same monitor, and we&#39;re going to save that.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1PwYbf6Fd7STG0uUF3uH09/418485625412714526fde9e26920dd2b/and-we-re-going-to-save-that.png\" alt=\"\" class=\"kg-image\" width=\"1590\" height=\"2198\" loading=\"lazy\"/>\n            \n            </figure><p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6vmTkwbobukXt04j3nhtff/0f7b5f347026fdacc7b35523a16a3b15/and-we-re-going-to-save-that-2.png\" alt=\"\" class=\"kg-image\" width=\"1592\" height=\"1554\" loading=\"lazy\"/>\n            \n            </figure><p>And then we still need to do our our European origin. Same health check monitor and we&#39;ll hit save. We&#39;ve created three origin pools and, as I was saying, those origin pools could hold more than one origin each.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3vtXitCA6gkLoy9J0wIvNV/a1c2438338a7921941ecc02eb9ca9cce/origin-pools-could-hold-more-than-one-origin-each.png\" alt=\"\" class=\"kg-image\" width=\"1594\" height=\"1448\" loading=\"lazy\"/>\n            \n            </figure><p>And if you add multiple origins in a pool, it would round robin between those. Now we have three pools and we can do a clever migration between them. If you had an active / passive data center setup, you could use two pools and put them in the right order so you&#39;d say origin pool #1 / origin pool #2 and then active / passive. In this instance, we&#39;re going to say if, say Europe fails, we want to fail back over the U.S., we&#39;ll make US our primary, Europe secondary globally, and then Australia third.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3i2jp0KkbwqRrplQUgwBHh/dd269b0c54bee8bc155868621e30e40c/secondary-globally--and-then-Australia-third.png\" alt=\"\" class=\"kg-image\" width=\"1598\" height=\"656\" loading=\"lazy\"/>\n            \n            </figure><p>But we also want to do some geo-routing, so let&#39;s choose which regions we&#39;re going to do some geo-routing.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/01fB15IoRtWNGW5eggi96U/9ee0ee42c8a93e511e755aa024f8c18b/regions-we-re-going-to-do-some-geo-routing.png\" alt=\"\" class=\"kg-image\" width=\"1594\" height=\"1968\" loading=\"lazy\"/>\n            \n            </figure><p>So we&#39;re going to get Europe, Oceania, The Middle East, Africa, Southern Africa, India, and Asia. So we&#39;re going to take Europe, and we&#39;re going to send that to the European origin. Eastern Europe to European origin. Oceana will go to Australia. Middle East we&#39;ll send to Europe. North Africa we&#39;ll send that to Europe. South Africa let&#39;s send that to Europe. India let&#39;s send to Australia. Northeast Asia we&#39;ll also send that to Australia.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5p9sUDK03e1g4my5TiosR1/c5263790b932debc4d8b74bd7b174e3b/Northeast-Asia-we-ll-also-send-that-to-Australia.png\" alt=\"\" class=\"kg-image\" width=\"1958\" height=\"1502\" loading=\"lazy\"/>\n            \n            </figure><p>Now we’re going to hit next; and we&#39;re ready to save and deploy.</p><p><b>Asad Baheri</b>That was less than 10 minutes; we actually set up an infrastructure, set up our pools, and set up our geo-routing.</p><p><b>Trey Guinn</b>So we&#39;re doing active health checks and probes to each of these data centers. Now we&#39;re going to say that WWW, which was going to the apex record and went to AWS, will be sent to the load balancer. The other thing I want to do is take the zone apex, <b>multicloud.tech</b>, and I want to send that to the load balancer, as well. This is something else that is special with Cloudflare; if you&#39;ve ever had to CNAME your apex record, it’s a real bugger; we allow you to do that on our infrastructure, because we do a thing called CNAME flattening. So now all the traffic now is going to the load balancer. We&#39;re also going to set up a WAF and setup Rate Limiting rules and we can make all that work together.</p><p><b>Asad Baheri</b>So now we&#39;re just getting into protection; we&#39;ve setup the infrastructure, the routing, and now we&#39;re going to protect it.</p><p><b>Trey Guinn</b>Exactly. I&#39;m running out of time already on my demo, so how hard is it to set up a WAF?</p><p><b>Asad Baheri</b>It&#39;s pretty much an all day process setting up rules, I think?</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3TfvzdXPhdP8AsXWc62Izj/920fcae1c99979e511bb64da836223bc/setting-up-rules--I-think.png\" alt=\"\" class=\"kg-image\" width=\"2038\" height=\"1944\" loading=\"lazy\"/>\n            \n            </figure><p><b>Trey Guinn</b>So now our WAF is setup; it&#39;s pretty easy. We made this product easy to use. We&#39;ll also turn on the OWASP top 10 ruleset and put that into block mode.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/318JlARHAO09ruyJd2t7Qr/5b449228af5c3712eda29e2929299cfb/10-ruleset-and-put-that-into-block-mode.png\" alt=\"\" class=\"kg-image\" width=\"1196\" height=\"1310\" loading=\"lazy\"/>\n            \n            </figure><p>Now that our WAF is fully engaged, let&#39;s set up a rate limiting rule, because you want to be able to stop someone from hammering away at your website. So we&#39;ll just call this rate limiting rule “Global” on http &amp; https * it&#39;ll just say any URL that you&#39;re checking.</p><p><b>Asad Baheri</b>It&#39;s great to have different rulesets on different parts of my website; if I&#39;m managing multiple customers or there&#39;s different regions, I can say &quot;hey I want this part of my site or this subdomain to have one type or protection vs. another part.&quot;</p><p><b>Trey Guinn</b>One of the common use cases is to protect your login page, and we can look at the response code and say if you&#39;re getting 200&#39;s that&#39;s fine, but if you&#39;re getting 401s or 403s, then clearly you&#39;re logging in with the wrong password, so we&#39;re going to really restrict you. So if you make more than 10 requests in 30 seconds, we&#39;re going to block you for 30 seconds.</p><p><b>Asad Baheri</b>And that&#39;s really going to stop those automated bot attacks, where people are trying credential stuffing and they&#39;re just trying to see how fast can I hammer on a login page, through these credential dumps that I&#39;ve gotten from somewhere, and see which ones work.</p><p><b>Trey Guinn</b>Exactly. Before we reload this webpage, it came from AWS. Now, if I do a refresh, it says &quot;Google Cloud Platform&quot;. And I&#39;m coming from US West; if you happen to be watching this from Australia, you&#39;ll see that you&#39;re coming from the Australian data center, if you&#39;re watching this from Europe and hit this website you&#39;d see Europe.</p><p>Now let&#39;s check our web application firewall (WAF); I snuck a little trick in here in one of my notes, because I wanted to remember a SQL injection command. So maybe with this command I was trying to dump the customer recordbase, and we&#39;ll see I&#39;ve been blocked by Cloudflare. The WAF is in place and working; that command never even made it to GCP, it never hit your infrastructure.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2iAE5jipHOaNOyEREKCHNV/ccd2ae1dde81b16f2ecb22b99dbadc20/it-never-hit-your-infrastructure.png\" alt=\"\" class=\"kg-image\" width=\"1602\" height=\"1704\" loading=\"lazy\"/>\n            \n            </figure><p>And in our Cloudflare dashboard is the bad request that came through, and it was just blocked.</p><p>And the last thing we need to do test out rate limiting. I&#39;ve setup rate limiting already, so I&#39;m going to do 200 requests against our website. I&#39;ve just curled <b>multicloud.tech</b> and I&#39;m grepping for the HTTP status code that comes back. And it’s blocked.</p><p>Like all migrations, there&#39;s always something that comes up; Jerry came to us, and said: &quot;Hey my website stopped working, and I can&#39;t find it anymore; what&#39;s going on?&quot; And if we look, he&#39;s got this awesome old marketing website.</p><p>And you know what: We&#39;re not going to migrate it to GCP, because it&#39;s getting killed off in about six months from now. But how can you create a path and route it over to AWS?</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4GH3pWGFmLoCrwdDtVHSBQ/e0fcde9baedaa81e1f41c3aa2a22cc73/create-a-path-and-route-it-over-to-AWS.png\" alt=\"\" class=\"kg-image\" width=\"2014\" height=\"1656\" loading=\"lazy\"/>\n            \n            </figure><p>I have the legacy AWS origin defined here as “legacyorigin”, and what I&#39;ll do in Cloudflare is create a thing called a &quot;Page Rule&quot;.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4fhn1SZUL1a91emejbefOo/bd2296f037b86f2ba3ab422400654a35/create-a-thing-called-a--22Page-Rule-22.png\" alt=\"\" class=\"kg-image\" width=\"1594\" height=\"918\" loading=\"lazy\"/>\n            \n            </figure><p>And this way, we can take the website **<a href=\"http://www.multicloud.tech/legacy/**\\\">www.multicloud.tech/legacy/**\\</a>*, so it takes anything under the legacy path and override the resolution of the origin and resolve it to <b>legacyorigin.multicloud.tech</b>. Now this has actually replicate out globally to a bunch of data centers after hitting it here.</p><p><b>Asad Baheri</b>So in this 10 minutes: We&#39;ve set up pools, we&#39;ve set up rules, we&#39;ve actually kept some of our legacy stuff back where it was, we&#39;ve shown protection against script kiddies and credential stuffing. And all in 15 minutes, which is pretty amazing. Especially for something which can easily take a month.</p>",
		"id": "2BZZ9bL6CB9ZWGz3E62Qwv",
		"localeList": {
			"name": "A Fast, Secure Migration to Google Cloud Platform using Cloudflare Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Looking to host your website, application, or API in the cloud, or migrate to a new cloud provider while keeping your data secure? This webinar covers secure migration to Google Cloud with Cloudflare.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-10-06T15:00:00.000+01:00",
		"slug": "a-fast-secure-migration-to-google-cloud-platform-using-cloudflare",
		"tags": [
			{
				"id": "1INuIoB0bqqZjMPIwltzUz",
				"name": "Webinars",
				"slug": "webinars"
			},
			{
				"id": "2XaNX3TUr0DobetHd9z2GL",
				"name": "Google Cloud",
				"slug": "google-cloud"
			},
			{
				"id": "7qrmHspTZnIVIRl7tmvg6k",
				"name": "Events",
				"slug": "events"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "48r7QV00gLMWOIcM1CSDRy",
				"name": "Speed & Reliability",
				"slug": "speed-and-reliability"
			},
			{
				"id": "5x72ei67SoD11VQ0uqFtpF",
				"name": "API",
				"slug": "api"
			}
		],
		"title": "A Fast, Secure Migration to Google Cloud Platform using Cloudflare",
		"updated_at": "2024-10-09T22:12:28.271Z",
		"url": "https://blog.cloudflare.com/a-fast-secure-migration-to-google-cloud-platform-using-cloudflare"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}