{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Marek Majkowski",
				"slug": "marek-majkowski",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1JuU5qavgwVeqR8BAUrd6U/bd09672287e7cf04d4347d9a47607eb5/marek-majkowski.jpeg",
				"location": null,
				"website": null,
				"twitter": "@majek04",
				"facebook": null
			}
		],
		"excerpt": "For some time I’ve wanted to play with coverage-guided fuzzing. I decided to have a go at the Linux Kernel netlink machinery.  It's a good target: it's an obscure part of kernel, and it's relatively easy to automatically craft valid messages.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4gqfk9kUSf4AoHlsgRFeji/da35fe187cfdd805b9b80a78881efeda/a-gentle-introduction-to-linux-kernel-fuzzing.png",
		"featured": false,
		"html": "<p>For some time I’ve wanted to play with coverage-guided <a href=\"https://en.wikipedia.org/wiki/Fuzzing\">fuzzing</a>. Fuzzing is a powerful testing technique where an automated program feeds semi-random inputs to a tested program. The intention is to find such inputs that trigger bugs. Fuzzing is especially useful in finding memory corruption bugs in C or C++ programs.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/281ZRgfWvQ84ZxrUD29Bq2/013433199bd847defe647a14c6fb2b13/4152779709_d1ea8dd3b4_z.jpg\" alt=\"4152779709_d1ea8dd3b4_z\" class=\"kg-image\" width=\"640\" height=\"480\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://www.flickr.com/photos/patrick_s/4152779709\">Image</a> by <a href=\"https://www.flickr.com/photos/patrick_s/\">Patrick Shannon</a> CC BY 2.0</p><p>Normally it&#39;s recommended to pick a well known, but little explored, library that is heavy on parsing. Historically things like libjpeg, libpng and libyaml were perfect targets. Nowadays it&#39;s harder to find a good target - everything seems to have been fuzzed to death already. That&#39;s a good thing! I guess the software is getting better! Instead of choosing a userspace target I decided to have a go at the Linux Kernel netlink machinery.</p><p><a href=\"https://en.wikipedia.org/wiki/Netlink\">Netlink is an internal Linux facility</a> used by tools like &quot;ss&quot;, &quot;ip&quot;, &quot;netstat&quot;. It&#39;s used for low level networking tasks - configuring network interfaces, IP addresses, routing tables and such. It&#39;s a good target: it&#39;s an obscure part of kernel, and it&#39;s relatively easy to automatically craft valid messages. Most importantly, we can learn a lot about Linux internals in the process. Bugs in netlink aren&#39;t going to have security impact though - netlink sockets usually require privileged access anyway.</p><p>In this post we&#39;ll run <a href=\"http://lcamtuf.coredump.cx/afl/\">AFL fuzzer</a>, driving our netlink shim program against a custom Linux kernel. All of this running inside KVM virtualization.</p><p>This blog post is a tutorial. With the easy to follow instructions, you should be able to quickly replicate the results. All you need is a machine running Linux and 20 minutes.</p><h2>Prior work</h2><p>The technique we are going to use is formally called &quot;coverage-guided fuzzing&quot;. There&#39;s a lot of prior literature:</p><ul><li><p><a href=\"https://blog.trailofbits.com/2017/02/16/the-smart-fuzzer-revolution/\">The Smart Fuzzer Revolution</a> by Dan Guido, and <a href=\"https://lwn.net/Articles/677764/\">LWN article</a> about it</p></li><li><p><a href=\"https://j00ru.vexillium.org/talks/blackhat-eu-effective-file-format-fuzzing-thoughts-techniques-and-results/\">Effective file format fuzzing</a> by Mateusz “j00ru” Jurczyk</p></li><li><p><a href=\"http://honggfuzz.com/\">honggfuzz</a> by Robert Swiecki, is a modern, feature-rich coverage-guided fuzzer</p></li><li><p><a href=\"https://google.github.io/clusterfuzz/\">ClusterFuzz</a></p></li><li><p><a href=\"https://github.com/google/fuzzer-test-suite\">Fuzzer Test Suite</a></p></li></ul><p>Many people have fuzzed the Linux Kernel in the past. Most importantly:</p><ul><li><p><a href=\"https://github.com/google/syzkaller/blob/master/docs/syzbot.md\">syzkaller (aka syzbot)</a> by Dmitry Vyukov, is a very powerful CI-style continuously running kernel fuzzer, which found hundreds of issues already. It&#39;s an awesome machine - it will even report the bugs automatically!</p></li><li><p><a href=\"https://github.com/kernelslacker/trinity\">Trinity fuzzer</a></p></li></ul><p>We&#39;ll use <a href=\"http://lcamtuf.coredump.cx/afl/\">the AFL</a>, everyone&#39;s favorite fuzzer. AFL was written by <a href=\"http://lcamtuf.coredump.cx\">Michał Zalewski</a>. It&#39;s well known for its ease of use, speed and very good mutation logic. It&#39;s a perfect choice for people starting their journey into fuzzing!</p><p>If you want to read more about AFL, the documentation is in couple of files:</p><ul><li><p><a href=\"http://lcamtuf.coredump.cx/afl/historical_notes.txt\">Historical notes</a></p></li><li><p><a href=\"http://lcamtuf.coredump.cx/afl/technical_details.txt\">Technical whitepaper</a></p></li><li><p><a href=\"http://lcamtuf.coredump.cx/afl/README.txt\">README</a></p></li></ul><h2>Coverage-guided fuzzing</h2><p>Coverage-guided fuzzing works on the principle of a feedback loop:</p><ul><li><p>the fuzzer picks the most promising test case</p></li><li><p>the fuzzer mutates the test into a large number of new test cases</p></li><li><p>the target code runs the mutated test cases, and reports back code coverage</p></li><li><p>the fuzzer computes a score from the reported coverage, and uses it to prioritize the interesting mutated tests and remove the redundant ones</p></li></ul><p>For example, let&#39;s say the input test is &quot;hello&quot;. Fuzzer may mutate it to a number of tests, for example: &quot;hEllo&quot; (bit flip), &quot;hXello&quot; (byte insertion), &quot;hllo&quot; (byte deletion). If any of these tests will yield an interesting code coverage, then it will be prioritized and used as a base for a next generation of tests.</p><p>Specifics on how mutations are done, and how to efficiently compare code coverage reports of thousands of program runs is the fuzzer secret sauce. Read on the <a href=\"http://lcamtuf.coredump.cx/afl/technical_details.txt\">AFL&#39;s technical whitepaper</a> for nitty gritty details.</p><p>The code coverage reported back from the binary is very important. It allows fuzzer to order the test cases, and identify the most promising ones. Without the code coverage the fuzzer is blind.</p><p>Normally, when using AFL, we are required to instrument the target code so that coverage is reported in an AFL-compatible way. But we want to fuzz the kernel! We can&#39;t just recompile it with &quot;afl-gcc&quot;! Instead we&#39;ll use a trick. We&#39;ll prepare a binary that will trick AFL into thinking it was compiled with its tooling. This binary will report back the code coverage extracted from kernel.</p><h2>Kernel code coverage</h2><p>The kernel has at least two built-in coverage mechanisms - GCOV and KCOV:</p><ul><li><p><a href=\"https://www.kernel.org/doc/html/v4.15/dev-tools/gcov.html\">Using gcov with the Linux kernel</a></p></li><li><p><a href=\"https://www.kernel.org/doc/html/latest/dev-tools/kcov.html\">KCOV: code coverage for fuzzing</a></p></li></ul><p>KCOV was designed with fuzzing in mind, so we&#39;ll use this.</p><p>Using KCOV is pretty easy. We must compile the Linux kernel with the right setting. First, enable the KCOV kernel config option:</p>\n            <pre class=\"language-sh\"><code class=\"language-sh\">cd linux\n./scripts/config \\\n    -e KCOV \\\n    -d KCOV_INSTRUMENT_ALL</pre></code>\n            <p>KCOV is capable of recording code coverage from the whole kernel. It can be set with KCOV_INSTRUMENT_ALL option. This has disadvantages though - it would slow down the parts of the kernel we don&#39;t want to profile, and would introduce noise in our measurements (reduce &quot;stability&quot;). For starters, let&#39;s disable KCOV_INSTRUMENT_ALL and enable KCOV selectively on the code we actually want to profile. Today, we focus on netlink machinery, so let&#39;s enable KCOV on whole &quot;net&quot; directory tree:</p>\n            <pre class=\"language-sh\"><code class=\"language-sh\">find net -name Makefile | xargs -L1 -I {} bash -c &#039;echo &quot;KCOV_INSTRUMENT := y&quot; &gt;&gt; {}&#039;</pre></code>\n            <p>In a perfect world we would enable KCOV only for a couple of files we really are interested in. But netlink handling is peppered all over the network stack code, and we don&#39;t have time for fine tuning it today.</p><p>With KCOV in place, it&#39;s worth to add &quot;kernel hacking&quot; toggles that will increase the likelihood of reporting memory corruption bugs. See the <a href=\"https://github.com/cloudflare/cloudflare-blog/blob/master/2019-07-kernel-fuzzing/README.md\">README</a> for the list of <a href=\"https://github.com/google/syzkaller/blob/master/docs/linux/kernel_configs.md\">Syzkaller suggested options</a> - most importantly <a href=\"https://www.kernel.org/doc/html/latest/dev-tools/kasan.html\">KASAN</a>.</p><p>With that set we can compile our KCOV and KASAN enabled kernel. Oh, one more thing. We are going to run the kernel in a kvm. We&#39;re going to use <a href=\"https://github.com/amluto/virtme\">&quot;virtme&quot;</a>, so we need a couple of toggles:</p>\n            <pre class=\"language-sh\"><code class=\"language-sh\">./scripts/config \\\n    -e VIRTIO -e VIRTIO_PCI -e NET_9P -e NET_9P_VIRTIO -e 9P_FS \\\n    -e VIRTIO_NET -e VIRTIO_CONSOLE  -e DEVTMPFS ...</pre></code>\n            <p>(see the <a href=\"https://github.com/cloudflare/cloudflare-blog/blob/master/2019-07-kernel-fuzzing/README.md\">README</a> for full list)</p><h2>How to use KCOV</h2><p>KCOV is super easy to use. First, note the code coverage is recorded in a per-process data structure. This means you have to enable and disable KCOV within a userspace process, and it&#39;s impossible to record coverage for non-task things, like interrupt handling. This is totally fine for our needs.</p><p>KCOV reports data into a ring buffer. Setting it up is pretty simple, <a href=\"https://github.com/cloudflare/cloudflare-blog/blob/master/2019-07-kernel-fuzzing/src/kcov.c\">see our code</a>. Then you can enable and disable it with a trivial ioctl:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">ioctl(kcov_fd, KCOV_ENABLE, KCOV_TRACE_PC);\n/* profiled code */\nioctl(kcov_fd, KCOV_DISABLE, 0);</pre></code>\n            <p>After this sequence the ring buffer contains the list of %rip values of all the basic blocks of the KCOV-enabled kernel code. To read the buffer just run:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">n = __atomic_load_n(&amp;kcov_ring[0], __ATOMIC_RELAXED);\nfor (i = 0; i &lt; n; i++) {\n    printf(&quot;0x%lx\\n&quot;, kcov_ring[i + 1]);\n}</pre></code>\n            <p>With tools like <code>addr2line</code> it&#39;s possible to resolve the %rip to a specific line of code. We won&#39;t need it though - the raw %rip values are sufficient for us.</p><h2>Feeding KCOV into AFL</h2><p>The next step in our journey is to learn how to trick AFL. Remember, AFL needs a specially-crafted executable, but we want to feed in the kernel code coverage. First we need to understand how AFL works.</p><p>AFL sets up an array of 64K 8-bit numbers. This memory region is called &quot;shared_mem&quot; or &quot;trace_bits&quot; and is shared with the traced program. Every byte in the array can be thought of as a hit counter for a particular (branch_src, branch_dst) pair in the instrumented code.</p><p>It&#39;s important to notice that AFL prefers random branch labels, rather than reusing the %rip value to identify the basic blocks. This is to increase entropy - we want our hit counters in the array to be uniformly distributed. The algorithm AFL uses is:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">cur_location = &lt;COMPILE_TIME_RANDOM&gt;;\nshared_mem[cur_location ^ prev_location]++; \nprev_location = cur_location &gt;&gt; 1;</pre></code>\n            <p>In our case with KCOV we don&#39;t have compile-time-random values for each branch. Instead we&#39;ll use a hash function to generate a uniform 16 bit number from %rip recorded by KCOV. This is how to feed a KCOV report into the AFL &quot;shared_mem&quot; array:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">n = __atomic_load_n(&amp;kcov_ring[0], __ATOMIC_RELAXED);\nuint16_t prev_location = 0;\nfor (i = 0; i &lt; n; i++) {\n        uint16_t cur_location = hash_function(kcov_ring[i + 1]);\n        shared_mem[cur_location ^ prev_location]++;\n        prev_location = cur_location &gt;&gt; 1;\n}</pre></code>\n            <h2>Reading test data from AFL</h2><p>Finally, we need to actually write the test code hammering the kernel netlink interface! First we need to read input data from AFL. By default AFL sends a test case to stdin:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">/* read AFL test data */\nchar buf[512*1024];\nint buf_len = read(0, buf, sizeof(buf));</pre></code>\n            <h2>Fuzzing netlink</h2><p>Then we need to send this buffer into a netlink socket. But we know nothing about how netlink works! Okay, let&#39;s use the first 5 bytes of input as the netlink protocol and group id fields. This will allow the AFL to figure out and guess the correct values of these fields. The code testing netlink (simplified):</p>\n            <pre class=\"language-c\"><code class=\"language-c\">netlink_fd = socket(AF_NETLINK, SOCK_RAW | SOCK_NONBLOCK, buf[0]);\n\nstruct sockaddr_nl sa = {\n        .nl_family = AF_NETLINK,\n        .nl_groups = (buf[1] &lt;&lt;24) | (buf[2]&lt;&lt;16) | (buf[3]&lt;&lt;8) | buf[4],\n};\n\nbind(netlink_fd, (struct sockaddr *) &amp;sa, sizeof(sa));\n\nstruct iovec iov = { &amp;buf[5], buf_len - 5 };\nstruct sockaddr_nl sax = {\n      .nl_family = AF_NETLINK,\n};\n\nstruct msghdr msg = { &amp;sax, sizeof(sax), &amp;iov, 1, NULL, 0, 0 };\nr = sendmsg(netlink_fd, &amp;msg, 0);\nif (r != -1) {\n      /* sendmsg succeeded! great I guess... */\n}</pre></code>\n            <p>That&#39;s basically it! For speed, we will wrap this in a short loop that mimics <a href=\"https://lcamtuf.blogspot.com/2014/10/fuzzing-binaries-without-execve.html\">the AFL &quot;fork server&quot; logic</a>. I&#39;ll skip the explanation here, <a href=\"https://github.com/cloudflare/cloudflare-blog/blob/master/2019-07-kernel-fuzzing/src/forksrv.c\">see our code for details</a>. The resulting code of our AFL-to-KCOV shim looks like:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">forksrv_welcome();\nwhile(1) {\n    forksrv_cycle();\n    test_data = afl_read_input();\n    kcov_enable();\n    /* netlink magic */\n    kcov_disable();\n    /* fill in shared_map with tuples recorded by kcov */\n    if (new_crash_in_dmesg) {\n         forksrv_status(1);\n    } else {\n         forksrv_status(0);\n    }\n}</pre></code>\n            <p><a href=\"https://github.com/cloudflare/cloudflare-blog/blob/master/2019-07-kernel-fuzzing/src/fuzznetlink.c\">See full source code</a>.</p><h2>How to run the custom kernel</h2><p>We&#39;re missing one important piece - how to actually run the custom kernel we&#39;ve built. There are three options:</p><p><b>&quot;native&quot;</b>: You can totally boot the built kernel on your server and fuzz it natively. This is the fastest technique, but pretty problematic. If the fuzzing succeeds in finding a bug you will crash the machine, potentially losing the test data. Cutting the branches we sit on should be avoided.</p><p><b>&quot;uml&quot;</b>: We could configure the kernel to run as <a href=\"http://user-mode-linux.sourceforge.net/\">User Mode Linux</a>. Running a UML kernel requires no privileges. The kernel just runs a user space process. UML is pretty cool, but sadly, it doesn&#39;t support KASAN, therefore the chances of finding a memory corruption bug are reduced. Finally, UML is a pretty magic special environment - bugs found in UML may not be relevant on real environments. Interestingly, UML is used by <a href=\"https://source.android.com/devices/architecture/kernel/network_tests\">Android network_tests framework</a>.</p><p><b>&quot;kvm&quot;</b>: we can use kvm to run our custom kernel in a virtualized environment. This is what we&#39;ll do.</p><p>One of the simplest ways to run a custom kernel in a KVM environment is to use <a href=\"https://github.com/amluto/virtme\">&quot;virtme&quot; scripts</a>. With them we can avoid having to create a dedicated disk image or partition, and just share the host file system. This is how we can run our code:</p>\n            <pre class=\"language-sh\"><code class=\"language-sh\">virtme-run \\\n    --kimg bzImage \\\n    --rw --pwd --memory 512M \\\n    --script-sh &quot;&lt;what to run inside kvm&gt;&quot; </pre></code>\n            <p>But hold on. We forgot about preparing input corpus data for our fuzzer!</p><h2>Building the input corpus</h2><p>Every fuzzer takes a carefully crafted test cases as input, to bootstrap the first mutations. The test cases should be short, and cover as large part of code as possible. Sadly - I know nothing about netlink. How about we don&#39;t prepare the input corpus...</p><p>Instead we can ask AFL to &quot;figure out&quot; what inputs make sense. This is what <a href=\"https://lcamtuf.blogspot.com/2014/11/pulling-jpegs-out-of-thin-air.html\">Michał did back in 2014 with JPEGs</a> and it worked for him. With this in mind, here is our input corpus:</p>\n            <pre class=\"language-sh\"><code class=\"language-sh\">mkdir inp\necho &quot;hello world&quot; &gt; inp/01.txt</pre></code>\n            <p>Instructions, how to compile and run the whole thing are in <a href=\"https://github.com/cloudflare/cloudflare-blog/blob/master/2019-07-kernel-fuzzing\">README.md</a> on our github. It boils down to:</p>\n            <pre class=\"language-sh\"><code class=\"language-sh\">virtme-run \\\n    --kimg bzImage \\\n    --rw --pwd --memory 512M \\\n    --script-sh &quot;./afl-fuzz -i inp -o out -- fuzznetlink&quot; </pre></code>\n            <p>With this running you will see the familiar AFL status screen:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3Ms0btT4aEecNGhSwflYYX/b8d856d138ff10e9b9993dd0bff3cf33/Screenshot-from-2019-07-10-11-44-50.png\" alt=\"Screenshot-from-2019-07-10-11-44-50\" class=\"kg-image\" width=\"944\" height=\"598\" loading=\"lazy\"/>\n            \n            </figure><h2>Further notes</h2><p>That&#39;s it. Now you have a custom hardened kernel, running a basic coverage-guided fuzzer. All inside KVM.</p><p>Was it worth the effort? Even with this basic fuzzer, and no input corpus, after a day or two the fuzzer found an interesting code path: <a href=\"https://lore.kernel.org/netdev/CAJPywTJWQ9ACrp0naDn0gikU4P5-xGcGrZ6ZOKUeeC3S-k9+MA@mail.gmail.com/T/#u\">NEIGH: BUG, double timer add, state is 8</a>. With a more specialized fuzzer, some work on improving the &quot;stability&quot; metric and a decent input corpus, we could expect even better results.</p><p>If you want to learn more about what netlink sockets actually do, see a blog post by my colleague Jakub Sitnicki <a href=\"http://codecave.cc/multipath-routing-in-linux-part-1.html\">Multipath Routing in Linux - part 1</a>. Then there is a good chapter about it in <a href=\"https://books.google.pl/books?redir_esc=y&hl=pl&id=96V4AgAAQBAJ&q=netlink#v=snippet&q=netlink&f=false\">Linux Kernel Networking book by Rami Rosen</a>.</p><p>In this blog post we haven&#39;t mentioned:</p><ul><li><p>details of AFL shared_memory setup</p></li><li><p>implementation of AFL persistent mode</p></li><li><p>how to create a network namespace to isolate the effects of weird netlink commands, and improve the &quot;stability&quot; AFL score</p></li><li><p>technique on how to read dmesg (/dev/kmsg) to find kernel crashes</p></li><li><p>idea to run AFL outside of KVM, for speed and stability - currently the tests aren&#39;t stable after a crash is found</p></li></ul><p>But we achieved our goal - we set up a basic, yet still useful fuzzer against a kernel. Most importantly: the same machinery can be reused to fuzz other parts of Linux subsystems - from file systems to bpf verifier.</p><p>I also learned a hard lesson: tuning fuzzers is a full time job. Proper fuzzing is definitely not as simple as starting it up and idly waiting for crashes. There is always something to improve, tune, and re-implement. A quote at the beginning of the mentioned presentation by Mateusz Jurczyk resonated with me:</p><blockquote><p>&quot;Fuzzing is easy to learn but hard to master.&quot;</p></blockquote><p>Happy bug hunting!</p>",
		"id": "5t8I5tspUrkYUD9SY5kNP3",
		"localeList": {
			"name": "A gentle introduction to Linux Kernel fuzzing Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2019-07-10T14:07:21.000+01:00",
		"reading_time": 9,
		"slug": "a-gentle-introduction-to-linux-kernel-fuzzing",
		"tags": [
			{
				"id": "383iv0UQ6Lp0GZwOAxGq2p",
				"name": "Linux",
				"slug": "linux"
			},
			{
				"id": "73alK6sbtKLS6uB7ZrYrjj",
				"name": "Kernel",
				"slug": "kernel"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "2UVIYusJwlvsmPYl2AvSuR",
				"name": "Deep Dive",
				"slug": "deep-dive"
			}
		],
		"title": "A gentle introduction to Linux Kernel fuzzing",
		"updated_at": "2024-08-27T02:10:44.857Z",
		"url": "https://blog.cloudflare.com/a-gentle-introduction-to-linux-kernel-fuzzing"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}