{
	"locale": "en-us",
	"localesAvailable": [
		"ja-jp"
	],
	"post": {
		"authors": [
			{
				"name": "Nick Sullivan",
				"slug": "nick-sullivan",
				"bio": "Nick Sullivan was Head of Research (& Cryptography) at Cloudflare until 2023. He is passionate about improving security and privacy through cutting-edge research and the development of open standards.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1awsFzXodRY6h5BEcWKcCE/85e0d04bb0360398b832e6476173945e/nick-sullivan.jpg",
				"location": "San Francisco",
				"website": "https://crypto.dance",
				"twitter": "@grittygrease",
				"facebook": null
			}
		],
		"excerpt": "Elliptic Curve Cryptography (ECC) is one of the most powerful but least understood types of cryptography in wide use today. At CloudFlare, we make extensive use of ECC to secure everything from our customers' HTTPS connections to how we pass data between our data centers.",
		"feature_image": "https:undefined",
		"featured": false,
		"html": "<p>Elliptic Curve Cryptography (ECC) is one of the most powerful but least understood types of cryptography in wide use today. At <a href=\"https://www.cloudflare.com/\">CloudFlare</a>, we make extensive use of ECC to secure everything from our customers&#39; HTTPS connections to how we pass data between our data centers.</p><p>Fundamentally, we believe it&#39;s important to be able to understand the technology behind any security system in order to trust it. To that end, we looked around to find a good, relatively easy-to-understand primer on ECC in order to share with our users. Finding none, we decided to write one ourselves. That is what follows.</p><p>Be warned: this is a complicated subject and it&#39;s not possible to boil down to a pithy blog post. In other words, settle in for a bit of an epic because there&#39;s a lot to cover. If you just want the gist, the TL;DR is: ECC is the next generation of public key cryptography and, based on currently understood mathematics, provides a significantly more secure foundation than first generation public key cryptography systems like RSA. If you&#39;re worried about ensuring the highest level of security while maintaining performance, ECC makes sense to adopt. If you&#39;re interested in the details, read on.</p><h3>The dawn of public key cryptography</h3><p>The history of cryptography can be split into two eras: the classical era and the modern era. The turning point between the two occurred in 1977, when both the <a href=\"http://en.wikipedia.org/wiki/RSA_(algorithm)\">RSA algorithm</a> and the <a href=\"http://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange\">Diffie-Hellman</a> key exchange algorithm were introduced. These new algorithms were revolutionary because they represented the first viable cryptographic schemes where security was based on the theory of numbers; it was the first to enable secure communication between two parties without a shared secret. Cryptography went from being about securely transporting secret codebooks around the world to being able to have provably secure communication between any two parties without worrying about someone listening in on the key exchange.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2FAT1j6FzdNmWOnEU0UtoY/139db2aea5a6a9433d137d9fd6f1d282/image07.jpg\" alt=\"\" class=\"kg-image\" width=\"462\" height=\"280\" loading=\"lazy\"/>\n            \n            </figure><p><i><sub>Whitfield Diffie and Martin Hellman</sub></i></p><p>Modern cryptography is founded on the idea that the key that you use to encrypt your data can be made public while the key that is used to to decrypt your data can be kept private. As such, these systems are known as public key cryptographic systems. The first, and still most widely used of these systems, is known as RSA — named after the initials of the three men who first publicly described the algorithm: Ron Rivest, Adi Shamir and Leonard Adleman.</p><p>What you need for a public key cryptographic system to work is a set of algorithms that is easy to process in one direction, but difficult to undo. In the case of RSA, the easy algorithm multiplies two prime numbers. If multiplication is the easy algorithm, its difficult pair algorithm is factoring the product of the multiplication into its two component primes. Algorithms that have this characteristic — easy in one direction, hard the other — are known as <a href=\"http://en.wikipedia.org/wiki/Trapdoor_function\">Trap door Functions</a>. Finding a good Trapdoor Function is critical to making a secure public key cryptographic system. Simplistically: the bigger the spread between the difficulty of going one direction in a Trapdoor Function and going the other, the more secure a cryptographic system based on it will be.</p><h3>A toy RSA algorithm</h3><p>The RSA algorithm is the most popular and best understood public key cryptography system. Its security relies on the fact that factoring is slow and multiplication is fast. What follows is a quick walk-through of what a small RSA system looks like and how it works.</p><p>In general, a public key encryption system has two components, a public key and a private key. Encryption works by taking a message and applying a mathematical operation to it to get a random-looking number. Decryption takes the random looking number and applies a different operation to get back to the original number. Encryption with the public key can only be undone by decrypting with the private key.</p><p>Computers don&#39;t do well with arbitrarily large numbers. We can make sure that the numbers we are dealing with do not get too large by choosing a maximum number and only dealing with numbers less than the maximum. We can treat the numbers like the numbers on an analog clock. Any calculation that results in a number larger than the maximum gets wrapped around to a number in the valid range.</p><p>In RSA, this maximum value (call it <i>max</i>) is obtained by multiplying two random prime numbers. The public and private keys are two specially chosen numbers that are greater than zero and less than the maximum value, call them <i>pub</i> and <i>priv</i>. To encrypt a number you multiply it by itself <i>pub</i> times, making sure to wrap around when you hit the maximum. To decrypt a message, you multiply it by itself <i>priv</i> times and you get back to the original number. It sounds surprising, but it actually works. This property was a big breakthrough when it was discovered.</p><p>To create a RSA key pair, first randomly pick the two prime numbers to obtain the maximum <i>(max)</i>. Then pick a number to be the public key <i>pub</i>. As long as you know the two prime numbers, you can compute a corresponding private key <i>priv</i> from this public key. This is how factoring relates to breaking RSA — factoring the maximum number into its component primes allows you to compute someone&#39;s private key from the public key and decrypt their private messages.</p><p>Let&#39;s make this more concrete with an example. Take the prime numbers 13 and 7, their product gives us our maximum value of 91. Let&#39;s take our public encryption key to be the number 5. Then using the fact that we know 7 and 13 are the factors of 91 and applying an algorithm called the <a href=\"http://en.wikipedia.org/wiki/Extended_Euclidean_algorithm\">Extended Euclidean Algorithm</a>, we get that the private key is the number 29.</p><p>These parameters (<i>max</i>: 91, <i>pub</i>: 5; <i>priv</i>: 29) define a fully functional RSA system. You can take a number and multiply it by itself 5 times to encrypt it, then take that number and multiply it by itself 29 times and you get the original number back.</p><p>Let&#39;s use these values to encrypt the message &quot;CLOUD&quot;.</p><p>In order to represent a message mathematically we have to turn the letters into numbers. A common representation of the Latin alphabet is UTF-8. Each character corresponds to a number.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5xUJlv5Lvw5dMwlAwpXcTM/d673afc6a8823345f403edece13b710d/image05.png\" alt=\"\" class=\"kg-image\" width=\"504\" height=\"143\" loading=\"lazy\"/>\n            \n            </figure><p>Under this encoding, CLOUD is 67, 76, 79, 85, 68. Each of these digits are smaller than our maximum of 91, so we can encrypt them individually. Let&#39;s start with the first letter.</p><p>We have to multiply it by itself 5 times to get the encrypted value.</p><p>67×67 = 4489 = 30 *</p><p><i>*Since 4489 is larger than max, we have to wrap it around. We do that by dividing by 91 and taking the remainder.</i></p><p>4489 = 91×49 + 30</p><p>30×67 = 2010 = 8</p><p>8×67 = 536 = 81</p><p>81×67 = 5427 = 58</p><p>This means the encrypted version of 67 is 58.</p><p>Repeating the process for each of the letters we get that the encrypted message CLOUD becomes:</p><p>58, 20, 53, 50, 87</p><p>To decrypt this scrambled message, we take each number and multiply it by itself 29 times:</p><p>58×58 = 3364 = 88 (remember, we wrap around when the number is greater than <i>max</i>)&gt;</p><p>88×58 = 5104 = 8</p><p>…</p><p>9×58 = 522 = 67</p><p>Voila, we&#39;re back to 67. This works with the rest of the digits, resulting in the original message.</p><p>The takeaway is that you can take a number, multiply it by itself a number of times to get a random-looking number, then multiply that number by itself a secret number of times to get back to the original number.</p><h3>Not a perfect Trapdoor</h3><p>RSA and Diffie-Hellman were so powerful because they came with rigorous security proofs. The authors proved that breaking the system is equivalent to solving a mathematical problem that is thought to be difficult to solve. Factoring is a very well known problem and has been studied since antiquity (see <a href=\"http://en.wikipedia.org/wiki/Sieve_of_Eratosthenes\">Sieve of Eratosthenes</a>). Any breakthroughs would be big news and would net the discoverer a significant <a href=\"http://en.wikipedia.org/wiki/RSA_Factoring_Challenge\">financial windfall</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3OEzdcj0gvuqtjkVW4rKpB/a7a03b947d33ea65b89836f092708787/image03.jpg\" alt=\"\" class=\"kg-image\" width=\"620\" height=\"388\" loading=\"lazy\"/>\n            \n            </figure><p><i><sub>&quot;Find factors, get money&quot; - Notorious </sub></i><a href=\"http://people.epfl.ch/thorsten.kleinjung\"><i><sub>T.K.G.</sub></i></a><i><sub> (Reuters)</sub></i></p><p>That said, factoring is not the hardest problem on a bit for bit basis. Specialized algorithms like the <a href=\"http://mathworld.wolfram.com/QuadraticSieve.html\">Quadratic Sieve</a> and the <a href=\"http://en.wikipedia.org/wiki/General_number_field_sieve\">General Number Field Sieve</a> were created to tackle the problem of prime factorization and have been moderately successful. These algorithms are faster and less computationally intensive than the naive approach of just guessing pairs of known primes.</p><p>These factoring algorithms get more efficient as the size of the numbers being factored get larger. The gap between the difficulty of factoring large numbers and multiplying large numbers is shrinking as the number (i.e. the key&#39;s bit length) gets larger. As the resources available to decrypt numbers increase, the size of the keys need to grow even faster. This is not a sustainable situation for mobile and low-powered devices that have limited computational power. The gap between factoring and multiplying is not sustainable in the long term.</p><p>All this means is that RSA is not the ideal system for the future of cryptography. In an ideal Trapdoor Function, the easy way and the hard way get harder at the same rate with respect to the size of the numbers in question. We need a public key system based on a better Trapdoor.</p><h3>Elliptic curves: Building blocks of a better Trapdoor</h3><p>After the introduction of RSA and Diffie-Hellman, researchers explored other mathematics-based cryptographic solutions looking for other algorithms beyond factoring that would serve as good Trapdoor Functions. In 1985, cryptographic algorithms were proposed based on an esoteric branch of mathematics called elliptic curves.</p><p>But what exactly is an elliptic curve and how does the underlying Trapdoor Function work? Unfortunately, unlike factoring — something we all had to do for the first time in middle school — most people aren&#39;t as familiar with the math around elliptic curves. The math isn&#39;t as simple, nor is explaining it, but I&#39;m going to give it a go over the next few sections. (If your eyes start to glaze over, you can skip way down to the section: What does it all mean.)</p><p>An elliptic curve is the set of points that satisfy a specific mathematical equation. The equation for an elliptic curve looks something like this:</p><p>y<sup>2</sup> = x<sup>3</sup> + ax + b</p><p>That graphs to something that looks a bit like the Lululemon logo tipped on its side:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7C9LODC0OpfZlr9E8kqrSP/ae0255299502b2e23a43cd205051b0e9/image00.png\" alt=\"\" class=\"kg-image\" width=\"409\" height=\"410\" loading=\"lazy\"/>\n            \n            </figure><p>There are other representations of elliptic curves, but technically an elliptic curve is the set points satisfying an equation in two variables with degree two in one of the variables and three in the other. An elliptic curve is not just a pretty picture, it also has some properties that make it a good setting for cryptography.</p><h3>Strange symmetry</h3><p>Take a closer look at the elliptic curve plotted above. It has several interesting properties.</p><p>One of these is horizontal symmetry. Any point on the curve can be reflected over the x axis and remain the same curve. A more interesting property is that any non-vertical line will intersect the curve in at most three places.</p><p>Let&#39;s imagine this curve as the setting for a bizarre game of billiards. Take any two points on the curve and draw a line through them, it will intersect the curve at exactly one more place. In this game of billiards, you take a ball at point A, shoot it towards point B. When it hits the curve, the ball bounces either straight up (if it&#39;s below the x-axis) or straight down (if it&#39;s above the x-axis) to the other side of the curve.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5T0bi5LllWSsEHVH8u3LxV/0ffa7b971e60a2c0f7c8df84faca0fdc/image02.gif\" alt=\"\" class=\"kg-image\" width=\"410\" height=\"410\" loading=\"lazy\"/>\n            \n            </figure><p>We can call this billiards move on two points &quot;dot.&quot; Any two points on a curve can be dotted together to get a new point.</p><p>A dot B = C</p><p>We can also string moves together to &quot;dot&quot; a point with itself over and over.</p><p>A dot A = B</p><p>A dot B = C</p><p>A dot C = D</p><p>...</p><p>It turns out that if you have two points, an initial point &quot;dotted&quot; with itself n times to arrive at a final point, finding out n when you only know the final point and the first point is hard. To continue our bizzaro billiards metaphor, imagine one person plays our game alone in a room for a random period of time. It is easy for him to hit the ball over and over following the rules described above. If someone walks into the room later and sees where the ball has ended up, even if they know all the rules of the game and where the ball started, they cannot determine the number of times the ball was struck to get there without running through the whole game again until the ball gets to the same point. Easy to do, hard to undo: this is the basis for a very good Trapdoor Function.</p><h3>Let&#39;s get weird</h3><p>This simplified curve above is great to look at and explain the general concept of elliptic curves, but it doesn&#39;t represent what the curves used for cryptography look like.</p><p>For this, we have to restrict ourselves to numbers in a fixed range, like in RSA. Rather than allow any value for the points on the curve, we restrict ourselves to whole numbers in a fixed range. When computing the formula for the elliptic curve (y<sup>2</sup> = x<sup>3</sup> + ax + b), we use the same trick of rolling over numbers when we hit the maximum. If we pick the maximum to be a prime number, the elliptic curve is called a prime curve and has excellent cryptographic properties.</p><p>Here&#39;s an example of a curve (y<sup>2</sup> = x<sup>3</sup> - x + 1) plotted for all numbers:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3875ZLdcQNVGoVs88n1Xf3/285ce9abe22558f3908e2aa56ed98b44/image04.png\" alt=\"\" class=\"kg-image\" width=\"784\" height=\"584\" loading=\"lazy\"/>\n            \n            </figure><p>Here&#39;s the plot of the same curve with only the whole number points represented with a maximum of 97:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/25HFmEqqHnTOfdm8sDiPM1/af5a5e858f3c9c8e3dad37132b2e804e/image06.png\" alt=\"\" class=\"kg-image\" width=\"954\" height=\"680\" loading=\"lazy\"/>\n            \n            </figure><p>This hardly looks like a curve in the traditional sense, but it is. It&#39;s like the original curve was wrapped around at the edges and only the parts of the curve that hit whole number coordinates are colored in. You can even still see the horizontal symmetry.</p><p>In fact, you can still play the billiards game on this curve and dot points together. The equation for a line on the curve still has the same properties. Moreover, the dot operation can be efficiently computed. You can visualize the line between two points as a line that wraps around at the borders until it hits a point. It&#39;s as if in our bizarro billiards game, when a ball hits the edge of the board (the max) then it is magically transported to the opposite side of the table and continues on its path until reaching a point, kind of like the game <a href=\"http://en.wikipedia.org/wiki/Asteroids_(video_game)\">Asteroids</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/phKRQ5xVkAnEwByf2Ep3Z/0fd3aef8b5cc4ad326a4c869fb950baf/image01.gif\" alt=\"\" class=\"kg-image\" width=\"954\" height=\"680\" loading=\"lazy\"/>\n            \n            </figure><p>With this new curve representation, you can take messages and represent them as points on the curve. You could imagine taking a message and setting it as the x coordinate, and solving for y to get a point on the curve. It is slightly more complicated than this in practice, but this is the general idea.</p><p>You get the points</p><p>(70,6), (76,48), -, (82,6), (69,22)</p><p>*There are no coordinates with 65 for the x value, this can be avoided in the real world</p><p>An elliptic curve cryptosystem can be defined by picking a prime number as a maximum, a curve equation and a public point on the curve. A private key is a number <i>priv</i>, and a public key is the public point dotted with itself <i>priv</i> times. Computing the private key from the public key in this kind of cryptosystem is called the elliptic curve discrete logarithm function. This turns out to be the Trapdoor Function we were looking for.</p><h3>What does it all mean?</h3><p>The elliptic curve discrete logarithm is the hard problem underpinning elliptic curve cryptography. Despite almost three decades of research, mathematicians still haven&#39;t found an algorithm to solve this problem that improves upon the naive approach. In other words, unlike with factoring, based on currently understood mathematics there doesn&#39;t appear to be a shortcut that is narrowing the gap in a Trapdoor Function based around this problem. This means that for numbers of the same size, solving elliptic curve discrete logarithms is significantly harder than factoring. Since a more computationally intensive hard problem means a stronger cryptographic system, it follows that elliptic curve cryptosystems are harder to break than RSA and Diffie-Hellman.</p><p>To visualize how much harder it is to break, Lenstra recently introduced the concept of &quot;<a href=\"http://eprint.iacr.org/2013/635.pdf\">Global Security</a>.&quot; You can compute how much energy is needed to break a cryptographic algorithm, and compare that with how much water that energy could boil. This is a kind of cryptographic carbon footprint. By this measure, breaking a 228-bit RSA key requires less energy to than it takes to boil a teaspoon of water. Comparatively, breaking a 228-bit elliptic curve key requires enough energy to boil all the water on earth. For this level of security with RSA, you&#39;d need a key with 2,380-bits.</p><p>With ECC, you can use smaller keys to get the same levels of security. Small keys are important, especially in a world where more and more cryptography is done on less powerful devices like mobile phones. While multiplying two prime numbers together is easier than factoring the product into its component parts, when the prime numbers start to get very long even just the multiplication step can take some time on a low powered device. While you could likely continue to keep RSA secure by increasing the key length that comes with a cost of slower cryptographic performance on the client. ECC appears to offer a better tradeoff: high security with short, fast keys.</p><h3>Elliptic curves in action</h3><p>After a slow start, elliptic curve based algorithms are gaining popularity and the pace of adoption is accelerating. Elliptic curve cryptography is now used in a wide variety of applications: the <a href=\"http://www.certicom.com/index.php/news/6-press-rreleases/314-certicom-sells-licensing-rights-to-nsa\">U.S. government</a> uses it to protect internal communications, the Tor project uses it to help <a href=\"https://gitweb.torproject.org/tor.git/blob_plain/release-0.2.4:/ReleaseNotes\">assure anonymity</a>, it is the mechanism used to <a href=\"https://en.bitcoin.it/wiki/Elliptic_Curve_Digital_Signature_Algorithm\">prove ownership of bitcoins</a>, it provides signatures in Apple&#39;s <a href=\"http://blog.quarkslab.com/imessage-privacy.html\">iMessage service</a>, it is used to encrypt DNS information with <a href=\"http://en.wikipedia.org/wiki/DNSCurve\">DNSCurve</a>, and it is the preferred method for authentication for secure web browsing over SSL/TLS. CloudFlare uses elliptic curve cryptography to provide <a href=\"/staying-on-top-of-tls-attacks\">perfect forward secrecy</a> which is essential for online privacy. First generation cryptographic algorithms like RSA and Diffie-Hellman are still the norm in most arenas, but elliptic curve cryptography is quickly becoming the go-to solution for privacy and security online.</p><p>If you are accessing the HTTPS version of this blog (<a href=\"/\">https://blog.cloudflare.com</a>) from a recent enough version of Chrome or Firefox, your browser is using elliptic curve cryptography. You can check this yourself. In Chrome, you can click on the lock in the address bar and go to the connection tab to see which cryptographic algorithms were used in establishing the secure connection. Clicking on the lock in the Chrome 30 should show the following image.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/39u0hRQg30e0HoVq4XGhUm/10cf64a764c935c4e13144a36f1edd78/Screenshot_2024-09-03_at_5.23.03_PM.png\" alt=\"\" class=\"kg-image\" width=\"1306\" height=\"778\" loading=\"lazy\"/>\n            \n            </figure><p>The relevant portions of this text to this discussion is ECDHE_RSA. ECDHE stands for Elliptic Curve Diffie Hellman Ephemeral and is a key exchange mechanism based on elliptic curves. This algorithm is used by CloudFlare to provide <a href=\"/staying-on-top-of-tls-attacks\">perfect forward secrecy</a> in SSL. The RSA component means that RSA is used to prove the identity of the server.</p><p>We use RSA because CloudFlare&#39;s SSL certificate is bound to an RSA key pair. Modern browsers also support certificates based on elliptic curves. If CloudFlare&#39;s SSL certificate was an elliptic curve certificate this part of the page would state ECDHE_ECDSA. The proof of the identity of the server would be done using ECDSA, the Elliptic Curve Digital Signature Algorithm.</p><p>CloudFlare&#39;s ECC curve for ECDHE (This is the same curve used by Google.com):</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">max: 115792089210356248762697446949407573530086143415290314195533631308867097853951  \ncurve: y² = x³ + ax + b  \na = 115792089210356248762697446949407573530086143415290314195533631308867097853948  \nb = 41058363725152142129326129780047268409114441015993725554835256314039467401291</pre></code>\n            <p></p><p>The performance improvement of ECDSA over RSA is dramatic. Even with an older version of OpenSSL that does not have assembly-optimized elliptic curve code, an ECDSA signature with a 256-bit key is over 20x faster than an RSA signature with a 2,048-bit key.</p><p>On a MacBook Pro with OpenSSL 0.9.8, the &quot;speed&quot; benchmark returns:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">Doing 256 bit sign ecdsa's for 10s: 42874 256 bit ECDSA signs in 9.99s  \nDoing 2048 bit private rsa's for 10s: 1864 2048 bit private RSA's in 9.99s</pre></code>\n            <p></p><p>That&#39;s 23x as many signatures using ECDSA as RSA.</p><p>CloudFlare is constantly looking to improve SSL performance. Just this week, CloudFlare started using an assembly-optimized version of ECC that more than doubles the speed of ECDHE. Using elliptic curve cryptography saves time, power and computational resources for both the server and the browser helping us make the web both faster and more secure.</p><h3>The downside</h3><p>It is not all roses in the world of elliptic curves, there have been some questions and uncertainties that have held them back from being fully embraced by everyone in the industry.</p><p>One point that has been in the news recently is the Dual Elliptic Curve Deterministic Random Bit Generator (Dual_EC_DRBG). This is a random number generator standardized by the National Institute of Standards and Technology (NIST), and promoted by the NSA. Dual_EC_DRBG generates random-looking numbers using the mathematics of elliptic curves. The algorithm itself involves taking points on a curve and repeatedly performing an elliptic curve &quot;dot&quot; operation. After publication it was <a href=\"http://rump2007.cr.yp.to/15-shumow.pdf\">reported</a> that it could have been <a href=\"http://blog.cryptographyengineering.com/2013/09/the-many-flaws-of-dualecdrbg.html\">designed with a backdoor</a>, meaning that the sequence of numbers returned could be fully predicted by someone with the right secret number. Recently, the company RSA recalled several of their products because this random number generator was <a href=\"http://arstechnica.com/security/2013/09/stop-using-nsa-influence-code-in-our-product-rsa-tells-customers/\">set as the default PRNG for their line of security products</a>. Whether or not this random number generator was written with a backdoor or not does not change the strength of the elliptic curve technology itself, but it does raise questions about the standardization process for elliptic curves. As we&#39;ve written about before, it&#39;s also part of the reason that <a href=\"/ensuring-randomness-with-linuxs-random-number-generator\">attention should be spent to ensuring that your system is using adequately random numbers</a>. In a future blog post, we will go into how a backdoor could be snuck into the specification of this algorithm.</p><p>Some of the more skeptical cryptographers in the world now have a general distrust for NIST itself and the standards it has published that were supported by the NSA. Almost all of the widely implemented elliptic curves fall into this category. There are no known attacks on these special curves, chosen for their efficient arithmetic, however bad curves do exist and some feel it is better to be safe than sorry. There has been progress in developing curves with efficient arithmetic outside of NIST, including <a href=\"http://cr.yp.to/ecdh.html\">curve 25519</a> created by Daniel Bernstein (djb) and more <a href=\"http://eprint.iacr.org/2013/647\">recently computed curves</a> by Paulo Baretto and collaborators, though widespread adoption of these curves are several years away. Until these non-traditional curves are implemented by browsers, they won&#39;t be able to be used for securing cryptographic transport on the web.</p><p>Another uncertainty about elliptic curve cryptography is related to patents. There are over 130 patents that cover specific uses of elliptic curves owned by BlackBerry (through their 2009 acquisition of Certicom). Many of these patents were licensed for use by private organizations and even the NSA. This has given some developers pause over whether their implementations of ECC infringe upon this patent portfolio. In 2007, Certicom filed suit against Sony for some uses of elliptic curves, however that lawsuit was dismissed in 2009. There are now many implementations of elliptic curve cryptography that are thought to not infringe upon these patents and are in wide use.</p><p>The ECDSA digital signature has a drawback compared to RSA in that it requires a good source of entropy. Without proper randomness, the private key could be revealed. <a href=\"http://www.v3.co.uk/v3-uk/news/2288778/android-securerandom-bitcoin-wallet-vulnerability-could-be-used-to-hack-more-than-300-000-apps\">A flaw in the random number generator on Android</a> allowed hackers to find the ECDSA private key used to protect the bitcoin wallets of several people in early 2013. Sony&#39;s Playstation implementation of ECDSA had a similar <a href=\"http://events.ccc.de/congress/2010/Fahrplan/events/4087.en.html\">vulnerability</a>. A good <a href=\"/ensuring-randomness-with-linuxs-random-number-generator\">source of random numbers</a> is needed on the machine making the signatures. Dual_EC_DRBG is not recommended.</p><h3>Looking ahead</h3><p>Even with the above cautions, the advantages of elliptic curve cryptography over traditional RSA are widely accepted. Many experts are concerned that the mathematical algorithms behind RSA and Diffie-Hellman <a href=\"http://www.technologyreview.com/news/517781/math-advances-raise-the-prospect-of-an-internet-security-crisis/\">could be broken within 5 years</a>, leaving ECC as the only reasonable alternative.</p><p>Elliptic curves are supported by all modern browsers, and most certification authorities offer elliptic curve certificates. Every SSL connection for a CloudFlare protected site will default to ECC on a modern browser. Soon, <a href=\"https://www.cloudflare.com/\">CloudFlare</a> will allow customers to upload their own elliptic curve certificates. This will allow ECC to be used for identity verification as well as securing the underlying message, speeding up HTTPS sessions across the board. More on this when the feature becomes available.</p>",
		"id": "7qr4EqUyq2eE6FVIrzlDoA",
		"localeList": {
			"name": "A (Relatively Easy To Understand) Primer on Elliptic Curve Cryptography Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2013-10-24T04:00:00.000+01:00",
		"reading_time": 16,
		"slug": "a-relatively-easy-to-understand-primer-on-elliptic-curve-cryptography",
		"tags": [
			{
				"id": "5US4l4wdDysuDpZ4ktL3yP",
				"name": "HTTPS",
				"slug": "https"
			},
			{
				"id": "3bDWDAUmdLvArlEYPz8Di4",
				"name": "Elliptic Curves",
				"slug": "elliptic-curves"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			}
		],
		"title": "A (Relatively Easy To Understand) Primer on Elliptic Curve Cryptography",
		"updated_at": "2024-09-04T00:21:36.628Z",
		"url": "https://blog.cloudflare.com/a-relatively-easy-to-understand-primer-on-elliptic-curve-cryptography"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}