{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "10",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Rob Dinh",
				"slug": "robdinh",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5lX8oyoK840n7hC3PvJuQD/002f1a5ff3b6619437965ec359b28ef2/robdinh.png",
				"location": "Bay Area, CA",
				"website": null,
				"twitter": "@rob_dinh",
				"facebook": null
			}
		],
		"excerpt": "This blog is a quick Electrical Engineering 101 session going over specifically how 3-phase PDUs work, along with some good practices on how we use them",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1DYVktd4CLuqhNQkxYD74n/619f57099bf2af8ac3eec400dc8624cf/an-introduction-to-three-phase-power-and-pdus.jpg",
		"featured": false,
		"html": "<p>Our fleet of over 200 locations comprises various generations of servers and routers. And with the ever changing landscape of services and computing demands, it’s imperative that we manage power in our data centers right. This blog is a brief Electrical Engineering 101 session going over specifically how power distribution units (PDU) work, along with some good practices on how we use them. It appears to me that we could all use a bit more knowledge on this topic, and more love and appreciation of something that’s critical but usually taken for granted, like hot showers and opposable thumbs.</p><p>A PDU is a device used in data centers to distribute power to multiple rack-mounted machines. It’s an industrial grade power strip typically designed to power an average consumption of about <a href=\"https://www.eia.gov/tools/faqs/faq.php?id=97&t=3\">seven US households</a>. Advanced models have monitoring features and can be accessed via <a href=\"https://www.cloudflare.com/learning/access-management/what-is-ssh/\">SSH</a> or webGUI to turn on and off power outlets. How we choose a PDU depends on what country the data center is and what it provides in terms of <a href=\"https://www.worldstandards.eu/electricity/three-phase-electric-power/\">voltage, phase, and plug type</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5VQToUAxoKYdAqSWgqOyDS/96e96552c7dcec209262323090204046/Artboard-1.png\" alt=\"\" class=\"kg-image\" width=\"1500\" height=\"1271\" loading=\"lazy\"/>\n            \n            </figure><p>For each of our racks, all of our dual power-supply (PSU) servers are cabled to one of the two vertically mounted PDUs. As shown in the picture above, one PDU feeds a server’s PSU via a red cable, and the other PDU feeds that server’s other PSU via a blue cable. This is to ensure we have power redundancy maximizing our service uptime; in case one of the PDUs or server PSUs fail, the redundant power feed will be available keeping the server alive.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"faradays-law-and-ohms-law\">Faraday’s Law and Ohm’s Law</h3>\n            <a href=\"#faradays-law-and-ohms-law\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Like most high-voltage applications, PDUs and servers are designed to use AC power. Meaning voltage and current aren’t constant — they’re sine waves with magnitudes that can alternate between positive and negative at a certain frequency. For example, a voltage feed of 100V is not constantly at 100V, but it bounces between 100V and -100V like a sine wave. One complete sine wave cycle is one phase of 360 degrees, and running at 50Hz means there are 50 cycles per second.</p><p>The sine wave can be explained by Faraday’s Law and by looking at how an AC power generator works. Faraday’s Law tells us that a current is induced to flow due to a changing magnetic field. Below illustrates a simple generator with a permanent magnet rotating at constant speed and a coil coming in contact with the magnet’s magnetic field. Magnetic force is strongest at the North and South ends of the magnet. So as it rotates on itself near the coil, current flow fluctuates in the coil. One complete rotation of the magnet represents one phase. As the North end approaches the coil, current increases from zero. Once the North end leaves, current decreases to zero. The South end in turn approaches, now the current “increases” in the opposite direction. And finishing the phase, the South end leaves returning the current back to zero. Current <i>alternates</i> its direction at every half cycle, hence the naming of Alternating Current.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7CcXLX2BlNWmNeVBk9YOJz/c4a5be8770ae4f13228bf3addd888896/Artboard-2-1.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"491\" loading=\"lazy\"/>\n            \n            </figure><p>Current and voltage in AC power fluctuate in-phase, or “in tandem”, with each other. So by Ohm&#39;s Law of Power = Voltage x Current, power will always be positive. Notice on the graph below that AC power (Watts) has two peaks per cycle. But for practical purposes, we&#39;d like to use a constant power value. We do that by interpreting AC power into &quot;DC&quot; power using root-mean-square (RMS) averaging, which takes the max value and divides it by √2. For example, in the US, our conditions are 208V 24A at 60Hz. When we look at spec sheets, all of these values can be assumed as RMS&#39;d into their constant DC equivalent values. When we say we&#39;re fully utilizing a PDU&#39;s max capacity of 5kW, it actually means that the power consumption of our machines bounces between 0 and 7.1kW (5kW x √2).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3fM63pmekFqVlqHI6opB4V/77e1c301a9bc874949c80f903946c144/image13.png\" alt=\"\" class=\"kg-image\" width=\"807\" height=\"479\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6n22LgiBvxJ4hrF6UdL0em/e348d6792242537012a9f71d17da2620/image6.png\" alt=\"\" class=\"kg-image\" width=\"808\" height=\"479\" loading=\"lazy\"/>\n            \n            </figure><p>It’s also critical to figure out the sum of power our servers will need in a rack so that it falls under the PDU’s design max power capacity. For our US example, a PDU is typically 5kW (208 volts x 24 amps); therefore, we&#39;re budgeting 5kW and fit as many machines as we can under that. If we need more machines and the total sum power goes above 5kW, we&#39;d need to provision another power source. That would lead to possibly another set of PDUs and racks that we may not fully use depending on demand; e.g. more underutilized costs. All we can do is abide by P = V x I.</p><p>However there is a way we can increase the max power capacity economically — 3-phase PDU. Compared to single phase, its max capacity is √3 or 1.7 times higher. A 3-phase PDU of the same US specs above has a capacity of 8.6kW (5kW x √3), allowing us to power more machines under the same source. Using a 3-phase setup might mean it has thicker cables and bigger plug; but despite being more expensive than a 1-phase, its value is higher compared to two 1-phase rack setups for these reasons:</p><ul><li><p>It’s more cost-effective, because there are fewer hardware resources to buy</p></li><li><p>Say the computing demand adds up to 215kW of hardware, we would need 25 3-phase racks compared to 43 1-phase racks.</p></li><li><p>Each rack needs two PDUs for power redundancy. Using the example above, we would need 50 3-phase PDUs compared to 86 1-phase PDUs to power 215kW worth of hardware.</p></li><li><p>That also means a smaller rack footprint and fewer power sources provided and charged by the data center, saving us up to √3 or 1.7 times in opex.</p></li><li><p>It’s more resilient, because there are more circuit breakers in a 3-phase PDU — one more than in a 1-phase. For example, a 48-outlet PDU that is 1-phase would be split into two circuits of 24 outlets. While a 3-phase one would be split into 3 circuits of 16 outlets. If a breaker tripped, we’d lose 16 outlets using a 3-phase PDU instead of 24.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6j4fgzSlb8GU9fsGwywC11/ed156203ed76ff919ca4d8f199806e88/image5-1.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"120\" loading=\"lazy\"/>\n            \n            </figure><p>The PDU shown above is a 3-phase model of 48 outlets. We can see three pairs of circuit breakers for the three branches that are intertwined with each other <b>—</b> white, grey, and black. Industry demands today pressure engineers to maximize compute performance and minimize physical footprint, making the 3-phase PDU a widely-used part of operating a data center.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-is-3-phase\">What is 3-phase?</h3>\n            <a href=\"#what-is-3-phase\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>A 3-phase AC generator has three coils instead of one where the coils are 120 degrees apart inside the cylindrical core, as shown in the figure below. Just like the 1-phase generator, current flow is induced by the rotation of the magnet thus creating power from each coil sequentially at every one-third of the magnet’s rotation cycle. In other words, we’re generating three 1-phase power offset by 120 degrees.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7JNipgmV5CwJESOZLyeiy2/86c513ee9dbcecfeb39af20dc586ed83/Artboard-3-1.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"471\" loading=\"lazy\"/>\n            \n            </figure><p>A 3-phase feed is set up by joining any of its three coils into line pairs. L1, L2, and L3 coils are live wires with each on their own <i>phase</i> carrying their own <i>phase</i> voltage and <i>phase</i> current. Two phases joining together form one <i>line</i> carrying a common <i>line</i> voltage and <i>line</i> current. L1 and L2 phase voltages create the L1/L2 line voltage. L2 and L3 phase voltages create the L2/L3 line voltage. L1 and L3 phase voltages create the L1/L3 line voltage.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/aEGubJ4ZOZYPBdqTyT2If/c1dd7c7703c7c888612abd7d64750ed0/image9-1.jpg\" alt=\"\" class=\"kg-image\" width=\"811\" height=\"782\" loading=\"lazy\"/>\n            \n            </figure><p>Let’s take a moment to clarify the terminology. Some other sources may refer to line voltage (or current) as line-to-line or phase-to-phase voltage (or current). It can get confusing, because line voltage is the same as phase voltage in 1-phase circuits, as there’s only one phase. Also, the <i>magnitude</i> of the line voltage is equal to the <i>magnitude</i> of the phase voltage in 3-phase Delta circuits, while the <i>magnitude</i> of the line current is equal to the <i>magnitude</i> of the phase current in 3-phase Wye circuits.</p><p>Conversely, the line current equals to phase current times √3 in Delta circuits. In Wye circuits, the line voltage equals to phase voltage times √3.</p><p>In Delta circuits:</p><p>V<sub>line</sub> = V<sub>phase</sub></p><p>I<sub>line</sub> = √3 x I<sub>phase</sub></p><p>In Wye circuits:</p><p>V<sub>line</sub> = √3 x V<sub>phase</sub></p><p>I<sub>line</sub> = I<sub>phase</sub></p><p>Delta and Wye circuits are the two methods that three wires can join together. This happens both at the power source with three coils and at the PDU end with three branches of outlets. Note that the generator and the PDU don’t need to match each other’s circuit types.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/yBiiAFcHTedr9s3s3QSPL/39f6fba8331bc70477cff2c184587ba2/image8.png\" alt=\"\" class=\"kg-image\" width=\"1278\" height=\"628\" loading=\"lazy\"/>\n            \n            </figure><p>On PDUs, these phases join when we plug servers into the outlets. So we conceptually use the wirings of coils above and replace them with resistors to represent servers. Below is a simplified wiring diagram of a 3-phase Delta PDU showing the three line pairs as three modular branches. Each branch carries two phase currents and its own one common voltage drop.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4xV9Yds4Dzc7VOVFEmrg7X/f6885f808adac071216b859336e0b2cc/image15.png\" alt=\"\" class=\"kg-image\" width=\"1796\" height=\"338\" loading=\"lazy\"/>\n            \n            </figure><p>And this one below is of a 3-phase Wye PDU. Note that Wye circuits have an additional line known as the neutral line where all three phases meet at one point. Here each branch carries one phase and a neutral line, therefore one common current. The neutral line isn’t considered as one of the phases.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6P2JKqoppmgeEjomv9jmmY/8b8130b80e9641a85235290fa325778a/image20.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"379\" loading=\"lazy\"/>\n            \n            </figure><p>Thanks to a neutral line, a Wye PDU can offer a second voltage source that is √3 times lower for smaller devices, like laptops or monitors. Common voltages for Wye PDUs are 230V/400V or 120V/208V, particularly in North America.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"where-does-the-3-come-from\">Where does the √3 come from?</h3>\n            <a href=\"#where-does-the-3-come-from\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Why are we multiplying by √3? As the name implies, we are adding phasors. Phasors are complex numbers representing sine wave functions. Adding phasors is like adding vectors. Say your GPS tells you to walk 1 mile East (vector a), then walk a 1 mile North (vector b). You walked 2 miles, but you only moved by 1.4 miles NE from the original location (vector a+b). That 1.4 miles of “work” is what we want.</p><p>Let’s take in our application L1 and L2 in a Delta circuit. we add phases L1 and L2, we get a L1/L2 line. We assume the 2 coils are identical. Let’s say α represents the voltage magnitude for each phase. The 2 phases are 120 degrees offset as designed in the 3-phase power generator:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">|L1| = |L2| = α\nL1 = |L1|∠0° = α∠0°\nL2 = |L2|∠-120° = α∠-120°</pre></code>\n            <p>Using vector addition to solve for L1/L2:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">L1/L2 = L1 + L2</pre></code>\n            \n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2NtOvL0EuHAqcE84gSFJsf/a465b760c97a0d8349c676faaf15fd6a/image10.png\" alt=\"\" class=\"kg-image\" width=\"1748\" height=\"567\" loading=\"lazy\"/>\n            \n            </figure><p>$$\\text{L1/L2} = α∠\\text{0°} - α∠\\text{-120°}$$</p><p>$$\\text{L1/L2} = (α\\cos{\\text{0°}}+jα\\sin{\\text{0°}})-(α\\cos{\\text{-120°}}+jα\\sin{\\text{-120°}})$$</p><p>$$\\text{L1/L2} = (α\\cos{\\text{0°}}-α\\cos{\\text{-120°}})+j(α\\sin{\\text{0°}}-α\\sin{\\text{-120°}})$$</p><p>$$\\text{L1/L2} = \\frac{3}{2}α+j\\frac{\\sqrt3}{2}α$$</p><p>Convert L1/L2 into polar form:</p><p>$$\\text{L1/L2} = \\sqrt{(\\frac{3}{2}α)^2 + (\\frac{\\sqrt3}{2}α)<sup>2}∠\\tan</sup>{-1}(\\frac{\\frac{\\sqrt3}{2}α}{\\frac{3}{2}α})$$</p><p>$$\\text{L1/L2} = \\sqrt 3α∠\\text{30°}$$</p><p>Since voltage is a scalar, we’re only interested in the “work”:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">|L1/L2| = √3α</pre></code>\n            <p>Given that α also applies for L3. This means for any of the three line pairs, we multiply the phase voltage by √3 to calculate the line voltage.</p><p>V<sub>line</sub> = √3 x V<sub>phase</sub></p><p>Now with the three line powers being equal, we can add them all to get the overall effective power. The derivation below works for both Delta and Wye circuits.</p><p>P<sub>overall</sub> = 3 x P<sub>line</sub></p><p>P<sub>overall</sub> = 3 x (V<sub>line</sub> x I<sub>line</sub>)</p><p>P<sub>overall</sub> = (3/√3) x (V<sub>phase</sub> x I<sub>phase</sub>)</p><p>P<sub>overall</sub> = √3 x V<sub>phase</sub> x I<sub>phase</sub></p><!--kg-card-begin: html--><p></p><!--kg-card-end: html--><p>Using the US example, V<sub>phase</sub> is 208V and I<sub>phase</sub> is 24A. This leads to the overall 3-phase power to be 8646W (√3 x 208V x 24A) or 8.6kW. There lies the biggest advantage for using 3-phase systems. Adding 2 sets of coils and wires (ignoring the neutral wire), we’ve turned a generator that can produce √3 or 1.7 times more power!</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"dealing-with-3-phase\">Dealing with 3-phase</h3>\n            <a href=\"#dealing-with-3-phase\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>The derivation in the section above assumes that the magnitude at all three phases is equal, but we know in practice that&#39;s not always the case. In fact, it&#39;s barely ever. We rarely have servers and switches evenly distributed across all three branches on a PDU. Each machine may have different loads and different specs, so power could be wildly different, potentially causing a dramatic phase imbalance. Having a heavily imbalanced setup could potentially hinder the PDU&#39;s available capacity.</p><p>A perfectly balanced and fully utilized PDU at 8.6kW means that each of its three branches has 2.88kW of power consumed by machines. Laid out simply, it&#39;s spread 2.88 + 2.88 + 2.88. This is the best case scenario. If we were to take 1kW worth of machines out of one branch, spreading power to 2.88 + 1.88 + 2.88. Imbalance is introduced, the PDU is underutilized, but we&#39;re fine. However, if we were to put back that 1kW into another branch — like 3.88 + 1.88 + 2.88 — the PDU is over capacity, even though the sum is still 8.6kW. In fact, it would be over capacity even if you just added 500W instead of 1kW on the wrong branch, thus reaching 3.18 + 1.88 + 2.88 (8.1kW).</p><p>That&#39;s because a 8.6kW PDU is spec&#39;d to have a maximum of 24A for each phase current. Overloading one of the branches can force phase currents to go over 24A. Theoretically, we can reach the PDU’s capacity by loading one branch until its current reaches 24A and leave the other two branches unused. That’ll render it into a 1-phase PDU, losing the benefit of the √3 multiplier. In reality, the branch would have fuses rated less than 24A (usually 20A) to ensure we won&#39;t reach that high and cause overcurrent issues. Therefore the same 8.6kW PDU would have one of its branches tripped at 4.2kW (208V x 20A).</p><p>Loading up one branch is the easiest way to overload the PDU. Being heavily imbalanced significantly lowers PDU capacity and increases risk of failure. To help minimize that, we must:</p><ul><li><p>Ensure that total power consumption of all machines is under the PDU&#39;s max power capacity</p></li><li><p>Try to be as phase-balanced as possible by spreading cabling evenly across the three branches</p></li><li><p>Ensure that the sum of phase currents from powered machines at each branch is under the fuse rating at the circuit breaker.</p></li></ul><p><a href=\"https://www.raritan.com/blog/how-to-calculate-current-on-a-3-phase-208v-rack-pdu-power-strip\">This spreadsheet</a> from Raritan is very useful when designing racks.</p><p>For the sake of simplicity, let&#39;s ignore other machines like switches. Our latest 2U4N servers are rated at 1800W. That means we can only fit a maximum of four of these 2U4N chassis (8600W / 1800W = 4.7 chassis). Rounding them up to 5 would reach a total rack level power consumption of 9kW, so that&#39;s a no-no.</p><p>Splitting 4 chassis into 3 branches evenly is impossible, and will force us to have one of the branches to have 2 chassis. That would lead to a non-ideal phase balancing:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1vAVIr6zDrLo4vIWjmtQYL/3125689d9c651bcb6ea9fd4b164a0259/image17.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1069\" loading=\"lazy\"/>\n            \n            </figure><p>Keeping phase currents under 24A, there&#39;s only 1.1A (24A - 22.9A) to add on L1 or L2 before the PDU gets overloaded. Say we want to add as many machines as we can under the PDU’s power capacity. One solution is we can add up to 242W on the L1/L2 branch until both L1 and L2 currents reach their 24A limit.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3NP9EOPb0h2lEXuvlSdg3B/1fa2739a8b8d642506872a5b50eed5e7/image18.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1072\" loading=\"lazy\"/>\n            \n            </figure><p>Alternatively, we can add up to 298W on the L2/L3 branch until L2 current reaches 24A. Note we can also add another 298W on the L3/L1 branch until L1 current reaches 24A.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/64ECQoHBzqhPuq38sNizat/89340ed86b0f1e3601841a9cb9e94992/image16.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1075\" loading=\"lazy\"/>\n            \n            </figure><p>In the examples above, we can see that various solutions are possible. Adding two 298W machines each at L2/L3 and L3/L1 is the most phase balanced solution, given the parameters. Nonetheless, PDU capacity isn&#39;t optimized at 7.8kW.</p><p>Dealing with a 1800W server is not ideal, because whichever branch we choose to power one would significantly swing the phase balance unfavorably. Thankfully, our <a href=\"/cloudflares-gen-x-servers-for-an-accelerated-future/\">Gen X servers</a> take up less space and are more power efficient. Smaller footprint allows us to have more flexibility and fine-grained control over our racks in many of our diverse data centers. Assuming each 1U server is 450W, as if we physically split the 1800W 2U4N into fours each with their own power supplies, we&#39;re now able to fit 18 nodes. That&#39;s 2 more nodes than the four 2U4N setup:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7eBaV5AwmB0D31FSgEw65b/9b10b79710165889b01210c848b252a2/image21.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1072\" loading=\"lazy\"/>\n            \n            </figure><p>Adding two more servers here means we&#39;ve increased our value by 12.5%. While there are more factors not considered here to calculate the Total Cost of Ownership, this is still a great way to show we can be smarter with asset costs.</p><p>Cloudflare provides the back-end services so that our customers can enjoy the performance, reliability, security, and global scale of our edge network. Meanwhile, we manage all of our hardware in over 100 countries with various power standards and compliances, and ensure that our physical infrastructure is as reliable as it can be.</p><p>There’s no Cloudflare without hardware, and there’s no Cloudflare without power. Want to know more? Watch this Cloudflare TV segment about power: <a href=\"https://cloudflare.tv/event/7E359EDpCZ6mHahMYjEgQl\">https://cloudflare.tv/event/7E359EDpCZ6mHahMYjEgQl</a>.</p>",
		"id": "4Qx2ZCOM4gEYCEIljEKvAi",
		"localeList": {
			"name": "An introduction to three-phase power and PDUs Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "This blog is a quick Electrical Engineering 101 session going over specifically how 3-phase PDUs work, along with some good practices on how we use them",
		"metadata": {
			"title": "An introduction to three-phase power and PDUs",
			"description": "This blog is a quick Electrical Engineering 101 session going over specifically how 3-phase PDUs work, along with some good practices on how we use them",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/19K2xMxKwjej7e5MaMd8gV/eb250aad5a2d22bca86a4a58f83de584/an-introduction-to-three-phase-power-and-pdus-1Wircu.png"
		},
		"primary_author": {},
		"published_at": "2020-12-04T14:05:37.000+00:00",
		"slug": "an-introduction-to-three-phase-power-and-pdus",
		"tags": [
			{
				"id": "1ffv1vW4BzGcbQOa9xbY4O",
				"name": "Hardware",
				"slug": "hardware"
			},
			{
				"id": "3xEHPB7vINhWXG24KZgTTz",
				"name": "Data Center",
				"slug": "data-center"
			},
			{
				"id": "1U6ifhBwTuaJ2w4pjNOzNT",
				"name": "Network",
				"slug": "network"
			},
			{
				"id": "3OPPjcK7cKutTdeAjpThfG",
				"name": "Edge",
				"slug": "edge"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			},
			{
				"id": "1Efeqd1oZ7vy3xls0fdjHF",
				"name": "Agile Developer Services",
				"slug": "agile-developer-services"
			}
		],
		"title": "An introduction to three-phase power and PDUs",
		"updated_at": "2024-08-27T01:55:37.012Z",
		"url": "https://blog.cloudflare.com/an-introduction-to-three-phase-power-and-pdus"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}