{
	"initialReadingTime": "8",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Derek Chamorro",
				"slug": "derek-chamorro",
				"bio": "Derek is Head of Hardware Security at Cloudflare with over 20 years of experience designing security frameworks at scale, focusing on research & development within encryption, infrastructure security.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5tLoe6WZaa5vZwEpIUYLFY/4fa6777f297ec8590ba11404a476ac54/derek-chamorro.png",
				"location": null,
				"website": "https://randomsecurity.dev",
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Ryan Chow",
				"slug": "ryan-chow",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5TJGoRJtGt1tLdEfiXF5Zn/1f683e22c272405a8e0aad35e789394f/ryan-chow.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "As a security company, we pride ourselves on finding innovative ways to protect our platform to, in turn, protect the data of our customers. Part of this approach is implementing progressive methods in protecting our hardware at scale.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7evpElvLDnmlYhMthjzn1B/7788820241edbb2557a6fd3b6f3533e9/anchoring-trust-a-hardware-secure-boot-story.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/15nAX8kXKg4gz7jDCecogD/337b7838d4dca712e7498f6e32c11d9e/anchor2-2-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"904\" loading=\"lazy\"/>\n            \n            </figure><p>As a security company, we pride ourselves on finding innovative ways to protect our platform to, in turn, protect the data of our customers. Part of this approach is implementing progressive methods in protecting our hardware at scale. While we have blogged about how we address security threats from <a href=\"/mitigating-spectre-and-other-security-threats-the-cloudflare-workers-security-model/\">application</a> to <a href=\"/securing-memory-at-epyc-scale/\">memory</a>, the attacks on hardware, as well as firmware, have increased substantially. The data cataloged in the <a href=\"https://nvd.nist.gov/\">National Vulnerability Database (NVD)</a> has shown the frequency of hardware and firmware-level vulnerabilities rising year after year.</p><p>Technologies like <a href=\"https://docs.microsoft.com/en-us/windows-hardware/design/device-experiences/oem-secure-boot\">secure boot</a>, common in desktops and laptops, have been ported over to the server industry as a method to combat firmware-level attacks and protect a device’s boot integrity. These technologies require that you create a trust ‘anchor’, an authoritative entity for which trust is assumed and not derived. A common trust anchor is the system <a href=\"https://en.wikipedia.org/wiki/BIOS\">Basic Input/Output System (BIOS)</a> or the <a href=\"https://www.uefi.org/\">Unified Extensible Firmware Interface (UEFI</a>) firmware.</p><p>While this ensures that the device boots only signed firmware and operating system bootloaders, does it protect the entire boot process? What protects the BIOS/UEFI firmware from attacks?</p><h2>The Boot Process</h2><p>Before we discuss how we secure our boot process, we will first go over how we boot our machines.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3ubWFPurTNwYnbXL8EnVpl/01493656ce43feeb988c0a94b81dc9bd/image1-7.png\" alt=\"\" class=\"kg-image\" width=\"960\" height=\"540\" loading=\"lazy\"/>\n            \n            </figure><p>The above image shows the following sequence of events:</p><ul><li><p>After powering on the system (through a <a href=\"https://www.gigabyte.com/Glossary/bmc\">baseboard management controller (BMC)</a> or physically pushing a button on the system), the system unconditionally executes the UEFI firmware residing on a flash chip on the motherboard.</p></li><li><p>UEFI performs some hardware and peripheral initialization and executes the <a href=\"https://wiki.debian.org/PXEBootInstall\">Preboot Execution Environment (PXE)</a> code, which is a small program that boots an image over the network and usually resides on a flash chip on the network card.</p></li><li><p>PXE sets up the network card, and downloads and executes a small program bootloader through an open source boot firmware called <a href=\"https://ipxe.org/\">iPXE</a>.</p></li><li><p>iPXE loads a script that automates a sequence of commands for the bootloader to know how to boot a specific operating system (sometimes several of them). In our case, it loads our Linux kernel, <code>initrd</code> (this contains device drivers which are not directly compiled into the kernel), and a standard Linux root filesystem. After loading these components, the bootloader executes and hands off the control to the kernel.</p></li><li><p>Finally, the Linux kernel loads any additional drivers it needs and starts applications and services.</p></li></ul><h2>UEFI Secure Boot</h2><p>Our UEFI secure boot process is fairly straightforward, albeit customized for our environments. After loading the UEFI firmware from the bootloader, an initialization script defines the following variables:</p><p><b>Platform Key (PK):</b> It serves as the cryptographic root of trust for secure boot, giving capabilities to manipulate and/or validate the other components of the <a href=\"https://blog.hansenpartnership.com/the-meaning-of-all-the-uefi-keys/\">secure boot framework</a>.</p><p><b>Trusted Database (DB):</b> Contains a signed (by platform key) list of hashes of all PCI option ROMs, as well as a public key, which is used to verify the signature of the bootloader and the kernel on boot.</p><p>These variables are respectively the master platform public key, which is used to sign all other resources, and an allow list database, containing other certificates, binary file hashes, etc. In default secure boot scenarios, Microsoft keys are used by default. At Cloudflare we use our own, which makes us the root of trust for UEFI:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/12zsC1QVrT8uIGMG0K6ss8/c542b4e961c9779f504acb881ae9432b/image7.png\" alt=\"\" class=\"kg-image\" width=\"960\" height=\"540\" loading=\"lazy\"/>\n            \n            </figure><p>But, by setting our trust anchor in the UEFI firmware, what attack vectors still exist?</p><h2>UEFI Attacks</h2><p>As stated previously, firmware and hardware attacks are on the rise. It is clear from the figure below that firmware-related vulnerabilities have increased significantly over the last 10 years, especially since 2017, when the hacker community started attacking the firmware on different platforms:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7gyyxjhnApSBYfZEdqglcS/619200077d4cc54684d51c40d4e517f6/image14.png\" alt=\"\" class=\"kg-image\" width=\"1610\" height=\"1462\" loading=\"lazy\"/>\n            \n            </figure><p>This upward trend, coupled with <a href=\"https://arstechnica.com/information-technology/2020/10/custom-made-uefi-bootkit-found-lurking-in-the-wild/\">recent malware findings in UEFI</a>, shows that trusting firmware is becoming increasingly problematic.</p><p>By tainting the UEFI firmware image, you poison the entire boot trust chain. The ability to trust firmware integrity is important beyond secure boot. For example, if you can&#39;t trust the firmware not to be compromised, you can&#39;t trust things like <a href=\"https://docs.microsoft.com/en-us/windows/security/information-protection/tpm/trusted-platform-module-overview\">trusted platform module (TPM) measurements</a> to be accurate, because the firmware is itself responsible for doing these measurements (e.g a TPM is not an on-path security mechanism, but instead it requires firmware to interact and cooperate with). Firmware may be crafted to extend measurements that are accepted by a remote attestor, but that don&#39;t represent what&#39;s being locally loaded. This could cause firmware to have a questionable measured boot and remote attestation procedure.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3hTmUFGH3CZwcPD6CXmASh/a3a1916cbae485bbf1938e54b7f457d7/image11.png\" alt=\"\" class=\"kg-image\" width=\"960\" height=\"540\" loading=\"lazy\"/>\n            \n            </figure><p>If we can’t trust firmware, then hardware becomes our last line of defense.</p><h2>Hardware Root of Trust</h2><p>Early this year, we made a series of blog posts on <a href=\"/technical-details-of-why-cloudflare-chose-amd-epyc-for-gen-x-servers/\">why we chose AMD EPYC processors</a> for our Gen X servers. With security in mind, we started <a href=\"/securing-memory-at-epyc-scale/\">turning on</a> features that were available to us and set forth the plan of using AMD silicon as a Hardware Root of Trust (HRoT).</p><p><a href=\"https://www.amd.com/system/files/2017-06/Trusting-in-the-CPU.pdf\">Platform Secure Boot</a> (PSB) is AMD’s implementation of hardware-rooted boot integrity. Why is it better than UEFI firmware-based root of trust? Because it is intended to assert, by a root of trust anchored in the hardware, the integrity and authenticity of the System ROM image before it can execute. It does so by performing the following actions:</p><ul><li><p>Authenticates the first block of BIOS/UEFI prior to releasing x86 CPUs from reset.</p></li><li><p>Authenticates the System Read-Only Memory (ROM) contents on each boot, not just during updates.</p></li><li><p>Moves the UEFI Secure Boot trust chain to immutable hardware.</p></li></ul><p>This is accomplished by the AMD Platform Security Processor (PSP), an ARM Cortex-A5 microcontroller that is an immutable part of the system on chip (SoC). The PSB consists of two components:</p><p><b><b><b>On-chip Boot ROM</b></b></b></p><ul><li><p>Embeds a SHA384 hash of an AMD root signing key</p></li><li><p>Verifies and then loads the off-chip PSP bootloader located in the boot flash</p></li></ul><p><b><b><b>Off-chip Boot</b></b></b><b><b>**l</b></b>oader******</p><ul><li><p>Locates the PSP directory table that allows the PSP to find and load various images</p></li><li><p>Authenticates first block of BIOS/UEFI code</p></li><li><p>Releases CPUs after successful authentication</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5ABw5l5aHps4VcM0wHACDq/8f28a204f81b8608d25a15ccd37e9e6c/image4.gif\" alt=\"\" class=\"kg-image\" width=\"960\" height=\"540\" loading=\"lazy\"/>\n            \n            </figure><ol><li><p>The PSP secures the On-chip Boot ROM code, loads the off-chip PSP firmware into PSP static random access memory (SRAM) after authenticating the firmware, and passes control to it.</p></li><li><p>The Off-chip Bootloader (BL) loads and specifies applications in a specific order (whether or not the system goes into a debug state and then a secure EFI application binary interface to the BL)</p></li><li><p>The system continues initialization through each bootloader stage.</p></li><li><p>If each stage passes, then the UEFI image is loaded and the x86 cores are released.</p></li></ol><p>Now that we know the booting steps, let’s build an image.</p><h2>Build Process</h2><h3></h3><p>Public Key Infrastructure</p><p>Before the image gets built, a public key infrastructure (PKI) is created to generate the key pairs involved for signing and validating signatures:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7CGqAcYMPxBE9kv0ZcjGwL/76e0192eb62d0cc1becfff8efd32a9ee/image10.png\" alt=\"\" class=\"kg-image\" width=\"960\" height=\"540\" loading=\"lazy\"/>\n            \n            </figure><p>Our original device manufacturer (ODM), as a trust extension, creates a key pair (public and private) that is used to sign the first segment of the BIOS (private key) and validates that segment on boot (public key).</p><p>On AMD’s side, they have a key pair that is used to sign (the AMD root signing private key) and certify the public key created by the ODM. This is validated by AMD’s root signing public key, which is stored as a hash value (<a href=\"https://tools.ietf.org/html/rfc5756\">RSASSA-PSS</a>: SHA-384 with 4096-bit key is used as the hashing algorithm for both message and mask generation) in <a href=\"https://en.wikipedia.org/wiki/Serial_Peripheral_Interface\">SPI-ROM</a>.</p><p>Private keys (both AMD and ODM) are stored in <a href=\"https://en.wikipedia.org/wiki/Hardware_security_module\">hardware security modules</a>.</p><p>Because of the way the PKI mechanisms are built, the system cannot be compromised if only one of the keys is leaked. This is an important piece of the trust hierarchy that is used for image signing.</p><h3>Certificate Signing Request</h3><p>Once the PKI infrastructure is established, a BIOS signing key pair is created, together with a certificate signing request (CSR). Creating the CSR uses known common name (CN) fields that many are familiar with:</p><ul><li><p><code>countryName</code></p></li><li><p><code>stateOrProvinceName</code></p></li><li><p><code>localityName</code></p></li><li><p><code>organizationName</code></p></li></ul><p>In addition to the fields above, the CSR will contain a <code>serialNumber</code> field, a 32-bit integer value represented in ASCII HEX format that encodes the following values:</p><ul><li><p><code>PLATFORM_VENDOR_ID</code>: An 8-bit integer value assigned by AMD for each ODM.</p></li><li><p><code>PLATFORM_MODEL_ID</code>: A 4-bit integer value assigned to a platform by the ODM.</p></li><li><p><code>BIOS_KEY_REVISION_ID</code>: is set by the ODM encoding a 4-bit key revision as unary counter value.</p></li><li><p><code>DISABLE_SECURE_DEBUG</code>: Fuse bit that controls whether secure debug unlock feature is disabled permanently.</p></li><li><p><code>DISABLE_AMD_BIOS_KEY_USE</code>: Fuse bit that controls if the BIOS, signed by an AMD key, (with <code>vendor ID == 0</code>) is permitted to boot on a CPU with non-zero Vendor ID.</p></li><li><p><code>DISABLE_BIOS_KEY_ANTI_ROLLBACK</code>: Fuse bit that controls whether BIOS key anti-rollback feature is enabled.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7jqoVoEKDiRSoVt9MbdY0W/cc78823e08260658511296d9e82225c3/image3-3.png\" alt=\"\" class=\"kg-image\" width=\"966\" height=\"155\" loading=\"lazy\"/>\n            \n            </figure><p>Remember these values, as we’ll show how we use them in a bit. Any of the <code>DISABLE</code> values are optional, but recommended based on your security posture/comfort level.</p><p>AMD, upon processing the CSR, provides the public part of the BIOS signing key signed and certified by the AMD signing root key as a RSA Public Key Token file (<code>.stkn</code>) format.</p><h2>Putting It All Together</h2><p>The following is a step-by-step illustration of how signed UEFI firmware is built:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/48teEpwD6WwiJEVvSql73e/caa650ab3ce2b393dee8c7417a25b073/image8.gif\" alt=\"\" class=\"kg-image\" width=\"960\" height=\"540\" loading=\"lazy\"/>\n            \n            </figure><ol><li><p>The ODM submits their public key used for signing Cloudflare images to AMD.</p></li><li><p>AMD signs this key using their RSA private key and passes it back to ODM.</p></li><li><p>The AMD public key and the signed ODM public key are part of the final BIOS SPI image.</p></li><li><p>The BIOS source code is compiled and various BIOS components (PEI Volume, Driver eXecution Environment (DXE) volume, NVRAM storage, etc.) are <a href=\"https://edk2-docs.gitbook.io/edk-ii-build-specification/2_design_discussion/23_boot_sequence\">built as usual.</a></p></li><li><p>The PSP directory and BIOS directory are built next. PSP directory and BIOS directory table points to the location of various firmware entities.</p></li><li><p>The ODM builds the signed BIOS Root of Trust Measurement (RTM) signature based on the blob of BIOS PEI volume concatenated with BIOS Directory header, and generates the digital signature of this using the private portion of ODM signing key. The SPI location for signed BIOS RTM code is finally updated with this signature blob.</p></li><li><p>Finally, the BIOS binaries, PSP directory, BIOS directory and various firmware binaries are combined to build the SPI BIOS image.</p></li></ol><h2>Enabling Platform Secure Boot</h2><p>Platform Secure Boot is enabled at boot time with a PSB-ready firmware image. PSB is configured using a region of one-time programmable (OTP) fuses, specified for the customer. OTP fuses are on-chip non-volatile memory (NVM) that permits data to be written to memory only once. There is <b>NO</b> way to roll the fused CPU back to an unfused one.</p><p>Enabling PSB in the field will go through two steps: fusing and validating.</p><ul><li><p>Fusing: Fuse the values assigned in the <code>serialNumber</code> field that was generated in the CSR</p></li><li><p>Validating: Validate the fused values and the status code registers</p></li></ul><p>If validation is successful, the BIOS RTM signature is validated using the ODM BIOS signing key, PSB-specific registers (<code>MP0_C2P_MSG_37</code> and <code>MP0_C2P_MSG_38</code>) are updated with the PSB status and fuse values, and the x86 cores are released</p><p>If validation fails, the registers above are updated with the PSB error status and fuse values, and the x86 cores stay in a locked state.</p><h2>Let’s Boot!</h2><p>With a signed image in hand, we are ready to enable PSB on a machine. We chose to deploy this on a few machines that had an updated, unsigned <a href=\"https://ami.com/en/support/bios-uefi-firmware-support/\">AMI UEFI</a> firmware image, in this case version <code>2.16</code>. We use a couple of different firmware <a href=\"https://github.com/Zibri/afulnx/releases\">update</a> <a href=\"https://downloadcenter.intel.com/download/29977?v=t\">tools</a>, so, after a quick script, we ran an update to change the firmware version from <code>2.16</code> to <code>2.18C</code> (the signed image):</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">. $sudo ./UpdateAll.sh\nBin file name is ****.218C\n\nBEGIN\n\n+---------------------------------------------------------------------------+\n|                 AMI Firmware Update Utility v5.11.03.1778                 |      \n|                 Copyright (C)2018 American Megatrends Inc.                |                       \n|                         All Rights Reserved.                              |\n+---------------------------------------------------------------------------+\nReading flash ............... done\nFFS checksums ......... ok\nCheck RomLayout ........ ok.\nErasing Boot Block .......... done\nUpdating Boot Block ......... done\nVerifying Boot Block ........ done\nErasing Main Block .......... done\nUpdating Main Block ......... done\nVerifying Main Block ........ done\nErasing NVRAM Block ......... done\nUpdating NVRAM Block ........ done\nVerifying NVRAM Block ....... done\nErasing NCB Block ........... done\nUpdating NCB Block .......... done\nVerifying NCB Block ......... done\n\nProcess completed.</pre></code>\n            <p>After the update completed, we rebooted:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2ZW4E36XqbrlpgvXyjR34t/8fe106d8d5c1054d89f014e40143be6e/image2-6.png\" alt=\"\" class=\"kg-image\" width=\"1603\" height=\"1205\" loading=\"lazy\"/>\n            \n            </figure><p>After a successful install, we validated that the image was correct via the <a href=\"https://man7.org/linux/man-pages/man5/sysfs.5.html\">sysfs</a> information provided in the <a href=\"https://linux.die.net/man/8/dmidecode\">dmidecode</a> output:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1gIi4xRxwq4PfpxAjc2nnA/41cd8a14cf8e706fa950f384afa18923/image12.gif\" alt=\"\" class=\"kg-image\" width=\"463\" height=\"233\" loading=\"lazy\"/>\n            \n            </figure><h3>Testing</h3><p>With a signed image installed, we wanted to test that it worked, meaning: what if an unauthorized user installed their own firmware image? We did this by downgrading the image back to an unsigned image, <code>2.16</code>. In theory, the machine shouldn’t boot as the x86 cores should stay in a locked state. After downgrading, we rebooted and got the following:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7HQqHnKOTSHg1YQOyZq35A/71d546123a3df594596bc6c7ba86ecee/image13-1.jpg\" alt=\"\" class=\"kg-image\" width=\"292\" height=\"452\" loading=\"lazy\"/>\n            \n            </figure><p>This isn’t a powered down machine, but the result of booting with an unsigned image.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/y9RGO5UGzOEG1lxRyPJa2/8356466f68d677c4119a32675d2191e4/image9.jpg\" alt=\"\" class=\"kg-image\" width=\"225\" height=\"225\" loading=\"lazy\"/>\n            \n            </figure><p>Flashing back to a signed image is done by running the same flashing utility through the BMC, so we weren’t bricked. Nonetheless, the results were successful.</p><h2>Naming Convention</h2><p>Our standard UEFI firmware images are alphanumeric, making it difficult to distinguish (by name) the difference between a signed and unsigned image (<code>v2.16A</code> vs <code>v2.18C</code>), for example. There isn’t a remote attestation capability (yet) to probe the PSB status registers or to store these values by means of a signature (e.g. <a href=\"https://linux.die.net/man/8/tpm_quote_tools\">TPM quote</a>). As we transitioned to PSB, we wanted to make this easier to determine by adding a specific suffix: <code>-sig</code>  that we could query in userspace. This would allow us to query this information via <a href=\"https://prometheus.io/\">Prometheus</a>. Changing the file name alone wouldn’t do it, so we had to make the following changes to reflect a new naming convention for signed images:</p><ul><li><p>Update filename</p></li><li><p>Update BIOS version for setup menu</p></li><li><p>Update post message</p></li><li><p>Update <a href=\"https://www.dmtf.org/sites/default/files/standards/documents/DSP0134_2.7.1.pdf\">SMBIOS type 0</a> (BIOS version string identifier)</p></li></ul><p>Signed images now have a <code>-sig</code> suffix:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">~$ sudo dmidecode -t0\n# dmidecode 3.2\nGetting SMBIOS data from sysfs.\nSMBIOS 3.3.0 present.\n# SMBIOS implementations newer than version 3.2.0 are not\n# fully supported by this version of dmidecode.\n\nHandle 0x0000, DMI type 0, 26 bytes\nBIOS Information\n\tVendor: American Megatrends Inc.\n\tVersion: V2.20-sig\n\tRelease Date: 09/29/2020\n\tAddress: 0xF0000\n\tRuntime Size: 64 kB\n\tROM Size: 16 MB</pre></code>\n            <h2>Conclusion</h2><p>Finding weaknesses in firmware is a challenge that many attackers have taken on. Attacks that physically manipulate the firmware used for performing hardware initialization during the booting process can invalidate many of the common secure boot features that are considered industry standard. By implementing a hardware root of trust that is used for code signing critical boot entities, your hardware becomes a &#39;first line of defense&#39; in ensuring that your server hardware and software integrity can derive trust through cryptographic means.</p><h2>What’s Next?</h2><p>While this post discussed our current, AMD-based hardware platform, how will this affect our future hardware generations? One of the benefits of working with diverse vendors like AMD and <a href=\"https://amperecomputing.com/\">Ampere</a> (ARM) is that we can ensure they are baking in our desired platform security by default (which we’ll speak about in a future post), making our hardware security outlook that much brighter ?.</p>",
		"id": "m0jUp84VV1cK5dqLgVh32",
		"localeList": {
			"name": "Anchoring Trust: A Hardware Secure Boot Story Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "As a security company, we pride ourselves on finding innovative ways to protect our platform to, in turn, protect the data of our customers. Part of this approach is implementing progressive methods in protecting our hardware at scale.",
		"metadata": {
			"title": "Anchoring Trust: A Hardware Secure Boot Story",
			"description": "As a security company, we pride ourselves on finding innovative ways to protect our platform to, in turn, protect the data of our customers. Part of this approach is implementing progressive methods in protecting our hardware at scale.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3j1UWGSCraVO1RveLhB7rB/ec2c4d8332eb0f54179dc927cf65ae2d/anchoring-trust-a-hardware-secure-boot-story-TosqzC.png"
		},
		"primary_author": {},
		"published_at": "2020-11-17T12:00:00.000+00:00",
		"slug": "anchoring-trust-a-hardware-secure-boot-story",
		"tags": [
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "1ffv1vW4BzGcbQOa9xbY4O",
				"name": "Hardware",
				"slug": "hardware"
			},
			{
				"id": "3q9cXaNFwBlNyWjukkAveR",
				"name": "Encryption",
				"slug": "encryption"
			},
			{
				"id": "3xEHPB7vINhWXG24KZgTTz",
				"name": "Data Center",
				"slug": "data-center"
			},
			{
				"id": "3TaNOBp8EhAE6eCfshf1tK",
				"name": "Cloudflare Network",
				"slug": "cloudflare-network"
			}
		],
		"title": "Anchoring Trust: A Hardware Secure Boot Story",
		"updated_at": "2024-08-27T01:56:03.762Z",
		"url": "https://blog.cloudflare.com/anchoring-trust-a-hardware-secure-boot-story"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}