{
	"post": {
		"id": "5f724398c9353501baf0c614",
		"uuid": "3f11f370-0624-4956-a11f-7e664fb3284b",
		"title": "Introducing Automatic Platform Optimization, starting with WordPress",
		"slug": "automatic-platform-optimizations-starting-with-wordpress",
		"html": "<figure class=\"kg-card kg-image-card\"><img src=\"http://blog.cloudflare.com/content/images/2020/10/image2-1.png\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>Today, we are announcing a new service to serve more than just the static content of your website with the <a href=\"https://www.cloudflare.com/application-services/products/automatic-platform-optimization/\">Automatic Platform Optimization (APO)</a> service. With this launch, we are supporting WordPress, the most popular website hosting solution serving 38% of all websites. Our testing, as detailed below, showed a 72% reduction in Time to First Byte (TTFB), 23% reduction to <a href=\"https://web.dev/fcp/\">First Contentful Paint</a>, and 13% reduction in <a href=\"https://web.dev/speed-index/\">Speed Index</a> for desktop users at the 90th percentile, by serving nearly all of your website’s content from Cloudflare’s network. This means visitors to your website see not only the first content sooner but all content more quickly. </p><p>With Automatic Platform Optimization for WordPress, your customers won’t suffer any slowness caused by common issues like shared hosting congestion, slow database lookups, or misbehaving plugins. This service is now available for anyone using WordPress. </p><h3 id=\"automatic-platform-optimization-pricing\">Automatic Platform Optimization Pricing</h3><p>APO for WordPress costs $5/month for customers on our Free plan and is included, at no additional cost, in our Professional, Business, and Enterprise <a href=\"https://www.cloudflare.com/plans/\">plans</a>. No usage fees, no surprises, <em>just speed</em>.</p><h3 id=\"how-to-get-started\">How to get started</h3><p>The easiest way to get started with APO is from your WordPress admin console. </p><p><strong>1</strong>. First, install the <a href=\"https://wordpress.org/plugins/cloudflare/\">Cloudflare WordPress plugin</a> on your WordPress website or update to the latest version (3.8.2 or higher). <br><strong>2</strong>. Authenticate the plugin (<a href=\"https://wordpress.org/plugins/cloudflare/#installation\">steps here</a>) to talk to Cloudflare if you have not already done that. <br><strong>3</strong>. From the Home screen of the Cloudflare section, turn on Automatic Platform Optimization.<br><br>Free customers will first be directed to the <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/speed/optimization\">Cloudflare Dashboard</a> to purchase the service.</p><h3 id=\"why-we-built-this\">Why We Built This</h3><p>At Cloudflare, we jump at the opportunity to make hard problems for our customers disappear with the click of a button. Running a consistently fast website is challenging. Many businesses don’t have the time nor money to spend on complicated and expensive performance solutions for their site. Even if they do, it can be extremely costly to pay for specialized attention to ensure you get the best performance possible. Having a fast website doesn’t have to be complicated, though. <strong>The closer your content is to your customers, the better your site will perform.</strong> Static content caching does this for files like images, CSS and JavaScript, but that is only part of the equation. Dynamic content is still fetched from the origin incurring costly round trips and additional processing time. For more info on dynamic versus static content, see our <a href=\"https://www.cloudflare.com/learning/cdn/caching-static-and-dynamic-content/\">learning center</a>.</p><p>WordPress is one of the most open platforms in the world, but that means you are always at risk of incurring performance penalties because of plugins or other sources that, while necessary, may be hard to pinpoint and resolve. With the Automatic Platform Optimization service, we put your website into our network that is within 10 milliseconds of 99% of the Internet-connected population in the developed world, all without having to change your existing hosting provider. This means that for most requests your customers won’t even need to go to your origin, reducing many costly round trips and server processing time. These optimizations run on our edge network, so they also will not impact render or interactivity since no additional JavaScript is run on the client.</p><h3 id=\"how-we-measure-web-performance\">How We Measure Web Performance</h3><p>Evaluating performance of a website is difficult. There are many different metrics you can track and it is not always obvious which metrics most meaningfully represent a user’s experience. As discussed when we <a href=\"http://blog.cloudflare.com/new-speed-page/\">blogged</a> about our new <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/speed\">Speed page</a>, we aim to simplify this for customers by automating tests using the infrastructure of webpagetest.org, and summarizing both the results visually and numerically in one place.</p><figure class=\"kg-card kg-image-card\"><img src=\"http://blog.cloudflare.com/content/images/2020/10/image4-2.png\" class=\"kg-image\" alt=\"Tests your website's performance and provides visual and numerical metrics along with recommended optimizations\" loading=\"lazy\" title=\"Cloudflare Dashboard Speed Overview\"></figure><p>The visualization gives you a clear idea of what customers are going to see when they come to your site, and the <em>Critical Loading Times</em> provide the most important metrics to judge your performance. On top of seeing your site’s performance, we provide a list of recommendations for ways to even further increase your performance. If you are using WordPress, then we will test your site with Automatic Platform Optimizations to estimate the benefit you will get with the service.</p><h3 id=\"the-benefits-of-automatic-platform-optimization\">The Benefits of Automatic Platform Optimization</h3><p>We tested APO on over 500 Cloudflare customer websites that run on WordPress to understand what the performance improvements would be. The results speak for themselves:</p><p><strong>Test Results</strong></p><!--kg-card-begin: markdown--><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-aa1j{background-color:#c0c0c0;border-color:inherit;font-size:18px;font-weight:bold;text-align:center;vertical-align:middle}\n.tg .tg-r5qm{border-color:inherit;font-size:18px;text-align:left;vertical-align:middle}\n</style>\n<table class=\"tg\">\n<thead>\n  <tr>\n    <th class=\"tg-aa1j\">Metric</th>\n    <th class=\"tg-aa1j\">Percentiles</th>\n    <th class=\"tg-aa1j\">Baseline Cloudflare</th>\n    <th class=\"tg-aa1j\">APO Enabled</th>\n    <th class=\"tg-aa1j\">Improvement (%)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td class=\"tg-r5qm\" rowspan=\"2\"><span style=\"font-weight:400;font-style:normal;text-decoration:none\">Time to First Byte (TTFB)</span></td>\n    <td class=\"tg-r5qm\">90th</td>\n    <td class=\"tg-r5qm\">1252 ms</td>\n    <td class=\"tg-r5qm\">351 ms</td>\n    <td class=\"tg-r5qm\">71.96%</td>\n  </tr>\n  <tr>\n    <td class=\"tg-r5qm\">10th</td>\n    <td class=\"tg-r5qm\">254 ms</td>\n    <td class=\"tg-r5qm\">261 ms</td>\n    <td class=\"tg-r5qm\">-2.76%</td>\n  </tr>\n  <tr>\n    <td class=\"tg-r5qm\" rowspan=\"2\"><a href=\"https://web.dev/fcp/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight:400;font-style:normal;text-decoration:underline\">First Contentful Paint</span></a><br><a href=\"https://web.dev/fcp/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight:400;font-style:normal;text-decoration:underline\"> </span></a><span style=\"font-weight:400;font-style:normal;text-decoration:none\">(FCP)</span></td>\n    <td class=\"tg-r5qm\"><span style=\"font-weight:400;font-style:normal\">90th</span></td>\n    <td class=\"tg-r5qm\">2655 ms</td>\n    <td class=\"tg-r5qm\">2056 ms</td>\n    <td class=\"tg-r5qm\">22.55%</td>\n  </tr>\n  <tr>\n    <td class=\"tg-r5qm\"><span style=\"font-weight:400;font-style:normal\">10th</span></td>\n    <td class=\"tg-r5qm\">894 ms</td>\n    <td class=\"tg-r5qm\">783 ms</td>\n    <td class=\"tg-r5qm\">12.46%</td>\n  </tr>\n  <tr>\n    <td class=\"tg-r5qm\" rowspan=\"2\"><a href=\"https://web.dev/speed-index/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight:400;font-style:normal;text-decoration:underline\">Speed Index</span></a><br><a href=\"https://web.dev/speed-index/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight:400;font-style:normal;text-decoration:underline\"> </span></a><span style=\"font-weight:400;font-style:normal;text-decoration:none\">(SI)</span></td>\n    <td class=\"tg-r5qm\"><span style=\"font-weight:400;font-style:normal\">90th</span></td>\n    <td class=\"tg-r5qm\">6428</td>\n    <td class=\"tg-r5qm\">5586</td>\n    <td class=\"tg-r5qm\">13.11%</td>\n  </tr>\n  <tr>\n    <td class=\"tg-r5qm\"><span style=\"font-weight:400;font-style:normal\">10th</span></td>\n    <td class=\"tg-r5qm\">1301</td>\n    <td class=\"tg-r5qm\">1242</td>\n    <td class=\"tg-r5qm\">4.52%</td>\n  </tr>\n</tbody>\n</table><!--kg-card-end: markdown--><!--kg-card-begin: markdown--><p><small>Note: Results are based on test results of 505 randomly selected websites that are cached by Cloudflare. Tests were run using WebPageTest from South Carolina, USA and the following environment: Chrome, Cable connection speed.</small></p>\n<!--kg-card-end: markdown--><p>Most importantly, with APO, a site’s TTFB is made both fast and consistent. Because we now serve the HTML from Cloudflare’s edge with 0 origin processing time, getting the first byte to the eyeball is consistently fast. Under heavy load, a WordPress origin can suffer delays in building the HTML and returning it to visitors. APO removes the variance due to load resulting in consistent TTFB &lt;400 ms.</p><p>Additionally, between faster TTFB and additional caching of third party fonts, we see performance improvements in both FCP and SI for both the fastest and slowest of the sites we tested. Some of this comes naturally from reducing the TTFB, since every millisecond you shave off of TTFB is a potential millisecond gain for other metrics. Caching additional third party fonts allows us to reduce the time it takes to fetch that content. Given fonts can often block paints due to text rendering, this improves the rate at which the page paints, and improves the Speed Index.</p><p>We asked the folks at <a href=\"https://kinsta.com/\">Kinsta</a> to try out APO, given their expertise on WordPress, and tell us what they think. <a href=\"https://brianli.com/\">Brian Li</a>, a Website Content Manager at Kinsta, ran a set of tests from around the world on a website hosted in Tokyo. I’ll let him explain what they did and the results:</p><!--kg-card-begin: markdown--><blockquote>\n<p>At Kinsta, <a href=\"https://kinsta.com/blog/fastest-wordpress-hosting/\">WordPress performance</a> is something that’s near and dear to our hearts. So, when Cloudflare reached out about testing their new Automatic Platform Optimization (APO) service for WordPress, we were all ears.<br>\n <br>\nThis is what we did to test out the new service:</p>\n<ol>\n<li>We set up a test site in Tokyo, Japan – one of the 24 high-performance <a href=\"https://kinsta.com/knowledgebase/google-cloud-data-center-locations/\">data center locations</a> available for Kinsta customers.</li>\n<li>We ran several speed tests from six different locations around the world with and without Cloudflare’s APO.</li>\n</ol>\n<p> <br>\nThe results were incredible!<br>\n <br>\nBy caching <a href=\"https://kinsta.com/blog/wordpress-vs-static-html/\">static HTML</a> on Cloudflare’s edge network, we saw a 70-300% performance increase. As expected, the testing locations furthest away from Tokyo saw the biggest reduction in <a href=\"https://kinsta.com/blog/ttfb/\">load time</a>.<br>\n <br>\nIf your WordPress site uses a traditional <a href=\"https://www.cloudflare.com/learning/cdn/what-is-a-cdn/\">CDN</a> that only caches CSS, JS, and images, upgrading to Cloudflare’s WordPress APO is a no-brainer and will help you stay competitive with modern Jamstack and static sites that live on the edge by default.</p>\n</blockquote>\n<!--kg-card-end: markdown--><p>Brian’s test results are summarized in this image:</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2020/10/image1-7.png\" class=\"kg-image\" alt loading=\"lazy\"><figcaption>Page Load Speeds for loading a website hosted in Tokyo from 6 locations worldwide - comparing Kinsta, Kinsta with KeyCDN, and Kinsta with Cloudflare APO.</figcaption></figure><p>One of the clear benefits, from Kinsta’s testing of APO, is the consistency of performance for serving your site no matter where your visitors are in the world. The consistent sub-second performance shown with APO versus two or three second load times in other setups makes it clear that if you have a global customer base, APO delivers an improved experience for all visitors.</p><h3 id=\"how-automatic-platform-optimization-works\">How Automatic Platform Optimization Works</h3><p>Automatic Platform Optimization is the result of being able to use the power of <a href=\"https://www.cloudflare.com/developer-platform/workers/\">Cloudflare Workers</a> to intelligently cache dynamic content. By caching dynamic content, we can serve the entire website from our edge network. Think ‘static site’ but without any of the work of having to build or maintain a static site. Customers can keep managing and updating content on their website in the same way and leave the hard work for performance to us. Serving both static and dynamic content from our network results, generally, in no origin requests or origin processing time. This means all the communication occurs between the user’s device and our edge. Reducing the multitude of round trips typically required from our edge to the origin for dynamic content is what makes this service so effective. Let’s first see what it normally looks like to load a WordPress site for a visitor.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2020/10/image3-3.png\" class=\"kg-image\" alt loading=\"lazy\"><figcaption>A sequence diagram for a typical user visiting a site<span class=\"-mobiledoc-kit__atom\">‌‌</span></figcaption></figure><p>In a regular request flow, Cloudflare is able to cache some of the content like images, CSS, or JS, while other requests go to either the origin or a third party service in order to fetch the content. Most importantly the first request to fetch the HTML for the site needs to go to the origin which is a typical cause of long TTFB, since no other requests get made until the client can receive the HTML and parse it to make subsequent requests.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2020/10/image2-2.png\" class=\"kg-image\" alt loading=\"lazy\"><figcaption>The same site visit but with APO enabled.</figcaption></figure><p>Once APO is enabled, all those trips to the origin are removed. TTFB benefits greatly because the first hop starts and ends at Cloudflare’s network. This also means the browser starts working on fetching and painting the webpage sooner meaning each paint event occurs earlier. Last by caching third party fonts, we remove additional requests that would need to leave Cloudflare’s network and extend the time to display text to the user. Often, websites use fonts hosted on third-party domains. While this saves bandwidth costs that would be incurred from hosting it on the origin, depending on where those fonts are hosted, it can still be a costly operation to fetch them. By rehosting the fonts and serving them from our cache, we can reduce one of the remaining costly round trips.</p><p>With APO for WordPress, you can say bye bye to database congestion or unwieldy plugins slowing down your customers’ experience. These benefits are stacked on top of our already fast <a href=\"https://www.cloudflare.com/learning/ssl/transport-layer-security-tls/\">TLS connection times</a> and industry leading protocol support like HTTP/2 that ensure we are using the most efficient and the fastest way to connect and deliver your website to your customers.</p><p>For customers with WordPress sites that support authenticated sessions, you do not have to worry about us caching content from authenticated users and serving it to others. We bypass the cache on standard WordPress and WooCommerce cookies for authenticated users. This ensures customized content for a specific user is only visible to that user. While this has been available to customers with our Business-level service, it is now available for any WordPress customer that enables APO.</p><p>You might be wondering: “This all sounds great, but what about when I change content on my site?” Because this service works in tandem with our <a href=\"https://www.cloudflare.com/integrations/wordpress/\">WordPress plugin</a>, we are able to understand when you make changes and ensure we quickly purge the content in Cloudflare’s edge and refresh it with the new content. With the plugin installed, we detect content changes and update our edge network worldwide with automatic cache purges. As part of this release, we have updated our WordPress plugin, so whether you use APO, you should upgrade to the latest version today. If you do not or cannot use our WordPress plugin, then APO will still provide the same performance benefits, but may serve stale content for up to 30 minutes and when the content is requested again.</p><p>This service was built on the prototype work originally blogged about <a href=\"http://blog.cloudflare.com/improving-html-time-to-first-byte/\">here</a> and <a href=\"http://blog.cloudflare.com/fast-google-fonts-with-cloudflare-workers/\">here</a>. For a more in depth look at the technical side of the service and how Cloudflare Workers allowed us to build the Automatic Platform Optimization service, see the <a href=\"http://blog.cloudflare.com/building-automatic-platform-optimization-for-wordpress-using-cloudflare-workers/\">accompanying blog post</a>.</p><h3 id=\"wordpress-today-other-platforms-coming-soon\">WordPress Today, Other Platforms Coming Soon</h3><p>While today’s announcement is focused on supporting WordPress, this is just the start. We plan to bring these same capabilities to other popular platforms used for web hosting. If you operate a platform and are interested in how we may be able to work together to improve things for all your customers, <a href=\"https://www.cloudflare.com/partners/\">please get in touch</a>. If you are running a website, let us know what platform you want to see us bring Automatic Platform Optimization to next.</p>",
		"comment_id": "5f724398c9353501baf0c614",
		"feature_image": "http://blog.cloudflare.com/content/images/2020/09/Birthday-Week-OG-images_WordPress_Optimization.png",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-09-28T21:12:08.000+01:00",
		"updated_at": "2024-02-01T21:55:38.000+00:00",
		"published_at": "2020-10-02T14:01:00.000+01:00",
		"custom_excerpt": "Today, we are announcing a new service to serve more than just the static content of your website with the Automatic Platform Optimization (APO) service. With this launch, we are supporting WordPress, the most popular website hosting solution serving 38% of all websites. ",
		"codeinjection_head": null,
		"codeinjection_foot": null,
		"custom_template": null,
		"canonical_url": null,
		"authors": [
			{
				"id": "5d1644b141acde0011a94fd0",
				"name": "Garrett Galow",
				"slug": "garrett",
				"profile_image": "http://blog.cloudflare.com/content/images/2018/04/14729279_10207227100946205_2625241094472568444_n.jpg",
				"cover_image": "http://blog.cloudflare.com/content/images/2018/08/general@2x-82.png",
				"bio": null,
				"website": null,
				"location": null,
				"facebook": null,
				"twitter": null,
				"meta_title": null,
				"meta_description": null,
				"url": "http://blog.cloudflare.com/author/garrett/"
			}
		],
		"tags": [
			{
				"id": "5d16450341acde0011a95211",
				"name": "Birthday Week",
				"slug": "birthday-week",
				"description": "Collection of Cloudflare blog posts tagged 'Birthday Week'.",
				"feature_image": "http://blog.cloudflare.com/content/images/2023/09/Welcome-to-Birthday-Week-2023.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Birthday Week",
				"meta_description": "Collection of Cloudflare blog posts tagged 'Birthday Week'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/birthday-week/"
			},
			{
				"id": "5d16450341acde0011a95154",
				"name": "WordPress",
				"slug": "wordpress",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/wordpress/"
			},
			{
				"id": "5d16450341acde0011a951ee",
				"name": "Product News",
				"slug": "product-news",
				"description": "Product News (EN)",
				"feature_image": "http://blog.cloudflare.com/content/images/2020/10/Product-News-1.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Product News",
				"meta_description": "Collection of Cloudflare blog posts tagged 'Product News'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/product-news/"
			},
			{
				"id": "5d16450341acde0011a95160",
				"name": "Speed & Reliability",
				"slug": "speed-and-reliability",
				"description": null,
				"feature_image": "http://blog.cloudflare.com/content/images/2020/10/Speed---Reliability-1.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Speed & Reliability",
				"meta_description": "Collection of Cloudflare blog posts tagged 'Speed & Reliability'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/speed-and-reliability/"
			},
			{
				"id": "5f727fcec9353501baf0c6c2",
				"name": "TTFB",
				"slug": "ttfb",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/ttfb/"
			},
			{
				"id": "5e8cf191e589a401bcf8571e",
				"name": "#table",
				"slug": "hash-table",
				"description": null,
				"feature_image": null,
				"visibility": "internal",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/404/"
			},
			{
				"id": "5f727fcec9353501baf0c6c3",
				"name": "Automatic Platform Optimization",
				"slug": "automatic-platform-optimization",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/automatic-platform-optimization/"
			}
		],
		"primary_author": {
			"id": "5d1644b141acde0011a94fd0",
			"name": "Garrett Galow",
			"slug": "garrett",
			"profile_image": "http://blog.cloudflare.com/content/images/2018/04/14729279_10207227100946205_2625241094472568444_n.jpg",
			"cover_image": "http://blog.cloudflare.com/content/images/2018/08/general@2x-82.png",
			"bio": null,
			"website": null,
			"location": null,
			"facebook": null,
			"twitter": null,
			"meta_title": null,
			"meta_description": null,
			"url": "http://blog.cloudflare.com/author/garrett/"
		},
		"primary_tag": {
			"id": "5d16450341acde0011a95211",
			"name": "Birthday Week",
			"slug": "birthday-week",
			"description": "Collection of Cloudflare blog posts tagged 'Birthday Week'.",
			"feature_image": "http://blog.cloudflare.com/content/images/2023/09/Welcome-to-Birthday-Week-2023.png",
			"visibility": "public",
			"meta_title": "Cloudflare Blog: Birthday Week",
			"meta_description": "Collection of Cloudflare blog posts tagged 'Birthday Week'.",
			"og_image": null,
			"og_title": null,
			"og_description": null,
			"twitter_image": null,
			"twitter_title": null,
			"twitter_description": null,
			"codeinjection_head": null,
			"codeinjection_foot": null,
			"canonical_url": null,
			"accent_color": null,
			"url": "http://blog.cloudflare.com/tag/birthday-week/"
		},
		"url": "http://blog.cloudflare.com/automatic-platform-optimizations-starting-with-wordpress/",
		"excerpt": "Today, we are announcing a new service to serve more than just the static content of your website with the Automatic Platform Optimization (APO) service. With this launch, we are supporting WordPress, the most popular website hosting solution serving 38% of all websites. ",
		"reading_time": 9,
		"access": true,
		"comments": false,
		"og_image": null,
		"og_title": null,
		"og_description": null,
		"twitter_image": null,
		"twitter_title": null,
		"twitter_description": null,
		"meta_title": null,
		"meta_description": "With the Automatic Platform Optimization (APO) service, we are supporting WordPress, the most popular website hosting solution serving 38% of all websites. ",
		"email_subject": null,
		"frontmatter": null,
		"feature_image_alt": null,
		"feature_image_caption": null
	},
	"locale": "en-us"
}