{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Chris De La Garza",
				"slug": "chris-de-la-garza",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/xL5ieZGeKlwwga2IM0uc0/1245da5918a1b95313b9406696096a75/chris-de-la-garza.jpg",
				"location": null,
				"website": null,
				"twitter": "@tenaciousdlg",
				"facebook": null
			}
		],
		"excerpt": "An overview on how to use Terraform to automatically deploy Named Tunnels into your infrastructure with Cloudflare. \n",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5HkKfLR1e0M1JAm7AAkJvZ/16289ba293f78717a913882965cd52dc/automating-cloudflare-tunnel-with-terraform.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3v0TUHcslCYkLfDFBPyxwA/7538733250acd0b44fe70ae3a4b0775a/Terraform-tunnels.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"766\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare Tunnel allows you to connect applications securely and quickly to Cloudflare’s edge. With Cloudflare Tunnel, teams can expose anything to the world, from internal subnets to containers, in a secure and fast way. Thanks to recent developments with our <a href=\"https://github.com/cloudflare/terraform-provider-cloudflare/issues/603\">Terraform provider</a> and the advent of <a href=\"/argo-tunnels-that-live-forever/\">Named Tunnels</a> it’s never been easier to spin up.</p><h3>Classic Tunnels to Named Tunnels</h3><p>Historically, the biggest limitation to using Cloudflare Tunnel at scale was that the process to create a tunnel was manual. A user needed to download the binary for their OS, install/compile it, and then run the command <code>cloudflared tunnel login</code>. This would open a browser to their Cloudflare account so they could download a <code>cert.pem</code> file to authenticate their tunnel against Cloudflare’s edge with their account.</p><p>With the jump to Named Tunnels and a supported <a href=\"https://api.cloudflare.com/#argo-tunnel-create-argo-tunnel\">API endpoint</a> Cloudflare users can automate this manual process. Named Tunnels also moved to allow a <code>.json</code> file for the origin side tunnel credentials instead of (or with) the <code>cert.pem</code> file. It has been a dream of mine since joining Cloudflare to write a Cloudflare Tunnel as code, along with my instance/application, and deploy it while I go walk my dog. Tooling should be easy to deploy and robust to use. That dream is now a reality and my dog could not be happier.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3gSV6JJ9YIcaT8Mb0Jd3M3/c13cad5755a80a681c03e2b081068195/image3-2.png\" alt=\"\" class=\"kg-image\" width=\"1800\" height=\"1800\" loading=\"lazy\"/>\n            \n            </figure><h3>Okay, so what?</h3><p>The ability to dynamically generate a tunnel and tie it into a back end application(s) brings several benefits to users including: putting more of their Cloudflare config in code, auto-scaling resources, dynamically spinning up resources such as bastion servers for secure logins, and saving time from avoiding manually generating/maintaining tunnels.</p><p>Tunnels also allow traffic to connect securely into Cloudflare’s edge for <i>only</i> the particular account they are affiliated with. In a world where IPs are increasingly ephemeral, tunnels allow for a modern approach to tying your application(s) into Cloudflare. Putting automation around tunnels allows teams to incorporate them into their existing CI/CD (continuous improvement/continuous development) pipelines.</p><p>Most importantly, the spin up of an environment securely tied into Cloudflare can be achieved with some Terraform config and then by running <code>terraform apply</code>. I can then go take my pup on an adventure while my environment kicks off.</p><h3>Why Terraform?</h3><p>While there are numerous Infrastructure as Code tools out there, Terraform has an actively maintained <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs\">Cloudflare provider</a>. This is not to say that this same functionality cannot be re-created by making use of the API endpoint with a tool of your choice. The overarching concepts here should translate quite nicely. Using Terraform we can deploy Cloudflare resources, origin resources, and configure our server all with one tool. Let’s see what setting that up looks like.</p><h3>Terraform Config</h3><p>The technical bits of this will cover how to set up an automated Named Tunnel that will proxy traffic to a Google compute instance (GCP) which is my backend for this example. These concepts should be the same regardless of where you host your applications such as an onprem location to a multi-cloud solution.</p><p>With <a href=\"https://developers.cloudflare.com/cloudflare-one/connections/connect-apps/configuration/ingress\">Cloudflare Tunnel’s Ingress Rules</a>, we can use a single tunnel to proxy traffic to a number of local services. In our case we will tie into a Docker container running <a href=\"https://httpbin.org/\">HTTPbin</a> and the local SSH daemon. These endpoints are being used to represent a standard login protocol (such as SSH or RDP) and an example web application (HTTPbin). We can even take it a step further by applying a <a href=\"https://www.cloudflare.com/teams/access/\">Zero Trust framework with Cloudflare Access</a> over the SSH hostname.</p><p>The version of Terraform used in this example is 0.15.0. Please refer to the provider documentation when using the Cloudflare Terraform provider. Tunnels are compatible with Terraform version 0.13+.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">cdlg at cloudflare in ~/Documents/terraform/blog on master\n$ terraform --version\nTerraform v0.15.0\non darwin_amd64\n+ provider registry.terraform.io/cloudflare/cloudflare v2.18.0\n+ provider registry.terraform.io/hashicorp/google v3.56.0\n+ provider registry.terraform.io/hashicorp/random v3.0.1\n+ provider registry.terraform.io/hashicorp/template v2.2.0</pre></code>\n            <p>Here is what the Terraform hierarchy looks like for this setup.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">cdlg at cloudflare in ~/Documents/terraform/blog on master\n$ tree .\n.\n├── README.md\n├── access.tf\n├── argo.tf\n├── bootstrap.tf\n├── instance.tf\n├── server.tpl\n├── terraform.tfstate\n├── terraform.tfstate.backup\n├── terraform.tfvars\n├── terraform.tfvars.example\n├── test.plan\n└── versions.tf\n\n0 directories, 12 files</pre></code>\n            <p>We can ignore the files <code>README.md</code> and <code>terraform.tfvars.example</code> for now. The files ending in <code>.tf</code> is where our Terraform configuration lives. Each file is designated to a specific purpose. For example, the <code>instance.tf</code> file only contains the scope of the GCP server resources used with this deployment and the affiliated DNS records pointing to the tunnel on it.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">cdlg at cloudflare in ~/Documents/terraform/blog on master\n$ cat instance.tf\n# Instance information\ndata &quot;google_compute_image&quot; &quot;image&quot; {\n  family  = &quot;ubuntu-minimal-1804-lts&quot;\n  project = &quot;ubuntu-os-cloud&quot;\n}\n\nresource &quot;google_compute_instance&quot; &quot;origin&quot; {\n  name         = &quot;test&quot;\n  machine_type = var.machine_type\n  zone         = var.zone\n  tags         = [&quot;no-ssh&quot;]\n\n  boot_disk {\n    initialize_params {\n      image = data.google_compute_image.image.self_link\n    }\n  }\n\n  network_interface {\n    network = &quot;default&quot;\n    access_config {\n      // Ephemeral IP\n    }\n  }\n  // Optional config to make instance ephemeral\n  scheduling {\n    preemptible       = true\n    automatic_restart = false\n  }\n\n  metadata_startup_script = templatefile(&quot;./server.tpl&quot;,\n    {\n      web_zone    = var.cloudflare_zone,\n      account     = var.cloudflare_account_id,\n      tunnel_id   = cloudflare_argo_tunnel.auto_tunnel.id,\n      tunnel_name = cloudflare_argo_tunnel.auto_tunnel.name,\n      secret      = random_id.argo_secret.b64_std\n    })\n}\n\n\n\n# DNS settings to CNAME to tunnel target\nresource &quot;cloudflare_record&quot; &quot;http_app&quot; {\n  zone_id = var.cloudflare_zone_id\n  name    = var.cloudflare_zone\n  value   = &quot;${cloudflare_argo_tunnel.auto_tunnel.id}.cfargotunnel.com&quot;\n  type    = &quot;CNAME&quot;\n  proxied = true\n}\n\nresource &quot;cloudflare_record&quot; &quot;ssh_app&quot; {\n  zone_id = var.cloudflare_zone_id\n  name    = &quot;ssh&quot;\n  value   = &quot;${cloudflare_argo_tunnel.auto_tunnel.id}.cfargotunnel.com&quot;\n  type    = &quot;CNAME&quot;\n  proxied = true\n}</pre></code>\n            <p>This is a personal preference — if desired, the entire Terraform config could be put into one file. One thing to note is the usage of variables throughout the files. For example, the value of <code>var.cloudflare_zone</code> is populated with the value provided to it from the <code>terraform.tfvars</code> file. This allows the configuration to be used as a template with other deployments. The only change that would be necessary is updating the relevant variables, such as in the <code>terraform.tfvars</code> file, when re-using the configuration.</p><p>When using a credentials file (vs environment variables such as a <code>.tfvars</code> file) it is very important that this file is exempted from the version tracking tool. With git this is accomplished with a <code>.gitignore</code> file. Before running this example the <code>terraform.tfvars.example</code> file is copied to <code>terraform.tfvars</code> within the same directory and filled in as needed. The <code>.gitignore</code> file is told to ignore any file named <code>terraform.tfvars</code> to exempt the actual variables from version tracking.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">cdlg at cloudflare in ~/Documents/terraform/blog on master\n$ cat .gitignore\n# Local .terraform directories\n**/.terraform/*\n\n# .tfstate files\n*.tfstate\n*.tfstate.*\n\n# Crash log files\ncrash.log\n\n# Ignore any .tfvars files that are generated automatically for each Terraform run. Most\n# .tfvars files are managed as part of configuration and so should be included in\n# version control.\n#\n# example.tfvars\nterraform.tfvars\n\n# Ignore override files as they are usually used to override resources locally and so\n# are not checked in\noverride.tf\noverride.tf.json\n*_override.tf\n*_override.tf.json\n\n# Include override files you do wish to add to version control using negated pattern\n#\n# !example_override.tf\n\n# Include tfplan files to ignore the plan output of command: terraform plan -out=tfplan\n# example: *tfplan*\n*tfplan*\n*.plan*\n*lock*</pre></code>\n            <p>Now to the fun stuff! To create a Cloudflare Tunnel in Terraform we only need to set the following resources in our Terraform config (this is what populates the <code>argo.tf</code> file).</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">resource &quot;random_id&quot; &quot;argo_secret&quot; {\n  byte_length = 35\n}\n\nresource &quot;cloudflare_argo_tunnel&quot; &quot;auto_tunnel&quot; {\n  account_id = var.cloudflare_account_id\n  name       = &quot;zero_trust_ssh_http&quot;\n  secret     = random_id.argo_secret.b64_std\n}</pre></code>\n            <p>That’s it.</p><p>Technically you could get away with just the <code>cloudflare_argo_tunnel</code> resource, but using the <code>random_id</code> resource helps with not having to hard code the secret for the tunnel. Instead we can dynamically generate a secret for our tunnel each time we run Terraform.</p><p>Let’s break down what is happening in the <code>cloudflare_argo_tunnel</code> resource: we are passing the Cloudflare account ID (via the <code>var.cloudflare_account_id</code> variable), a name for our tunnel, and the dynamically generated secret for the tunnel, which is pulled from the <code>random_id</code> resource. Tunnels expect the secret to be in base64 standard encoding and at least 32 characters.</p><p>Using Named Tunnels now gives customers a UUID (universal unique identity) target to tie their applications to. These endpoints are routed off an internal domain to Cloudflare and can only be used with zones in your account, as mentioned earlier. This means that one tunnel can proxy multiple applications for various zones in your account, thanks to Cloudflare Tunnel Ingress Rules.</p><p>Now that we have a target for our services, we can create a tunnel/applications in the GCP instance. Terraform has a feature called a <a href=\"https://www.terraform.io/docs/language/functions/templatefile.html\">templatefile function</a> that allows you to pass input variables as local variables (i.e. what the server can use to configure things) to an argument called <code>metadata_startup_script</code>.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">resource &quot;google_compute_instance&quot; &quot;origin&quot; {\n...\n  metadata_startup_script = templatefile(&quot;./server.tpl&quot;, \n    {\n      web_zone    = var.cloudflare_zone,\n      account     = var.cloudflare_account_id,\n      tunnel_id   = cloudflare_argo_tunnel.auto_tunnel.id,\n      tunnel_name = cloudflare_argo_tunnel.auto_tunnel.name,\n      secret      = random_id.argo_secret.b64_std\n    })\n}</pre></code>\n            <p>This abbreviated section of the <code>google_compute_instance</code> resource shows a templatefile using 5 variables passed to the file located at <code>./server.tpl</code>. The file <code>server.tpl</code> is a bash script within the local directory that will configure the newly created GCP instance.</p><p>As indicated earlier, Named Tunnels can make use of a JSON credentials file instead of the historic use of a <code>cert.pem</code> file. By using a templatefile function pointing to a bash script (or cloud-init, etc…) we can dynamically generate the fields that populate both the <code>cert.json</code> file and the <code>config.yml</code> file used for Ingress Rules on the server/host. Then the bash script can install <code>cloudflared</code> as <a href=\"https://developers.cloudflare.com/cloudflare-one/connections/connect-apps/run-tunnel/run-as-service\">a system service</a>, so it is persistent (i.e it can come back up after the machine is rebooted). Here is an example of this.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">wget https://bin.equinox.io/c/VdrWdbjqyF/cloudflared-stable-linux-amd64.deb\nsudo dpkg -i cloudflared-stable-linux-amd64.deb\nmkdir ~/.cloudflared\ntouch ~/.cloudflared/cert.json\ntouch ~/.cloudflared/config.yml\ncat &gt; ~/.cloudflared/cert.json &lt;&lt; &quot;EOF&quot;\n{\n    &quot;AccountTag&quot;   : &quot;${account}&quot;,\n    &quot;TunnelID&quot;     : &quot;${tunnel_id}&quot;,\n    &quot;TunnelName&quot;   : &quot;${tunnel_name}&quot;,\n    &quot;TunnelSecret&quot; : &quot;${secret}&quot;\n}\nEOF\ncat &gt; ~/.cloudflared/config.yml &lt;&lt; &quot;EOF&quot;\ntunnel: ${tunnel_id}\ncredentials-file: /etc/cloudflared/cert.json\nlogfile: /var/log/cloudflared.log\nloglevel: info\n\ningress:\n  - hostname: ${web_zone}\n    service: http://localhost:8080\n  - hostname: ssh.${web_zone}\n    service: ssh://localhost:22\n  - hostname: &quot;*&quot;\n    service: hello-world\nEOF\n\nsudo cloudflared service install\nsudo cp -via ~/.cloudflared/cert.json /etc/cloudflared/\n\ncd /tmp\nsudo docker-compose up -d &amp;&amp; sudo service cloudflared start</pre></code>\n            <p>In this example, a <a href=\"https://tldp.org/LDP/abs/html/here-docs.html\">heredoc</a> is used to fill in the variable fields for the <code>cert.json</code> file and another heredoc is used to fill in the <code>config.yml</code> (Ingress Rules) file with the variables we set in Terraform. Taking a quick look at the <code>cert.json</code> file we can see that the Account ID is provided to it which secures the tunnel to your specific account. The UUID  of the tunnel is then passed in along with the name that was assigned in the tunnel’s name argument. Lastly the 35 character secret is then passed to the tunnel. These are the necessary parameters to get our tunnel spun up against Cloudflare’s edge.</p><p>The <code>config.yml</code> file is where we set up the Ingress Rules for the Cloudflare Tunnel. The first few lines tell the tunnel which UUID to attach to, where the credentials are on the OS, and where the tunnel should write logs to. The log level of <code>info</code> is good for general use but for troubleshooting <code>debug</code> may be needed.</p><p>Next the first - <code>hostname:</code> line says any requests bound for that particular hostname need to be proxied to the service (HTTPbin) running at <code>localhost</code> port 8080. Following that the SSH target is defined and will proxy requests to the local SSH port. The next hostname is interesting in that we have a wildcard character. This functionality allows other zones or hostnames on the Account to point to the tunnel without being explicitly defined in Ingress Rules. The service that will respond to these requests is a built in <a href=\"https://developers.cloudflare.com/cloudflare-one/connections/connect-apps/configuration/ingress#supported-protocols\">hello world service</a> the tunnel provides.</p><p>Pretty neat, but what else can we do? We can block all <a href=\"https://developers.cloudflare.com/cloudflare-one/faq/tunnel/#how-can-origin-servers-be-secured-when-using-tunnel\">inbound networking</a> to the server and instead use Cloudflare Tunnel to proxy the connections to Cloudflare’s edge. To safeguard the SSH hostname <a href=\"https://developers.cloudflare.com/cloudflare-one/applications/configure-apps/self-hosted-apps/\">an Access policy</a> can be applied over it.</p><h3>SSH and Zero Trust</h3><p>The Access team has several tutorials on how to <a href=\"https://developers.cloudflare.com/cloudflare-one/api-terraform/access-with-terraform\">tie your policies into Terraform</a>. Using this as a guide we can create the Access related Terraform resources for the SSH endpoint.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"># Access policy to apply zero trust policy over SSH endpoint\nresource &quot;cloudflare_access_application&quot; &quot;ssh_app&quot; {\n  zone_id          = var.cloudflare_zone_id\n  name             = &quot;Access protection for ssh.${var.cloudflare_zone}&quot;\n  domain           = &quot;ssh.${var.cloudflare_zone}&quot;\n  session_duration = &quot;1h&quot;\n}\n\nresource &quot;cloudflare_access_policy&quot; &quot;ssh_policy&quot; {\n  application_id = cloudflare_access_application.ssh_app.id\n  zone_id        = var.cloudflare_zone_id\n  name           = &quot;Example Policy for ssh.${var.cloudflare_zone}&quot;\n  precedence     = &quot;1&quot;\n  decision       = &quot;allow&quot;\n\n  include {\n    email = [var.cloudflare_email]\n  }\n}</pre></code>\n            <p>In the above <code>cloudflare_access_application</code> resource, a variable, <code>var.cloudflare_zone_id</code>, is used to pull in the Cloudflare Zone’s ID based on the value of the variable provided in the <code>terraform.tfvars</code> file. The Zone Name is also dynamically populated at runtime in the <code>var.cloudflare_zone</code> fields based on the value provided in the <code>terraform.tfvars</code> file. We also limit the scope of this access policy to <code>ssh.targetdomain.com</code> using the <code>domain</code> argument in the <code>cloudflare_access_application</code> resource.</p><p>In the <code>cloudflare_access_policy</code> resource, we take the information provided by the <code>cloudflare_access_application</code> resource called <code>ssh_app</code> and apply it as an active policy. The scope of who is allowed to log into this endpoint is the user’s email as provided by the <code>var.cloudflare_email</code> variable.</p><h3>Terraform Spin up and SSH Connection</h3><p>Now to connect to this SSH endpoint. First we need to spin up our environment. This can be done with <code>terraform plan</code> and then <code>terraform apply</code>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7t9hVHmNwlWQASoIFnboLt/6ac3d63e2df746ec44f6bb09e0fffbec/image5-2.png\" alt=\"\" class=\"kg-image\" width=\"1667\" height=\"708\" loading=\"lazy\"/>\n            \n            </figure><p>On my workstation I have <code>cloudflared</code> installed and updated my SSH config to proxy traffic for this SSH endpoint through <code>cloudflared</code>.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">cdlg at cloudflare in ~\n$ cloudflared --version\ncloudflared version 2021.4.0 (built 2021-04-07-2111 UTC)\n\ncdlg at cloudflare in ~\n$ grep -A2 &#039;ssh.chrisdlg.com&#039; ~/.ssh/config\nHost ssh.chrisdlg.com\n    IdentityFile /Users/cdlg/.ssh/google_compute_engine\n    ProxyCommand /usr/local/bin/cloudflared access ssh --hostname %h</pre></code>\n            <p>I can then SSH with my local user on the remote machine (cdlg) at the SSH hostname (ssh.chrisdlg.com). The instance of cloudflared running on my workstation will then proxy this request.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1BcyIgXbVE2wu6rRq6pZgJ/71aca5082a4a413e0b4fc9f1dbc76b66/image4-3.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"306\" loading=\"lazy\"/>\n            \n            </figure><p>This will open a new tab in my current browser and direct me to the Cloudflare Access application recently created with Terraform. Earlier in the Access resource we set the Cloudflare user as denoted by the <code>var.cloudflare_email</code> variable as the criteria for the Access policy. If the correct email address is provided the user will receive an email similar to the following.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5Z4k965ZDENHc6gTFX0AZx/aac4fdfdecff114222b11131001d831c/image1-3.png\" alt=\"\" class=\"kg-image\" width=\"796\" height=\"407\" loading=\"lazy\"/>\n            \n            </figure><p>Following the link or providing the pin on the previously opened tab will complete the authentication. Hitting ‘approve’ tells Cloudflare Access that the user should be allowed through per the length of the <code>session_duration</code> argument in the <code>cloudflare_access_application</code> resource. Navigating back to the terminal we can see that we are now on the server.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4zogkUR1oIkrVNTAXAMlnl/686e8d4bffd807fe0e658f50cc8f49ae/image6.png\" alt=\"\" class=\"kg-image\" width=\"1379\" height=\"851\" loading=\"lazy\"/>\n            \n            </figure><p>If we check the server’s authentication log we can see that connections from the tunnel are coming in via <code>localhost (127.0.0.1)</code>. This allows us to lock down external network access on the SSH port of the server.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1HQdBMj9vWK7HiKP6VXwcI/591827faa1ad787727f08aa012da02ce/image2-2.png\" alt=\"\" class=\"kg-image\" width=\"1323\" height=\"332\" loading=\"lazy\"/>\n            \n            </figure><p>The full config of this deployment can be viewed <a href=\"https://github.com/cloudflare/argo-tunnel-examples/tree/master/terraform-zerotrust-ssh-http-gcp\">here</a>.</p><p>The roadmap for Cloudflare Tunnels is bright. Hopefully this walkthrough provided some quick context on what you can achieve with Cloudflare Tunnels and Cloudflare. Personally my dog is quite happy that I have more time to take him on walks. We’re very excited to see what you build with Cloudflare Tunnels and Cloudflare!</p>",
		"id": "62yhRjZfOrEwEMIQAf61Am",
		"localeList": {
			"name": "Automating Cloudflare Tunnel with Terraform Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "An overview on how to use Terraform to automatically deploy Named Tunnels into your infrastructure with Cloudflare.",
		"metadata": {
			"title": "Automating Cloudflare Tunnel with Terraform",
			"description": "An overview on how to use Terraform to automatically deploy Named Tunnels into your infrastructure with Cloudflare.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2hB86962xFPosFtGSiBdl5/2504fc905e1b080979d9332001ced64d/automating-cloudflare-tunnel-with-terraform-Q31f2X.png"
		},
		"primary_author": {},
		"published_at": "2021-05-14T14:00:00.000+01:00",
		"slug": "automating-cloudflare-tunnel-with-terraform",
		"tags": [
			{
				"id": "4PjcrP7azfu8cw8rGcpYoM",
				"name": "Terraform",
				"slug": "terraform"
			},
			{
				"id": "2kFnzwwExTv3DVtV0CTReO",
				"name": "Cloudflare Tunnel",
				"slug": "cloudflare-tunnel"
			}
		],
		"title": "Automating Cloudflare Tunnel with Terraform",
		"updated_at": "2024-08-27T01:49:38.103Z",
		"url": "https://blog.cloudflare.com/automating-cloudflare-tunnel-with-terraform"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}