{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Nitin Rao",
				"slug": "nitin-rao",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/19DfiMNfYfSekVNwQA4otm/c385e25933451e5d290bfebd31ac4f80/nitin-rao.jpg",
				"location": null,
				"website": null,
				"twitter": "@NitinBRao",
				"facebook": null
			}
		],
		"excerpt": "CloudFlare protects over 4 million Internet properties using our global network which spans 86 cities across 45 countries. Running this network give us a unique vantage point to track the evolving cost of bandwidth around the world.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/11WrQaPOqrE2FsRi9w5D6b/18298ecd058a2b0bdc3acfe5edb68912/bandwidth-costs-around-the-world.jpg",
		"featured": false,
		"html": "<p>CloudFlare protects over 4 million Internet properties using our <a href=\"https://cloudflare.com/network-map\">global network</a> which spans 86 cities across 45 countries. Running this network give us a unique vantage point to track the evolving cost of bandwidth around the world.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5tFugU3IkiCVDl2DcSP56J/2f7df90657b05caa323477e1cc74d2b3/CoinOperatedInternet.jpg\" alt=\"\" class=\"kg-image\" width=\"427\" height=\"640\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://creativecommons.org/licenses/by-sa/2.0/\">CC BY-SA 2.0</a> <a href=\"https://www.flickr.com/photos/53326337@N00/4877664667\">image</a> by <a href=\"https://www.flickr.com/photos/quinnanya/\">Quinn Dombrowski</a></p><h3>Recap</h3><p>Two years ago, we previewed the <a href=\"/the-relative-cost-of-bandwidth-around-the-world/\">relative cost of bandwidth</a> that we see in different parts of the world. Bandwidth is the largest recurring cost of providing our service. Compared with Europe and North America, there were considerably higher Internet costs in Australia, Asia and Latin America. Even while bandwidth costs tend to <a href=\"https://www.telegeography.com/press/press-releases/2015/09/09/ip-transit-prices-continue-falling-major-discrepancies-remain/index.html\">trend down over time</a>, driven by competition and decreases in the costs of underlying hardware, we thought it might be interesting to provide an update.</p><p>Since August 2014, we have tripled the number of our data centers from 28 to 86, with more to come. CloudFlare hardware is also deployed in new regions such as the Middle East and Africa. Our network spans multiple countries in each continent, and, sometimes, multiple cities in each country.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/72mogBmAnpUvL0sWav4zfu/810910340470df1ff485b51289d5bb07/Traffic_86_PoPs-1.png\" alt=\"\" class=\"kg-image\" width=\"1055\" height=\"131\" loading=\"lazy\"/>\n            \n            </figure><p><i>Traffic across 86 data centers in the CloudFlare network</i></p><p>There are approximately thirteen networks called “Tier 1 networks” (e.g., Telia, GTT, Tata, Cogent) who sell “transit” to access any of thousands of other networks on the Internet using their global backbones, including networks who are not their customers. We connect to networks by either purchasing transit from a global <a href=\"http://research.dyn.com/2016/04/a-bakers-dozen-2015-edition/\">&quot;Tier 1 network&quot;</a> (or major regional network), or by exchanging traffic directly with a carrier or ISP using “peering”. Typically, peered traffic is exchanged without settlement between the peered parties.</p><p>We try to make it as easy as possible for networks to interconnect with us. CloudFlare has an “open peering” policy, and participates at nearly <a href=\"http://bgp.he.net/report/exchanges#_participants\">150 internet exchanges</a>, more than any other company.</p><p>As a benchmark, <b>let&#39;s assume the cost of transit in Europe and North America is 10 units</b> (per Mbps). With that benchmark in place, without disclosing exact pricing, we can compare regions by transit cost, percentage of peering, and their effective blended cost (transit + peering).</p><h3>Europe</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6o9Xr6nVnzB9niOIjvOTvp/11f1ec3e5e3be314df510be001187923/Europe_graph.png\" alt=\"\" class=\"kg-image\" width=\"1053\" height=\"274\" loading=\"lazy\"/>\n            \n            </figure><p><i>Europe Transit vs Peering (Last 30 Days)</i></p><p>Based on our benchmark, the transit cost is 10 units. The region has a large number of Internet exchanges, typically non-profit, where we peer around 60% of our traffic. This makes for an effective regional cost of 4 units.</p><p>With perhaps the notable exception of the incumbent in Germany, many networks are supportive of open interconnection. CloudFlare already participates at <a href=\"https://www.peeringdb.com/net/4224\">40 European internet exchanges</a>, and is in the process of joining at least five more.</p><h3>North America</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3dBfSCjq3AVR6heZETWLHw/b2dacdef6b9ac93a1cc96c0f5017617c/NAM.png\" alt=\"\" class=\"kg-image\" width=\"1063\" height=\"269\" loading=\"lazy\"/>\n            \n            </figure><p><i>North America Transit vs Peering (Last 30 Days)</i></p><p>The cost of transit in North America is equal to the cost in Europe, or 10 units. We peer around 40% of our traffic, resulting in an effective regional cost of 6 units.</p><p>The level of peering in North America is less than in Europe, but a significant improvement over two years ago. The share of peered traffic is expected to grow. Some material changes have occurred and are occurring in the North American market, such as <a href=\"http://internet.frontier.com/fios-network-acquisition/\">Frontier acquiring Verizon FiOS customers</a> in three U.S. States and <a href=\"http://ir.charter.com/phoenix.zhtml?c=112298&p=irol-newsArticle&ID=2053012\">Charter preparing to merge with Time Warner Cable</a>. We can see these changes making an impact to the <a href=\"http://arstechnica.com/tech-policy/2016/04/doj-fcc-chairman-ok-chartertime-warner-cable-deal-with-a-few-caveats/\">regional interconnection landscape</a>.</p><p>Notably, our peering has particularly grown in smaller regional locations, closer to the end visitor, leading to an improvement in performance. This could be through private peering, or via an interconnection point such as the <a href=\"http://www.micemn.net/\">Midwest Internet Cooperative Exchange (MICE)</a> in Minneapolis.</p><h3>Africa</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/48liYaMhlYUrjcgZHctoOE/9c25cbc82182ae39a22895b238e5fd3b/Africa.jpg\" alt=\"\" class=\"kg-image\" width=\"997\" height=\"272\" loading=\"lazy\"/>\n            \n            </figure><p><i>Africa Transit vs Peering (Last 30 Days)</i></p><p>Transit prices in Africa are amongst the highest in the world at 14 times the benchmark or 140 units, with notable variance across the continent, from <a href=\"/cairo/\">Cairo</a> to <a href=\"/mombasa-kenya-cloudflares-43rd-data-center/\">Mombasa</a> to <a href=\"/johannesburg-cloudflares-30th-data-center/\">Johannesburg</a>. Fortunately, of the traffic that we are currently able to serve locally in Africa, we manage to peer about 90% (with a mix of carriers and ISPs), making for an effective cost of 14 units.</p><p>Our African deployments help us avoid the significant latency of serving websites from London, Paris or Marseille. A particularly promising but challenging region where we hope to deploy a CloudFlare data center is West Africa - specifically Nigeria, which is already at just under <a href=\"http://qz.com/658762/there-arent-as-many-nigerians-on-the-mobile-internet-as-we-thought/\">100 million Internet users</a>.</p><h3>Middle East</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6GDZqjNHYbH6G2AOj00VDl/687cd65fd53c31039177d08952be055b/MiddleEast.jpg\" alt=\"\" class=\"kg-image\" width=\"986\" height=\"265\" loading=\"lazy\"/>\n            \n            </figure><p><i>Middle East Transit vs Peering (Last 30 Days)</i></p><p>CloudFlare currently has four data centers in the Middle East, each of which are cache deployments with <a href=\"/middle-east-expansion/\">strategic ISP partners</a> to serve their respective customers. We are able to peer all the traffic currently served from these data centers. While these collectively provide significant coverage, there is additional traffic (reaching Europe) that we would like to localize in the region. We hope that the remaining ISPs, such as Saudi Telecom Company, deploy similar caches, and enhance the performance of their customers.</p><p>Because we can peer 100% of our traffic in the Middle East, our effective pricing for bandwidth in the region is 0 units. There are, of course, other costs to delivering our service beyond bandwidth. However, by driving up peering rates in the Middle East we’ve been able to make our service in the Middle East extremely cost competitive.</p><h3>Asia</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4E2MimCjn7URfsa8wVNUBs/8b927959292751a492fa40cc4cc1c56a/Asia_graph.png\" alt=\"\" class=\"kg-image\" width=\"1052\" height=\"275\" loading=\"lazy\"/>\n            \n            </figure><p><i>Asia Transit vs Peering (Last 30 Days)</i></p><p>In Asia (excluding the Middle East), transit costs 7 times times the benchmark, or 70 units. However, we peer about 60% of our traffic, resulting in an effective cost of 28 units.</p><p>Beyond the major meeting points in Hong Kong, Singapore and Tokyo, a significant portion of our interconnection is localized to take place closer to visitors in cities such as <a href=\"/bangkok/\">Bangkok</a>, <a href=\"/cloudflare-launches-in-india-with-data-centers-in-mumbai-chennai-and-new-delhi/\">Chennai</a>, <a href=\"/kuala-lumpur-malaysia-cloudflares-45th-data-center/\">Kuala Lumpur</a>, <a href=\"/cloudflare-launches-in-india-with-data-centers-in-mumbai-chennai-and-new-delhi/\">Mumbai</a>, <a href=\"/osaka-data-center/\">Osaka</a>, <a href=\"/cloudflare-launches-in-india-with-data-centers-in-mumbai-chennai-and-new-delhi/\">New Delhi</a>, <a href=\"/seoul-korea-cloudflares-23rd-data-center/\">Seoul</a>, and <a href=\"/taipei\">Taipei</a>. These statistics do not include our network of strategically located data centers inside of mainland <a href=\"https://www.cloudflare.com/china\">China</a>, where the dynamics of interconnection are entirely unique.</p><p>Two Asian locations stand out as being especially expensive: Seoul and Taipei. In these markets, with powerful incumbents (Korea Telecom and HiNet), transit costs 15x as much as in Europe or North America, or 150 units.</p><p>South Korea is perhaps the only country in the world where bandwidth costs are going up. This may be driven by new regulations from the <a href=\"http://english.msip.go.kr/\">Ministry of Science, ICT and Future Planning</a>, which mandate the commercial terms of domestic interconnection, based on predetermined “Tiers” of participating networks. This is contrary to the model in most parts of the world, where networks self-regulate, and often peer without settlement. The government even prescribes the rate at which prices should decrease per year (-7.5%), which is significantly slower than the annual drop in unit bandwidth costs elsewhere in the world. We are only able to peer 2% of our traffic in South Korea.</p><p>If you include HiNet and Korea Telecom in our blended bandwidth pricing, and take into account peering, our effective price is 28 units. If you exclude HiNet and Korea Telecom, our effective price is 14 units.</p><h3>South America</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/481zW7oJoCQaQfqbKQMFrR/5f35f7ea2f3df607fcc048a8f103dbf3/SAM.png\" alt=\"\" class=\"kg-image\" width=\"1064\" height=\"272\" loading=\"lazy\"/>\n            \n            </figure><p><i>South America Transit vs Peering (Last 30 Days)</i></p><p>Transit prices in South America are very high, costing 17 times the benchmark, or 170 units. We peer about 60% of traffic in South America, making for an effective cost of 68 units.</p><p>One of the reasons that transit prices are high is that the Tier 1 networks which are newer entrants to this region have yet to pick up significant market share. While markets such as Brazil are less expensive and have greater peering, costs are highest in countries such as Peru and Argentina where, in each, a single incumbent provider, respectively Telefonica and Telecom Argentina, controls access for the last mile delivery of content to the majority of Internet users.</p><p>As we try to increase our share of peered traffic, one of the challenges we face is that many Internet exchanges (e.g., NAP Colombia) only permit domestically incorporated and licensed networks to publicly peer, or in another case, require a unanimous vote of all members on an IX to permit a new participant, effectively creating a separation between “international content” and “domestic content”.</p><p>If you include Telecom Argentina and Telefonica, our blended cost of bandwidth in South America is 68 units. If you exclude these two providers then our blended cost is 17 units.</p><h3>Oceania</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6RYaoeDxxQ4MQ7CEHiNUDj/f47edb37cc78408296129a3e0c12ae9c/Oceania.png\" alt=\"\" class=\"kg-image\" width=\"1054\" height=\"271\" loading=\"lazy\"/>\n            \n            </figure><p><i>Oceania Transit vs Peering (Last 30 Days)</i></p><p>Transit prices in Oceania (Australia and New Zealand) are lower than they used to be, but continue to be extremely high in relative terms, costing 17 times the benchmark from Europe, or 170 units. We peer 50% of our traffic, resulting in an effective cost of 85 units.</p><p>If you exclude Optus and Telstra, then the price falls to 17 units — because we peer with nearly everyone else.</p><h3>Six Expensive Networks</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/25n1Nj92sEeS37m8YWeVqC/37af3a16fb683db0537461cbee35e674/CloudFlare_Relative_Cost_of_Bandwidth.png\" alt=\"alt\" class=\"kg-image\" width=\"722\" height=\"417\" loading=\"lazy\"/>\n            \n            </figure><p><i>Relative Cost of Bandwidth</i></p><p>CloudFlare has always optimized where we serve customers to take into account our effective costs. If you are a free customer using an excessive amount of expensive transit, we would serve you from fewer regions. The good news is that, over the last five years, we’ve been able to negotiate reasonable transit pricing or settlement-free peering with the vast majority of the world’s networks. That allows us to continue to provide the free version of our service as well as to keep prices low for all our paid services.</p><p>Today, however, there are <b>six expensive networks (HiNet, Korea Telecom, Optus, Telecom Argentina, Telefonica, Telstra</b>) that are more than an order of magnitude more expensive than other bandwidth providers around the globe and refuse to discuss local peering relationships. To give you a sense, these six networks represent less than 6% of the traffic but nearly 50% of our bandwidth costs.</p><p>While we’ve tried to engage all these providers to reduce their extremely high costs and ensure that even our Free customers can be served across their networks, we’ve hit an impasse. To that end, unfortunately, we’ve made the decision that the only thing that will change these providers’ pricing is to make it clear how out of step they are with the rest of the world. To demonstrate this, we’ve moved our Free customers off these six transit providers. Free customers will still be accessible across our network and served from another regional cache with more reasonable bandwidth pricing.</p><p>Ironically, this actually increases the cost to several of these providers because they now need to backhaul traffic to another CloudFlare data center and pay more in the process. For instance, if Telstra were to peer with CloudFlare then they would only have to move traffic over about 30 meters of fiber optic cable between our adjoining cages in the same data center. Now Telstra will need to backhaul traffic to Free customers to Los Angeles or Singapore over expensive undersea cables. Their behavior is irrational in any competitive market and so it is not a surprise that each of these providers is a relative monopolist in their home market.</p><p>If you’re a <a href=\"https://www.cloudflare.com/plans/free/\">Free CloudFlare</a> customer who cares about optimizing the best possible performance from one of these six providers then we encourage you to reach out to them and encourage them to follow a core principle of a free and open Internet and not abuse their monopoly position. We are committed to serving all our customers across every network that peers with us. To that end, help us convince these six networks to be on the right side of a free and open Internet by reaching out to your ISP.</p><ul><li><p><a href=\"http://service.hinet.net/2004/ncsc/index.htm\">Ask HiNet to peer with CloudFlare in Taipei</a></p></li><li><p><a href=\"http://www.kt.com/eng/etc/contact.jsp\">Ask Korea Telecom to peer with CloudFlare in Seoul</a></p></li><li><p><a href=\"http://www.optus.com.au/shop/support/answer/complaints-compliments?requestType=NormalRequest&id=1409&typeId=5\">Ask Optus to peer with CloudFlare across Australia</a></p></li><li><p><a href=\"http://www.telecom.com.ar/hogares/gestion_libro.htm\">Ask Telecom Argentina to peer with CloudFlare in Buenos Aires</a></p></li><li><p><a href=\"https://www.telefonica.com/en/web/press-office/contact-us\">Ask Telefonica to peer with CloudFlare across South America</a></p></li><li><p><a href=\"https://say.telstra.com.au/customer/general/forms/Email-Complaint\">Ask Telstra to peer with CloudFlare across Australia</a></p></li></ul><p>We’ll post updates as we negotiate with these six networks and are hopeful that we’ll soon be able to serve all our customers across all the networks we interconnect with.</p>",
		"id": "7fVH9m0ytZc5ytjDF0rLjd",
		"localeList": {
			"name": "Bandwidth Costs Around the World Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2016-08-17T17:50:12.000+01:00",
		"slug": "bandwidth-costs-around-the-world",
		"tags": [
			{
				"id": "3LsEaSGQzFzVQJ2Jp16ZuG",
				"name": "Peering",
				"slug": "peering"
			},
			{
				"id": "3xEHPB7vINhWXG24KZgTTz",
				"name": "Data Center",
				"slug": "data-center"
			},
			{
				"id": "3TaNOBp8EhAE6eCfshf1tK",
				"name": "Cloudflare Network",
				"slug": "cloudflare-network"
			},
			{
				"id": "11Bx9URjfCl3nyOYFkpZ3N",
				"name": "Bandwidth Costs",
				"slug": "bandwidth-costs"
			},
			{
				"id": "2fCMcJ8BDZr46FNqbnDDwr",
				"name": "Africa",
				"slug": "africa"
			},
			{
				"id": "7eHY5WNQQd02QJafTdf18n",
				"name": "USA",
				"slug": "usa"
			},
			{
				"id": "3NViozti299U831IPp5ELk",
				"name": "South America",
				"slug": "south-america"
			},
			{
				"id": "qfkPi0tunYrR7GLqqPpWH",
				"name": "Europe",
				"slug": "europe"
			},
			{
				"id": "7z5119SUFtTa793P2q6WM",
				"name": "Asia",
				"slug": "asia"
			},
			{
				"id": "2udkw4PkZBJX8HfbLBRBau",
				"name": "Australia",
				"slug": "australia"
			},
			{
				"id": "3kXyDg5Bl73xkdRzmNKJJb",
				"name": "Oceania",
				"slug": "oceania"
			},
			{
				"id": "4fT6sO9GC4Y6wXsPWwhbOa",
				"name": "Middle East",
				"slug": "middle-east"
			}
		],
		"title": "Bandwidth Costs Around the World",
		"updated_at": "2024-08-27T02:33:46.409Z",
		"url": "https://blog.cloudflare.com/bandwidth-costs-around-the-world"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}