{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Kyle Boutette",
				"slug": "kyle-boutette",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4kaWPS8nsy8dcT0OEQAaGE/d9179b173ccf326dbf563dc48e277b31/kyle-boutette.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null,
				"publiclyIndex": true
			},
			{
				"name": "Jacob Curtis",
				"slug": "jacob-curtis",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7E1t6MY3DrCBdbukUQJloN/1bf6538560676a34f1b0181e5d6fdfc4/jacob-curtis.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null,
				"publiclyIndex": true
			}
		],
		"excerpt": "Let’s talk about Stream Live’s design, and how it leverages the distributed nature of Cloudflare’s network, rather than centralized locations as many other live services do.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6Rxa7rHczMYnxNB1kh7WNu/a0560876b85511115083103729ce0f7f/image1.png",
		"featured": false,
		"html": "<p>Cloudflare announced Stream Live for open beta <a href=\"https://blog.cloudflare.com/stream-live\"><u>in 2021</u></a>, and <a href=\"https://blog.cloudflare.com/stream-live-ga\"><u>in 2022</u></a> we went GA. While we talked about the experience of using it and the value it delivers to customers, we didn’t talk about how we built it. So let’s talk about Stream Live’s design, and how it leverages the distributed nature of Cloudflare’s network, rather than centralized locations as many other live services do. Ultimately, our goals are to keep our content ingest as close to broadcasters as possible, our content delivery as close to viewers as possible, and to retain our ability to handle unexpected use cases.</p><p>At a high level, Stream Live accepts audio/video content from broadcasters and makes that content available to viewers around the world in real time through the <a href=\"https://www.cloudflare.com/network/\"><u>Cloudflare network</u></a>, which reaches more than 330 cities in over 120 countries. Hence, there are two sides to this: ingesting data from broadcasters and delivering encoded content to viewers. Both sides are built on a combination of internal systems and Cloudflare products, including <a href=\"https://www.cloudflare.com/developer-platform/products/workers/\"><u>Cloudflare Workers</u></a>, <a href=\"https://www.cloudflare.com/developer-platform/products/durable-objects/\"><u>Durable Objects</u></a>, <a href=\"https://www.cloudflare.com/application-services/products/cloudflare-spectrum/\"><u>Spectrum</u></a>, and, of course, <a href=\"https://developers.cloudflare.com/cache/\"><u>Cache</u></a>.</p><p>Let’s start on the ingest side.</p>\n    <div class=\"flex anchor relative\">\n      <h3 id=\"ingesting-a-broadcast\">Ingesting a broadcast</h3>\n      <a href=\"#ingesting-a-broadcast\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>Broadcasters generate content in real time, as a series of video and audio frames, and it needs to be transmitted to Cloudflare over the Internet. To communicate with us, they choose a protocol such as <a href=\"https://en.wikipedia.org/wiki/Real-Time_Messaging_Protocol\"><u>RTMPS</u></a> (Real Time Messaging Protocol Secure), <a href=\"https://www.ietf.org/archive/id/draft-sharabayko-srt-01.txt\"><u>SRT</u></a> (Secure Reliable Transport), or <a href=\"https://www.ietf.org/archive/id/draft-ietf-wish-whip-01.html\"><u>WHIP</u></a> (WebRTC-HTTP ingestion protocol) that defines how their content is packaged and transmitted. Each of these protocols is a way to transmit audio and video frames with various tradeoffs.</p><p>Regardless of the chosen protocol, the ingest lifecycle looks fairly similar. Broadcasters connect to an <a href=\"https://www.cloudflare.com/learning/cdn/glossary/anycast-network/\"><u>Anycast</u></a> IP address using either a <a href=\"https://developers.cloudflare.com/stream/stream-live/custom-domains/\"><u>custom ingest domain</u></a> or our default <code>live.cloudflare.com</code>. Both options direct to an IP address advertised from every Cloudflare data center around the world, minimizing the latency for broadcasters (both big and small) to our ingest points.</p><p>When the media content arrives at the Cloudflare server servicing the connection, it is first handled by a <a href=\"https://www.cloudflare.com/application-services/products/cloudflare-spectrum/\"><u>Spectrum application</u></a>. Spectrum saved us time by implementing TLS termination for RTMPS, blocking potential <a href=\"https://www.cloudflare.com/learning/ddos/what-is-a-ddos-attack/\"><u>DDOS attacks</u></a>, and a few other protocol-specific benefits, such as our ability to support SRT broadcasters whose clients don&#39;t support the <a href=\"https://github.com/Haivision/srt/blob/bcc2f21ec75fcb10a8185857f3bc323bb19619da/docs/features/access-control.md\"><u>Stream ID</u></a> portion of the SRT protocol. Those broadcasters assume their connection can be fully identified by connecting to a specific port, which was a challenge for our multitenant service. We use Spectrum to expose many listening ports to specific broadcasters which get wrapped up in <a href=\"https://developers.cloudflare.com/spectrum/reference/simple-proxy-protocol-header/\"><u>Simple Proxy Protocol</u></a> and sent to one ingest service port. This is important, as our SRT implementation spends a non-trivial amount of CPU for each listening port, whereas Spectrum spends effectively nothing. In any case, Spectrum forwards all connections to the ingest service running on the same server.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7Hgz9WilQMf7hiIWgWvzgN/35c46350835d1e9c6d219f1ca2507abf/image3.png\" alt=\"\" class=\"kg-image\" width=\"1630\" height=\"500\" loading=\"lazy\"/>\n          </figure><p>Our ingest service handles receiving content from broadcasters, forwarding to <a href=\"https://developers.cloudflare.com/stream/stream-live/simulcasting/\"><u>live outputs</u></a>, and recording for HLS/DASH viewing. The ingest service is written in Go and acts on configuration and broadcast state stored in our Live Config <a href=\"https://developers.cloudflare.com/durable-objects/\"><u>Durable Objects</u></a>. One Durable Object instance represents one live input; it contains both the customer configuration and the ongoing state of each broadcast.</p><p>We chose Durable Objects over a centralized database since they are not coupled to any specific data center, allowing them to be closer to each of our geographically distributed broadcasters while remaining highly available. In terms of customer configuration, we use Durable Objects to store everything defined <a href=\"https://developers.cloudflare.com/api/operations/stream-live-inputs-create-a-live-input#request-body\"><u>when creating</u></a> or <a href=\"https://developers.cloudflare.com/api/operations/stream-live-inputs-create-a-new-output,-connected-to-a-live-input\"><u>modifying the live input</u></a>.</p><p>We store the canonical state of the broadcast in the Durable Object. That includes timestamp metadata for keeping times monotonic, connection status, and which ingest service instance owns the broadcast. Any content received by the ingest service needs to be acknowledged and indexed by the Durable Object before it is made available to viewers. This splits our state into two types, ‘volatile’ and ‘committed’. Volatile state is content the ingest has received but not yet told the Durable Object about. Committed state is content the Durable Object has acknowledged and is used as a sync point for any other ingest service instance in the event they claim ownership of the broadcast.</p><p>This split between volatile and committed states is how we support broadcasters resuming a live broadcast after disconnecting and reconnecting for whatever reason, including a broadcaster network blip. That’s normally a relatively easy problem when you have centralized ingestion and state storage. Since broadcasters connect to an arbitrary server due to Anycast, we needed to get more creative in making sure that whichever server receives the reconnect has the data to continue the broadcast.</p><p>The ingest service itself is written as a relay, taking packets from one input stream and mapping them to multiple output streams. At the top level, the relay is implemented as two coupled ‘for’ loops that communicate over a Go channel, one for sending and one for receiving. When we receive data, we internally normalize it depending on the protocol. For example, some protocols send video packets as delimiter-based (<a href=\"https://gist.github.com/XueshiQiao/d68bea4a5406dd648664ce66933aeed9\"><u>annex B h264 NALU</u></a>), but other protocols or file formats expect length-prefixed packets (<a href=\"https://gist.github.com/XueshiQiao/d68bea4a5406dd648664ce66933aeed9\"><u>avcc h264 NALU</u></a>).</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/903kTMKMnnHwms0EL9FNn/62e77098d23fa863c5ec1088367b4f43/image5.png\" alt=\"\" class=\"kg-image\" width=\"1472\" height=\"1272\" loading=\"lazy\"/>\n          </figure><p>A special case of relay outputs is our Live Playback and Recording functionality. When this is enabled, we copy and sanitize the incoming packets. Specifically, we issue monotonically increasing timestamps, which solves many issues we’ve encountered with various customer encoders. To ensure everything is aligned, we drop severely misaligned audio/video blocks, something typically seen at the start of broadcasts. Those sanitized packets are packaged into fragmented <a href=\"https://en.wikipedia.org/wiki/MP4_file_format\"><u>MP4s</u></a> on keyframe boundaries.  We call those fragmented MP4s ‘original segments.’ Our ingest service stores the original segments in <a href=\"https://developers.cloudflare.com/r2/\"><u>R2</u></a> and lets the live config Durable Object know the segment exists and how long it is.</p><p>These original segments are considered the canonical copy of the content a customer has uploaded to us, and are reused when transitioning from live to on-demand. Since these are required to serve live viewers, this is why we don’t currently provide an option to decouple live playback from recording. Supporting live playback automatically implements on-demand recording, with some state management overhead.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5GLIyr66cFtbd4jajXYrE0/d098b1347a45e287e2c5ef03fffb264b/image4.png\" alt=\"\" class=\"kg-image\" width=\"1472\" height=\"838\" loading=\"lazy\"/>\n          </figure>\n    <div class=\"flex anchor relative\">\n      <h3 id=\"viewing-the-broadcast\">Viewing the broadcast</h3>\n      <a href=\"#viewing-the-broadcast\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>At this point, we’ve ingested the content, cleaned it up, and durably stored it. Lets talk about how viewers watch this content.</p><p>Most online video is delivered in short &#39;segments’, multi-second chunks of content. Splitting the output allows content to be progressively emitted and is very cache-friendly. The protocols viewers use to request that content are typically <a href=\"https://datatracker.ietf.org/doc/html/rfc8216\"><u>HLS (HTTP Live Streaming)</u></a> or <a href=\"https://www.mpeg.org/standards/MPEG-DASH/\"><u>MPEG-DASH (Dynamic Adaptive Streaming over HTTP)</u></a>. <a href=\"https://www.ietf.org/archive/id/draft-murillo-whep-03.txt\"><u>WHEP</u></a> (WebRTC-HTTP Egress Protocol) is a non-segmented viewing method available for real-time viewing in some cases. However, we’ll focus here on playback using segmented content with HLS or DASH, since that’s most of Stream Live’s usage today.</p><p>To start viewing, a video player will request an HLS or DASH playlist which describes the attributes of the media content and acts as an index for each segment. The playlist tells us which segments map to what point of the video’s timeline. Those segments are inserted into a playback buffer to be decoded and displayed by a client’s player. Examples here will use HLS, which is a newline delimited format. The typical alternative is DASH, which is XML based.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/43zIdjDFagc4w8HgHNYBPD/1447cb964d9eace73711b31a5f963656/image6.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"521\" loading=\"lazy\"/>\n          </figure><p>First, ‘primary’ playlists describe which renditions of the same content are available, as well as where to get their specific index files. Those renditions can vary in bitrate, codec, framerate, resolution, etc. If you’ve ever picked ‘1080p’ from a video player quality menu, the player knew those qualities were available using this or similar methods. When selecting quality automatically, players choose the best rendition for the viewing machine’s capabilities (such as the ability to decode a certain codec) and network constraints. We use an internal representation of tracks (what kind of content, i.e. video), renditions (content parameters, i.e. 1080p), and muxings (where to find that content, i.e. in R2 bucket N or OTFE with call M) to generate both HLS and DASH, as the two formats contain nearly the same data, except organized differently. Here’s a simplified example of a ‘multi-variant’ or ‘primary’ HLS playlist that Stream generated. It includes some annotations to explain the components.</p>\n            <pre class=\"language-Rust\"><code class=\"language-Rust\">#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-INDEPENDENT-SEGMENTS\n#EXT-X-MEDIA:TYPE=AUDIO,GROUP-ID=&quot;group_audio&quot;,NAME=&quot;original&quot;,LANGUAGE=&quot;en-0a76e0ad&quot;,DEFAULT=YES,AUTOSELECT=YES,URI=&quot;stream_2.m3u8&quot; &lt;- Audio track description + URL path\n...\n#EXT-X-STREAM-INF:RESOLUTION=426x240,CODECS=&quot;avc1.42c015,mp4a.40.2&quot;,BANDWIDTH=149084,AVERAGE-BANDWIDTH=145135,SCORE=1.0,FRAME-RATE=30.000,AUDIO=&quot;group_audio&quot; &lt;- description of variant contents\nstream_1.m3u8 &lt;- URL path to fetch variant</pre></code>\n            <p>Second, ‘variant’ or ‘stream’ playlists contain a list of segments that can be downloaded and viewed for each rendition. These are used for both live and on-demand viewing. The difference is on-demand playlists contain a flag indicating no more content will be added to the index whereas live omits that flag to allow it to append content in future requests. As a result, you’ll see video players download <a href=\"https://en.wikipedia.org/wiki/M3U#M3U8\"><u>M3U8</u></a> (HLS) or <a href=\"https://ottverse.com/structure-of-an-mpeg-dash-mpd/\"><u>MPD</u></a> (DASH) files approximately every 1–10 seconds when viewing a broadcast, looking for updated content.</p>\n            <pre class=\"language-Rust\"><code class=\"language-Rust\">#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-MEDIA-SEQUENCE:89281 &lt;- Indicates position of sliding window\n#EXT-X-TARGETDURATION:6\n#EXT-X-MAP:URI=&quot;.../init.mp4&quot; &lt;- Initialization data\n#EXTINF:4.000, &lt;- How long the segment\n.../seg_89281.mp4 &lt;- Location of a segment\n#EXTINF:4.000,\n.../seg_89282.mp4\n#EXTINF:4.000,\n.../seg_89283.mp4</pre></code>\n            <p>To serve all requests from viewers, we use a <a href=\"https://workers.cloudflare.com/\"><u>Cloudflare Worker</u></a> called ‘delivery-worker’. It handles all requests for Stream content, and had its first commit in 2017, making it one of the earliest production-facing workers at Cloudflare. Since it&#39;s a worker that executes as close to a viewer as possible, it frees us up to spend more time on content and metadata performance rather than where our logic runs. It delivers content, renders playlists, and performs a variety of other functions. For rendering playlists, the worker transforms the broadcast state from the durable object, as mentioned earlier.</p><p>When clients ask for the encoded media content the playlist advertised to them, delivery-worker will send a subrequest to our OTFE (on-the-fly-encoder) service that transits the Cloudflare network. That request describes the format of content requested, i.e. the video stream of segment 89282 at a 1280x720 resolution encoded using AVC (aka H.264) capped CRF with some specified <a href=\"https://blog.cloudflare.com/making-video-intuitive-an-explainer/\"><u>bitrate cap</u></a>. Then, OTFE will encode the original segment to output the specified configuration.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2PNSBVrMZz3rgiQqzzQcHp/56cd69bc8b64034673d4f15c9e461a1f/image7.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"422\" loading=\"lazy\"/>\n          </figure><p>On-the-fly encoding is more efficient than always-encoding, which is the approach most other platforms take. If there are no viewers watching a specific quality level, or watching the broadcast at all, then we aren’t encoding it. That saves power, CPU time, RAM, network, and cache space. Doing nothing is always more efficient than doing something. This applies to a variety of customer use cases, since not all broadcasts have many viewers widely distributed across a range of connection qualities. For one case, consider when serving live broadcasts that are primarily viewed on high quality connections — encoding 240p or 360p variants would probably go to waste most of the time. For a more extreme case, there are situations where you definitely want recording enabled for live content, but viewing is an exceptional situation, such as for security cameras or dashcams. Of course, we have many customers that have active viewership for their broadcasts and this architecture allows us to serve both use cases.</p><p>On-the-fly encoding has a tradeoff: it is hard to implement for “media-correctness” and performance reasons. Media-correctness is important to ensuring smooth playback; individual segments need to have exactly the right start time and duration, or you get stuttering playback, audio/video desync, or entirely unwatchable content. Perfecting our media output requires fine-tuning our encoding, deep-diving into specs, and adjusting fragmented MP4s — especially since most encoders aren’t designed for per-segment encoding. For performance, we hide encoding delay by aggressively prefetching segments from delivery-worker. When a viewer initiates a request for Segment N, we initiate encoding of segment N+1. Since that logic is implemented as a worker, we can also easily add or iterate the prefetching however we want.</p><p>This encoding flow stands on top of the Cloudflare network, which also provides us with <a href=\"https://developers.cloudflare.com/cache/how-to/tiered-cache/\"><u>tiered caching</u></a> and request coalescing. Request coalescing is the key to supporting many viewers simultaneously but only encoding once by enforcing that, for any number of viewers requesting the same encoded content, only one of those requests will make it to our encoder origin — thanks to <a href=\"https://developers.cloudflare.com/cache/\"><u>Cache</u></a>.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6oLTqFzrQodmQqWrIb91qX/1f1f7eb02fd7efb1830f7d636f54edca/image2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"756\" loading=\"lazy\"/>\n          </figure><p>That’s how Stream Live works at a high level. We ingest content from users, send it to any desired live outputs, transcode it for viewing, and give viewers a choice of quality levels, with a lot of backend complexity hidden behind a friendly API. All of this is built on top of the Cloudflare network, with Cloudflare as Customer Zero for our own products and services, using the same as the ones available to our customers.</p><p>There’s a lot more we can write about for problems we’ve solved in building Stream Live over the last few years, but those will have to be for a future blog post. If this mix of media and distributed system problems discussed here sound interesting, the Cloudflare Media Platform <a href=\"https://job-boards.greenhouse.io/cloudflare/jobs/6449185?gh_jid=6449185\"><u>is hiring</u></a> for <a href=\"https://job-boards.greenhouse.io/cloudflare/jobs/6297082?gh_jid=6297082\"><u>several roles</u></a>. Apply and join us!</p>",
		"id": "chVlt8JAjFduvvOJ5c1yl",
		"localeList": {
			"name": "blog-english-only",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Let’s talk about Stream Live’s design, and how it leverages the distributed nature of Cloudflare’s network, rather than centralized locations as many other live services do.",
		"metadata": {
			"title": "Behind the scenes with Stream Live, Cloudflare’s live streaming service",
			"description": "Let’s talk about Stream Live’s design, and how it leverages the distributed nature of Cloudflare’s network, rather than centralized locations as many other live services do.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/22xpisp6kbEqdM6zRXu3dA/94a28da12c2384c800639e2d25a1b0a3/Behind_the_scenes_with_Stream_Live__Cloudflare_s_live_streaming_service-OG.png"
		},
		"primary_author": {},
		"publicly_index": true,
		"published_at": "2025-01-02T14:00+00:00",
		"slug": "behind-the-scenes-with-stream-live-cloudflares-live-streaming-service",
		"tags": [
			{
				"id": "7mVMfcxp4tMqKil9jj8BJa",
				"name": "Cloudflare Stream",
				"slug": "cloudflare-stream"
			},
			{
				"id": "2lpv2daeYndRIyDp7rTa07",
				"name": "Live Streaming",
				"slug": "live-streaming"
			}
		],
		"title": "Behind the scenes with Stream Live, Cloudflare’s live streaming service",
		"updated_at": "2025-01-02T14:00:03.190Z",
		"url": "https://blog.cloudflare.com/behind-the-scenes-with-stream-live-cloudflares-live-streaming-service"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.icon_aria_label": "Search",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"search.result_stat_empty": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong>",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"search.autocomplete_title": "Insert a query. Press enter to send",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}