{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw"
	],
	"post": {
		"authors": [
			{
				"name": "Peter Bacon Darwin",
				"slug": "peter-bacon-darwin",
				"bio": "Principal Systems Engineer on the Workers Experiences team at Cloudflare. Previously, one of the longest serving members of the Angular core team.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2p5W3FQx293vHg4DXN0ND5/3ed4e3f32c486b8937232001582cf651/peter-bacon-darwin.png",
				"location": "London, UK",
				"website": null,
				"twitter": "@petebd",
				"facebook": null
			},
			{
				"name": "James Culveyhouse",
				"slug": "james-culveyhouse",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2IAt8Eb4CKZMgvCvxHdNM/5ca38bd966dc3ad097850e7e46474193/james-culveyhouse.jpg",
				"location": "San Francisco, CA",
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Igor Minar",
				"slug": "igor",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4bFcaTr1FpTJBKV7y849pd/4bebf85537d6e063e64b26dbc08297da/igor.jpeg",
				"location": null,
				"website": null,
				"twitter": "@IgorMinar",
				"facebook": null
			}
		],
		"excerpt": "In this blog-post we demonstrate how hosting and combining multiple server-side rendered micro-frontends on Cloudflare Workers offer a highly scalable, high performance solution to these problems",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6dPHHzMPJqeW0UcKQi6DMo/bcb54871fead5f1bfade139e1fd2f063/better-micro-frontends.png",
		"featured": false,
		"html": "<p>To help developers build better web applications we researched and devised a fragments architecture to build <a href=\"https://martinfowler.com/articles/micro-frontends.html\">micro-frontends</a> using <a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a> that is lightning fast, cost-effective to develop and operate, and scales to the needs of the largest enterprise teams without compromising release velocity or user experience.</p><p>Here we share a technical overview and a proof of concept of this architecture.</p><h2>Why micro-frontends?</h2><p>One of the challenges of modern frontend web development is that applications are getting bigger and more complex. This is especially true for enterprise web applications supporting <a href=\"https://www.cloudflare.com/ecommerce/\">e-commerce</a>, banking, insurance, travel, and other industries, where a unified user interface provides access to a large amount of functionality. In such projects it is common for many teams to collaborate to build a single web application. These monolithic web applications, usually built with JavaScript technologies like React, Angular, or Vue, span thousands, or even millions of lines of code.</p><p>When a monolithic JavaScript architecture is used with applications of this scale, the result is a slow and fragile user experience with low <a href=\"https://web.dev/measure/\">Lighthouse scores</a>. Furthermore, collaborating development teams often struggle to <a href=\"https://www.youtube.com/watch?v=pU1gXA0rfwc\">maintain and evolve</a> their parts of the application, as their <a href=\"https://igor.dev/posts/fate-sharing-and-micro-frontends/\">fates are tied</a> with fates of all the other teams, so the mistakes and tech debt of one team often impacts all.</p><p>Drawing on ideas from <a href=\"https://en.wikipedia.org/wiki/Microservices\">microservices</a>, the frontend community has started to advocate for <a href=\"https://micro-frontends.org/\">micro-frontends</a> to enable teams to develop and deploy their features independently of other teams. Each micro-frontend is a self-contained mini-application, that can be developed and released independently, and is responsible for rendering a “fragment” of the page. The application then combines these fragments together so that from the user&#39;s perspective it feels like a single application.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/78VTFfttaimJC7Son9VcYZ/668c91e42f3c88873a142d97ae048625/image3.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1975\" loading=\"lazy\"/>\n            \n            </figure><p>An application consisting of multiple micro-frontends</p><p>Fragments could represent vertical application features, like “account management” or “checkout”, or horizontal features, like “header” or “navigation bar”.</p><h3>Client-side micro-frontends</h3><p>A common approach to micro-frontends is to rely upon client-side code to lazy load and stitch fragments together (e.g. via <a href=\"https://webpack.js.org/concepts/module-federation/\">Module Federation</a>). Client-side micro-frontend applications suffer from a number of problems.</p><p>Common code must either be duplicated or published as a shared library. Shared libraries are problematic themselves. It is not possible to <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/Tree_shaking\">tree-shake</a> unused library code at build time resulting in more code than necessary being downloaded to the browser and coordinating between teams when shared libraries need to be updated can be complex and awkward.</p><p>Also, the top-level container application must bootstrap before the micro-frontends can even be requested, and they also need to boot before they become interactive. If they are nested, then you may end up getting a <a href=\"https://javascript.plainenglish.io/react-official-answer-the-right-way-of-requesting-data-in-react18-other-frameworks-also-apply-50d907c1f6c4\">waterfall of requests</a> to get micro-frontends leading to further runtime delays.</p><p>These problems can result in a sluggish application startup experience for the user.</p><p>Server-side rendering could be used with client-side micro-frontends to improve how quickly a browser displays the application but implementing this can significantly increase the complexity of development, deployment and operation. Furthermore, most server-side rendering approaches still suffer from a <a href=\"https://dev.to/this-is-learning/why-efficient-hydration-in-javascript-frameworks-is-so-challenging-1ca3\">hydration delay</a> before the user can fully interact with the application.</p><p>Addressing these challenges was the main motivation for exploring an alternative solution, which relies on the distributed, low latency properties provided by Cloudflare Workers.</p><h2>Micro-frontends on Cloudflare Workers</h2><p><a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a> is a compute platform that offers a highly scalable, low latency JavaScript execution environment that is available in <a href=\"https://www.cloudflare.com/network/\">over 275 locations</a> around the globe. In our exploration we used Cloudflare Workers to host and render micro-frontends from anywhere on our global network.</p><h3>Fragments architecture</h3><p>In this architecture the application consists of a tree of “fragments” each deployed to Cloudflare Workers that collaborate to server-side render the overall response. The browser makes a request to a “root fragment”, which will communicate with “child fragments” to generate the final response. Since Cloudflare Workers can communicate with each other <a href=\"https://developers.cloudflare.com/workers/platform/bindings/about-service-bindings/\">with almost no overhead</a>, applications can be server-side rendered quickly by child fragments, all working in parallel to render their own HTML, streaming their results to the parent fragment, which combines them into the final response stream delivered to the browser.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/43AlwyalVCD1CfOm31lNiX/406c6038ce4b2a99b03ba5c56a2c8b3b/blog-1447.png\" alt=\"\" class=\"kg-image\" width=\"1644\" height=\"916\" loading=\"lazy\"/>\n            \n            </figure><p>A high-level overview of a fragments architecture</p><h2>Visit the “Cloud Gallery”</h2><p>We have built an example of a “Cloud Gallery” application to show how this can work in practice. It is deployed to Cloudflare Workers at  <a href=\"https://cloud-gallery.web-experiments.workers.dev/\">https://cloud-gallery.web-experiments.workers.dev/</a></p><p>The demo application is a simple filtered gallery of cloud images built using our fragments architecture. Try selecting a tag in the type-ahead to filter the images listed in the gallery. Then change the delay on the stream of cloud images to see how the type-ahead filtering can be interactive before the page finishes loading.</p><h3>Multiple Cloudflare Workers</h3><p>The application is composed of a tree of six collaborating but independently deployable Cloudflare Workers, each rendering their own fragment of the screen and providing their own client-side logic, and assets such as CSS stylesheets and images.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2xfKbBmdC16pAkNbdCjOz7/609029c98ed6bba952874582ea2b78ee/image6-4.png\" alt=\"\" class=\"kg-image\" width=\"990\" height=\"417\" loading=\"lazy\"/>\n            \n            </figure><p>Architectural overview of the Cloud Gallery app</p><p>The “main” fragment acts as the root of the application. The “header” fragment has a slider to configure an artificial delay to the display of gallery images. The “body” fragment contains the “filter” fragment and “gallery” fragments. Finally, the “footer” fragment just shows some static content.</p><p>The full source code of the demo app is available on <a href=\"https://github.com/cloudflare/workers-web-experiments/tree/main/cloud-gallery\">GitHub</a>.</p><h2>Benefits and features</h2><p>This architecture of multiple collaborating server-side rendered fragments, deployed to Cloudflare Workers has some interesting features.</p><h3>Encapsulation</h3><p>Fragments are entirely encapsulated, so they can control what they own and what they make available to other fragments.</p><h4><i>Fragments can be developed and deployed independently</i></h4><p>Updating one of the fragments is as simple as redeploying that fragment. The next request to the main application will use the new fragment. Also, fragments can host their own assets (client-side JavaScript, images, etc.), which are streamed through their parent fragment to the browser.</p><h4><i>Server-only code is not sent to the browser</i></h4><p>As well as reducing the cost of downloading unnecessary code to the browser, security sensitive code that is only needed for server-side rendering the fragment is never exposed to other fragments and is not downloaded to the browser. Also, features can be safely hidden behind feature flags in a fragment, allowing more flexibility with rolling out new behavior safely.</p><h3>Composability</h3><p>Fragments are fully composable - any fragment can contain other fragments. The resulting tree structure gives you more flexibility in how you architect and deploy your application. This helps larger projects to scale their development and deployment. Also, fine-grain control over how fragments are composed, could allow fragments that are expensive to server-side render to be cached individually.</p><h3>Fantastic Lighthouse scores</h3><p>Streaming server-rendered HTML results in great user experiences and <a href=\"https://developer.chrome.com/docs/lighthouse/overview/\">Lighthouse</a> scores, which in practice means happier users and higher chance of conversions for your business.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4GNNIIhE13dbX7EwfTUoQ8/6dc3eccb0770c3e9fdcaab92dc670907/image7-2.png\" alt=\"\" class=\"kg-image\" width=\"1552\" height=\"330\" loading=\"lazy\"/>\n            \n            </figure><p>Lighthouse scores for the Cloud Gallery app</p><p>Each fragment can parallelize requests to its child fragments and pipe the resulting HTML streams into its own single streamed server-side rendered response. Not only can this reduce the time to render the whole page but streaming each fragment through to the browser reduces the time to the first byte of each fragment.</p><h3>Eager interactivity</h3><p>One of the powers of a fragments architecture is that fragments can become interactive even while the rest of the application (including other fragments) is still being streamed down to the browser.</p><p>In our demo, the “filter” fragment is immediately interactive as soon as it is rendered, even if the image HTML for the “gallery” fragment is still loading.</p><p>To make it easier to see this, we added a slider to the top of the “header” that can simulate a network or database delay that slows down the HTML stream which renders the “gallery” images. Even when the “gallery” fragment is still loading, the type-ahead input, in the “filter” fragment, is already fully interactive.</p><p>Just think of all the frustration that this eager interactivity could avoid for web application users with unreliable Internet connection.</p><h2>Under the hood</h2><p>As discussed already this architecture relies upon deploying this application as many cooperating Cloudflare Workers. Let’s look into some details of how this works in practice.</p><p>We experimented with various technologies, and while this approach can be used with many frontend libraries and frameworks, we found the <a href=\"https://qwik.builder.io/\">Qwik framework</a> to be a particularly good fit, because of its HTML-first focus and low JavaScript overhead, which avoids any hydration problems.</p><h3>Implementing a fragment</h3><p>Each fragment is a server-side rendered Qwik application deployed to its own Cloudflare Worker. This means that you can even browse to these fragments directly. For example, the “header” fragment is deployed to <a href=\"https://cloud-gallery-header.web-experiments.workers.dev/\">https://cloud-gallery-header.web-experiments.workers.dev/</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/24SSUszIf2fbUphL5lsfr9/f74a593ce1b91c5fae0b8c2d08e7dd44/image8-2.png\" alt=\"\" class=\"kg-image\" width=\"1732\" height=\"318\" loading=\"lazy\"/>\n            \n            </figure><p>A screenshot of the self-hosted “header” fragment</p><p>The header fragment is defined as a <a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/header/src/root.tsx\"><code>Header</code></a> component using Qwik. This component is rendered in a Cloudflare Worker via a <code>fetch()</code> handler:</p>\n            <pre class=\"language-tsx\"><code class=\"language-tsx\">export default {\n  fetch(request: Request, env: Record&lt;string, unknown&gt;): Promise&lt;Response&gt; {\n    return renderResponse(request, env, &lt;Header /&gt;, manifest, &quot;header&quot;);\n  },\n};</pre></code>\n            <!--kg-card-begin: html--><center><small><a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/header/src/entry.ssr.tsx\"><b>cloud-gallery/header/src/entry.ssr.tsx</b></a></small></center><!--kg-card-end: html--><p>The <code>[renderResponse](https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/renderResponse.ts)()</code> function is a helper we wrote that server-side renders the fragment and streams it into the body of a <code>Response</code> that we return from the <code>fetch()</code> handler.</p><p>The header fragment serves its own JavaScript and image assets from its Cloudflare Worker. We configure <a href=\"https://developers.cloudflare.com/workers/wrangler\">Wrangler</a> to upload these assets to Cloudflare and serve them from our network.</p><h2>Implementing fragment composition</h2><p>Fragments that contain child fragments have additional responsibilities:</p><ul><li><p>Request and inject child fragments when rendering their own HTML.</p></li><li><p>Proxy requests for child fragment assets through to the appropriate fragment.</p></li></ul><h3>Injecting child fragments</h3><p>The position of a child fragment inside its parent can be specified by a <a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/fragmentHelpers.tsx\"><code>FragmentPlaceholder</code></a> helper component that we have developed. For example, the “body” fragment has the “filter” and “gallery” fragments.</p>\n            <pre class=\"language-tsx\"><code class=\"language-tsx\">&lt;div class=&quot;content&quot;&gt;\n  &lt;FragmentPlaceholder name=&quot;filter&quot; /&gt;\n  &lt;FragmentPlaceholder name=&quot;gallery&quot; /&gt;\n&lt;/div&gt;</pre></code>\n            <!--kg-card-begin: html--><center><small><a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/body/src/root.tsx\"><b>cloud-gallery/body/src/root.tsx</b></a></small></center><!--kg-card-end: html--><p>The <code>FragmentPlaceholder</code> component is responsible for making a request for the fragment and piping the fragment stream into the output stream.</p><h3>Proxying asset requests</h3><p>As mentioned earlier, fragments can host their own assets, especially client-side JavaScript files. When a request for an asset arrives at the parent fragment, it needs to know which child fragment should receive the request.</p><p>In our demo we use a convention that such asset paths will be prefixed with <code>/_fragment/&lt;fragment-name&gt;</code>. For example, the header logo image path is <code>/_fragment/header/cf-logo.png</code>. We developed a <code>[tryGetFragmentAsset](https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/fragmentHelpers.tsx#L28)()</code> helper which can be added to the parent fragment’s <code>fetch()</code> handler to deal with this:</p>\n            <pre class=\"language-tsx\"><code class=\"language-tsx\">export default {\n  async fetch(\n    request: Request,\n    env: Record&lt;string, unknown&gt;\n  ): Promise&lt;Response&gt; {\n    // Proxy requests for assets hosted by a fragment.\n    const asset = await tryGetFragmentAsset(env, request);\n    if (asset !== null) {\n      return asset;\n    }\n    // Otherwise server-side render the template injecting child fragments.\n    return renderResponse(request, env, &lt;Root /&gt;, manifest, &quot;div&quot;);\n  },\n};</pre></code>\n            <!--kg-card-begin: html--><center><small><a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/body/src/entry.ssr.tsx\"><strong>cloud-gallery/body/src/entry.ssr.tsx</strong></a></small></center><!--kg-card-end: html--><h3>Fragment asset paths</h3><p>If a fragment hosts its own assets, then we need to ensure that any HTML it renders uses the special <code>_fragment/&lt;fragment-name&gt;</code> path prefix mentioned above when referring to these assets. We have implemented a strategy for this in the helpers we developed.</p><p>The <a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/fragmentHelpers.tsx\"><code>FragmentPlaceholder</code></a> component adds a <code>base</code> searchParam to the fragment request to tell it what this prefix should be. The <code>[renderResponse](https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/renderResponse.ts)()</code> helper extracts this prefix and provides it to the Qwik server-side renderer. This ensures that any request for client-side JavaScript has the correct prefix. Fragments can apply a hook that we developed called <code>[useFragmentRoot](https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/base.ts#L22)()</code>. This allows components to gather the prefix from a <a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/base.ts#L12\"><code>FragmentContext</code></a> context.</p><p>For example, since the “header” fragment hosts the Cloudflare and GitHub logos as assets, it must call the <code>useFragmentRoot()</code> hook:</p>\n            <pre class=\"language-tsx\"><code class=\"language-tsx\">export const Header = component$(() =&gt; {\n  useStylesScoped$(HeaderCSS);\n  useFragmentRoot();\n\n  return (...);\n});</pre></code>\n            <!--kg-card-begin: html--><center><small><a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/header/src/root.tsx\"><strong>cloud-gallery/header/src/root.tsx</strong></a></small></center><!--kg-card-end: html--><p>The <code>FragmentContext</code> value can then be accessed in components that need to apply the prefix. For example, the <code>Image</code> component:</p>\n            <pre class=\"language-tsx\"><code class=\"language-tsx\">export const Image = component$((props: Record&lt;string, string | number&gt;) =&gt; {\n  const { base } = useContext(FragmentContext);\n  return &lt;img {...props} src={base + props.src} /&gt;;\n});</pre></code>\n            <!--kg-card-begin: html--><center><small><a href=\"https://github.com/cloudflare/workers-web-experiments/blob/main/cloud-gallery/helpers/src/image/image.tsx\"><strong>cloud-gallery/helpers/src/image/image.tsx</strong></a></small></center><!--kg-card-end: html--><h3>Service-binding fragments</h3><p>Cloudflare Workers provide a mechanism called <a href=\"https://developers.cloudflare.com/workers/platform/bindings/about-service-bindings/\">service bindings</a> to make requests between Cloudflare Workers efficiently that avoids network requests. In the demo we use this mechanism to make the requests from parent fragments to their child fragments with almost no performance overhead, while still allowing the fragments to be independently deployed.</p><h2>Comparison to current solutions</h2><p>This fragments architecture has three properties that distinguish it from other current solutions.</p><p>Unlike monoliths, or client-side micro-frontends, fragments are developed and deployed as independent server-side rendered applications that are composed together on the server-side. This significantly improves rendering speed, and lowers interaction latency in the browser.</p><p>Unlike server-side rendered micro-frontends with Node.js or cloud functions, Cloudflare Workers is a globally distributed compute platform with a region-less deployment model. It has incredibly low latency, and a near-zero communication overhead between fragments.</p><p>Unlike solutions based on <a href=\"https://webpack.js.org/concepts/module-federation/\">module federation</a>, a fragment&#39;s client-side JavaScript is very specific to the fragment it is supporting. This means that it is small enough that we don’t need to have shared library code, eliminating the version skew issues and coordination problems when updating shared libraries.</p><h2>Future possibilities</h2><p>This demo is just a proof of concept, so there are still areas to investigate. Here are some of the features we’d like to explore in the future.</p><h3>Caching</h3><p>Each micro-frontend fragment can be cached independently of the others based on how static its content is. When requesting the full page, the fragments only need to run server-side rendering for micro-frontends that have changed.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3PxpkF17fG0fMqBX0nhT6n/ba80cb082afdf030d20918f5ff530cc8/image2.jpg\" alt=\"\" class=\"kg-image\" width=\"1548\" height=\"661\" loading=\"lazy\"/>\n            \n            </figure><p>An application where the output of some fragments are cached</p><p>With per-fragment caching you can return the HTML response to the browser faster, and avoid incurring compute costs in re-rendering content unnecessarily.</p><h3>Fragment routing and client-side navigation</h3><p>Our demo application used micro-frontend fragments to compose a single page. We could however use this approach to implement page routing as well. When server-side rendering, the main fragment could insert the appropriate “page” fragment based on the visited URL. When navigating, client-side, within the app, the main fragment would remain the same while the displayed “page” fragment would change.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/31uGNgOqJccEZXHRfrK7Fw/1275bcc50b789cdda974d1d16c3f9cbc/image5-1.jpg\" alt=\"\" class=\"kg-image\" width=\"1685\" height=\"690\" loading=\"lazy\"/>\n            \n            </figure><p>An application where each route is delegated to a different fragment</p><p>This approach combines the best of server-side and client-side routing with the power of fragments.</p><h3>Using other frontend frameworks</h3><p>Although the Cloud Gallery application uses Qwik to implement all fragments, it is possible to use other frameworks as well. If really necessary, it’s even possible to mix and match frameworks.</p><p>To achieve good results, the framework of choice should be capable of server-side rendering, and should have a small client-side JavaScript footprint. HTML streaming capabilities, while not required, can significantly improve performance of large applications.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1AkgbhioqHBaKtvZxVTIsp/476650ecc343f925c17e993bd7702cda/image1-15.png\" alt=\"\" class=\"kg-image\" width=\"1685\" height=\"690\" loading=\"lazy\"/>\n            \n            </figure><p>An application using different frontend frameworks</p><h3>Incremental migration strategies</h3><p>Adopting a new architecture, compute platform, and deployment model is a lot to take in all at once, and for existing large applications is prohibitively risky and expensive. To make this  fragment-based architecture available to legacy projects, an incremental adoption strategy is a key.</p><p>Developers could test the waters by migrating just a single piece of the user-interface within their legacy application to a fragment, integrating with minimal changes to the legacy application. Over time, more of the application could then be moved over, one fragment at a time.</p><h3>Convention over configuration</h3><p>As you can see in the Cloud Gallery demo application, setting up a fragment-based micro-frontend requires quite a bit of configuration. A lot of this configuration is very mechanical and could be abstracted away via conventions and better tooling. Following productivity-focused precedence found in Ruby on Rails, and filesystem based routing meta-frameworks, we could make a lot of this configuration disappear.</p><h2>Try it yourself!</h2><p>There is still so much to dig into! Web applications have come a long way in recent years and their growth is hard to overstate. Traditional implementations of micro-frontends have had only mixed success in helping developers scale development and deployment of large applications. Cloudflare Workers, however, unlock new possibilities which can help us tackle many of the existing challenges and help us build better web applications.</p><p>Thanks to the <a href=\"https://workers.cloudflare.com/#plans\">generous free plan</a> offered by Cloudflare Workers, you can <a href=\"https://github.com/cloudflare/workers-web-experiments/tree/main/cloud-gallery\">check out the Gallery Demo code</a> and deploy it yourself.</p><p>If all of these sounds interesting to you, and you would like to work with us on improving the developer experience for Cloudflare Workers, we are also happy to share that <a href=\"https://boards.greenhouse.io/cloudflare/jobs/4619341\">we are hiring</a>!</p>",
		"id": "irbcct7Wl9QqgfZhsBGew",
		"localeList": {
			"name": "Cloudflare Workers and micro-frontends: made for one another Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "In this blog-post we demonstrate how hosting and combining multiple server-side rendered micro-frontends on Cloudflare Workers offer a highly scalable, high performance solution to these problems.",
		"metadata": {
			"title": "Cloudflare Workers and micro-frontends: made for one another",
			"description": "In this blog-post we demonstrate how hosting and combining multiple server-side rendered micro-frontends on Cloudflare Workers offer a highly scalable, high performance solution to these problems.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3kpEl7IFlg5sREGAtBeqtI/c24dc6ec506efaea5c2b918ba7b4ec27/better-micro-frontends-BBAoTE.png"
		},
		"primary_author": {},
		"published_at": "2022-10-20T14:00:00.000+01:00",
		"slug": "better-micro-frontends",
		"tags": [
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "7aCmhopZM6Wjggr7YnTxHZ",
				"name": "Micro-frontends",
				"slug": "micro-frontends"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			},
			{
				"id": "5cye1Bh5KxFh3pKSnX8Dsy",
				"name": "Serverless",
				"slug": "serverless"
			}
		],
		"title": "Cloudflare Workers and micro-frontends: made for one another",
		"updated_at": "2024-08-27T02:06:42.479Z",
		"url": "https://blog.cloudflare.com/better-micro-frontends"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}