{
	"initialReadingTime": "11",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Mingwei Zhang",
				"slug": "mingwei",
				"bio": "Senior Systems Engineer",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5QnUBSretQguH6rvS2M2T/b3879dbdcb0a5fb1a89bde7efbdcaac9/mingwei.jpeg",
				"location": null,
				"website": null,
				"twitter": "@heymingwei",
				"facebook": null
			},
			{
				"name": "Celso Martinho",
				"slug": "celso",
				"bio": "From when Mosaic took over Gopher. Engineering Director at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2pzgat1zmt1oF1byi7hskH/7e3b95ac25469b2640929caf376fa4c8/celso.png",
				"location": "Portugal, Lisbon",
				"website": "https://celso.io/",
				"twitter": "@celso",
				"facebook": null
			}
		],
		"excerpt": "BGP origin hijacks allow attackers to intercept, monitor, redirect, or drop traffic destined for the victim's networks. We explain how Cloudflare built its BGP hijack detection system, from its design and implementation to its integration on Cloudflare Radar",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3CHy5OM9MF4ihIQOPfKzMv/7a90b19c5ffd9a178eec4ce4044b8a9c/bgp-hijack-detection.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2C1TQmCTMu8ztsxeIn7h10/e63b5d921aa152d775c8fda3269d4e4e/Cloudflare-Radar-s-new-BGP-origin-hijack-detection-system.png\" alt=\"Cloudflare Radar's new BGP origin hijack detection system\" class=\"kg-image\" width=\"1801\" height=\"1019\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-bgp/\">Border Gateway Protocol</a> (BGP) is the de facto inter-domain routing protocol used on the Internet. It enables networks and organizations to exchange reachability information for blocks of IP addresses (IP prefixes) among each other, thus allowing routers across the Internet to forward traffic to its destination. BGP was designed with the assumption that networks do not intentionally propagate falsified information, but unfortunately that’s not a valid assumption on today’s Internet.</p><p>Malicious actors on the Internet who control BGP routers can perform BGP hijacks by falsely announcing ownership of groups of IP addresses that they do not own, control, or route to. By doing so, an attacker is able to redirect traffic destined for the victim network to itself, and monitor and intercept its traffic. A BGP hijack is much like if someone were to change out all the signs on a stretch of freeway and reroute automobile traffic onto incorrect exits.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3eRfapZmJQLB67OmDnppNJ/a8a3ee199f84f697e1898da6b6f1746d/image11.png\" alt=\"\" class=\"kg-image\" width=\"1459\" height=\"957\" loading=\"lazy\"/>\n            \n            </figure><p>You can learn more about <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-bgp/\">BGP</a> and <a href=\"https://www.cloudflare.com/learning/security/glossary/bgp-hijacking/\">BGP hijacking</a> and its consequences in our learning center.</p><p>At Cloudflare, we have long been monitoring suspicious BGP anomalies internally. With our recent efforts, we are bringing BGP origin hijack detection to the <a href=\"https://radar.cloudflare.com/security-and-attacks\">Cloudflare Radar</a> platform, sharing our detection results with the public. In this blog post, we will explain how we built our detection system and how people can use Radar and its APIs to integrate our data into their own workflows**.**</p><h2>What is BGP origin hijacking?</h2><p>Services and devices on the Internet locate each other using IP addresses. Blocks of IP addresses are called an IP prefix (or just prefix for short), and multiple prefixes from the same organization are aggregated into an <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-an-autonomous-system/\">autonomous system</a> (AS).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1V7wyuIuBZwT9BV8uQjBRs/1fd182e6dc693335cac8fb713003ff42/Screenshot-2023-07-26-at-18.26.17.png\" alt=\"\" class=\"kg-image\" width=\"1614\" height=\"918\" loading=\"lazy\"/>\n            \n            </figure><p>Using the BGP protocol, ASes announce which routes can be imported or exported to other ASes and routers from their routing tables. This is called the AS routing policy. Without this routing information, operating the Internet on a large scale would quickly become impractical: data packets would get lost or take too long to reach their destinations.</p><p>During a BGP origin hijack, an attacker creates fake announcements for a targeted prefix, falsely identifying an <a href=\"https://developers.cloudflare.com/radar/glossary/#autonomous-systems\">autonomous systems (AS)</a> under their control as the origin of the prefix.</p><p>In the following graph, we show an example where <code>AS 4</code> announces the prefix <code>P</code> that was previously originated by <code>AS 1</code>. The receiving parties, i.e. <code>AS 2</code> and <code>AS 3</code>, accept the hijacked routes and forward traffic toward prefix <code>P</code> to <code>AS 4</code> instead.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4868WfpNphX6eCHwMpZKGr/c4f05927c6029b436f09000d8c34d706/image2-15.png\" alt=\"\" class=\"kg-image\" width=\"1186\" height=\"616\" loading=\"lazy\"/>\n            \n            </figure><p>As you can see, the normal and hijacked traffic flows back in the opposite direction of the BGP announcements we receive.</p><p>If successful, this type of attack will result in the dissemination of the falsified prefix origin announcement throughout the Internet, causing network traffic previously intended for the victim network to be redirected to the AS controlled by the attacker. As an example of a famous BGP hijack attack, in 2018 <a href=\"/bgp-leaks-and-crypto-currencies/\">someone was able</a> to convince parts of the Internet to reroute traffic for AWS to malicious servers where they used DNS to redirect MyEtherWallet.com, a popular crypto wallet, to a hacked page.</p><h2>Prevention mechanisms and why they’re not perfect (yet)</h2><p>The key difficulty in preventing BGP origin hijacks is that the BGP protocol itself does not provide a mechanism to validate the announcement content. In other words, the original BGP protocol does not provide any authentication or ownership safeguards; any route can be originated and announced by any random network, independent of its rights to announce that route.</p><p>To address this problem, operators and researchers have proposed the <a href=\"https://en.wikipedia.org/wiki/Resource_Public_Key_Infrastructure\">Resource Public Key Infrastructure (RPKI)</a> to store and validate prefix-to-origin mapping information. With RPKI, operators can prove the ownership of their network resources and create ROAs, short for Route Origin Authorisations, cryptographically signed objects that define which Autonomous System (AS) is authorized to originate a specific prefix.</p><p>Cloudflare <a href=\"/rpki/\">committed to support RPKI</a> since the early days of the <a href=\"https://datatracker.ietf.org/doc/html/rfc6480\">RFC</a>. With RPKI, IP prefix owners can store and share the ownership information securely, and other operators can validate BGP announcements by checking the prefix origin to the information stored on RPKI. Any hijacking attempt to announce an IP prefix with an incorrect origin AS will result in invalid validation results, and such invalid BGP messages will be discarded. This validation process is referred to as route origin validation (ROV).</p><p>In order to further advocate for RPKI deployment and filtering of RPKI invalid announcements, Cloudflare has been providing a RPKI test service, <a href=\"https://isbgpsafeyet.com/\">Is BGP Safe Yet?</a>, allowing users to test whether their ISP filters RPKI invalid announcements. We also provide rich information with regard to the RPKI status of individual prefixes and ASes at <a href=\"https://rpki.cloudflare.com/\">https://rpki.cloudflare.com/</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4MNPvwC6PpJCPQCIQhC8sl/a82401de8180e06615757aa3b4c25a49/image8-1.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"918\" loading=\"lazy\"/>\n            \n            </figure><p><b>However</b>, the effectiveness of RPKI on preventing BGP origin hijacks depends on two factors:</p><ol><li><p>The ratio of prefix owners register their prefixes on RPKI;</p></li><li><p>The ratio of networks performing route origin validation.</p></li></ol><p>Unfortunately, neither ratio is at a satisfactory level yet. As of today, July 27, 2023, only about 45% of the IP prefixes routable on the Internet are covered by some ROA on RPKI. The remaining prefixes are highly vulnerable to BGP origin hijacks. Even for the 45% prefix that are covered by some ROA, origin hijack attempts can still affect them due to the low ratio of networks that perform route origin validation (ROV). Based on our <a href=\"/rpki-updates-data/\">recent study,</a> only 6.5% of the Internet users are protected by ROV from BGP origin hijacks.</p><p>Despite the benefits of RPKI and RPKI ROAs, their effectiveness in preventing BGP origin hijacks is limited by the slow adoption and deployment of these technologies. Until we achieve a high rate of RPKI ROA registration and RPKI invalid filtering, BGP origin hijacks will continue to pose a significant threat to the daily operations of the Internet and the security of everyone connected to it. Therefore, it’s also essential to prioritize developing and deploying BGP monitoring and detection tools to enhance the security and stability of the Internet&#39;s routing infrastructure.</p><h2>Design of Cloudflare’s BGP hijack detection system</h2><p>Our system comprises multiple data sources and three distinct modules that work together to detect and analyze potential BGP hijack events: prefix origin change detection, hijack detection and the storage and notification module.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/67bYKbfT4zBONmISARpcta/ced4cfeca71a3eb5c1c5fce241b3afd2/image6-7.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1340\" loading=\"lazy\"/>\n            \n            </figure><p>The Prefix Origin Change Detection module provides the data, the Hijack Detection module analyzes the data, and the Alerts Storage and Delivery module stores and provides access to the results. Together, these modules work in tandem to provide a comprehensive system for detecting and analyzing potential BGP hijack events.</p><h3>Prefix origin change detection module</h3><p>At its core, the BGP protocol involves:</p><ol><li><p>Exchanging prefix reachability (routing) information;</p></li><li><p>Deciding where to forward traffic based on the reachability information received.</p></li></ol><p>The reachability change information is encoded in BGP update messages while the routing decision results are encoded as a route information base (RIB) on the routers, also known as the <a href=\"https://en.wikipedia.org/wiki/Routing_table\">routing table</a>.</p><p>In our origin hijack detection system, we focus on investigating BGP <a href=\"https://datatracker.ietf.org/doc/html/rfc4271\">update messages</a> that contain changes to the origin ASes of any IP prefixes. There are two types of BGP update messages that could indicate prefix origin changes: <b>announcements</b> and <b>withdrawals</b>.</p><p>Announcements include an AS-level path toward one or more prefixes. The path tells the receiving parties through which sequence of networks (ASes) one can reach the corresponding prefixes. The last hop of an AS path is the origin AS. In the following diagram, AS 1 is the origin AS of the announced path.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4bF9IfSM2X5mtlWgqsKt4e/6dba4e3ffe3c3d4e4ce3cb113f9f20e0/image4-6.png\" alt=\"\" class=\"kg-image\" width=\"1476\" height=\"336\" loading=\"lazy\"/>\n            \n            </figure><p>Withdrawals, on the other hand, simply inform the receiving parties that the prefixes are no longer reachable.</p><p>Both types of messages are stateless. They inform us of the current route changes, but provide no information about the previous states. As a result, detecting origin changes is not as straightforward as one may think. Our system needs to keep track of historical BGP updates and build some sort of state over time so that we can verify if a BGP update contains origin changes.</p><p>We didn&#39;t want to deal with a complex system like a database to manage the state of all the prefixes we see resulting from all the BGP updates we get from them. Fortunately, there&#39;s this thing called <a href=\"https://en.wikipedia.org/wiki/Trie\">prefix trie</a> in computer science that you can use to store and look up string-indexed data structures, which is ideal for our use case. We ended up developing a fast Rust-based custom IP prefix trie that we use to hold the relevant information such as the origin ASN and the AS path for each IP prefix and allows information to be updated based on BGP announcements and withdrawals.</p><p>The example figure below shows an example of the AS path information for prefix <code>192.0.2.0/24</code> stored on a prefix trie. When updating the information on the prefix trie, if we see a change of origin ASN for any given prefix, we record the BGP message as well as the change and create an <code>Origin Change Signal</code>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2tZK0inZhfzbvgpQIBKkFE/8fc453c8a0d84b40ef9fb638e81554e1/Screenshot-2023-07-26-at-18.20.07.png\" alt=\"\" class=\"kg-image\" width=\"1622\" height=\"862\" loading=\"lazy\"/>\n            \n            </figure><p>The prefix origin changes detection module collects and processes live-stream and historical BGP data from various sources. For <a href=\"https://www.cloudflare.com/developer-platform/solutions/live-streaming/\">live streams</a>, our system applies a thin layer of data processing to translate BGP messages into our internal data structure. At the same time, for historical archives, we use a dedicated deployment of the <a href=\"https://bgpkit.com/broker\">BGPKIT broker</a> and <a href=\"https://bgpkit.com/parser\">parser</a> to convert MRT files from <a href=\"https://www.routeviews.org/\">RouteViews</a> and <a href=\"https://www.ripe.net/analyse/internet-measurements/routing-information-service-ris\">RIPE RIS</a> into BGP message streams as they become available.</p><p>After the data is collected, consolidated and normalized it then creates, maintains and destroys the prefix tries so that we can know what changed from previous BGP announcements from the same peers. Based on these calculations we then send enriched messages downstream to be analyzed.</p><h3>Hijack detection module</h3><p>Determining whether BGP messages suggest a hijack is a complex task, and no common scoring mechanism can be used to provide a definitive answer. Fortunately, there are several types of data sources that can collectively provide a relatively good idea of whether a BGP announcement is legitimate or not. These data sources can be categorized into two types: inter-AS relationships and prefix-origin binding.</p><p>The inter-AS relationship datasets include AS2org and AS2rel datasets from <a href=\"https://www.caida.org/\">CAIDA/UCSD</a>, AS2rel datasets from <a href=\"https://bgpkit.com/\">BGPKIT</a>, AS organization datasets from <a href=\"https://www.peeringdb.com/\">PeeringDB</a>, and <a href=\"/route-leak-detection-with-cloudflare-radar/#route-leak-detection\">per-prefix AS relationship data</a> built at Cloudflare. These datasets provide information about the relationship between autonomous systems, such as whether they are upstream or downstream from one another, or if the origins of any change signal belong to the same organization.</p><p>Prefix-to-origin binding datasets include live RPKI validated ROA payload (VRP) from the <a href=\"https://rpki.cloudflare.com/\">Cloudflare RPKI portal</a>, daily Internet Routing Registry (IRR) dumps curated and cleaned up by <a href=\"https://www.manrs.org/\">MANRS</a>, and prefix and AS <a href=\"https://en.wikipedia.org/wiki/Bogon_filtering\">bogon</a> lists (private and reserved addresses defined by <a href=\"https://datatracker.ietf.org/doc/html/rfc1918\">RFC 1918</a>, <a href=\"https://datatracker.ietf.org/doc/html/rfc5735\">RFC 5735</a>, and <a href=\"https://datatracker.ietf.org/doc/html/rfc6598\">RFC 6598</a>). These datasets provide information about the ownership of prefixes and the ASes that are authorized to originate them.</p><p>By combining all these data sources, it is possible to collect information about each BGP announcement and answer questions programmatically. For this, we have a scoring function that takes all the evidence gathered for a specific BGP event as the input and runs that data through a sequence of checks. Each condition returns a neutral, positive, or negative weight that keeps adding to the final score. The higher the score, the more likely it is that the event is a hijack attempt.</p><p>The following diagram illustrates this sequence of checks:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4y6YiYezGew65wYeNFPOqs/3609b94a2c1ac888a148367f8861cfd1/image1-12.png\" alt=\"\" class=\"kg-image\" width=\"1410\" height=\"1682\" loading=\"lazy\"/>\n            \n            </figure><p>As you can see, for each event, several checks are involved that help calculate the final score: RPKI, Internet Routing Registry (IRR), bogon prefixes and ASNs lists, AS relationships, and AS path.</p><p>Our guiding principles are: if the newly announced origins are RPKI or IRR invalid, it’s more likely that it’s a hijack, but if the old origins are also invalid, then it’s less likely. We discard events about private and reserved ASes and prefixes. If the new and old origins have a direct business relationship, then it’s less likely that it’s a hijack. If the new AS path indicates that the traffic still goes through the old origin, then it’s probably not a hijack.</p><p>Signals that are deemed legitimate are discarded, while signals with a high enough confidence score are flagged as potential hijacks and sent downstream for further analysis.</p><p>It&#39;s important to reiterate that the decision is not binary but a score. There will be situations where we find false negatives or false positives. The advantage of this framework is that we can easily monitor the results, learn from additional datasets and conduct the occasional manual inspection, which allows us to adjust the weights, add new conditions and continue improving the score precision over time.</p><h4>Aggregating BGP hijack events</h4><p>Our BGP hijack detection system provides fast response time and requires minimal resources by operating on a per-message basis.</p><p>However, when a hijack is happening, the number of hijack signals can be overwhelming for operators to manage. To address this issue, we designed a method to aggregate individual hijack messages into <b>BGP hijack events</b>, thereby reducing the number of alerts triggered.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/20mBP4fcykkGkNIXwXqlAa/879c7b95cb1f7909a4772f6b049259ce/image10.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"752\" loading=\"lazy\"/>\n            \n            </figure><p>An event aggregates BGP messages that are coming from the same hijacker related to prefixes from the same victim. The start date is the same as the date of the first suspicious signal. To calculate the end of an event we look for one of the following conditions:</p><ul><li><p>A BGP withdrawn message for the hijacked prefix: regardless of who sends the withdrawal, the route towards the prefix is no longer via the hijacker, and thus this hijack message is considered finished.</p></li><li><p>A new BGP announcement message with the previous (legitimate) network as the origin: this indicates that the route towards the prefix is reverted to the state before the hijack, and the hijack is therefore considered finished.</p></li></ul><p>If all BGP messages for an event have been withdrawn or reverted, and there are no more new suspicious origin changes from the hijacker ASN for <b>six hours</b>, we mark the event as finished and set the end date.</p><p>Hijack events can capture both small-scale and large-scale attacks. Alerts are then based on these aggregated events, not individual messages, making it easier for operators to manage and respond appropriately.</p><h3>Alerts, Storage and Notifications module</h3><p>This module provides access to detected BGP hijack events and sends out notifications to relevant parties. It handles storage of all detected events and provides a user interface for easy access and search of historical events. It also generates notifications and delivers them to the relevant parties, such as network administrators or security analysts, when a potential BGP hijack event is detected. Additionally, this module can build dashboards to display high-level information and visualizations of detected events to facilitate further analysis.</p><h3>Lightweight and portable implementation</h3><p>Our BGP hijack detection system is implemented as a Rust-based command line application that is lightweight and portable. The whole detection pipeline runs off a single binary application that connects to a PostgreSQL database and essentially runs a complete self-contained BGP data pipeline. And if you are wondering, yes, the full system, including the database, can run well on a laptop.</p><p>The runtime cost mainly comes from maintaining the in-memory prefix tries for each full-feed router, each costing roughly 200 MB RAM. For the beta deployment, we use about 170 full-feed peers and the whole system runs well on a single 32 GB node with 12 threads.</p><h2>Using the BGP Hijack Detection</h2><p>The BGP Hijack Detection results are now available on both the <a href=\"https://radar.cloudflare.com/security-and-attacks\">Cloudflare Radar</a> website and the <a href=\"https://developers.cloudflare.com/api/operations/radar-get-bgp-hijacks-events\">Cloudflare Radar API</a>.</p><h3>Cloudflare Radar</h3><p>Under the “Security &amp; Attacks” section of the Cloudflare Radar for both global and ASN view, we now display the BGP origin hijacks table. In this table, we show a list of detected potential BGP hijack events with the following information:</p><ul><li><p>The detected and expected origin ASes;</p></li><li><p>The start time and event duration;</p></li><li><p>The number of BGP messages and route collectors peers that saw the event;</p></li><li><p>The announced prefixes;</p></li><li><p>Evidence tags and confidence level (on the likelihood of the event being a hijack).</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VwQO8aPGpngp78MrDyCmH/221681cec507a1fc7b731f03d9be707a/image3-6.png\" alt=\"\" class=\"kg-image\" width=\"1407\" height=\"532\" loading=\"lazy\"/>\n            \n            </figure><p>For each BGP event, our system generates relevant evidence tags to indicate why the event is considered suspicious or not. These tags are used to inform the confidence score assigned to each event. Red tags indicate evidence that increases the likelihood of a hijack event, while green tags indicate the opposite.</p><p>For example, the red tag &quot;RPKI INVALID&quot; indicates an event is likely a hijack, as it suggests that the RPKI validation failed for the announcement. Conversely, the tag &quot;SIBLING ORIGINS&quot; is a green tag that indicates the detected and expected origins belong to the same organization, making it less likely for the event to be a hijack.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/44EZVKQqIpl7O5tS7QrweM/2dddd47ea1da2f599c39f23404e9085c/Screenshot-2023-07-26-at-18.22.35.png\" alt=\"\" class=\"kg-image\" width=\"1612\" height=\"560\" loading=\"lazy\"/>\n            \n            </figure><p>Users can now access the BGP hijacks table in the following ways:</p><ol><li><p>Global view under <a href=\"https://radar.cloudflare.com/security-and-attacks\">Security &amp; Attacks</a> page without location filters. This view lists the most recent 150 detected BGP hijack events globally.</p></li><li><p>When filtered by a specific ASN, the table will appear on Overview, Traffic, and Traffic &amp; Attacks tabs.</p></li></ol><h3>Cloudflare Radar API</h3><p>We also provide programmable access to the BGP hijack detection results via the Cloudflare Radar API, which is freely available under <a href=\"https://radar.cloudflare.com/about\">CC BY-NC 4.0 license</a>. The API documentation is available at the <a href=\"https://developers.cloudflare.com/api/operations/radar-get-bgp-hijacks-events\">Cloudflare API portal</a>.</p><p>The following <code>curl</code> command fetches the most recent 10 BGP hijack events relevant to AS64512.</p>\n            <pre class=\"language-curl\"><code class=\"language-curl\">curl -X GET &quot;https://api.cloudflare.com/client/v4/radar/bgp/hijacks/events?invlovedAsn=64512&amp;format=json&amp;per_page=10&quot; \\\n    -H &quot;Authorization: Bearer &lt;API_TOKEN&gt;&quot;</pre></code>\n            <p>Users can further filter events with high confidence by specifying the <code>minConfidence</code> parameter with a 0-10 value, where a higher value indicates higher confidence of the events being a hijack. The following example expands on the previous example by adding the minimum confidence score of 8 to the query:</p>\n            <pre class=\"language-curl\"><code class=\"language-curl\">curl -X GET &quot;https://api.cloudflare.com/client/v4/radar/bgp/hijacks/events?invlovedAsn=64512&amp;format=json&amp;per_page=10&amp;minConfidence=8&quot; \\\n    -H &quot;Authorization: Bearer &lt;API_TOKEN&gt;&quot;</pre></code>\n            <p>Additionally, users can also quickly build custom hijack alerters using a Cloudflare <a href=\"https://developers.cloudflare.com/workers/wrangler/workers-kv/#workers-kv\">Workers + KV combination</a>. We have a full tutorial on building alerters that send out webhook-based messages or emails (with <a href=\"https://developers.cloudflare.com/email-routing/\">Email Routing</a>) available on the <a href=\"https://developers.cloudflare.com/radar/investigate/bgp-anomalies/\">Cloudflare Radar documentation site</a>.</p><h2>More routing security on Cloudflare Radar</h2><p>As we continue improving Cloudflare Radar, we are planning to introduce additional Internet routing and security data. For example, Radar will soon get a dedicated routing section to provide digestible BGP information for given networks or regions, such as distinct routable prefixes, RPKI valid/invalid/unknown routes, distribution of IPv4/IPv6 prefixes, etc. Our goal is to provide the best data and tools for routing security to the community, so that we can build a better and more secure Internet together.</p><p>Visit <a href=\"https://radar.cloudflare.com/\">Cloudflare Radar</a> for additional insights around (Internet disruptions, routing issues, Internet traffic trends, attacks, Internet quality, etc.). Follow us on social media at <a href=\"https://twitter.com/CloudflareRadar\">@CloudflareRadar</a> (Twitter), <a href=\"https://noc.social/@cloudflareradar\">https://noc.social/@cloudflareradar</a> (Mastodon), and <a href=\"https://bsky.app/profile/radar.cloudflare.com\">radar.cloudflare.com</a> (Bluesky), or contact us via <a href=\"mailto:radar@cloudflare.com\">e-mail</a>.</p>",
		"id": "33xptAfGQ0z94EAn4h1oKn",
		"localeList": {
			"name": "Cloudflare Radar's new BGP origin hijack detection system Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "BGP origin hijacks allow attackers to intercept, monitor, redirect, or drop traffic destined for the victim's networks. We explain how Cloudflare built its BGP hijack detection system, from its design and implementation to its integration on Cloudflare Radar.",
		"metadata": {
			"title": "Cloudflare Radar's new BGP origin hijack detection system",
			"description": "BGP origin hijacks allow attackers to intercept, monitor, redirect, or drop traffic destined for the victim's networks. We explain how Cloudflare built its BGP hijack detection system, from its design and implementation to its integration on Cloudflare Radar.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6NY0rBRaUqKcQtOOPTLS1f/ca181d30ff8ef5a0df2ed5a9015de67f/bgp-hijack-detection-pM5Jg9.png"
		},
		"primary_author": {},
		"published_at": "2023-07-28T14:00:26.000+01:00",
		"slug": "bgp-hijack-detection",
		"tags": [
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "5O7yCWW0RgXMAc5MVjwcGS",
				"name": "BGP",
				"slug": "bgp"
			},
			{
				"id": "1lRHgvVaFVTRtnN3m3UI6Q",
				"name": "Radar Alerts",
				"slug": "radar-alerts"
			}
		],
		"title": "Cloudflare Radar's new BGP origin hijack detection system",
		"updated_at": "2024-08-27T01:07:48.339Z",
		"url": "https://blog.cloudflare.com/bgp-hijack-detection"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}