{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "1",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Nikita Cano",
				"slug": "nikita",
				"bio": "Product Manager, Rules and Insights (Configuration Rules, Compression Rules, Page Rules, Redirect Rules, Origin Rules, Snippets, Trace, Traffic Sequence, Transform Rules, URL Normalization, etc.)",
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6hGB1W3bIJaibV4F7Qe0L8/56f554eeae28828297135a54eacc3065/nikita.jpeg",
				"location": "London, United Kingdom",
				"website": "https://nikitacano.com",
				"twitter": null,
				"facebook": null,
				"publiclyIndex": true
			},
			{
				"name": "Korinne Alpers",
				"slug": "korinne-alpers",
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5cfasTtVaoOsISarcB9F4Z/1686863c1bbd4dc0b74c7229cfcee42c/Korinne_Alpers.jpg",
				"publiclyIndex": true
			}
		],
		"excerpt": "Rust-powered core systems, post-quantum upgrades, developer access for students, PlanetScale integration, open-source partnerships, and our biggest internship program ever — 1,111 interns in 2026.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4o7ZlislB0NhFCy354yVhT/0a15a12961fbd507899843b2e6111b37/unnamed__37_.png",
		"featured": false,
		"html": "<p>Cloudflare launched fifteen years ago with a mission to help build a better Internet. Over that time the Internet has changed and so has what it needs from teams like ours.  In this year’s <a href=\"https://blog.cloudflare.com/cloudflare-2025-annual-founders-letter/\"><u>Founder’s Letter</u></a>, Matthew and Michelle discussed the role we have played in the evolution of the Internet, from helping encryption grow from 10% to 95% of Internet traffic to more recent challenges like how people consume content. </p><p>We spend Birthday Week every year releasing the products and capabilities we believe the Internet needs at this moment and around the corner. Previous <a href=\"https://blog.cloudflare.com/tag/birthday-week/\"><u>Birthday Weeks</u></a> saw the launch of <a href=\"https://blog.cloudflare.com/introducing-cloudflares-automatic-ipv6-gatewa/\"><u>IPv6 gateway</u></a> in 2011,  <a href=\"https://blog.cloudflare.com/introducing-universal-ssl/\"><u>Universal SSL</u></a> in 2014, <a href=\"https://blog.cloudflare.com/introducing-cloudflare-workers/\"><u>Cloudflare Workers</u></a> and <a href=\"https://blog.cloudflare.com/unmetered-mitigation/\"><u>unmetered DDoS protection</u></a> in 2017, <a href=\"https://blog.cloudflare.com/introducing-cloudflare-radar/\"><u>Cloudflare Radar</u></a> in 2020, <a href=\"https://blog.cloudflare.com/introducing-r2-object-storage/\"><u>R2 Object Storage</u></a> with zero egress fees in 2021,  <a href=\"https://blog.cloudflare.com/post-quantum-tunnel/\"><u>post-quantum upgrades for Cloudflare Tunnel</u></a> in 2022, <a href=\"https://blog.cloudflare.com/best-place-region-earth-inference/\"><u>Workers AI</u></a> and <a href=\"https://blog.cloudflare.com/announcing-encrypted-client-hello/\"><u>Encrypted Client Hello</u></a> in 2023. And those are just a sample of the launches.</p><p>This year’s themes focused on helping prepare the Internet for a new model of monetization that encourages great content to be published, fostering more opportunities to build community both inside and outside of Cloudflare, and evergreen missions like making more features available to everyone and constantly improving the speed and security of what we offer.</p><p>We shipped a lot of new things this year. In case you missed the dozens of blog posts, here is a breakdown of everything we announced during Birthday Week 2025. </p><p><b>Monday, September 22</b></p><table><tr><td><p><b>What</b></p></td><td><p><b>In a sentence …</b></p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/cloudflare-1111-intern-program/\"><b><u>Help build the future: announcing Cloudflare’s goal to hire 1,111 interns in 2026</u></b></a></p></td><td><p>To invest in the next generation of builders, we announced our most ambitious intern program yet with a goal to hire 1,111 interns in 2026.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/supporting-the-future-of-the-open-web/\"><b><u>Supporting the future of the open web: Cloudflare is sponsoring Ladybird and Omarchy</u></b></a></p></td><td><p>To support a diverse and open Internet, we are now sponsoring Ladybird (an independent browser) and Omarchy (an open-source Linux distribution and developer environment).</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/new-hubs-for-startups/\"><b><u>Come build with us: Cloudflare’s new hubs for startups</u></b></a></p></td><td><p>We are opening our office doors in four major cities (San Francisco, Austin, London, and Lisbon) as free hubs for startups to collaborate and connect with the builder community.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/ai-crawl-control-for-project-galileo/\"><b><u>Free access to Cloudflare developer services for non-profit and civil society organizations</u></b></a></p></td><td><p>We extended our Cloudflare for Startups program to non-profits and public-interest organizations, offering free credits for our developer tools.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/workers-for-students/\"><b><u>Introducing free access to Cloudflare developer features for students</u></b></a></p></td><td><p>We are removing cost as a barrier for the next generation by giving students with .edu emails 12 months of free access to our paid developer platform features.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/\"><b><u>Cap’n Web: a new RPC system for browsers and web servers</u></b></a></p></td><td><p>We open-sourced Cap&#39;n Web, a new JavaScript-native RPC protocol that simplifies powerful, schema-free communication for web applications.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/workers-launchpad-006/\"><b><u>A lookback at Workers Launchpad and a warm welcome to Cohort #6</u></b></a></p></td><td><p>We announced Cohort #6 of the Workers Launchpad, our accelerator program for startups building on Cloudflare.</p></td></tr></table><p><b>Tuesday, September 23</b></p><table><tr><td><p><b>What</b></p></td><td><p><b>In a sentence …</b></p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/per-customer-bot-defenses/\"><b><u>Building unique, per-customer defenses against advanced bot threats in the AI era</u></b></a></p></td><td><p>New anomaly detection system that uses machine learning trained on each zone to build defenses against AI-driven bot attacks. </p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/cloudflare-astro-tanstack/\"><b><u>Why Cloudflare, Netlify, and Webflow are collaborating to support Open Source tools</u></b></a></p></td><td><p>To support the open web, we joined forces with Webflow to sponsor Astro, and with Netlify to sponsor TanStack.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/x402/\"><b><u>Launching the x402 Foundation with Coinbase, and support for x402 transactions</u></b></a></p></td><td><p>We are partnering with Coinbase to create the x402 Foundation, encouraging the adoption of the <a href=\"https://github.com/coinbase/x402?cf_target_id=4D4A124640BFF471F5B56706F9A86B34\"><u>x402 protocol</u></a> to allow clients and services to exchange value on the web using a common language</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/ai-crawl-control-for-project-galileo/\"><b><u>Helping protect journalists and local news from AI crawlers with Project Galileo</u></b></a></p></td><td><p>We are extending our free Bot Management and AI Crawl Control services to journalists and news organizations through Project Galileo.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/confidence-score-rubric/\"><b><u>Cloudflare Confidence Scorecards - making AI safer for the Internet</u></b></a></p></td><td><p>Automated evaluation of AI and SaaS tools, helping organizations to embrace AI without compromising security.</p></td></tr></table><p><b>Wednesday, September 24</b></p><table><tr><td><p><b>What</b></p></td><td><p><b>In a sentence …</b></p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/automatically-secure/\"><b><u>Automatically Secure: how we upgraded 6,000,000 domains by default</u></b></a></p></td><td><p>Our Automatic SSL/TLS system has upgraded over 6 million domains to more secure encryption modes by default and will soon automatically enable post-quantum connections.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/content-signals-policy/\"><b><u>Giving users choice with Cloudflare’s new Content Signals Policy</u></b></a></p></td><td><p>The Content Signals Policy is a new standard for robots.txt that lets creators express clear preferences for how AI can use their content.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/building-a-better-internet-with-responsible-ai-bot-principles/\"><b><u>To build a better Internet in the age of AI, we need responsible AI bot principles</u></b></a></p></td><td><p>A proposed set of responsible AI bot principles to start a conversation around transparency and respect for content creators&#39; preferences.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/saas-to-saas-security/\"><b><u>Securing data in SaaS to SaaS applications</u></b></a></p></td><td><p>New security tools to give companies visibility and control over data flowing between SaaS applications.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/post-quantum-warp/\"><b><u>Securing today for the quantum future: WARP client now supports post-quantum cryptography (PQC)</u></b></a></p></td><td><p>Cloudflare’s WARP client now supports post-quantum cryptography, providing quantum-resistant encryption for traffic. </p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/a-simpler-path-to-a-safer-internet-an-update-to-our-csam-scanning-tool/\"><b><u>A simpler path to a safer Internet: an update to our CSAM scanning tool</u></b></a></p></td><td><p>We made our CSAM Scanning Tool easier to adopt by removing the need to create and provide unique credentials, helping more site owners protect their platforms.</p></td></tr></table><p>\n<b>Thursday, September 25</b></p><table><tr><td><p><b>What</b></p></td><td><p><b>In a sentence …</b></p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/enterprise-grade-features-for-all/\"><b><u>Every Cloudflare feature, available to everyone</u></b></a></p></td><td><p>We are making every Cloudflare feature, starting with Single Sign On (SSO), available for anyone to purchase on any plan. </p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/cloudflare-developer-platform-keeps-getting-better-faster-and-more-powerful/\"><b><u>Cloudflare&#39;s developer platform keeps getting better, faster, and more powerful</u></b></a></p></td><td><p>Updates across Workers and beyond for a more powerful developer platform – such as support for larger and more concurrent Container images, support for external models from OpenAI and Anthropic in AI Search (previously AutoRAG), and more. </p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/planetscale-postgres-workers/\"><b><u>Partnering to make full-stack fast: deploy PlanetScale databases directly from Workers</u></b></a></p></td><td><p>You can now connect Cloudflare Workers to PlanetScale databases directly, with connections automatically optimized by Hyperdrive.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/cloudflare-data-platform/\"><b><u>Announcing the Cloudflare Data Platform</u></b></a></p></td><td><p>A complete solution for ingesting, storing, and querying analytical data tables using open standards like Apache Iceberg. </p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/r2-sql-deep-dive/\"><b><u>R2 SQL: a deep dive into our new distributed query engine</u></b></a></p></td><td><p>A technical deep dive on R2 SQL, a serverless query engine for petabyte-scale datasets in R2.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/safe-in-the-sandbox-security-hardening-for-cloudflare-workers/\"><b><u>Safe in the sandbox: security hardening for Cloudflare Workers</u></b></a></p></td><td><p>A deep-dive into how we’ve hardened the Workers runtime with new defense-in-depth security measures, including V8 sandboxes and hardware-assisted memory protection keys.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/sovereign-ai-and-choice/\"><b><u>Choice: the path to AI sovereignty</u></b></a></p></td><td><p>To champion AI sovereignty, we&#39;ve added locally-developed open-source models from India, Japan, and Southeast Asia to our Workers AI platform.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/email-service/\"><b><u>Announcing Cloudflare Email Service’s private beta</u></b></a></p></td><td><p>We announced the Cloudflare Email Service private beta, allowing developers to reliably send and receive transactional emails directly from Cloudflare Workers.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/nodejs-workers-2025/\"><b><u>A year of improving Node.js compatibility in Cloudflare Workers</u></b></a></p></td><td><p>There are hundreds of new Node.js APIs now available that make it easier to run existing Node.js code on our platform. </p></td></tr></table><p><b>Friday, September 26</b></p><table><tr><td><p><b>What</b></p></td><td><p><b>In a sentence …</b></p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/20-percent-internet-upgrade\"><b><u>Cloudflare just got faster and more secure, powered by Rust</u></b></a></p></td><td><p>We have re-engineered our core proxy with a new modular, Rust-based architecture, cutting median response time by 10ms for millions. </p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com//introducing-observatory-and-smart-shield/\"><b><u>Introducing Observatory and Smart Shield</u></b></a></p></td><td><p>New monitoring tools in the Cloudflare dashboard that provide actionable recommendations and one-click fixes for performance issues.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/monitoring-as-sets-and-why-they-matter/\"><b><u>Monitoring AS-SETs and why they matter</u></b></a></p></td><td><p>Cloudflare Radar now includes Internet Routing Registry (IRR) data, allowing network operators to monitor AS-SETs to help prevent route leaks.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/an-ai-index-for-all-our-customers\"><b><u>An AI Index for all our customers</u></b></a></p></td><td><p>We announced the private beta of AI Index, a new service that creates an AI-optimized search index for your domain that you control and can monetize.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/new-regional-internet-traffic-and-certificate-transparency-insights-on-radar/\"><b><u>Introducing new regional Internet traffic and Certificate Transparency insights on Cloudflare Radar</u></b></a></p></td><td><p>Sub-national traffic insights and Certificate Transparency dashboards for TLS monitoring.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/eliminating-cold-starts-2-shard-and-conquer/\"><b><u>Eliminating Cold Starts 2: shard and conquer</u></b></a></p></td><td><p>We have reduced Workers cold starts by 10x by implementing a new &quot;worker sharding&quot; system that routes requests to already-loaded Workers.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/network-performance-update-birthday-week-2025/\"><b><u>Network performance update: Birthday Week 2025</u></b></a></p></td><td><p>The TCP Connection Time (Trimean) graph shows that we are the fastest TCP connection time in 40% of measured ISPs – and the fastest across the top networks.</p></td></tr><tr><td><p><a href=\"https://blog.cloudflare.com/how-cloudflare-uses-the-worlds-greatest-collection-of-performance-data/\"><b><u>How Cloudflare uses performance data to make the world’s fastest global network even faster</u></b></a></p></td><td><p>We are using our network&#39;s vast performance data to tune congestion control algorithms, improving speeds by an average of 10% for QUIC traffic.\n</p></td></tr></table>\n    <div class=\"flex anchor relative\">\n      <h3 id=\"come-build-with-us\">Come build with us!</h3>\n      <a href=\"#come-build-with-us\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>Helping build a better Internet has always been about more than just technology. Like the announcements about interns or working together in our offices, the community of people behind helping build a better Internet matters to its future. This week, we rolled out our most ambitious set of initiatives ever to support the builders, founders, and students who are creating the future.</p><p>For founders and startups, we are thrilled to welcome <b>Cohort #6</b> to the <b>Workers Launchpad</b>, our accelerator program that gives early-stage companies the resources they need to scale. But we’re not stopping there. We’re opening our doors, literally, by launching <b>new physical hubs for startups</b> in our San Francisco, Austin, London, and Lisbon offices. These spaces will provide access to mentorship, resources, and a community of fellow builders.</p><p>We’re also investing in the next generation of talent. We announced <b>free access to the Cloudflare developer platform for all students</b>, giving them the tools to learn and experiment without limits. To provide a path from the classroom to the industry, we also announced our goal to hire <b>1,111 interns in 2026</b> — our biggest commitment yet to fostering future tech leaders.</p><p>And because a better Internet is for everyone, we’re extending our support to <b>non-profits and public-interest organizations</b>, offering them free access to our production-grade developer tools, so they can focus on their missions.</p><p>Whether you&#39;re a founder with a big idea, a student just getting started, or a team working for a cause you believe in, we want to help you succeed.</p>\n    <div class=\"flex anchor relative\">\n      <h3 id=\"until-next-year\">Until next year</h3>\n      <a href=\"#until-next-year\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>Thank you to our customers, our community, and the millions of developers who trust us to help them build, secure, and accelerate the Internet. Your curiosity and feedback drive our innovation.</p><p>It’s been an incredible 15 years. And as always, we’re just getting started!</p>",
		"id": "4k1NhJtljIsH7GOkpHg1Ei",
		"localeList": {
			"name": "blog-english-only",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Cloudflare just turned 15! Birthday Week 2025 celebrated innovation at scale: Rust-powered core systems, post-quantum upgrades, developer access for students, PlanetScale integration, open-source partnerships, and our biggest internship program ever — 1,111 interns in 2026.",
		"metadata": {
			"title": "15 years of helping build a better Internet: A look back at Birthday Week 2025",
			"description": "Cloudflare just turned 15! Birthday Week 2025 celebrated innovation at scale: Rust-powered core systems, post-quantum upgrades, developer access for students, PlanetScale integration, open-source partnerships, and our biggest internship program ever — 1,111 interns in 2026.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2zbjXPDrTva3PsfI0LXpH0/1be8467639262d3c946ae07e846d4c85/15_years_of_helping_build_a_better_Internet-_a_look_back_at_Birthday_Week_2025-OG.png"
		},
		"primary_author": {},
		"publicly_index": true,
		"published_at": "2025-09-29T14:00+00:00",
		"slug": "birthday-week-2025-wrap-up",
		"tags": [
			{
				"id": "1Cv5JjXzKWKEA10JdYbXu1",
				"name": "Birthday Week",
				"slug": "birthday-week"
			},
			{
				"id": "V86khSc459Yi1AhTlvtY7",
				"name": "Partners",
				"slug": "partners"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			},
			{
				"id": "5Ol0Sw9kBTwIstJ84njaO7",
				"name": "Workers Launchpad",
				"slug": "workers-launchpad"
			},
			{
				"id": "4gN0ARax0fHxjtZL07THOe",
				"name": "Performance",
				"slug": "performance"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "5RrjSR5vIOJAfRdT8966hf",
				"name": "Cache",
				"slug": "cache"
			},
			{
				"id": "1OAcGRrbAS8T2hKb2tqB7N",
				"name": "Speed",
				"slug": "speed"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "6Foe3R8of95cWVnQwe5Toi",
				"name": "AI",
				"slug": "ai"
			},
			{
				"id": "2FQK880QI5lKEUCjVHBber",
				"name": "1.1.1.1",
				"slug": "1-1-1-1"
			},
			{
				"id": "urEf9QllkDeGxTu3ysdlo",
				"name": "Application Security",
				"slug": "application-security"
			},
			{
				"id": "36Dg2NwTgUHhrlE0FRpSdJ",
				"name": "Application Services",
				"slug": "application-services"
			},
			{
				"id": "4l3WDYLk6bXCyaRc9pRzXa",
				"name": "Bots",
				"slug": "bots"
			},
			{
				"id": "3aRZvV7ApVpkYKGhnNQH4w",
				"name": "CDN",
				"slug": "cdn"
			},
			{
				"id": "5tk59ZFOQlw6hnNzbDnhZJ",
				"name": "Cloudflare for Startups",
				"slug": "cloudflare-for-startups"
			},
			{
				"id": "4Z2oveL0P0AeqGa5lL4Vo1",
				"name": "Cloudflare One",
				"slug": "cloudflare-one"
			},
			{
				"id": "3QNaVNNpUXrfZYUGDJkXwA",
				"name": "Cloudflare Zero Trust",
				"slug": "cloudflare-zero-trust"
			},
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			}
		],
		"title": "15 years of helping build a better Internet: a look back at Birthday Week 2025",
		"updated_at": "2025-09-29T13:00:10.453Z",
		"url": "https://blog.cloudflare.com/birthday-week-2025-wrap-up"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.icon_aria_label": "Search",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"search.result_stat_empty": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong>",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"search.autocomplete_title": "Insert a query. Press enter to send",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}