{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Sofia Cardita",
				"slug": "sofia-cardita",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2ra2NnooW35NsF7j6AyeY5/a689b00898cd5f98523386d89295fefd/sofia-cardita.png",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Alexandra Moraru",
				"slug": "alexandra",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/URwbDrA0k9GNtNsCsAC7N/01aed0a80ca42a6fe058097aa2992f86/alexandra.png",
				"location": "London",
				"website": null,
				"twitter": "@alexandramoraru",
				"facebook": null
			}
		],
		"excerpt": "Discover the enhanced URL Scanner API: Now with direct access from the Security Center Investigate Portal, enjoy unlisted scans, multi-device screenshots, and seamless integration within the Cloudflare ecosystem",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4BNpAm0wkigASQsSv0ERjB/9b51fe250f8a7eed60de9019dfb821be/building-urlscanner.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3eSANAscXnEBIAQrZDXEEs/6c78bdca9b6bab049ff98436e6e7437b/image3-25.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>Today, we’re excited to talk about <a href=\"https://radar.cloudflare.com/scan\">URL Scanner</a>, a tool that helps everyone from security teams to everyday users to detect and safeguard against malicious websites by scanning and analyzing them. URL Scanner has executed almost a million scans since its <a href=\"/radar-url-scanner-early-access/\">launch</a> last March on <a href=\"https://radar.cloudflare.com/scan\">Cloudflare Radar</a>, driving us to continuously innovate and enhance its capabilities. Since that time, we have introduced unlisted scans, detailed malicious verdicts, enriched search functionality, and now, integration with Security Center and an official API, all built upon the robust foundation of <a href=\"https://developers.cloudflare.com/workers/\">Cloudflare Workers</a>, <a href=\"https://developers.cloudflare.com/workers/runtime-apis/durable-objects/\">Durable Objects</a>, and the <a href=\"/browser-rendering-open-beta/\">Browser Rendering API</a>.</p><h2>Integration with the Security Center in the Cloudflare Dashboard</h2><p>Security Center is the single place in the Cloudflare Dashboard to map your <a href=\"https://www.cloudflare.com/learning/security/what-is-an-attack-surface/\">attack surface</a>, identify potential security risks, and mitigate risks with a few clicks. Its users can now access the URL scanner directly from the <a href=\"https://developers.cloudflare.com/security-center/investigate/\">Investigate Portal</a>, enhancing their cybersecurity workflow. These scans will be unlisted by default, ensuring privacy while facilitating a deep dive into website security. Users will be able to see their historic scans and access the related reports when they need to, and they will benefit from automatic screenshots for multiple screen sizes, enriching the context of each scan.</p><p>Customers with Cloudflare dashboard access will enjoy higher API limits and faster response times, crucial for agile security operations. Integration with internal workflows becomes seamless, allowing for sophisticated network and user protection strategies.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5xsq5tQ1cjM8cQwnCRUCmh/f315a8104811c503fed06f215d8b6041/image2-24.png\" alt=\"Security Center in the Cloudflare Dashboard\" class=\"kg-image\" width=\"888\" height=\"988\" loading=\"lazy\"/>\n            \n            </figure><p><i>Security Center in the Cloudflare Dashboard</i></p><h2>Unlocking the potential of the URL Scanner API</h2><p>The <a href=\"https://developers.cloudflare.com/radar/investigate/url-scanner/\">URL Scanner API</a> is a powerful asset for developers, enabling custom scans to detect <a href=\"https://www.cloudflare.com/learning/access-management/phishing-attack/\">phishing</a> or <a href=\"https://www.cloudflare.com/learning/ddos/glossary/malware/\">malware</a> risks, analyze website technologies, and much more. With new features like custom HTTP headers and multi-device screenshots, developers gain a comprehensive toolkit for thorough website assessment.</p><h3>Submitting a scan request</h3><p>Using the API, here’s the simplest way to <a href=\"https://developers.cloudflare.com/api/operations/urlscanner-create-scan\">submit</a> a scan request:</p>\n            <pre class=\"language-curl\"><code class=\"language-curl\">curl --request POST \\\n\t--url https://api.cloudflare.com/client/v4/accounts/&lt;accountId&gt;/urlscanner/scan \\\n\t--header &#039;Content-Type: application/json&#039; \\\n--header &quot;Authorization: Bearer &lt;API_TOKEN&gt;&quot; \\\n\t--data &#039;{\n\t\t&quot;url&quot;: &quot;https://www.cloudflare.com&quot;,\n\t}&#039;</pre></code>\n            <p>New features include the option to set custom HTTP headers, like <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/User_agent\">User-Agent</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Authorization\">Authorization</a>, request multiple target device screenshots, like mobile and desktop, as well as set the visibility level to “unlisted”. This essentially marks the scan as private and was often requested by developers who wanted to keep their investigations confidential. Public scans, on the other hand, can be found by anyone through search and are useful to share results with the wider community. You can find more details in our <a href=\"https://developers.cloudflare.com/radar/investigate/url-scanner/\">developer documentation</a>.</p><h3>Exploring the scan results</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2NRMloVOilGBXsYy12xeeT/8202728097a541d3bd027d51892e1bb4/image5-16.png\" alt=\"Scan results for www.cloudflare.com on Cloudflare Radar\" class=\"kg-image\" width=\"1999\" height=\"1185\" loading=\"lazy\"/>\n            \n            </figure><p><i>Scan results for</i> <a href=\"http://www.cloudflare.com\"><i>www.cloudflare.com</i></a> <i>on Cloudflare Radar</i></p><p>Once a scan concludes, fetch the final <a href=\"https://developers.cloudflare.com/api/operations/urlscanner-get-scan\">report</a> and the full <a href=\"https://developers.cloudflare.com/api/operations/urlscanner-get-scan-har\">network log</a>. Recently added features include the `verdict` property, indicating the site’s malicious status, and the `securityViolations` section detailing <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/CSP\">CSP</a> or <a href=\"https://developer.mozilla.org/en-US/docs/Web/Security/Subresource_Integrity\">SRI</a> policy breaches — as a developer, you can also scan your own website and see our recommendations. Expect improvements on verdict accuracy over time, as this is an area we’re focusing on.</p><h3>Enhanced search functionality</h3><p>Developers can now <a href=\"https://developers.cloudflare.com/api/operations/urlscanner-search-scans\">search</a> scans by hostname, a specific URL or even <i>any</i> URL the page connected to during the scan. This allows, for example, to search for websites that use a JavaScript library named jquery.min.js (‘?path=jquery.min.js’). Future plans include additional features like searching by IP address, <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-an-autonomous-system/\">ASN</a>, and malicious website categorisation.</p><p>The URL Scanner can be used for a diverse range of applications. These include capturing a website&#39;s evolving state over time (such as tracking changes to the front page of an online newspaper), analyzing technologies employed by a website, preemptively assessing potential risks (as when scrutinizing shortened URLs), and supporting the investigation of persistent cybersecurity threats (such as identifying affected websites hosting a malicious JavaScript file).</p><h2>How we built the URL Scanner API</h2><p>In recounting the process of developing the URL Scanner, we aim to showcase the potential and versatility of Cloudflare Workers as a platform. This story is more than a technical journey, but a testament to the capabilities inherent in our platform&#39;s suite of APIs. By dogfooding our own technology, we not only demonstrate confidence in its robustness but also encourage developers to harness the same capabilities for building sophisticated applications. The URL Scanner exemplifies how Cloudflare Workers, Durable Objects, and the Browser Rendering API seamlessly integrate.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/55HCrSeFuu3FUjcjjIXJyl/3eebc727f0034d32e54526c6a50f939a/image4-23.png\" alt=\"High level overview of the Cloudflare URL Scanner technology stack\" class=\"kg-image\" width=\"1999\" height=\"564\" loading=\"lazy\"/>\n            \n            </figure><p><i><i>High level overview of the</i></i><i> </i><i><i>Cloudflare URL Scanner technology stack</i></i></p><p>As seen above, Cloudflare’s runtime infrastructure is the foundation the system runs on. <a href=\"https://developers.cloudflare.com/workers/\">Cloudflare Workers</a> serves the public API, <a href=\"https://developers.cloudflare.com/workers/runtime-apis/durable-objects/\">Durable Objects</a> handles orchestration, <a href=\"https://developers.cloudflare.com/r2/\">R2</a> acts as the primary storage solution, and <a href=\"https://developers.cloudflare.com/queues/\">Queues</a> efficiently handles batch operations, all at the edge. However, what truly enables the URL Scanner’s capabilities is the <a href=\"https://developers.cloudflare.com/browser-rendering/\">Browser Rendering API</a>. It’s what initially allowed us to release in such a short time frame, since we didn’t have to build and manage an entire fleet of Chrome browsers from scratch. We simply request a browser, and then using the well known <a href=\"https://pptr.dev/\">Puppeteer</a> library, instruct it to fetch the webpage and process it in the way we want. This API is at the heart of the entire system.</p><h3>Scanning a website</h3><p>The entire process of scanning a website, can be split into 4 phases:</p><ol><li><p>Queue a scan</p></li><li><p>Browse to the website and compile initial report</p></li><li><p>Post-process: compile additional information and build final report</p></li><li><p>Store final report, ready for serving and searching</p></li></ol>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5AUAfO5VBEUvbRlYwoJ5zL/dedd5666ad32c6824d8b53eecb934ab0/image1-28.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"438\" loading=\"lazy\"/>\n            \n            </figure><p>In short, we create a Durable Object, the Scanner, unique to each scan, which is responsible for orchestrating the scan from start to finish. Since we want to respond immediately to the user, we save the scan to the Durable Object’s transactional Key-Value storage, and schedule an alarm so we can perform the scan asynchronously a second later.  We then respond to the user, informing them that the scan request was accepted.</p><p>When the Scanner’s alarm triggers, we enter the second phase:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4qnzMmDQbPtWmyIClv6680/f251bd874d45b397013355d804a1b292/image7-5.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"878\" loading=\"lazy\"/>\n            \n            </figure><p>There are 3 components at work in this phase, the Scanner, the Browser Pool and the Browser Controller, all <a href=\"https://developers.cloudflare.com/workers/runtime-apis/durable-objects/\">Durable Objects</a>.</p><p>In the initial release, for each new scan we would launch a brand-new browser. However, This operation would take time and was inefficient, so after review, we decided to reuse browsers across multiple scans. This is why we introduced both the Browser Pool and the Browser Controller components. The Browser Pool keeps track of what browsers we have open, when they last pinged the browser pool (so it knows they’re alive), and whether they’re free to accept a new scan. The Browser Controller is responsible for keeping the browser instance alive, once it’s launched, and orchestrating (ahem, <a href=\"http://pptr.dev\">puppeteering</a>) the entire browsing session. Here’s a simplified version of our Browser Controller code:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">export class BrowserController implements DurableObject {\n\t//[..]\n\tprivate async handleNewScan(url: string) {\n\t\tif (!this.browser) {\n\t\t\t// Launch browser: 1st request to durable object\n\t\t\tthis.browser = await puppeteer.launch(this.env.BROWSER)\n\t\t\tawait this.state.storage.setAlarm(Date.now() + 5 * 1000)\n\t\t}\n\t\t// Open new page and navigate to url\n\t\tconst page = await this.browser.newPage()\n\t\tawait page.goto(url, { waitUntil: &#039;networkidle2&#039;, timeout: 5000, })\n\n\t\t// Capture DOM\n\t\tconst dom = await page.content()\n\n\t\t// Clean up\n\t\tawait page.close()\n\n\t\treturn {\n\t\t\tdom: dom,\n\t\t}\n\t}\n\n\tasync alarm() {\n\t\tif (!this.browser) {\n\t\t\treturn\n\t\t}\n\t\tawait this.browser.version() // stop websocket connection to Chrome from going idle\n\t\t\n\t\t// ping browser pool, let it know we&#039;re alive\n\t\t\n\t\t// Keep durable object alive\n\t\tawait this.state.storage.setAlarm(Date.now() + 5 * 1000)\n\t}\n}</pre></code>\n            <p>Launching a browser (Step 6) and maintaining a connection to it is abstracted away from us thanks to the <a href=\"/browser-rendering-open-beta/\">Browser Rendering API</a>. This API is responsible for all the infrastructure required to maintain a fleet of Chrome browsers, and led to a much quicker development and release of the URL Scanner. It also allowed us to use a well-known library, <a href=\"https://pptr.dev/\">Puppeteer</a>, to communicate with Google Chrome via the <a href=\"https://chromedevtools.github.io/devtools-protocol/\">DevTools</a> protocol.</p><p>The initial report is made up of the network log of all requests, captured in <a href=\"https://en.wikipedia.org/wiki/HAR_(file_format)\">HAR</a> (HTTP Archive) format. HAR files, essentially JSON files, provide a detailed record of all interactions between a web browser and a website. As an established standard in the industry, HAR files can be easily <a href=\"https://developers.cloudflare.com/api/operations/urlscanner-get-scan-har\">shared</a> and analyzed using specialized <a href=\"https://toolbox.googleapps.com/apps/har_analyzer/\">tools</a>. In addition to this network log, we augment our dataset with an array of other metadata, including base64-encoded screenshots which provide a snapshot of the website at the moment of the scan.</p><p>Having this data, we transition to phase 3, where the Scanner Durable Object initiates a series of interactions with a few other Cloudflare APIs in order to collect additional information, like running a phishing scanner over the web page&#39;s Document Object Model (DOM), fetching <a href=\"https://www.cloudflare.com/learning/dns/dns-records/\">DNS records</a>, and extracting information about <a href=\"https://developers.cloudflare.com/api/operations/domain-intelligence-get-domain-details\">categories</a> and <a href=\"https://developers.cloudflare.com/api/operations/radar-get-ranking-domain-details\">Radar rank</a> associated with the main hostname.</p><p>This process ensures that the final report is enriched with insights coming from different sources, making the URL Scanner more efficient in assessing websites. Once all the necessary information is collected, we compile the final report and store it as a JSON file within <a href=\"https://developers.cloudflare.com/r2\">R2</a>, Cloudflare’s object storage solution. To empower users with efficient scan searches, we use Postgres.</p><p>While the initial approach involved sending each completed scan promptly to the core API for immediate storage in Postgres, we realized that, as the rate of scans grew, a more efficient strategy would be to batch those operations, and for that, we use Worker Queues:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1gyX0lHVmgVGhmYZeyipcM/ff87f8dbfdaff32775b8c5f454ccd40c/image6-8.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"469\" loading=\"lazy\"/>\n            \n            </figure><p>This allows us to better manage the write load on Postgres. We wanted scans available as soon as possible to those who requested them, but it’s ok if they’re only available in search results at a slightly later point in time (seconds to minutes, depending on load).</p><p>In short, <a href=\"https://developers.cloudflare.com/workers/runtime-apis/durable-objects/\">Durable Objects</a> together with the <a href=\"/browser-rendering-open-beta/\">Browser Rendering API</a> power the entire scanning process. Once that’s finished, the Cloudflare Worker serving the API will simply fetch it from <a href=\"https://developers.cloudflare.com/r2/\">R2</a> by ID. All together, Workers, Durable Objects, and R2 scale seamlessly and will allow us to grow as demand evolves.</p><h3>Last but not least</h3><p>While we&#39;ve extensively covered the URL scanning workflow, we&#39;ve yet to delve into the construction of the API worker itself. Developed with <a href=\"https://www.typescriptlang.org/\">Typescript</a>, it uses <a href=\"https://github.com/cloudflare/itty-router-openapi\">itty-router-openapi</a>, a Javascript router with <a href=\"https://spec.openapis.org/oas/v3.1.0\">Open API 3</a> schema generation and validation, originally built for <a href=\"https://radar.cloudflare.com/\">Radar</a>, but that’s been improving ever since with contributions from the community. Here’s a quick example of how to set up an endpoint, with input validation built in:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">import { DateOnly, OpenAPIRoute, Path, Str, OpenAPIRouter } from &#039;@cloudflare/itty-router-openapi&#039;\n\nimport { z } from &#039;zod&#039;\nimport { OpenAPIRoute, OpenAPIRouter, Uuid } from &#039;@cloudflare/itty-router-openapi&#039;\n\nexport class ScanMetadataCreate extends OpenAPIRoute {\n  static schema = {\n    tags: [&#039;Scans&#039;],\n    summary: &#039;Create Scan metadata&#039;,\n    requestBody: {\n      scan_id: Uuid,\n      url: z.string().url(),\n      destination_ip: z.string().ip(),\n      timestamp: z.string().datetime(),\n      console_logs: [z.string()],\n    },\n  }\n\n  async handle(\n    request: Request,\n    env: any,\n    context: any,\n    data: any,\n  ) {\n    // Retrieve validated scan\n    const newScanMetadata = data.body\n\n    // Insert the scan\n\n    // Return scan as json\n    return newScanMetadata\n  }\n}\n\n\nconst router = OpenAPIRouter()\nrouter.post(&#039;/scan/metadata/&#039;, ScanMetadataCreate)\n\n// 404 for everything else\nrouter.all(&#039;*&#039;, () =&gt; new Response(&#039;Not Found.&#039;, { status: 404 }))\n\nexport default {\n  fetch: router.handle,\n}</pre></code>\n            <p>In the example above, the ScanMetadataCreate endpoint will make sure to validate the incoming POST data to match the defined schema before calling the ‘async handle(request,env,context,data)’ function. This way you can be sure that if your code is called, the data argument will always be validated and formatted.</p><p>You can learn more about the project on its <a href=\"https://github.com/cloudflare/itty-router-openapi\">GitHub page</a>.</p><h2>Future plans and new features</h2><p>Looking ahead, we&#39;re committed to further elevating the URL Scanner&#39;s capabilities. Key upcoming features include geographic scans, where users can customize the location that the scan is done from, providing critical insights into regional security threats and content compliance; expanded scan details, including more comprehensive headers and security details; and continuous performance improvements and optimisations, so we can deliver faster scan results.</p><p>The evolution of the URL Scanner is a reflection of our commitment to Internet safety and innovation. Whether you&#39;re a developer, a security professional, or simply invested in the safety of the digital landscape, the URL Scanner API offers a comprehensive suite of tools to enhance your efforts. Explore the new features today, and join us in shaping a safer Internet for everyone.</p><p>Remember, while Security Center&#39;s new capabilities offer advanced tools for URL Scanning for Cloudflare’s existing customers, the URL Scanner remains accessible for basic scans to the public on <a href=\"https://radar.cloudflare.com/scan\">Cloudflare Radar</a>, ensuring our technology benefits a broad audience.</p><p>If you’re considering a new career direction, check out <a href=\"https://cloudflare.com/careers\">our open positions</a>. We’re looking for individuals who want to help make the Internet better; learn more about our mission <a href=\"https://www.cloudflare.com/learning/what-is-cloudflare/\">here</a>.</p>",
		"id": "1JMMDhLvjentdgwo5df7bC",
		"localeList": {
			"name": "Cloudflare’s URL Scanner, new features, and the story of how we built it Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Discover the enhanced URL Scanner API: Now with direct access from the Security Center Investigate Portal, enjoy unlisted scans, multi-device screenshots, and seamless integration within the Cloudflare ecosystem. Perfect for developers and security professionals looking to elevate their website security assessments.",
		"metadata": {
			"title": "Cloudflare’s URL Scanner, new features, and the story of how we built it",
			"description": "Discover the enhanced URL Scanner API: Now with direct access from the Security Center Investigate Portal, enjoy unlisted scans, multi-device screenshots, and seamless integration within the Cloudflare ecosystem. Perfect for developers and security professionals looking to elevate their website security assessments.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/x3VFG9uijYvrs1ZuheZEd/0f01960b13f17991f5a6b37670d89799/building-urlscanner-lS3ALO.png"
		},
		"primary_author": {},
		"published_at": "2024-03-08T14:00:09.000+00:00",
		"slug": "building-urlscanner",
		"tags": [
			{
				"id": "3DmitkNK6euuD5BlhuvOLW",
				"name": "Security Week",
				"slug": "security-week"
			},
			{
				"id": "7istncjMVi8w4NkvT8mjsw",
				"name": "URL Scanner",
				"slug": "url-scanner"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "5x72ei67SoD11VQ0uqFtpF",
				"name": "API",
				"slug": "api"
			}
		],
		"title": "Cloudflare’s URL Scanner, new features, and the story of how we built it",
		"updated_at": "2024-08-27T00:59:33.685Z",
		"url": "https://blog.cloudflare.com/building-urlscanner"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}