{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"ko-kr",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Vy Ton",
				"slug": "vy",
				"bio": "Product Manager at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/47vp9vXZx8EXsnBFmCK8NS/2c9dc8e014ad1488da0a8985d4fb2e5f/vy.png",
				"location": null,
				"website": null,
				"twitter": "@vaiton13",
				"facebook": null
			},
			{
				"name": "Justin Mazzola Paluska",
				"slug": "justin-mazzola-paluska",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/kWY2RGoxbmCclJWHvUydC/6dfcf11c2914e2bb52648c8d31d34799/justin-mazzola-paluska.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "D1, Cloudflare’s SQL database, is now generally available. With new support for 10GB databases, data export, and enhanced query debugging, we empower developers to build production-ready applications with D1 to meet all their relational SQL needs",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/RjwMi9G4wj7Nywb50DT8B/3dbf9ec7e144818363ae9a59942a544d/building-d1-a-global-database.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/76hMKeBHewbCLm4XlVS4zL/3bf95667f0256177dc651f44ce33e2eb/image2-33.png\" alt=\"\" class=\"kg-image\" width=\"1800\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Developers who build Worker applications focus on what they&#39;re creating, not the infrastructure required, and benefit from the global reach of <a href=\"https://www.cloudflare.com/network/\">Cloudflare&#39;s network</a>. Many applications require persistent data, from personal projects to business-critical workloads. Workers offer various <a href=\"https://developers.cloudflare.com/workers/platform/storage-options/\">database and storage options</a> tailored to developer needs, such as key-value and object storage.</p><p>Relational databases are the backbone of many applications today. <a href=\"https://developers.cloudflare.com/d1/\">D1</a>, Cloudflare&#39;s relational database complement, is now generally available. Our journey from alpha in late 2022 to GA in April 2024 focused on enabling developers to build production workloads with the familiarity of relational data and SQL.</p><h3>What’s D1?</h3><p>D1 is Cloudflare&#39;s built-in, serverless relational database. For Worker applications, D1 offers SQL&#39;s expressiveness, leveraging SQLite&#39;s SQL dialect, and developer tooling integrations, including object-relational mappers (ORMs) like <a href=\"https://github.com/drizzle-team/drizzle-orm/blob/main/examples/cloudflare-d1/README.md\">Drizzle ORM</a>. D1 is accessible via <a href=\"https://developers.cloudflare.com/d1/build-with-d1/d1-client-api/\">Workers</a> or an <a href=\"https://developers.cloudflare.com/api/operations/cloudflare-d1-create-database\">HTTP API</a>.</p><p>Serverless means no provisioning, default disaster recovery with <a href=\"https://developers.cloudflare.com/d1/reference/time-travel/\">Time Travel</a>, and <a href=\"https://developers.cloudflare.com/d1/platform/pricing/\">usage-based pricing</a>. D1 includes a generous free tier that allows developers to experiment with D1 and then graduate those trials to production.</p><h3>How to make data global?</h3><p>D1 GA has focused on reliability and developer experience. Now, we plan on extending D1 to better support globally-distributed applications.</p><p>In the Workers model, an incoming request invokes serverless execution in the closest data center. A Worker application can scale globally with user requests. Application data, however, remains stored in centralized databases, and global user traffic must account for access round trips to data locations. For example, a D1 database today resides in a single location.</p><p>Workers support <a href=\"https://developers.cloudflare.com/workers/configuration/smart-placement\">Smart Placement</a> to account for frequently accessed data locality. Smart Placement invokes a Worker closer to centralized backend services like databases to lower latency and improve application performance. We’ve addressed Workers placement in global applications, but need to solve data placement.</p><p>The question, then, is how can D1, as Cloudflare’s built-in database solution, better support data placement for global applications? The answer is asynchronous read replication.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1I58tQFeSOcIyqrGfv9UnB/cad196a172cd0c5ff4000bac916848f4/image4-30.png\" alt=\"\" class=\"kg-image\" width=\"1800\" height=\"590\" loading=\"lazy\"/>\n            \n            </figure><h3>What is asynchronous read replication?</h3><p>In a server-based database management system, like Postgres, MySQL, SQL Server, or Oracle, a <b><i>read replica</i></b> is a separate database server that serves as a read-only, almost up-to-date copy of the primary database server. An administrator creates a read replica by starting a new server from a snapshot of the primary server and configuring the primary server to send updates asynchronously to the replica server. Since the updates are asynchronous, the read replica may be behind the current state of the primary server. The difference between the primary server and a replica is called <b><i>replica lag</i></b>. It&#39;s possible to have more than one read replica.</p><p>Asynchronous read replication is a time-proven solution for improving the performance of databases:</p><ul><li><p>It&#39;s possible to increase throughput by distributing load across multiple replicas.</p></li><li><p>It&#39;s possible to lower query latency when the replicas are close to the users making queries.</p></li></ul><p>Note that some database systems also offer synchronous replication. In a synchronous replicated system, writes must wait until all replicas have confirmed the write. Synchronous replicated systems can run only as fast as the slowest replica and come to a halt when a replica fails. If we’re trying to improve performance on a global scale, we want to avoid synchronous replication as much as possible!</p><h3>Consistency models &amp; read replicas</h3><p>Most database systems provide <a href=\"https://jepsen.io/consistency/models/read-committed\">read committed</a>, <a href=\"https://jepsen.io/consistency/models/snapshot-isolation\">snapshot isolation</a>, or <a href=\"https://jepsen.io/consistency/models/serializable\">serializable</a> consistency models, depending on their configuration. For example, Postgres <a href=\"https://jepsen.io/consistency/models/read-committed\">defaults to read committed</a> but can be configured to use stronger modes. SQLite provides <a href=\"https://www.sqlite.org/draft/isolation.html\">snapshot isolation in WAL mode</a>. Stronger modes like snapshot isolation or serializable are easier to program against because they limit the permitted system concurrency scenarios and the kind of concurrency race conditions the programmer has to worry about.</p><p>Read replicas are updated independently, so each replica&#39;s contents may differ at any moment. If all of your queries go to the same server, whether the primary or a read replica, your results should be consistent according to whatever <a href=\"https://jepsen.io/consistency\">consistency model</a> your underlying database provides. If you&#39;re using a read replica, the results may just be a little old.</p><p>In a server-based database with read replicas, it&#39;s important to stick with the same server for all of the queries in a session. If you switch among different read replicas in the same session, you compromise the consistency model provided by your application, which may violate your assumptions about how the database acts and cause your application to return incorrect results!</p><p><b>Example</b>For example, there are two replicas, A and B. Replica A lags the primary database by 100ms, and replica B lags the primary database by 2s. Suppose a user wishes to:</p><ol><li><p>Execute query 11a. Do some computation based on query 1 results</p></li><li><p>Execute query 2 based on the results of the computation in (1a)</p></li></ol><p>At time t=10s, query 1 goes to replica A and returns. Query 1 sees what the primary database looked like at t=9.9s. Suppose it takes 500ms to do the computation, so at t=10.5s, query 2 goes to replica B. Remember, replica B lags the primary database by 2s, so at t=10.5s, query 2 sees what the database looks like at t=8.5s. As far as the application is concerned, the results of query 2 look like the database has gone backwards in time!</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2R1p29j20c7szuRmY2Sjlp/d3da1494232913b556806d624a0c8f14/image3-34.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"510\" loading=\"lazy\"/>\n            \n            </figure><p>Formally, this is <a href=\"https://jepsen.io/consistency/models/read-committed\">read committed</a> consistency since your queries will only see committed data, but there’s no other guarantee - not even that you can read your own writes. While read committed is a valid consistency model, it’s hard to reason about all of the possible race conditions the read committed model allows, making it difficult to write applications correctly.</p><h3>D1’s consistency model &amp; read replicas</h3><p>By default, D1 provides the <a href=\"https://jepsen.io/consistency/models/snapshot-isolation\">snapshot isolation</a> that SQLite provides.</p><p>Snapshot isolation is a familiar consistency model that most developers find easy to use. We implement this consistency model in D1 by ensuring at most one active copy of the D1 database and routing all HTTP requests to that single database. While ensuring that there&#39;s at most one active copy of the D1 database is a gnarly distributed systems problem, it&#39;s one that we’ve solved by building D1 using <a href=\"https://developers.cloudflare.com/durable-objects/\">Durable Objects</a>. Durable Objects guarantee global uniqueness, so once we depend on Durable Objects, routing HTTP requests is easy: just send them to the D1 Durable Object.</p><p>This trick doesn&#39;t work if you have multiple active copies of the database since there&#39;s no 100% reliable way to look at a generic incoming HTTP request and route it to the same replica 100% of the time. Unfortunately, as we saw in the previous section&#39;s example, if we don&#39;t route related requests to the same replica 100% of the time, the best consistency model we can provide is read committed.</p><p>Given that it&#39;s impossible to route to a particular replica consistently, another approach is to route requests to any replica and ensure that the chosen replica responds to requests according to a consistency model that &quot;makes sense&quot; to the programmer. If we&#39;re willing to include a <a href=\"https://en.wikipedia.org/wiki/Lamport_timestamp\">Lamport timestamp</a> in our requests, we can implement <a href=\"https://jepsen.io/consistency/models/sequential\">sequential consistency</a> using any replica. The sequential consistency model has important properties like &quot;<a href=\"https://jepsen.io/consistency/models/read-your-writes\">read my own writes</a>&quot; and &quot;<a href=\"https://jepsen.io/consistency/models/writes-follow-reads\">writes follow reads</a>,&quot; as well as a total ordering of writes. The total ordering of writes means that every replica will see transactions commit in the same order, which is exactly the behavior we want in a transactional system. Sequential consistency comes with the caveat that any individual entity in the system may be arbitrarily out of date, but that caveat is a feature for us because it allows us to consider replica lag when designing our APIs.</p><p>The idea is that if D1 gives applications a Lamport timestamp for every database query and those applications tell D1 the last Lamport timestamp they&#39;ve seen, we can have each replica determine how to make queries work according to the sequential consistency model.</p><p>A robust, yet simple, way to implement sequential consistency with replicas is to:</p><ul><li><p>Associate a Lamport timestamp with every single request to the database. A monotonically increasing commit token works well for this.</p></li><li><p>Send all write queries to the primary database to ensure the total ordering of writes.</p></li><li><p>Send read queries to any replica, but have the replica delay servicing the query until the replica receives updates from the primary database that are later than the Lamport timestamp in the query.</p></li></ul><p>What&#39;s nice about this implementation is that it&#39;s fast in the common case where a read-heavy workload always goes to the same replica and will work even if requests get routed to different replicas.</p><h3><b><i>Sneak Preview:</i></b> bringing read replication to D1 with Sessions</h3><p>To bring read replication to D1, we will expand the D1 API with a new concept: <b>Sessions</b>. A Session encapsulates all the queries representing one logical session for your application. For example, a Session might represent all requests coming from a particular web browser or all requests coming from a mobile app. If you use Sessions, your queries will use whatever copy of the D1 database makes the most sense for your request, be that the primary database or a nearby replica. D1&#39;s Sessions implementation will ensure sequential consistency for all queries in the Session.</p><p>Since the Sessions API changes D1&#39;s consistency model, developers must opt-in to the new API. Existing D1 API methods are unchanged and will still have the same snapshot isolation consistency model as before. However, only queries made using the new Sessions API will use replicas.</p><p>Here’s an example of the D1 Sessions API:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">export default {\n  async fetch(request: Request, env: Env) {\n    // When we create a D1 Session, we can continue where we left off\n    // from a previous Session if we have that Session&#039;s last commit\n    // token.  This Worker will return the commit token back to the\n    // browser, so that it can send it back on the next request to\n    // continue the Session.\n    //\n    // If we don&#039;t have a commit token, make the first query in this\n    // session an &quot;unconditional&quot; query that will use the state of the\n    // database at whatever replica we land on.\n    const token = request.headers.get(&#039;x-d1-token&#039;) ?? &#039;first-unconditional&#039;\n    const session = env.DB.withSession(token)\n\n\n    // Use this Session for all our Workers&#039; routes.\n    const response = await handleRequest(request, session)\n\n\n    if (response.status === 200) {\n      // Set the token so we can continue the Session in another request.\n      response.headers.set(&#039;x-d1-token&#039;, session.latestCommitToken)\n    }\n    return response\n  }\n}\n\n\nasync function handleRequest(request: Request, session: D1DatabaseSession) {\n  const { pathname } = new URL(request.url)\n\n\n  if (pathname === &#039;/api/orders/list&#039;) {\n    // This statement is a read query, so it will execute on any\n    // replica that has a commit equal or later than `token` we used\n    // to create the Session.\n    const { results } = await session.prepare(&#039;SELECT * FROM Orders&#039;).all()\n\n\n    return Response.json(results)\n  } else if (pathname === &#039;/api/orders/add&#039;) {\n    const order = await request.json&lt;Order&gt;()\n\n\n    // This statement is a write query, so D1 will send the query to\n    // the primary, which always has the latest commit token.\n    await session\n      .prepare(&#039;INSERT INTO Orders VALUES (?, ?, ?)&#039;)\n      .bind(order.orderName, order.customer, order.value)\n      .run()\n\n\n    // In order for the application to be correct, this SELECT\n    // statement must see the results of the INSERT statement above.\n    // The Session API keeps track of commit tokens for queries\n    // within the session and will ensure that we won&#039;t execute this\n    // query until whatever replica we&#039;re using has seen the results\n    // of the INSERT.\n    const { results } = await session\n      .prepare(&#039;SELECT COUNT(*) FROM Orders&#039;)\n      .all()\n\n\n    return Response.json(results)\n  }\n\n\n  return new Response(&#039;Not found&#039;, { status: 404 })\n}</pre></code>\n            <p>D1’s implementation of Sessions makes use of commit tokens.  Commit tokens identify a particular committed query to the database.  Within a session, D1 will use commit tokens to ensure that queries are sequentially ordered.  In the example above, the D1 session ensures that the “SELECT COUNT(*)” query happens <i>after</i> the “INSERT” of the new order, <i>even if</i> we switch replicas between the awaits.  </p><p>There are several options on how you want to start a session in a Workers fetch handler.  <code>db.withSession(&lt;condition&gt;)</code> accepts these arguments:</p><!--kg-card-begin: html--><table style=\"border:none;border-collapse:collapse;\"><colgroup><col width=\"333\"><col width=\"333\"></colgroup><tbody><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><b><code>condition</code> argument</b></span></p></td><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><b>Behavior</b></span></p></td></tr><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><code>&lt;commit_token&gt;</code></span></p></td><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">(1) starts Session as of given commit token</span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">(2) subsequent queries have sequential consistency</span></p></td></tr><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><code>first-unconditional</code></span></p></td><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">(1) if the first query is read, read whatever current replica has and use the commit token of that read as the basis for subsequent queries.&nbsp; If the first query is a write, forward the query to the primary and use the commit token of the write as the basis for subsequent queries.</span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">(2) subsequent queries have sequential consistency</span></p></td></tr><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><code>first-primary</code></span></p></td><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">(1) runs first query, read or write, against the primary</span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">(2) subsequent queries have sequential consistency</span></p></td></tr><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><code>null</code> or missing argument</span></p></td><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"font-size:11pt;font-family:Arial,sans-serif;color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">treated like <code>first-unconditional</code>&nbsp;</span></p></td></tr></tbody></table><!--kg-card-end: html--><p>It’s possible to have a session span multiple requests by “round-tripping” the commit token from the last query of the session and using it to start a new session.  This enables individual user agents, like a web app or a mobile app, to make sure that all of the queries the user sees are sequentially consistent.</p><p>D1’s read replication will be built-in, will not incur extra usage or storage costs, and will require no replica configuration. Cloudflare will <a href=\"https://www.cloudflare.com/application-services/solutions/app-performance-monitoring/\">monitor</a> an application’s D1 traffic and automatically create database replicas to spread user traffic across multiple servers in locations closer to users. Aligned with our serverless model, D1 developers shouldn’t worry about replica provisioning and management. Instead, developers should focus on designing applications for replication and data consistency tradeoffs.</p><p>We’re actively working on global read replication and realizing the above proposal (share feedback In the <a href=\"https://discord.cloudflare.com/\">#d1 channel</a> on our Developer Discord). Until then, D1 GA includes several exciting new additions.</p><h3>Check out D1 GA</h3><p>Since D1’s open beta in October 2023, we’ve focused on D1’s reliability, scalability, and developer experience demanded of critical services. We’ve invested in several new features that allow developers to build and debug applications faster with D1.</p><p><b>Build bigger with larger databases</b>We’ve listened to developers who requested larger databases. D1 now supports up to 10GB databases, with 50K databases on the Workers Paid plan. With D1’s horizontal scaleout, applications can model database-per-business-entity use cases. Since beta, new D1 databases process 40x more requests than D1 alpha databases in a given period.</p><p><b>Import &amp; export bulk data</b>Developers import and export data for multiple reasons:</p><ul><li><p>Database migration testing to/from different database systems</p></li><li><p>Data copies for local development or testing</p></li><li><p>Manual backups for custom requirements like compliance</p></li></ul><p>While you could execute SQL files against D1 before, we’re improving <code>wrangler d1 execute –file=&lt;filename&gt;</code> to ensure large imports are atomic operations, never leaving your database in a halfway state. <code>wrangler d1 execute</code> also now defaults to local-first to protect your remote production database.</p><p>To import our <a href=\"https://github.com/cloudflare/d1-northwind/tree/main\">Northwind Traders</a> demo database, you can download the <a href=\"https://github.com/cloudflare/d1-northwind/blob/main/db/schema.sql\">schema</a> &amp; <a href=\"https://github.com/cloudflare/d1-northwind/blob/main/db/data.sql\">data</a> and execute the SQL files.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">npx wrangler d1 create northwind-traders\n\n# omit --remote to run on a local database for development\nnpx wrangler d1 execute northwind-traders --remote --file=./schema.sql\n\nnpx wrangler d1 execute northwind-traders --remote --file=./data.sql</pre></code>\n            <p>D1 database data &amp; schema, schema-only, or data-only can be exported to a SQL file using:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"># database schema &amp; data\nnpx wrangler d1 export northwind-traders --remote --output=./database.sql\n\n# single table schema &amp; data\nnpx wrangler d1 export northwind-traders --remote --table=&#039;Employee&#039; --output=./table.sql\n\n# database schema only\nnpx wrangler d1 export &lt;database_name&gt; --remote --output=./database-schema.sql --no-data=true</pre></code>\n            <p><b>Debug query performance</b>Understanding SQL query performance and debugging slow queries is a crucial step for production workloads. We’ve added the experimental <a href=\"https://developers.cloudflare.com/d1/observability/metrics-analytics/#query-insights\"><code>wrangler d1 insights</code></a> to help developers analyze query performance metrics also available via <a href=\"https://developers.cloudflare.com/d1/observability/metrics-analytics/\">GraphQL API</a>.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"># To find top 10 queries by average execution time:\nnpx wrangler d1 insights &lt;database_name&gt; --sort-type=avg --sort-by=time --count=10</pre></code>\n            <p><b>Developer tooling</b>Various <a href=\"https://developers.cloudflare.com/d1/reference/community-projects\">community developer projects</a> support D1. New additions include <a href=\"https://developers.cloudflare.com/d1/tutorials/d1-and-prisma-orm\">Prisma ORM</a>, in version 5.12.0, which now supports Workers and D1.</p><h3>Next steps</h3><p>The features available now with GA and our global read replication design are just the start of delivering the SQL database needs for developer applications. If you haven’t yet used D1, you can <a href=\"https://developers.cloudflare.com/d1/get-started/\">get started</a> right now, visit D1’s <a href=\"https://developers.cloudflare.com/d1/\">developer documentation</a> to spark some ideas, or <a href=\"https://discord.cloudflare.com/\">join the #d1 channel</a> on our Developer Discord to talk to other D1 developers and our product engineering team.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2dTCMeWMaQjhBd1SM8hM6O/5d2c50cacd4a2240b691643d9872536c/image1-35.png\" alt=\"\" class=\"kg-image\" width=\"1800\" height=\"713\" loading=\"lazy\"/>\n            \n            </figure><p></p>",
		"id": "6y8LbpExPriYEVMgzCDp4B",
		"localeList": {
			"name": "Building D1: a Global Database Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"title": "Building D1: a Global Database",
			"description": null,
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4bspaURu620TnQbI0SK4A6/ceb215fe5cce8ea58559f4a1ffabe826/building-d1-a-global-database-h6lAYJ.png"
		},
		"primary_author": {},
		"published_at": "2024-04-01T14:00:41.000+01:00",
		"reading_time": 10,
		"slug": "building-d1-a-global-database",
		"tags": [
			{
				"id": "2xCnBweKwOI3VXdYsGVbMe",
				"name": "Developer Week",
				"slug": "developer-week"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			},
			{
				"id": "UKt2GEAUQsbObsNqZ3Pr7",
				"name": "D1",
				"slug": "d1"
			},
			{
				"id": "6txTUIMHOhipqANVWJGAmG",
				"name": "Database",
				"slug": "database"
			}
		],
		"title": "Building D1: a Global Database",
		"updated_at": "2024-08-27T00:58:43.218Z",
		"url": "https://blog.cloudflare.com/building-d1-a-global-database"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}