{
	"initialReadingTime": "20",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Andrew A. Schafer",
				"slug": "andrew-schafer",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/l4jqNy2kzTBqyeNbVGOB0/bd5523d18f276c77cee831b97865cfbc/andrew-schafer.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Don’t tell our CEO, Matthew Prince, but the first day I interviewed at Cloudflare I had a $9.00 phone in my pocket, a knock-off similar to a Nokia 5140, but the UI was all in Chinese characters—that phone was a fitting symbol for my technical prowess. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/27mn0nugaKAtJp6HgFaaZD/b9ed4147b0ab869c3c8f9eccd29517b9/china-silicon-valley-china.jpg",
		"featured": false,
		"html": "<blockquote><p>“Real knowledge is to know the extent of one&#39;s ignorance.”― Confucius</p></blockquote><h3>Blueprint:</h3><p>Don’t tell our CEO, Matthew Prince, but the first day I interviewed at Cloudflare I had a $9.00 phone in my pocket, a knock-off similar to a <a href=\"https://nokiamuseum.info/nokia-5140/\">Nokia 5140</a>, but the UI was all in Chinese characters—that phone was a fitting symbol for my technical prowess. At that time in my career I could send emails and use Google, but that was about the extent of my tech skill set. The only code I’d ever seen was in the Matrix, Apple computers confused me, and I was working as a philosophy lecturer at The University of California, Santa Cruz. So, you know, I was pretty much the ideal candidate for a deeply technical, Silicon Valley startup.</p><p>This was in 2013. I had just returned from two years of <a href=\"https://www.peacecorps.gov/\">Peace Corps</a> service in the far Southwest of China approaching the Himalayan plateau. That experience gave me the confidence to walk into Cloudflare’s office knowing that I would be good for the job despite the gaps in my knowledge. My early training in philosophy plus my Peace Corps service gave me a blueprint for learning and figuring things out when thrown into the deep end (it turns out that I love being thrown into the deep end and learning to swim).</p><p>I had no idea that this first meeting with Matthew would eventually lead me back to China, this time riding on the cloud of a fast-growing Silicon Valley tech giant.</p><p>Two years earlier, eighty Peace Corps Volunteers and myself landed in the capital of Sichuan province, Chengdu. The vast majority of us, myself included, spoke zero Mandarin and only knew about China from books and a few news snippets here and there. The Chinese staff members that greeted us at the Peace Corps China headquarters on the Sichuan University campus affectionately called us “baby pandas”, because we were cute and fairly incompetent in terms of operating in China.  </p><p>Our mission was to help China meet its need for trained men and women—specifically to teach college level students English and train qualified Teachers of English as a foreign language instructors (TEFL instructors). We were also there to promote a better understanding of Americans abroad, and to do our best to gain some understanding of China and its people.</p><p>Thus began two years of deep learning and profound personal growth.</p><p>When I think about the most important aspects of my time in China, there are three fundamentals that I come back to:</p><ul><li><p>The importance of learning the language and culture</p></li><li><p>The importance of 关系 (guanxi) or personal connections and relationships</p></li><li><p>The necessity of being resourceful</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7suuGB13AdbgTa95c7xJO1/4f0f11f00ddc138db11a2150f439ab4d/Peace-Corps.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"367\" loading=\"lazy\"/>\n            \n            </figure><p>The most successful Peace Corps volunteers in my cohort were the ones that learned to speak Mandarin well, understood enough about Chinese culture to operate effectively in their schools and communities, had built important personal and professional relationships, and had figured out how to survive in Southwest China and be useful as English language resources and American cultural liaisons. There was a steep learning curve.</p><p>Peace Corps Service in China has four phases more or less. Phase one, Pre Service Training (PST), took place at Sichuan University. We were all living with Chinese host families, taking 8-9 hours of Mandarin class each day, learning about Chinese culture, and being trained as TEFL instructors. It is an intense period of learning against a backdrop of tremendous culture shock, jet lag, and general confusion of how to be an American in Southwest China.</p><p>After three months of well taught crash courses, I was sent out to the college where I would spend the next two years of my service. That first night, after I unpacked my bags and took a shower, the reality of my life decisions came crashing down. This was going to be *very* hard. I was alone with millions and millions of Chinese people in remote Sichuan. Phase two was about to begin.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2WOAgUyjlpKsOFHC7twHwu/af430a0372d6636866846e88b81107e5/Landscape.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1328\" loading=\"lazy\"/>\n            \n            </figure><p>This is Yibin (宜宾), the city I lived in for two years. A small city in China of just 5,000,000 people right on the Yangzi river. Photo taken from the countryside looking towards the center of town.</p><p>Getting familiar with the college where I was to spend two years was another steep learning curve. I was introduced to the colleagues I’d be teaching with as well as the school administrators, and, most importantly, I was introduced to my students. I got lucky, the English department at my school was small, and I only had 20-30 students in each of my classes. I met with them 4 times a week for two hours a day, so I had ample time to really get to know them and work with them one-on-one in the classroom, during office hours, and over spicy Sichuan dinners.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/YflrX1Yns6qosAKfkPgKt/68b35bf6d4d1510a9f9900afd0d74f7f/Classroom2.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1328\" loading=\"lazy\"/>\n            \n            </figure><p>Me and a few of my top students.</p><p>That first year of service I studied Mandarin as if my life depended on it—because it sort of did. Few people, i.e. my students and colleagues, spoke English in rural Sichuan. As I was able to communicate better in Mandarin, my understanding of the culture grew and so did my relationships with folks at my school and community.</p><p>In an effort to understand more about the culture I was living in, I gave myself an education in Chinese philosophy starting with Confucius (孔子) and the Daoist like Laozi (老子) and Zhuangzi (庄子), and I also looked into Buddhism. Since the world’s wisdom traditions contain universal principles that transcend time and culture, these readings gave me subtle insights into the Chinese way of life. I learned that Confucianism is the invisible glue holding much of Chinese society together. And while Confucius spoke to Chinese society and how people ought to act, his contemporary, Laozi, considered the founder of Daoism, spoke to the Chinese soul via the Dao de Jing (道德经).</p><p>Apropos of philosophy, one beautiful Chinese proverb I found in my reading goes: “Only those who take leisurely what the rest of the world is concerned about, can be concerned about with the rest of the world takes leisurely”. A calligraphy artist at my school gifted me a piece of work expressing this:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1xvrpe5s4bcZ4DX44vvMve/61b6423896eb56be5c5a50a9070c3270/image17-2.jpg\" alt=\"\" class=\"kg-image\" width=\"269\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>I also learned early on in my service what my students needed: authentic opportunities to express themselves in English, understanding and encouragement, and a solid English text book that employed the latest pedagogical techniques for learning a foreign language. Since my Mandarin was slow going, my students had all sorts of authentic opportunities to speak to me in English. They ended up helping me translate a lot that first year as I navigated my life on campus. As for encouragement, I would often talk to them in my developing and broken Mandarin in front of the class. I messed up words and tones constantly, and they laughed (hard) and then kindly corrected me. In this way, I showed them that learning is all about making mistakes, and that it is fine to get it wrong as you begin. There is no other way to learn a language (or anything else). The last part, providing a solid textbook, would be more tricky.</p><p>I received enough training during PST to have some good ideas for teaching English as a foreign language, but I had no experience writing a language textbook. What I ended up doing was replicating the structure of the textbooks I was using to learn Mandarin: a dialogue which incorporates a few new vocab words, a list of those new vocab words, grammar practice using grammatical structures from the dialogue, and then photos of relevant objects or scenes that would allow students to use new vocabulary words to describe the photos using new words and structures. I would record these dialogues and then distribue the audio file to my students so they could hear my pronunciation.</p><p>We’d work with this dialogue, vocabulary, and grammar all week, then on Fridays I’d put them in a “language line”. Sort of like speed dating, but they would have to hold a conversation with their classmates around the topic of that week and use the new vocab words. I’d listen in and help guide them. Then at the end of class, we’d form a line and I’d ask each one of them a question individually that they had to answer before they could leave the classroom. This pushed each student into learning so that they could actually speak English confidently to a native English speaker. It was a rewarding project.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5BqeMeM9r0nTZXIOzzDjpe/1be93013331d0f387149d7310e5e33a4/Classroom.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1328\" loading=\"lazy\"/>\n            \n            </figure><p>My mom sent Halloween candy for my students in October. They were *very* excited.</p><p>My students were super smart and diligent, and week after week their English level was going up. I was able to hold natural conversations with them while speaking slow, and my Mandarin was progressing to the point that I could clarify things in Mandarin to aid their English learning. And so I learned how to teach English.</p><p>I consider all of the second year of service phase three. It is in that second year that volunteers can do really great work. My language level was high enough to really communicate with my community and explore China more, I had a basic structure for teaching and kept honing it to fit the needs of my students, and I developed a lot of really important relationships with the administrators at my school and other wonderful folks in the area.</p><p>Phase four is the return to the US. Something that no one told me about Peace Corps service before I joined is that you actually sign up for three years, not two. And that the third year, the first year back home after service, would be the most challenging by far … readjusting to life in the US, starting up or continuing a career, feeling a million miles behind peers who cranked through two extra years in a work world. All of this while trying to work on one of the most important goals of the Peace Corps—Goal 3—helping Americans better understand China through my experiences. I’m doing this every chance I get. This blog is a part of fulfilling Goal 3.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/73taboUCrN9S6j6RoXhkjL/3b2fb5602a7ed4991fe9bc05e999af6c/Finish-Him.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1328\" loading=\"lazy\"/>\n            \n            </figure><p>Me and my good friend, 兵哥, goofing around in the Sichuan countryside after a long bike ride.</p><p>My service in China impacted me in profound ways. I have a love and respect for China that was born of close contact with the wonderful people, culture, philosophy, and language I was steeped in. And it gave me a clear experience of my ability to grow and change and acquire new skills swiftly. By the end of my time, I could confidently hold a conversation in Mandarin, I could read sections of Chinese newspapers, I had written an English text book for my students, and I made so many friends. All of that came from slow, diligent, hard work—and finding the necessary resources to get things done for my students in non-obvious ways. I had a clearly outlined experience of what diligence and time can do, and I knew deep in me is the potential to learn, adapt, and grow into almost anything.</p><p>Two years of remote Peace Corps work (which, despite being among millions of Chinese people, is often an isolating experience) gave me ample time to reflect on my life. While I find teaching deeply rewarding and I love the study of philosophy, I felt that I needed a different pool to swim in than academia. I thought that the private sector would likely offer the most opportunity, so when I came back to the US, I decided to move to San Francisco and aim for a job in tech. I figured that would be like plunging into the ocean, and I was keen to see where the global economic currents might take me.</p><p>In the first few weeks I was back in the US I set up 4-5 informational interviews each week. I spoke to people at Google and Square, folks working in event planning, in finance, in HR, in construction, etc. Then one of my colleagues at the university mentioned that their friend (Matthew) had a tech startup called “Cloudflare” and could maybe use some help writing stuff. I followed up right away.</p><h3>Career Change: From teaching to tech - How Hard Can It Be?</h3><p>Despite hours of Googling “What is a Cloudflare?”, I was utterly and completely out of my depth when Matthew explained to me what the company does. Before my interview with him, I had done my homework memorizing definitions for acronyms like CDN, DNS, DDoS, and API, but I didn’t really know what they were. The instructions I received before the interview were to learn a bit about how Cloudflare works, and “Don&#39;t wear a suit and tie”. This was a time in Cloudflare history when we had about 60 employees, about 30 data centers, and a bit of duct tape in the office pressing extension cords into the carpet.  </p><p>I was intimidated speaking to Matthew the first time. He is an amazingly accomplished and incredibly intelligent person. I checked out his LinkedIn profile, and I didn’t know anything about SPAM, law school, business school, being an entrepreneur, or how the Internet works. The folks in Peace Corps China always talked about being resourceful, so I looked for and found an opportunity to connect with him on a level that I could grasp. Matthew, who has unbelievable credentials and professional accolades, still has “Ski Instructor” on his LinkedIn profile somewhere between “Adjunct Professor of Law” and “Harvard Business School”:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/XT1XJSMkfnkGSmfJYjAtd/274bc7add46b10dbc2c4cb8492b8381f/LinkedIn.png\" alt=\"\" class=\"kg-image\" width=\"1832\" height=\"1544\" loading=\"lazy\"/>\n            \n            </figure><p>I had just spent all of my time in China aiming to build relationships with my students and other people in my community that were from vastly different backgrounds and trying to find common ground from which to build rapport and trust. I thought, if someone this accomplished keeps their ski instructor experience on their resume, it must have a lot of meaning. I’m glad I followed that intuition because this topic led to a great conversation with Matthew about hometowns, ski trips, and ski equipment, which eventually lead to a conversation about surfing and surfboards, which is right in my wheelhouse. It turned out to be a great interview because we connected over things that we both found important. We found a piece of common ground that didn’t seem obvious at first---part of that being a deep curiosity for how and why things work. Looking back five years, I can say without reservation that finding a way to connect with Matthew that day has had a profoundly positive impact on the course of my life.</p><p>When it came time for me to interview with our co-founder, Michelle, she understood that I had a lot to learn about the company, and she took the time to draw out a simplified map of Cloudflare’s network on a yellow legal pad. She drew jagged, little clouds around the world and patiently explained what global caching is, how Anycast networking helps with DDoS attacks, and how DNS is like the phone book of the Internet. I was struck that such a highly intelligent person, HBS grad, co-founder of a major tech firm would take time out of their busy day to do this. I learned later that Michelle is always like this. She is amazing with names, stops to talk to folks in the office whenever she can, and sets a tone of respect, compassion, and understanding at the office. It is inspiring.</p><p>I then had a video interview with <a href=\"https://www.jgc.org/\">John Graham-Cumming</a>, our CTO, who was in London. There was no getting away from tech with this interview. So I Googled everything I could about John. I read his book <a href=\"https://www.amazon.com/gp/product/0596523203?ie=UTF8&tag=jgcorg-20&linkCode=as2&camp=1789&creative=390957&creativeASIN=0596523203\">Geek Atlas</a>, I watched <a href=\"https://www.ted.com/talks/john_graham_cumming_the_greatest_machine_that_never_was\">his TED Talk</a>, and I looked into his interest in <a href=\"https://moviecode.tumblr.com/\">Movie Code</a>. I was ready for this interview. We talked about the Parkes Radio Telescope in Australia, Alan Turing, and about the code in the Matrix (thank you, Neo!). John is a fascinating speaker and a legend in the technology space. He is also kind and patient, and he never made me feel silly for not grasping technical concepts right away.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2JZbMaMKklcCY6CjTjABa4/6a46bef730d61e0862d46271c786e93f/Matrix.png\" alt=\"\" class=\"kg-image\" width=\"1404\" height=\"996\" loading=\"lazy\"/>\n            \n            </figure><p>After 6-7 interviews over the following weeks, the feedback I got was that I was a good culture fit, I was hard-working and smart, but I just didn’t have the technical knowledge to do the job. That feedback seemed spot on, but I wasn’t going to let that hold me back. I knew I could be useful to this company. I knew that if they gave me a shot and threw me into the deep end that I would learn to swim. I knew what I needed to do: learn the language and culture of Silicon Valley, make connections, and be resourceful.</p><p>I stood outside of the old Cloudflare office at 665 3rd St. in San Francisco, and I told myself that I have to get in that door. I didn’t know exactly what they are doing in there, but it seemed weird and interesting, and I wanted to be a part of it.</p><p>So I started learning. Another returned Peace Corps volunteer that I’d met in the Bay Area sat down with me one weekend and helped me build a simple website from the ground up. In the most basic HTML and CSS, we embedded <a href=\"http://www.poshcorps.com/shortschina\">a video we made about my China experience</a>. On the site I made the background color orange to match the Cloudflare logo and wrote something like, “Check it out Matthew and Michelle, I’m learning how to write code!”, and I sent them the link.</p><p>In the following weeks, I sent more follow up emails to Matthew than felt polite. But it worked. Matthew, Michelle, and John took a huge risk on me, and I got an offer to be Cloudflare’s “Writer” (since that was really the only thing that made sense for an academic philosopher to do at a tech firm). They actually gave me business cards that read: Andrew A. Schafer - Writer.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3x5bETruleteX2RC0vboQq/1361cde39229157533ee6aa3d91f7dbc/Writer.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1500\" loading=\"lazy\"/>\n            \n            </figure><p>When I accepted the offer via email, Matthew wrote back saying that getting up to speed with Cloudflare was “going to be like drinking from a fire hose”.</p><h3>Drinking from the Fire Hose:</h3><p>On day one, I sat down next to the folks on the Data Team and introduced myself. They all said a quick, polite “hi” and then put their head phones back on immediately and continued to write code. I didn’t learn for a long time that engineers DO NOT like to be interrupted when they are coding. This is a key feature of tech culture.</p><p>I spent part of my first week at Cloudflare watching a lot of YouTube videos by <a href=\"https://www.elithecomputerguy.com/\">Eli the computer guy.</a> He does a great job explaining DNS, the OSI model, basic networking, etc. He even has <a href=\"https://www.youtube.com/watch?v=R9oN5RK8JAQ\">an older video about Cloudflare</a>, which was super helpful (Thank you, Eli!).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5iotI0exQQdT9sUwCU4Pvs/e6b3c67dd03dde125665534110424b61/Eli-the-Computer-Guy-3.png\" alt=\"\" class=\"kg-image\" width=\"292\" height=\"326\" loading=\"lazy\"/>\n            \n            </figure><p>Eli, The Computer Guy</p><p>At one point John Graham-Cumming walked past my desk and asked me why I was staring at that man in the orange shirt so much. I turned around and exclaimed, “John, did you know that the Internet has LED lasers that blink on and off BILLIONS of times per second?!” He calmly replied, “yes” and then went about his business. That fact made my mind melt. I had so much to learn.</p><p>One of the first things I worked on as Cloudflare’s Writer was some of the PR efforts surrounding <a href=\"https://www.cloudflare.com/galileo/\">Project Galileo</a>, DDoS attack protection for at-risk public interest websites, which I’m still proud of. I worked with our legal team to draft up <a href=\"/naming-project-galileo/\">this blog post</a>, which helped me to understand the implications and power of Cloudflare’s technology in real-world terms.</p><p>I worked with <a href=\"/author/nick-sullivan/\">Nick Sullivan</a> a whole bunch at the beginning also, which was mystifying. He is already a great writer and he was writing about <a href=\"/keyless-ssl-the-nitty-gritty-technical-details/\">such complex things</a>. There were times where I was adding punctuation to sentences that made sense grammatically, but I didn’t understand their content. I learned a lot about encryption, and my tech vocabulary grew.</p><p>At one point I also helped John Graham-Cumming with a few blogs. John is a published author, so I didn’t really help him write anything, but I did help him bring his posts way down to my level. You can see my influence on this blog post about <a href=\"/inside-shellshock/\">Shellshock</a>. That day I learned the term “zero day vulnerability”.</p><p>In that blog John wrote: “Attackers will also use an ACE vulnerability to upload or run a program that gives them a simple way of controlling the targeted machine. This is often achieved by running a &quot;shell&quot;. I read his draft and I asked him, “What is a shell?”. A question, I learned much later, that was highly embarrassing to ask at a tech office. But I didn’t know, and I wanted to know. So we clarified that, “A shell is a command-line where commands can be entered and executed” in the post just in case other tech noobs like myself were trying to follow along. I learned how to be a translator from tech-speak to normal English.</p><p>I even researched and wrote a few posts of my own, <a href=\"/dyi-web-server-raspberry-pi-cloudflare/\">like this one about Raspberry Pi’s fronted by Cloudflare</a>. I had no idea what a Raspberry Pi was before being asked to write this. Thankfully one of the folks on the Data Team had one and let me borrow it for a photo op. I learned about the inspiring philosophy behind <a href=\"https://www.raspberrypi.org/\">Raspberry Pi</a> and the vibrant community that uses them.</p><p>As the official Cloudflare Writer, I was proud of writing the copy for our dashboard. That project was an amazing way for me to get to know a lot of key members of the engineering team and have them teach me exactly how each feature worked. I wrote out what I understood, clarified some points with them, and then made a pull request to get the explanations into the code base for our dashboard.  </p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6dktSpkmfEtKXJv7S2uFGC/e66e6d00cc11e05cb41c885de520bb57/HSTS.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"997\" loading=\"lazy\"/>\n            \n            </figure><p>If you’ve ever used these help menus—you are welcome! (Note: lots of other Cloudflare team members have kept this updated and expanded.)</p><p>Eventually, I became an honorary member of the Data Team. It took some doing, but I <a href=\"https://learnpythonthehardway.org/\">learned Python the hard way</a>, and I wrote a Python script that would print my name 100,000 times in the terminal. I crashed my machine when I tried to make it print my name 100,000,000,000,000 times. I learned something about code that day—it can break things.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4Txh9d8wz5AWwdUnVXQCZE/5805af577acb65913851ee7428ede1b4/Print-My-Name.png\" alt=\"\" class=\"kg-image\" width=\"1444\" height=\"952\" loading=\"lazy\"/>\n            \n            </figure><p>I ran this code while sitting next to the person who had built Cloudflare’s original database. I did a victory dance when I crashed my laptop I was so proud of myself. That is sort of like me bragging about my backyard badminton skills next to Serena Williams.</p><p>I dipped my toes into the language of code, and started to speak that language with the engineers around me. This helped me to learn an important lesson about tech culture: the deeper your technical understanding the greater the respect you receive.</p><p>Eventually, I was ready for a new challenge at Cloudflare—talking to our clients.</p><h3>Client Facing:</h3><p>The first thing I learned in a client facing role at Cloudflare is that Cloudflare is not a widget or a nice-to-have—it is mission critical technology for everyone that uses it. When something goes wrong people are <b>very</b> upset. The second thing I learned in a client facing role at Cloudflare is that the Internet is a fragile little teacup and it runs on human trust—which is astonishing. The combination of those two facts created ample opportunity for me to develop my listening and communication skills.</p><p>I started by rereading How to Win Friends and Influence People, by Dale Carnegie and took special note of rule number four, which states, “Be A Good Listener”. I quickly graduated to the philosophy and practice of Nonviolent Communication, by Marshall B. Rosenberg. I ended up taking some NVC courses in San Francisco focused on listening skills in this style. I also took compassion meditation courses via Stanford a few years in a row, which had a profound impact on my ability to empathise with our clients.</p><p>While brushing up on and honing these interpersonal skills was helpful, what I learned in a lot of those early meetings with clients was that I need to understand Cloudflare’s technology better. It’s one thing to be able to talk about it, it’s a whole different thing to be able to understand it enough to solve real issues.</p><p>I decided to do the “homework” our Solutions Engineering team gives out to their hiring candidates. I had to learn command-line basics, create an origin web server on DigitalOcean, install Ubuntu, configure a firewall, install NGINX, create a simple website from HTML, add an image to that site, set up DNS, and then put Cloudflare in front of it.</p><p>I set up my first DNS record in Cloudflare to point to my origin server, and was like “OHHHHHHH SNAP! <i>That</i> is how DNS works! It maps my domain name to the IP address of my server!” Hands on learning makes all the difference.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/hw4cs8r2xuApanUvRuRxd/3c2b060f1de4d8e2c0cf1cf5c1c2b329/DNS.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1162\" loading=\"lazy\"/>\n            \n            </figure><p>And I learned that WWW is a subdomain of the apex!! What???</p><p>It wouldn&#39;t be a legit Cloudflare blog without more code, so here we go. I ended up writing (modifying) this amazing piece of code based on the NGINX HTML welcome page template:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4B3Vw5W0DxE9d5kLxdsvGu/0b9340e4e04143d6fef02fc1c27bd48f/Code-Block.png\" alt=\"\" class=\"kg-image\" width=\"1250\" height=\"816\" loading=\"lazy\"/>\n            \n            </figure><p>Notice that I added an image:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/bNXYPpch1GTROEczv5Dgj/f84ca6f0321924e9c51859157e48fbe1/Developer.png\" alt=\"\" class=\"kg-image\" width=\"1242\" height=\"1162\" loading=\"lazy\"/>\n            \n            </figure><p>I’m now a web developer! I’ve added yet another cat photo to the Internet. You are welcome world! (Note at the time of publishing my site is offline [I forgot to renew the domain—oopsy]).</p><p>Once I had my site up and running on Cloudflare, I learned how to make API calls to pull down the our Enterprise raw logs and use jq to sort them (jq, I learned, is “a lightweight and flexible command-line JSON processor”):</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">curl -H &quot;X-Auth-Email: aschafer@cloudflare.com&quot; -H &quot;X-Auth-Key:\ncc1e78b22222229b9d72643fbda69655579d&quot; -H &quot;Content-Type: application/json&quot; \n&quot;https://api.cloudflare.com/client/v4/zones/f5fb827cf31f628c1c0730bc4b0792d\nd/logs/requests?start=0&amp;count=1&quot; | jq &#039;select(.clientRequest.uri == \n&quot;/admin&quot;), .client.ip&#039;| sort | uniq -c | sort -r</pre></code>\n            <p><i>(Note: This cURL command does not contain a real API key. I learned the hard way to NEVER include the API key when sharing a cURL.)</i></p><p>I was so proud. I could say things like, “pull down the raw logs and pipe them into jq” to my clients, and I actually knew what I was saying—my tech language skills were improving.</p><p>I then read “<a href=\"https://hpbn.co/\">High Performance Browser Networking</a>” by Ilya Grigorik. I didn&#39;t even understand what that title meant at first. I had to translate it into non-tech English. It turns out that, for example, Chrome is a high performance browser, which is a tool you use to navigate a network of computers, a.k.a. the Internet. So it is a guide book for building the most performant web apps within the limits of current browser and networking technology.</p><p>Grigorik’s philosophy resonates with me, “Good developers know how things work. Great developers know why things work.” Insert any other profession or art and the statement remains true.</p><p>It took me six months of reading on bus rides to work, but by the end I could say things like, WebSocket API, Subprotocol Negotiation, TLS OCSP Stapling, and TCP Head-of-Line Blocking. I learned from Grigorik that, “TCP provides the abstraction of a reliable network running over an unreliable channel, which includes basic packet error checking and correction, in-order delivery, retransmission of lost packets, as well as flow control, congestion control, and congestion avoidance designed to operate the network at the point of greatest efficiency. Combined, these features make TCP the preferred transport for most applications.” Who knew?</p><p>After putting so much work into learning what Cloudflare really does, I came to understand something fundamental about the tech world: <b>the learning never stops</b>. Never. The fire hose never turns off.  </p><p>When I started at Cloudflare we offered more domains and extra SSL cert hosting slots as our additional products. Now we have <a href=\"https://developers.cloudflare.com/workers/\">Workers</a> and <a href=\"https://developers.cloudflare.com/access/\">Access</a> and <a href=\"https://www.cloudflare.com/products/argo-smart-routing/\">Argo</a> and <a href=\"https://developers.cloudflare.com/argo-tunnel/\">Argo Tunnel</a> and <a href=\"https://developers.cloudflare.com/spectrum/\">Spectrum</a> and <a href=\"https://www.cloudflare.com/load-balancing/\">Load Balancing</a> and <a href=\"https://developers.cloudflare.com/stream/\">Stream</a> and a <a href=\"https://developers.cloudflare.com/mobile-sdk/\">Mobile SDK</a>, and the list keeps growing. And we all have to learn about all of this new technology as it gets released. It is amazing!</p><p>Over the last few years, I’ve learned the language of Silicon Valley, and more specifically, I can speak the language of Cloudflare fluently. That has made a huge difference in my career.</p><h3>Life @ 101 Townsend:</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2HNTv1JlNagGpnS6R7WOgG/61914b024d2898a6503521001deb7e3d/101-Townsend.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1335\" loading=\"lazy\"/>\n            \n            </figure><h3>Big Horse:</h3><p>I’ve enjoyed a lot of successes at Cloudflare, but the one achievement I’m most proud of is creating the “Big Horse Award for Strong Work”.</p><p>The idea for this came directly from chapter 2 of How to Win Friends and Influence People: “Give honest and sincere appreciation”. I make it a point to tell the folks I work with that they are doing outstanding work every chance I get because the folks I work with really are doing outstanding work all the time, and they should know about it.</p><p>Maybe three years ago <a href=\"/author/tom-brightbill/\">my best friend at Cloudflare</a> sent me a message via HipChat that read something like: “Hey Big Horse, you check that Jira ticket yet?”. From that day forward I called everyone “Big Horse” on HipChat at all times, which I thought was hilarious and everyone else thought was weird or annoying.</p><p>Shortly after that, in an effort to step up my “Give honest and sincere appreciation” game, I started sending emails to the whole company pointing out the strong work our support team was doing in our Zendesk customer support tickets. Our support team is world-class, but since only a few teams in the office can access Zendesk, a lot of folks internally don’t see their amazing work. I decided to take screenshots of tickets that were particularly well-handled and share them. I’d titled these emails “Strong Work, Big Horse!”. I quickly learned that emailing the whole company “does not scale”.</p><p>This culminated at one of our all hands B.E.E.R. meetings, where I gave out a Big Horse Award to a few outstanding members of our Support team. I had this stunningly beautiful trophy made for the occasion:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2GyAuNAZixH1TgDdDuwM5U/08705fe55f29f7d19efaf6c88f92c070/Big-Horse-trophy-2.jpg\" alt=\"\" class=\"kg-image\" width=\"375\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>We needed a logo, so I Googled “stupid horse drawings” and found an image. With a little editing via photo editor and PowerPoint, a meme was born:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/21s6xyuNWwT1OqNwxq2TPP/a89337097c59e7b74dc363f69b99bb38/Big-Horse.png\" alt=\"\" class=\"kg-image\" width=\"225\" height=\"225\" loading=\"lazy\"/>\n            \n            </figure><p>Since then we’ve had all sorts of iterations of the Big Horse logo:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/16iz2815pXuMd8O1hDFcyW/72ee654d2d8ef5705d7932b6bb3ae763/Big-Horse-Evolution.png\" alt=\"\" class=\"kg-image\" width=\"1426\" height=\"758\" loading=\"lazy\"/>\n            \n            </figure><p>And we had paraphernalia made:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3QYaaDW01hUH5yeVjiQg6u/417a505cc60df2605a1c89a9ca66a7f9/Big-Horse-swag.png\" alt=\"\" class=\"kg-image\" width=\"938\" height=\"320\" loading=\"lazy\"/>\n            \n            </figure><p>Our support team even spray painted “Big Horse” on the side of a building on 4th St in downtown San Francisco on a team outing:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/HxcMxRmKMMICuAMANbBek/6890fc5c0ff4e795e17b0ffb8a3b7976/Big-Horse-Graffiti.jpg\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1500\" loading=\"lazy\"/>\n            \n            </figure><p>We’ve issued a new Sparkle Lama award as well—since not everyone wants to be called a big horse:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/66yXg1Qt0jTpLhgFqCovhe/a555eb801085f547fe59380a8bab7707/Sparkle-Lama-2.png\" alt=\"\" class=\"kg-image\" width=\"413\" height=\"385\" loading=\"lazy\"/>\n            \n            </figure><p>Many Cloudflare team members have Big Horse and Sparkle Lama stickers on their laptops, and we’ve shipped those golden big horse trophies around the world to our London and Singapore offices. These symbols have become easy ways to let our teammates know that they are doing great work. It is a small thing, but it adds up and helps make Cloudflare a great place to work.</p><p>Just a few weeks ago <a href=\"https://mobile.twitter.com/neilwlevine/status/1099051366079619072?s=19\">this Tweet</a> was pointed out to me:</p><blockquote><p>&quot;For a reason I don’t understand yet, members of the Cloudflare engineering team own over 2% of all active .horse domains in the world&quot; &gt; <a href=\"https://t.co/IhGW55Oi2h\">https://t.co/IhGW55Oi2h</a></p><p>— Neil Levine (@neilwlevine) <a href=\"https://twitter.com/neilwlevine/status/1099051366079619072?ref_src=twsrc%5Etfw\">February 22, 2019</a></p></blockquote><p>Well, Neil, the reason for this is that a few engineers and myself had big plans of launching a website around the Big Horse Award, we bought big.horse and a few others, but we didn’t follow through—yet. Stay tuned.</p><p>The Big Horse and Sparkle Lama Awards are my contribution the tech culture I’ve been a student of these last few years.</p><h3>回中国 （Back to China)</h3><p>Five years after those first conversations with Matthew, Michelle, and John, I’m headed back to China with Cloudflare!</p><p>We are expanding our presence in China, and I have the good fortune (幸福) to combine the skills I acquired in philosophy and in the Peace Corps with the skills I acquired in Silicon Valley. We will be onboarding new Chinese clients, hiring more team members, and building out partnerships with other Chinese tech firms. I’m incredibly lucky to be headed back to a country that I love and embark on a new adventure.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7tGPIsz6d84fox4gCUbKEL/901cdbc148741ee6f5f96c54f15eeb41/Red-1.jpg\" alt=\"\" class=\"kg-image\" width=\"232\" height=\"231\" loading=\"lazy\"/>\n            \n            </figure><p>I have a whole new fire hose aimed at me, and I plan to drink deep. I’ve been taking Mandarin classes again, this time to learn words like encryption (加密), caching (缓存), and cloud software (云软件). I’ll be learning a whole new interpersonal skill set around working with clients in China and across Asia. And since the office is just starting, this project will be a new exercise in resourcefulness.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"> life_journey = [&quot;China&quot;, &quot;Silicon Valley&quot;, &quot;China&quot;]\nfor x in life_journey\n   print(x)</pre></code>\n            <p>I had no idea how much opportunity lay before me when I walked in the door as “the writer”, and I am profoundly grateful that Cloudflare took a chance on me. I plan to throw myself into this project in China, to learn and grow and contribute, and to figure out the best way to translate “Strong Work, Big Horse” into Mandarin.</p><p>我非常开心回去中国帮助成立我们的北京分部！</p>",
		"id": "345ByIXL2whCxRPpZVedfZ",
		"localeList": {
			"name": "China | Silicon Valley | China: A path less traveled Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2019-04-10T14:00:00.000+01:00",
		"slug": "china-silicon-valley-china",
		"tags": [
			{
				"id": "4g8tPriKOAUwdUT4jNPebe",
				"name": "Life at Cloudflare",
				"slug": "life-at-cloudflare"
			},
			{
				"id": "BeOQ8YnBKNydFxc1Ea2Rh",
				"name": "China",
				"slug": "china"
			},
			{
				"id": "73tAN5Lulrx0pDbXqrBcqM",
				"name": "Cloudflare History",
				"slug": "cloudflare-history"
			}
		],
		"title": "China | Silicon Valley | China: A path less traveled",
		"updated_at": "2024-08-27T02:13:16.823Z",
		"url": "https://blog.cloudflare.com/china-silicon-valley-china"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}