{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Patrick R. Donahue",
				"slug": "patrick",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1LQFonIW7hvlt7UKRMOzlk/1922ffdb4fc76d32f8d039753ad6eb16/patrick.png",
				"location": "San Francisco, CA",
				"website": "https://www.cloudflare.com",
				"twitter": "@prdonahue",
				"facebook": null
			}
		],
		"excerpt": "In the fall of 2014 CloudFlare launched Universal SSL and doubled the number of sites on the Internet accessible via HTTPS. In just a few days we issued certificates protecting millions of our customers’ domains and became the easiest way to secure your website with SSL/TLS.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1qduY4chV0V4sOXUhMDcdh/42766bbdc92973298e15a1e3b828e14d/cloudflare-ca-encryption-origin.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3LGGPwBbcwri0fn60opcSq/b36cf5210208537312ad821f4225c168/illustration-ssl-certificate.png\" alt=\"\" class=\"kg-image\" width=\"645\" height=\"200\" loading=\"lazy\"/>\n            \n            </figure>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"free-and-performant-encryption-to-the-origin-for-cloudflare-customers\">Free and performant encryption to the origin for CloudFlare customers</h3>\n            <a href=\"#free-and-performant-encryption-to-the-origin-for-cloudflare-customers\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>In the fall of 2014 CloudFlare <a href=\"/introducing-universal-ssl/\">launched Universal SSL</a> and doubled the number of sites on the Internet accessible via HTTPS. In just a few days we issued certificates protecting millions of our customers’ domains and became the easiest way to secure your website with SSL/TLS.</p><p>At the time, we &quot;strongly recommend[ed] that site owners install a certificate on their web servers so we can encrypt traffic to the origin.&quot; This recommendation was followed by a <a href=\"/origin-server-connection-security-with-universal-ssl/\">blog post</a> describing two readily-available options for doing so—creating a self-signed certificate and purchasing a publicly trusted certificate—and a third, still-in-beta option: using our private CA. Even though out-of-pocket costs of acquiring public CA certificates <a href=\"https://letsencrypt.org\">have since fallen to $0</a> since that post, we have continued to receive requests from our customers for an even easier (and more performant) option.</p><p>Operating a public certificate authority is difficult because you don&#39;t directly control either endpoint of the HTTPS connection (browser or web server). As a result, public CAs are limited both in their ability to issue certificates optimized for inter-server communication, as well as in their ability to revoke certificates if they are compromised. Our situation at CloudFlare is markedly different: we affirmatively control the edge of our network so we have the flexibility to build and operate a secure CA that’s capable of issuing highly streamlined certificates and ensuring they are utilized securely.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"less-is-more-removing-the-extraneous\">Less is more: removing the extraneous</h3>\n            <a href=\"#less-is-more-removing-the-extraneous\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>With Origin CA, we questioned all aspects of certificate issuance and browser validation, from domain control validation (DCV) to path bundling and revocation checking. We asked ourselves what cruft public CAs would remove from certificates if they only needed to work with one browser, whose codebase they maintained? Questions such as &quot;why bloat certificates with intermediate CAs when they only need to speak with our NGINX-based reverse proxy&quot; and &quot;why force customers to reconfigure their web or name server to pass DCV checks when they’ve already demonstrated control during zone onboarding?&quot; helped shape our efforts.</p><p>The result of us asking these questions and removing anything not needed to secure the connection between our servers and yours is described below, along with the benefits you may see and the interfaces you may use. We’re excited to introduce this third option for protecting your origin—more secure than self-signed certificates and more convenient, performant, and cost effective than publicly trusted certificates—and look forward to hearing about all the various ways you may use it.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-are-the-incremental-benefits-of-origin-ca-over-public-certificates\">What are the incremental benefits of Origin CA over public certificates?</h3>\n            <a href=\"#what-are-the-incremental-benefits-of-origin-ca-over-public-certificates\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <h4>1. Ease of issuance and renewal</h4><p>The most difficult and time-consuming part of securing your origin with TLS is obtaining—and renewing—a certificate. Or many certificates if you’re using a provider that doesn’t support wildcards. Often this process requires intimate knowledge of OpenSSL or related command line tools, a reconfiguration of your web or DNS server to accommodate domain control validation, and a regularly scheduled reminder or cron job to perform this process again every year (or even every few months). With Origin CA, we took the opportunity to remove as many of these obstacles as possible.</p><p>Customers more comfortable in the GUI can, with just two clicks, securely generate a private key and wildcard certificate that will be trusted by our systems for anywhere from 7 days to 15 years. And those who prefer more control over the process can use our API or CLI to issue certificates of specified validity, key type, and key size. Regardless of the user interface chosen, the potentially complicated validation process has been replaced by a simple API key now available in your account on the CloudFlare dashboard; we’ve already verified you control your zone, there’s no need to prove it again.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4aKKwwFmI91bim9WOmJ0HE/964987aa5fa3c333362f82248b16e87c/strict-ssl.png\" alt=\"\" class=\"kg-image\" width=\"1000\" height=\"480\" loading=\"lazy\"/>\n            \n            </figure><h4>2. Wildcard certificates reduce complexity</h4><p>If your origin server handles traffic for more than a few hostnames, it can get unwieldy to place a long list of SANs on each certificate request. The alternative—placing just one SAN on each certificate and using Server Name Indication (SNI) extension to lazy load the correct certificate—can easily get out of hand. In this deployment scenario the number of certificates required is a non-trivial fraction of the the number of hostnames you wish to protect (not to mention you may not even be allowed to do so on shared hosts).</p><p>Beyond provisioning efforts, placing too many SANs on a single certificate can <a href=\"https://cabforum.org/pipermail/performance/2014-May/000047.html\">significantly increase the size</a> of the certificate. Larger certificates consume more bandwidth at your origin (which, unlike CloudFlare, may bill you for marginal bandwidth consumption). The obvious answer for protecting more than a few hostnames (or even domains) on your origin is to use wildcard certificates. With Origin CA, you can request a single certificate containing wildcards for any and all of the zones registered in your account; you can even add wildcards covering multiple levels of a domain, e.g., <code>*.example.com</code>, <code>*.secure.example.com</code>, and <code>*.another-example.com</code> can all co-exist on the same certificate.</p><h4>3. Speed and simplicity of revocation</h4><p>If you’ve ever tried revoking a publicly trusted certificate—or relying on browsers to distrust a revoked certificate—you know how unreliable the process can be. Take your pick of explanations from Google crypto-wunderkind Adam Langley—<a href=\"https://www.imperialviolet.org/2011/03/18/revocation.html\">Revocation doesn’t work</a> (2011); <a href=\"https://www.imperialviolet.org/2014/04/19/revchecking.html\">No, don’t enable revocation checking</a> (2014); or <a href=\"https://www.imperialviolet.org/2014/04/29/revocationagain.html\">Revocation still doesn’t work</a> (2014)—they all reach the same conclusion: browser-based revocation checking is broken and useless without hard fails. (The advent of the OCSP Must-Staple extension should improve the situation, but if history is any indication it will be quite a while before sufficient browsers, certificate authorities, and issued certificates support it.)</p><p>Fortunately with Origin CA, we only need one &quot;browser&quot; to respect revocation: our edge. Failing hard—the only acceptable way to fail from a security perspective—is incredibly simple (and fast) when your user agent has an in-memory list of all valid certificates. (Try doing that with the millions of certificates issued by dozens of CAs over the past few years!) Rather than fire requests across the public Internet and praying they return quickly enough, our NGINX instances can just query a local database for each new HTTPS session and confirm in microseconds whether you’ve revoked the certificate for any reason.</p><p>And if/when the time comes to revoke, a single click and confirmation is all that’s required for our edge to distrust the certificate. If you expose or misplace your private key (and can’t find it under the couch or in the pockets of yesterday’s pants), simply navigate to the Crypto tab and click the &quot;x&quot; icon next to the compromised certificate. Within seconds we’ll push this revocation status worldwide and our edge servers will refuse to communicate with origins serving the revoked certificate. Such speed, security, and reliability is impossible without total control over the CA and browser ecosystem.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5k3l2VOBwjSwhRBAOEZLgw/da92ae3db4bc9b91916e6f6e9c5c41ba/revoke-modal.png\" alt=\"\" class=\"kg-image\" width=\"920\" height=\"960\" loading=\"lazy\"/>\n            \n            </figure><p>Even if published to the world, to abuse your CloudFlare Origin CA certificate an attacker would either need to compromise your CloudFlare account or take control of your <a href=\"https://www.cloudflare.com/learning/dns/glossary/what-is-a-domain-name-registrar/\">registrar</a> or DNS provider account. In any case, you&#39;d have a lot more to worry about than just a compromised certificate.</p><h4>4. Widely supported install base</h4><p>While most web server operators will elect to download the default PEM format for their certificate (as expected by Apache httpd and NGINX), many others will require a different variation. As illustrated in the screenshots below, certificates can be downloaded in several different formats, including DER, the binary equivalent of PEM’s ASCII, and PKCS#7, the Microsoft IIS Server and Apache Tomcat-compatible choice. Simply pick what works for your server and download it; there’s no need to learn cryptic command-line methods for converting.</p><p>Besides additional formats, we also have <a href=\"https://support.cloudflare.com/hc/en-us/articles/218408028\">instructions for a wide variety of operating systems and web servers</a>. After generating your certificate simply select your desired destination from the 80+ different options and instructions specific to your environment will be displayed.</p><h4>5. Optimized certificates increase performance and reduce origin bandwidth consumption</h4><p>Before a user agent can securely transmit HTTP actions like GET and POST to a web server, it must first establish the TLS session. To do so, the client kicks off a handshake by <a href=\"/tls-certificate-optimization-technical-details#step1clienthello\">sending its own capabilities</a> and the server responds with the negotiated cipher suite and certificate that should be used to protect the conversation agreeing upon a symmetric key.</p><p>Until the client receives—and validates—the certificate(s) sent across the network by the origin, it is unable to complete the handshake and commence with requesting data. As such, it’s in the best interest of performance-sensitive users to make this certificate as small and unencumbered as possible. (Ideally the packet containing the certificate even fits within a single frame and is not fragmented during transmission.) One <a href=\"https://cabforum.org/pipermail/performance/2014-May/000047.html\">brief survey</a> by a member of the <a href=\"https://cabforum.org/\">CA/B Forum</a> found that while the majority of certificates were between 1-2 kB, several thousand were found in the wild at least 10 kB in size, with one even over 50(!) kB.</p><p>With Origin CA certificates, we’ve stripped everything that’s extraneous to communication between our servers and yours to produce the smallest possible certificate and handshake. For example, we have no need to bundle intermediate certificates to assist browsers in building paths to trusted roots; no need to include signed certificate timestamps (SCTs) for purposes of certificate transparency and EV treatment; no need to include links to Certification Practice Statements or other URLs; and no need to listen to Online Certificate Status Protocol (OCSP) responses from third-parties.</p><p>Eliminating these unnecessary components typically found in certificates from public CAs has allowed us to reduce the size of the handshake by up to 70%, from over 4500 bytes in some cases to under 1300. You can replicate this test yourself using the following two OpenSSL s_client calls:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ for host in google.com bing.com cloudflare.com patriots.com; do echo -en &quot;$host\\t&quot; &amp;&amp; openssl s_client -connect www.$host:443 -servername www.$host 2&gt;/dev/null &lt;/dev/null | grep &quot;has read&quot;; done\ngoogle.com      SSL handshake has read 3747 bytes and written 497 bytes\nbing.com        SSL handshake has read 4252 bytes and written 583 bytes\ncloudflare.com  SSL handshake has read 3845 bytes and written 501 bytes\npatriots.com    SSL handshake has read 4507 bytes and written 499 bytes\n\n$ openssl s_client -connect [ORIGIN_IP]:443 -servername [ORIGIN_HOSTNAME] 2&gt;/dev/null &lt;/dev/null | grep &quot;has read&quot;\nSSL handshake has read 1289 bytes and written 496 bytes</pre></code>\n            \n          <div class=\"flex anchor relative\">\n            <h3 id=\"how-can-origin-ca-be-used\">How can Origin CA be used?</h3>\n            <a href=\"#how-can-origin-ca-be-used\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Now that you&#39;ve learned why you may want to use Origin CA-issued certificates on your origin, let’s explore the various interfaces you have for issuing (and revoking) them. Effective immediately, certificates for your origin can be issued in an automated fashion through our <a href=\"/cloudflare-ca-encryption-origin/#2apiapplicationprogramminginterface\">API</a> or <a href=\"/cloudflare-ca-encryption-origin#3clicommandlineinterfacelinuxonly\">CLI</a>, or through a guided wizard in the Crypto app on the <a href=\"https://www.cloudflare.com\">CloudFlare Dashboard</a>. Each of the three available methods is described below along with examples:</p><h4>1. GUI: Crypto app in the CloudFlare Dashboard</h4><p>To get started, login to <a href=\"https://www.cloudflare.com/a/login\">the dashboard</a> and click on the Crypto icon.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7aYmz9vQ74KDbgLUdkoghd/44a035da25632fcf2dada27d6a30fdb4/heading.png\" alt=\"\" class=\"kg-image\" width=\"1936\" height=\"348\" loading=\"lazy\"/>\n            \n            </figure><p>Next, scroll down to the Origin Certificates card and click the &quot;Create Certificate&quot; button.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/16CIs13h8n6Utv9q0vzMFO/3237f8b2c9cfc0c4914a558e2818ba86/origin-certificates-emptytable.png\" alt=\"\" class=\"kg-image\" width=\"1958\" height=\"522\" loading=\"lazy\"/>\n            \n            </figure><p>At this point, you must decide whether you wish to provide your own certificate signing request (CSR) or let your browser create one using its cryptographic libraries.</p><p>If you’ve already generated a private key and CSR, select the radio button labeled &quot;I have my own CSR&quot; and paste the CSR contents into the textbox that appears. Alternatively, leave the default option of “Let CloudFlare generate a key pair using my browser” selected. (If you are accessing the dashboard using an older browser, i.e., one that does not support <a href=\"https://www.w3.org/TR/WebCryptoAPI/\">Web Crypto API</a>, you will only see one option.)</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7tbWU0IOrjnp3dgQ1W2m5p/0f9c2b76faeae58add069ac53bb5db34/create-step1.png\" alt=\"\" class=\"kg-image\" width=\"1634\" height=\"1200\" loading=\"lazy\"/>\n            \n            </figure><p>By default, the list of hostnames your origin certificate covers includes the apex of the currently selected zone (example.com) and one level of wildcard (*.example.com). If you’d like to protect additional hostnames outside this list (e.g., *.secure.example.com), simply type them in the input box at the bottom of the modal. You may add up to 100 hostnames (or wildcards) on a single certificate, spanning multiple zones, provided they are for zones active in your account. Please keep in mind that each additional SAN increases the size of your certificate, so applications requiring frequent updates to the origin (and thus TLS handshakes) you should use as few SANs as possible.</p><p>After entering additional hostnames (or confirming the defaults will suffice), click Next and your certificate will be generated. By default, it will be displayed in PEM format, which is what web servers such as Apache httpd and NGINX expect. If you require an alternative format, such as PKCS#7 for Microsoft’s IIS or Apache Tomcat, change the dropdown box appropriately and save the contents to your server. Or if you’d like to use a binary format such as DER, select that and click the download button.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1ES61XNDaqGSGALF2KrHQn/676dcf8c3a077522868fb3fbfa8efc4b/generated-cert.png\" alt=\"\" class=\"kg-image\" width=\"1703\" height=\"970\" loading=\"lazy\"/>\n            \n            </figure><p>Lastly, choose your web server from the select box at the bottom of the window and click &quot;Show instructions&quot;. Doing so will open installation instructions in a new browser window that, once followed, will allow you to adjust your SSL setting (at the top of the Crypto app) to &quot;Strict&quot; mode.</p><h4>2. API: Application Programming Interface</h4><p>If you would like to automate the process of issuing certificates for your origin, or require more control over the parameters (e.g., shorter-lived certificates, greater key size, etc.), you can make use of our <a href=\"https://api.cloudflare.com/#origin-ca-properties\">certificates API endpoint</a>.</p><p>Before calling the <a href=\"https://www.cloudflare.com/learning/security/api/what-is-an-api/\">API</a> you will first need to generate a certificate signing request. To do so, you can use <a href=\"https://github.com/cloudflare/cfssl\">cfssl</a> or <a href=\"https://www.openssl.org/\">OpenSSL</a>. Instructions for the former can be <a href=\"/universal-ssl-encryption-all-the-way-to-the-origin-for-free/\">found here</a>, while our friends at DigiCert have provided an <a href=\"https://www.digicert.com/easy-csr/openssl.htm\">easy-to-use wizard</a> for the latter. Don&#39;t worry about including subject alternative names (SANs) in the CSR — we’ll take those in separately through the JSON payload.</p><h5>i. Generate a private key and CSR</h5>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ openssl req -new -newkey rsa:2048 -nodes -out www_example_com.csr -keyout www_example_com.key -subj &quot;/C=US/ST=California/L=/O=/CN=www.example.com&quot;\nGenerating a 2048 bit RSA private key\n.............................+++\n.....................................................................................................................................+++\nwriting new private key to &#039;www_example_com.key&#039;</pre></code>\n            <h5>ii. Obtain your Certificate API token</h5><p>Log in to the CloudFlare dashboard, and click My Settings under your username in the top-right  hand corner. Scroll down to the API Key panel and click &quot;View API Key&quot;.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2R4UWX1Op2jBlpfPW5e6kU/bf74052f2492140c0e873a72e483aad0/api-key-panel.png\" alt=\"\" class=\"kg-image\" width=\"1944\" height=\"560\" loading=\"lazy\"/>\n            \n            </figure><p>Click within the window that pops up and then copy the contents that is auto-selected to your clipboard. Save the key to an environment variable as it will be used in the subsequent curl command.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1dS3x5a8AGAuZcewhbA05d/704873d37a4d2f6ed8c0cfc7be9472cf/scoped-token-data.png\" alt=\"\" class=\"kg-image\" width=\"926\" height=\"546\" loading=\"lazy\"/>\n            \n            </figure>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$   export CF_API_KEY=&quot;v1.0-c9...&quot;</pre></code>\n            <h5>iii. Make the API call</h5><p>Note that you will need to remove newlines from the CSR as newlines are not permitted in JSON and add them back into the certificate that’s returned. When you remove them you should replace the newline character (hex code 0A) with the string &quot;\\n&quot;.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ curl -sX POST https://api.cloudflare.com/client/v4/certificates/ \\\n-H &quot;Content-Type: application/json&quot; \\\n-H &quot;Accept: application/json&quot; \\\n-H &quot;X-AUTH-USER-SERVICE-KEY: $CF_API_KEY&quot; \\\n--data &#039;{&quot;hostnames&quot;:[&quot;example.com&quot;,&quot;*.example.com&quot;],&quot;requested_validity&quot;:&quot;365&quot;,&quot;request_type&quot;:&quot;origin-rsa&quot;,&quot;csr&quot;:&quot;-----BEGIN CERTIFICATE REQUEST-----...-----END CERTIFICATE REQUEST-----&quot;}&#039;</pre></code>\n            <h5>iv. Extract certificate from API response</h5>\n            <pre class=\"language-bash\"><code class=\"language-bash\">{\n  &quot;success&quot;: true, &quot;errors&quot;: [], &quot;messages&quot;: [],\n  &quot;result&quot;: {\n    &quot;id&quot;: &quot;0x47530d8f561faa08&quot;,\n    &quot;certificate&quot;: &quot;-----BEGIN CERTIFICATE-----...-----END CERTIFICATE-----&quot;,\n    &quot;hostnames&quot;: [ &quot;example.com&quot;, &quot;*.example.com&quot; ],\n    &quot;expires_on&quot;: &quot;2014-01-01T05:20:00.12345Z&quot;,\n    &quot;request_type&quot;: &quot;origin-rsa&quot;,\n    &quot;requested_validity&quot;: &quot;365&quot;,\n    &quot;csr&quot;: &quot;-----BEGIN CERTIFICATE REQUEST-----...-----END CERTIFICATE REQUEST-----&quot;\n  }\n}</pre></code>\n            <h4>3. CLI: Command Line Interface (Linux only)</h4><p>Lastly, if you’re using a Linux platform that supports RPM or DEB packages, the easiest way to request certificates is with the Origin CA CLI. Before proceeding, make sure you follow the instructions above in the API example to save your API key in the CF_API_KEY environment variable.</p><p>To get started, browse to <a href=\"https://pkg.cloudflare.com/\">https://pkg.cloudflare.com/</a> and follow the instructions to add the CloudFlare Package Repository to your system. With the new package server in place, use apt or yum to install the &quot;cfca&quot; package (binary placed in /usr/local/bin on DEbian, e.g.,) and then issue a certificate in a manner similar to the following examples:</p><h5>i. Default parameters (RSA key, 15 year validity)</h5>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ /usr/local/bin/cfca getcert -hostnames example.com,*.example.com\n2016/04/25 19:47:23 [INFO] generate received request\n2016/04/25 19:47:23 [INFO] received CSR\n2016/04/25 19:47:23 [INFO] generating key: rsa-2048\n2016/04/25 19:47:24 [INFO] encoded CSR\n2016/04/25 19:47:24 [INFO] Connecting to https://api.cloudflare.com/client/v4/certificates/\n2016/04/25 19:47:25 [INFO] Successfully issued certificate for:\n*.example.com\nexample.com\n2016/04/25 19:47:25 [INFO] Saved generated private key to wildcard.example.com.key\n2016/04/25 19:47:25 [INFO] Saved issued certificate to wildcard.example.com.pem</pre></code>\n            <h5>ii. Short-lived multi-zone ECC example (ECDSA key, 7 day validity)</h5>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ /usr/local/bin/cfca getcert -days 7 -hostnames *.foo.com,*.bar.com -key-type ecdsa -key-size 256\n2016/04/26 12:24:24 [INFO] generate received request\n2016/04/26 12:24:24 [INFO] received CSR\n2016/04/26 12:24:24 [INFO] generating key: ecdsa-256\n2016/04/26 12:24:24 [INFO] encoded CSR\n2016/04/26 12:24:24 [INFO] Connecting to https://api.cloudflare.com/client/v4/certificates/\n2016/04/26 12:24:28 [INFO] Successfully issued certificate for:\n*.foo.com\n*.bar.com\n2016/04/26 12:24:28 [INFO] Saved generated private key to wildcard.foo.com.key\n2016/04/26 12:24:28 [INFO] Saved issued certificate to wildcard.foo.com.pem\n\n$ cat wildcard.foo.com.pem | openssl x509 -noout -text | grep &quot;Not After\\|Public Key Algorithm\\|DNS&quot;\nNot After : May  3 19:19:00 2016 GMT\nPublic Key Algorithm: id-ecPublicKey\nDNS:*.foo.com, DNS:*.bar.com</pre></code>\n            \n          <div class=\"flex anchor relative\">\n            <h3 id=\"final-recommendations-feedback\">Final Recommendations & Feedback</h3>\n            <a href=\"#final-recommendations-feedback\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>As you use Origin CA to generate certificates and secure your origin servers, keep these recommendations in mind:</p><ol><li><p>Use Origin CA to generate certificates for your origin servers, using wildcards for each zone to keep SANs to a minimum.</p></li><li><p>Upgrade each zone’s SSL setting from &quot;Flexible&quot; or &quot;Full&quot; to &quot;Strict&quot; mode you have Origin CA or public CA certificates installed protecting all hostnames in that zone.</p></li><li><p>If you were previously enrolled in our beta Origin CA program, you should issue new certificates so they include revocation endpoints.</p></li><li><p>When pausing CloudFlare or gray-clouding individual zones, be aware that you and your visitors may receive errors in their browsers until you orange-cloud (reverse proxy) them again.</p></li></ol><p>If you encounter any difficulty issuing certificates, or have any other concerns or suggestions, please open a <a href=\"https://support.cloudflare.com\">support ticket</a> and we will be happy to assist you.</p>",
		"id": "3MT7j1dVgl6kulh4PkOBRJ",
		"localeList": {
			"name": "Introducing CloudFlare Origin CA Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Faster, more secure alternative to public CA certificates for your CloudFlare-fronted servers. Extraneous overhead removed to optimize performance.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2016-05-03T12:40:25.000+01:00",
		"slug": "cloudflare-ca-encryption-origin",
		"tags": [
			{
				"id": "5US4l4wdDysuDpZ4ktL3yP",
				"name": "HTTPS",
				"slug": "https"
			},
			{
				"id": "56vA0Z6hqev6QaJBQmO2J8",
				"name": "TLS",
				"slug": "tls"
			},
			{
				"id": "6uS58ojEakXOXkakCKtKk3",
				"name": "Universal SSL",
				"slug": "universal-ssl"
			},
			{
				"id": "1HblPaFreDjetoJDJPjTAi",
				"name": "SSL",
				"slug": "ssl"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			}
		],
		"title": "Introducing CloudFlare Origin CA",
		"updated_at": "2024-08-27T02:35:01.533Z",
		"url": "https://blog.cloudflare.com/cloudflare-ca-encryption-origin"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}