{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "8",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"ja-jp",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Dina Kozlov",
				"slug": "dina",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/bY78cK0burCjZbD6jOgAH/a8479b5ea6dd8fb3acb41227c1a4ad0e/dina.jpg",
				"location": null,
				"website": null,
				"twitter": "@dinasaur_404",
				"facebook": null
			}
		],
		"excerpt": "Before today, SSL for SaaS was only available to Enterprise customers. Today, we are excited to announce that our SaaS solution is available to everyone. And to reflect the evolution of the product since it was first released, we’re changing the name: Cloudflare for SaaS.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3oQ2N6j1MuPvZtqXMgyK7o/d56ad3eeab8272e93e487b52be35fee7/cloudflare-for-saas.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7d3D2HKZ77Fmiqiyhdj0vy/30780f35a03ad3a5661d0fa243490408/image1-22.png\" alt=\"\" class=\"kg-image\" width=\"1619\" height=\"836\" loading=\"lazy\"/>\n            \n            </figure><p>Software as a Service (SaaS) is one of the <a href=\"https://www.bmc.com/blogs/saas-growth-trends/\">fastest-growing</a> business segments in the IT market. SaaS providers can be anything from a web hosting provider to a subscription service, to an e-commerce platform. While well-known SaaS providers are industry giants, every day new SaaS companies are created, with the potential to become the next Salesforce.</p><p>But while it’s a fast-growing segment, if you’re a SaaS company, you know it’s not an easy path to forge.</p><p>Cloudflare <a href=\"/introducing-ssl-for-saas/\">released</a> a solution to help our SaaS customers four years ago — it’s called <a href=\"https://www.cloudflare.com/ssl-for-saas-providers/\">SSL for SaaS</a>. It’s perfect for those who need to manage their customers’ websites and SSL certificates at scale, and it’s been adopted by some of the leading SaaS companies in the world, from <a href=\"https://www.cloudflare.com/case-studies/wp-engine/\">WP Engine</a> to <a href=\"https://www.cloudflare.com/case-studies/shopify/\">Shopify</a> to <a href=\"https://www.cloudflare.com/case-studies/hubspot/\">HubSpot</a>. As the product has evolved, it has become a one-stop-shop for SaaS providers looking to provide fast load times, unparalleled redundancy, and the strongest security to their customers. Now, over 10 million applications have inherited the full benefits of the Cloudflare network through their SaaS provider.</p><p>Before today, SSL for SaaS was only available to Enterprise customers. Today, we are excited to announce that our SaaS solution is available to everyone. And to reflect the evolution of the product since it was first released, we’re changing the name: Cloudflare for SaaS.</p><p>The beta is available today — submit your request <a href=\"https://forms.gle/crARoXd4taCtoSti8\">here</a> to try it out!</p><p>If you&#39;re starting a SaaS business, the value proposition is clear: <a href=\"https://www.cloudflare.com/saas/\">Cloudflare for SaaS</a> takes care of your underlying infrastructure, enabling you to keep your team lean and focused on building out your core solution. We’ve spent years investing in certificate issuance, building out our security and performance suite of products. Now we make it easy for you to extend all of the benefits we provide for your domain, to your end customers.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"its-technically-tricky-to-build-a-saas-business\">It’s Technically Tricky to Build a SaaS Business</h2>\n            <a href=\"#its-technically-tricky-to-build-a-saas-business\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>We know first hand the many challenges of building a successful SaaS business. We are not going to tell you how to run your business, but we can share what we&#39;ve learned about the core infrastructure requirements — and how Cloudflare is well-positioned to address them.</p><p>Today, the way many SaaS providers offer their services is by giving their customers a web application that’s hosted on their origin (or, often, on Cloudflare).</p><p>Suppose you’re building a SaaS service for building e-commerce sites. You can give your customers a dedicated subdomain, like myshop.example.com, but it’s likely that your customers will come back asking to run the application on myshopsactualname.com. To give customers a branded experience, SaaS providers are required to support vanity domains.</p><p>This is more onerous than it sounds.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3cCTIET38bt2HSbMMpgzzL/81724e63a38f62ae157a123a70889568/image3-7.png\" alt=\"\" class=\"kg-image\" width=\"1639\" height=\"1322\" loading=\"lazy\"/>\n            \n            </figure><p>Once an application has been spun up, the next step is to provision TLS certificates for both the SaaS provider’s application and their customers. Developers may start looking into building out their homespun solution where they have to architect a whole pipeline around making API calls to a Certificate Authority. That means validating certificates, renewing them, and storing them.  There are many states to account for in order to prevent certificate failures and uptime for your customers, which translates into a heavy engineering investment.</p><p>But here’s the thing: every hour of time you invest in doing this, is an hour that can’t be spent on engineering efforts to build out the core part of your business.</p><p>You don’t have to just take our word for it. In building SSL for SaaS, we got to learn from best-in-class engineering teams who were running into challenges managing complex certificate management systems. <a href=\"https://www.cloudflare.com/case-studies/hubspot/\">HubSpot</a>, for example, rolled out their in-house solution in 2015 where they deployed SSL certificates that were shared amongst their customers. This became a short-term solution when they began to run into scaling difficulties, resulting in slow certificate deployment, and leaving their customers with an unsatisfactory experience.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"enter-ssl-for-saas\">Enter: SSL for SaaS</h3>\n            <a href=\"#enter-ssl-for-saas\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Cloudflare has been focused on certificate provisioning and management for many years — it’s at the core of our business. When we launched Universal SSL in 2014, we built our SSL pipeline to manage millions of certificates. We then decided to extend the benefits of our managed certificate issuance platform in 2017 to our SaaS provider customers, allowing them to secure their customer’s websites that they are responsible for managing.</p><p>This allowed customers like Hubspot to secure thousands of domains, without dedicating a big amount of engineering effort towards it. But while SSL for SaaS was originally built to handle certificate issuance, management, and renewals on behalf of our customers and their own customers, we’ve extended our solution far beyond just that.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"beyond-ssl\">Beyond SSL</h3>\n            <a href=\"#beyond-ssl\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>For SaaS providers, their customers’ businesses are reliant on them staying online, always being available, and being performant. When their customers sign up for their business, that’s the underlying promise that the SaaS provider is making.</p><p>Every day, the Internet sees attacks, malicious traffic, unexpected spikes in requests, and so on.</p><p>At Cloudflare, we’ve heavily invested in building out one of the largest, most resilient networks, with solutions that keep your applications and origins protected. This is one of our core value propositions for customers, and now SaaS-providers can extend it to their customers, too. With built-in DDoS mitigation, a resilient Web Application Firewall (WAF), and a Carrier-grade Bot Management solution, you can prevent costly disruptions and downtime for you and your customers, so that regardless of who attackers are targeting, you both stay online.</p><p>We not only take the burden off your engineering and support teams, but we make it easy for your end customers to inherit your security settings. Whatever benefits you set up for yourself, your customers will instantly assume them.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"beyond-security\">Beyond Security</h3>\n            <a href=\"#beyond-security\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>As a business, you want to provide the best experience for your users. Speed plays a big part in how we perceive our online experiences.</p><p>For SaaS businesses, investing in performance is a must. When doing so, you need to keep in mind that your customers are global and their eyes are located worldwide, meaning that end users might not always be close to your origin server.</p><p>Cloudflare for SaaS allows you to take advantage of our performant Anycast network with data centers in more than 100 countries that, when coupled with our speed and performance features like caching and Argo Smart Routing, can improve performance by 30%. This means that, if you’re an e-commerce site and your origin server is in North America, your global customers in Asia will get the same lightning-fast load times that your US visitors get, giving every customer the best experience.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"built-for-giants-and-future-giants\">Built for Giants … and Future Giants</h2>\n            <a href=\"#built-for-giants-and-future-giants\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>In January, we <a href=\"https://twitter.com/dinasaur_404/status/1351703331744321536\">announced</a> on Twitter that we had an SSL for SaaS beta open. What we didn’t expect was that ~80% of our beta users were building their SaaS application on Workers. In retrospect, it makes total sense: in the same way that managing and scaling an SSL pipeline can take precious time and resources from building out the core business, managing and scaling infrastructure can be costly and time-consuming.</p><p>By marrying Cloudflare for SaaS with Workers, SaaS companies can unleash their developers — we’ll take care of not just certificate management, security, and performance, but also the burden of infrastructure.</p><p>You write the code, and we’ll take care of the rest.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7vju7DxminkYK3iDbfP6NZ/fd541a695b7b0e32b9bf2a64db4e2b68/image2-15.png\" alt=\"\" class=\"kg-image\" width=\"1586\" height=\"671\" loading=\"lazy\"/>\n            \n            </figure><p>The best part of building for developers is getting to see what they build. Here, we’re going to showcase some of the amazing projects already built on our platform that have taken the path we’ve just described:</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"statusflare-a-status-page-platform\">Statusflare: A Status Page Platform</h3>\n            <a href=\"#statusflare-a-status-page-platform\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p><a href=\"http://statusflare.com\">Statusflare</a> is a tool for monitoring your websites and applications because the only thing worse than downtime is not knowing about it. The Statusflare team has built out a solution that allows businesses to deploy global checks around the world to monitor uptime, metrics, and server response time. Beyond that, they allow their customers to deploy status pages, so their customers stay informed about the availability of their services.</p><p>When building out their status page product, the Statusflare team decided to use Workers as their deployment platform. This allowed them to spend all their time writing code and building out their API, and zero time worrying about deploying an origin server. Once the Statusflare team had finished building their application, they were ready to integrate it with their customers’ vanity domains, so that anyone could set up a status page for their website.</p><p>The challenge they then faced was getting their customers the latest version of their product. To start, they decided to open source their solution, give their customers the Workers script, and have their customers deploy it to get their status page up and running. But this makes updates complicated, and instead of giving their end-users the latest version, customers were now responsible for updates.</p><p>Not just that — they also had to spend time integrating with certificate authorities to issue certificates, so their customers’ pages stay protected.</p><p>Statusflare found that Cloudflare for SaaS was the perfect solution to help them grow. With easy-to-use integration for custom domains, all they now had to do was to click a few buttons, and their end-users could use a vanity domain, pull the latest update of the status page, and get a certificate deployed. Beyond that, Statusflare is now looking to integrate their solution with Cloudflare Access and Teams, so their customers can keep their monitoring private and only allow authorized users. With built-in security and rate limiting, Statusflare never has to worry about the number of incoming requests, or scaling their application. Statusflare was very excited to share that having everything in one place means that they don’t have to worry about scaling or provisioning servers, they don’t have to worry about the availability of their customer’s domains, and instead of investing time in keeping their application stable, they can now focus on writing code and building out their product.</p><blockquote><p>With Cloudflare, our application scales on its own, it scales to infinity.- <b>Adam, founder of Statusflare</b>.</p></blockquote>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"pluma-all-in-one-platform-for-publishing-blogs-and-podcasts\">PLUMA: All-in-One Platform for Publishing Blogs and Podcasts</h3>\n            <a href=\"#pluma-all-in-one-platform-for-publishing-blogs-and-podcasts\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p><a href=\"https://pluma.cloud/\">PLUMA</a> is an audio hosting service, a blogging platform, and a privacy-focused analytics service for websites and mobile apps that is currently in the making. It’s built on Workers, meaning the application fully runs on Cloudflare’s edge, with 0ms cold starts. With Workers KV, PLUMA is able to store all of its data, i.e. session data, static files, and logs, on Cloudflare’s edge, providing their end-users with a low latency service. One of the biggest requests from PLUMA users was for customers to be able to use their own branded domain, instead of one that PLUMA provides. With Cloudflare for SaaS, PLUMA can easily offer this experience to their end-users, with the extended benefit of keeping their customers’ sites secured with a TLS certificate.</p><blockquote><p>Cloudflare for SaaS makes it easy to integrate any number of domains with Workers. This makes Cloudflare a wonderful platform for building out low latency serverless applications.- <b>Pier Bover, founder of PLUMA</b></p></blockquote>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"plink-smart-links-for-podcasts\">Plink: Smart Links for Podcasts</h3>\n            <a href=\"#plink-smart-links-for-podcasts\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Plink makes universal links for podcasts. One of the top feature requests from their customers has been to have their own custom domains. As an early-stage startup, Plink was looking for a cost-effective solution that would help them optimize their application, scale, and provide a customized experience for their users. With Workers and Workers KV, they were able to optimize their core scripts and functionality, without worrying about DevOps. This, coupled with Cloudflare for SaaS, allowed them to create a “custom-branded” experience of their service to external domains that were owned by their customers.</p><blockquote><p>Connecting Plink’s API with Cloudflare’s API has been a seamless experience. In general, building with Workers is amazing! I&#39;m excited to provide a branded experience for Plink customers with Cloudflare for SaaS. - <b>Scott Mathson, Founder at Plink</b></p></blockquote>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"try-out-cloudflare-for-saas-today\">Try out Cloudflare for SaaS Today!</h2>\n            <a href=\"#try-out-cloudflare-for-saas-today\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>When developers are starting to build out their next SaaS application, there’s a long list of things they don’t want to worry about. Instead of allocating their engineering resources to work on their infrastructure, they should be dedicating their time building the next billion dollar business.</p><p>That’s what we’re enabling. And with our beta announced today, we’re doing it for everyone.</p><p>The end result: you can build the next groundbreaking SaaS business, and we’ll take care of the rest. To sign up for the beta, submit your request <a href=\"https://forms.gle/crARoXd4taCtoSti8\">here</a>. We will be admitting customers on a rolling basis, and allotting 20 custom hostnames to each domain.</p><p>Request to join our beta <a href=\"https://forms.gle/crARoXd4taCtoSti8\">here</a>!</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"enterprise-customers-stay-tuned\">Enterprise customers, stay tuned</h2>\n            <a href=\"#enterprise-customers-stay-tuned\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>While we’re super excited about making Cloudflare for SaaS available to everyone, we know that our largest Enterprise customers have some demanding and specialized needs. We’ve been hard at work to build out new features to satisfy them. Stay tuned for an exciting announcement in the upcoming weeks!</p>",
		"id": "1O2h56PLWBcxtCHNGK0U64",
		"localeList": {
			"name": "Announcing Cloudflare for SaaS for Everyone Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Before today, SSL for SaaS was only available to Enterprise customers. Today, we are excited to announce that our SaaS solution is available to everyone. And to reflect the evolution of the product since it was first released, we’re changing the name: Cloudflare for SaaS.",
		"metadata": {
			"title": "Announcing Cloudflare for SaaS for Everyone",
			"description": "Before today, SSL for SaaS was only available to Enterprise customers. Today, we are excited to announce that our SaaS solution is available to everyone. And to reflect the evolution of the product since it was first released, we’re changing the name: Cloudflare for SaaS.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6BtaPyP9EqxkA8Iy00psso/9d781510172a73eb4160215f122a11a8/cloudflare-for-saas-ikgj8R.png"
		},
		"primary_author": {},
		"published_at": "2021-04-15T14:00:00.000+01:00",
		"slug": "cloudflare-for-saas",
		"tags": [
			{
				"id": "2xCnBweKwOI3VXdYsGVbMe",
				"name": "Developer Week",
				"slug": "developer-week"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "7xVFrC2ME3CztgeqnLfaqZ",
				"name": "SaaS",
				"slug": "saas"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "44XpnybGjuati3QSYCQoQo",
				"name": "Cloudflare for SaaS",
				"slug": "cloudflare-for-saas"
			}
		],
		"title": "Announcing Cloudflare for SaaS for Everyone",
		"updated_at": "2024-10-09T23:05:48.798Z",
		"url": "https://blog.cloudflare.com/cloudflare-for-saas"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}