{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"ja-jp",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Sam Rhea",
				"slug": "sam",
				"bio": " ",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2U8kgggIwXALYQIRjBDjyp/92b2ece0016e6d71c0e97606f47b2692/sam.png",
				"location": null,
				"website": null,
				"twitter": "@LakeAustinBlvd",
				"facebook": null
			}
		],
		"excerpt": "Cloudflare Zero Trust named to Gartner® Magic Quadrant™ for Security Service Edge",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3RQGJwWVrXLV07OQeK5zaK/5da05645eff27aea06c09c347575f82a/cloudflare-sse-gartner-magic-quadrant.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5f8Dl6fedmDRmheRrIf5vt/e7f3bbfab8e95086c89748a06759698a/unnamed--1-.png\" alt=\"Cloudflare One named in Gartner® Magic Quadrant™ for Security Service Edge\" class=\"kg-image\" width=\"1200\" height=\"627\" loading=\"lazy\"/>\n            \n            </figure><p>Gartner has recognized Cloudflare in the 2023 “Gartner® Magic Quadrant™ for Security Service Edge (SSE)” report for its ability to execute and completeness of vision. We are excited to share that the <a href=\"https://www.cloudflare.com/products/zero-trust/\">Cloudflare Zero Trust</a> solution, part of our <a href=\"https://www.cloudflare.com/cloudflare-one/\">Cloudflare One</a> platform, is one of only ten vendors recognized in the report.</p><p>Of the 10 companies named to this year’s Gartner® Magic Quadrant™ report, Cloudflare is the only new vendor addition. You can read more about our position in the report and what customers say about using Cloudflare One <a href=\"https://cloudflare.com/lp/gartner-magic-quadrant-sse-2023/\">here</a>.</p><p>Cloudflare is also the newest vendor when measured by the date since our first products in the SSE space launched. We <a href=\"/cloudflare-access-now-teams-of-any-size-can-turn-off-their-vpn/\">launched Cloudflare Access</a>, our best-in-class Zero Trust access control product, a little less than five years ago. Since then, we have released hundreds of features and shipped nearly a dozen more products to create a comprehensive SSE solution that over 10,000 organizations trust to keep their organizations data, devices and teams both safe and fast. We moved that quickly because we built Cloudflare One on top of the same network that already secures and accelerates large segments of the Internet today.</p><p>We deliver our SSE services on the same servers and in the same locations that serve some of the world’s largest Internet properties. We combined existing advantages like the <a href=\"https://1.1.1.1/\">world’s fastest DNS resolver</a>, Cloudflare’s <a href=\"https://workers.cloudflare.com/\">serverless compute</a> platform, and our ability to <a href=\"/network-performance-update-cio-edition/\">route and accelerate traffic</a> around the globe. We might be new to the report, but customers who select Cloudflare One are not betting on an upstart provider; they are choosing an industry-leading solution made possible by a network that already secures millions of destinations and billions of users every day.</p><p>We are flattered by the recognition from Gartner this week and even more thrilled by the customer outcomes we make possible today. That said, we are not done and we are only going faster.</p><h2>What is a Security Service Edge?</h2><p>A <a href=\"https://www.cloudflare.com/learning/access-management/security-service-edge-sse/\">Security Service Edge</a> (SSE) “secures access to the web, cloud services and private applications. Capabilities include access control, threat protection, data security, security monitoring, and acceptable-use control enforced by network-based and API-based integration. SSE is primarily delivered as a cloud-based service, and may include on-premises or agent-based components.”<sup>1</sup></p><p>The SSE space developed to meet organizations as they encountered a new class of security problems. Years ago, teams could keep their devices, services, and data safe by hiding from the rest of the world behind a figurative castle-and-moat. The defense perimeter for an enterprise corresponded to the literal walls of their office. Applications ran in server closets or self-managed data centers. Businesses could deploy firewalls, proxies, and filtering appliances in the form of on-premise hardware. Remote users suffered through the setup by backhauling their traffic through the physical office with a legacy virtual private network (VPN) client.</p><p>That model began to break down when applications started to leave the building. Teams began migrating to SaaS tools and public cloud providers. They could no longer control security by placing physical appliances in the flow of their one path to the Internet.</p><p>Meanwhile, users also left the office, placing stress on the ability of a self-managed private network to scale with the traffic. Performance and availability suffered while costs increased as organizations carried more traffic and deployed more bandaids to try and buy time.</p><p>Bad actors also evolved. Attacks became more sophisticated and exploited the migration away from a classic security perimeter. The legacy appliances deployed could not keep up with the changes in attack patterns and scale of attacks.</p><p>SSE vendors provide organizations with a cloud-based solution to those challenges. SSE providers deploy and maintain security services in their own points of presence or in a public cloud provider, giving enterprises a secure first hop before they connect to the rest of the Internet or to their internal tools. IT teams can deprecate the physical or virtual appliances that they spent days maintaining. Security teams benefit from filtering and policies that update constantly to defend against new threats.</p><p>Some SSE features target remote access replacement by offering customers the ability to connect users to internal tools with Zero Trust access control rules. Other parts of an SSE platform focus on applying Zero Trust scrutiny to the rest of the Internet, replacing the on-premise filtering appliances of an enterprise with cloud-based firewalls, resolvers, and proxies that filter and log traffic leaving a device closer to the user instead of forcing a backhaul to a centralized location.</p><h3>What about SASE?</h3><p>You might also be familiar with the term <a href=\"https://www.cloudflare.com/learning/access-management/what-is-sase/\">Secure Access Service Edge</a> (SASE). We hear customers talk about their “SASE” goals more often than “SSE” alone. SASE extends the definition of SSE to include managing the connectivity of the traffic being secured. Network-as-a-Service vendors help enterprises connect their users, devices, sites, and services. SSE providers <a href=\"https://www.cloudflare.com/network-services/solutions/enterprise-network-security/\">secure</a> that traffic.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2rkvq7XmV0DpUVvfW7Rew7/2ce0dc885acece011b3e1f00d9fbb982/Screenshot-2023-03-01-at-16.30.12.png\" alt=\"\" class=\"kg-image\" width=\"1614\" height=\"902\" loading=\"lazy\"/>\n            \n            </figure><p>Most vendors focus on one side of the equation. Network-as-a-service companies sell <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-an-sd-wan/\">software-defined wide area network (SD-WAN)</a>, interconnection, and traffic optimization solutions to help enterprises manage and accelerate connectivity, but those enterprises wind up losing those benefits by sending all that traffic to an SSE provider for filtering. SSE providers deliver security tools for traffic of nearly any type, but they still need customers to buy additional networking services to get that traffic to their locations.</p><p>Cloudflare One is a single vendor SASE platform. Cloudflare offers enterprises a comprehensive <a href=\"https://www.cloudflare.com/learning/network-layer/network-as-a-service-naas/\">network-as-a-service</a> where teams can send all traffic to Cloudflare’s network, where we can help teams manage connectivity and improve performance. Enterprises can choose from flexible on-ramps, like their existing hardware routers, agents running on laptops and mobile devices, physical and virtual interconnects, or Cloudflare’s <a href=\"/magic-wan-connector/\">own last mile connector</a>.</p><p>When that traffic reaches Cloudflare’s network, our SSE services apply security filtering in the same locations where we manage and route connectivity. Cloudflare’s SSE solution does not add additional hops; we deliver filtering and logging in-line with the traffic we accelerate for our customers. The value of our single vendor SASE solution is just another outcome of an obsession we’ve had since we first launched our reverse proxy over ten years ago: customers should not have to compromise performance for security and vice versa.</p><h2>So where does Cloudflare One fit?</h2><p><a href=\"https://www.cloudflare.com/cloudflare-one/\">Cloudflare One</a> connects enterprises to the tools they need while securing their devices, applications and data without compromising on performance. The platform consists of two primary components: our Cloudflare Zero Trust products, which represent our SSE offering, and our network-as-a-service solution. As much as today’s announcement separates out those features, we prefer to talk about how they work together.</p><p>Cloudflare’s network-as-a-service offering, our Magic WAN solution, extends our network for customers to use as their own. Enterprises can take advantage of the investments we have made over more than a decade to build out one of the world’s most peered, most performant, and most available networks. Teams can connect individual roaming devices, offices and physical sites, or entire networks and data centers through Cloudflare to the rest of the Internet or internal destinations.</p><p>We want to make it as easy as possible for customers to send us their traffic, so we provide many flexible “on-ramps” to easily fit into their existing infrastructure. Enterprises can use our roaming agent to connect user devices, our Cloudflare Tunnel service for application-level connectivity, network-level tunnels from our <a href=\"/magic-wan-connector/\">Magic WAN Connector</a> or their existing router or SD-WAN hardware, and/or direct physical or virtual interconnections for dedicated connectivity to on-prem or cloud infrastructure at 1,600+ locations around the world. When packets arrive at the closest Cloudflare location, we provide optimization, acceleration and logging to give customers visibility into their traffic flows.</p><p>Instead of sending that accelerated traffic to an additional intermediary for security filtering, our Cloudflare Zero Trust platform can take over to provide SSE security filtering in the same location - generally on the exact same server - as our network-as-a-service functions. Enterprises can pick and choose what SSE features they want to enable to strengthen their security posture over time.</p><h2>Cloudflare One and the SSE feature set</h2><p>The security features inside of Cloudflare One provide comprehensive SSE coverage to enterprises operating at any scale. Customers just need to send traffic to a Cloudflare location within a few milliseconds of their users and Cloudflare Zero Trust handles everything else.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7J0yjZm1I1A6k2VoaoM3DI/3e1b21972aa36c8740579a29ee8b699d/2fUYKtUxdMunJRmzZBz89PTwIW1ks_TR9qk7CoLnFVC_P8603M3x7o2MXqPkpAO5FmVj4Ew6eYBSsbQn6WfQ2wJEnwfNHE8Rf0vmQfCg1AqMsjjzVTLpneY1sVuT.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"590\" loading=\"lazy\"/>\n            \n            </figure><h3>Cloudflare One SSE Capabilities</h3><p><b>Zero Trust Access Control</b>Cloudflare provides a <a href=\"https://www.cloudflare.com/products/zero-trust/vpn-replacement/\">Zero Trust VPN replacement</a> for teams that host and control their own resources. Customers can deploy a private network inside of Cloudflare’s network for more traditional connectivity or extend access to contractors without any agent required. Regardless of how users connect, and for any type of destination they need, Cloudflare’s network gives administrators the ability to <a href=\"https://developers.cloudflare.com/cloudflare-one/policies/access/\">build granular rules</a> on a per-resource or global basis. Teams can combine one or more <a href=\"https://developers.cloudflare.com/cloudflare-one/identity/\">identity providers</a>, <a href=\"https://developers.cloudflare.com/cloudflare-one/identity/devices/\">device posture</a> inputs, and other sources of signal to determine when and how a user should be able to connect.</p><p>Organizations can also extend these types of Zero Trust access control <a href=\"/cloudflare-access-for-saas/\">rules to the SaaS applications</a> where they do not control the hosting by introducing Cloudflare’s identity proxy into the login flow. They can continue to use their existing identity provider but layer on additional checks like device posture, country, and multifactor method.</p><p><b>DNS filtering</b>Cloudflare’s DNS filtering solution runs on the world’s fastest DNS resolver, filtering and logging the DNS queries leaving individual devices or some of the <a href=\"/helping-keep-governments-safe-and-secure/\">world’s largest networks</a>.</p><p><b>Network firewall</b>Organizations that maintain on-premise hardware firewalls or cloud-based equivalents can deprecate their boxes by sending traffic through Cloudflare where our <a href=\"https://www.cloudflare.com/learning/cloud/what-is-a-cloud-firewall/\">firewall-as-a-service</a> can filter and log traffic. Our Network Firewall includes L3-L7 filtering, Intrusion Detection, and direct integrations with our Threat Intelligence feeds and the rest of our SSE suite. It enables security teams to build sophisticated policies without any of the headaches of traditional hardware: no capacity or redundancy planning, no throughput restrictions, no manual patches or upgrades.</p><p><b>Secure Web Gateway</b>Cloudflare’s <a href=\"https://www.cloudflare.com/products/zero-trust/gateway/\">Secure Web Gateway</a> (SWG) service inspects, filters, and logs traffic in a Cloudflare PoP close to a user regardless of where they work. The <a href=\"https://www.cloudflare.com/learning/access-management/what-is-a-secure-web-gateway/\">SWG</a> can block <a href=\"https://www.cloudflare.com/learning/ddos/glossary/hypertext-transfer-protocol-http/\">HTTP requests</a> bound for dangerous destinations, scan traffic for viruses and malware, and control how traffic routes to the rest of the Internet without the need for additional hardware or virtualized services.</p><p><b>In-line Cloud Access Security Broker and Shadow IT</b>The proliferation of <a href=\"https://www.cloudflare.com/saas/\">SaaS applications</a> can help teams cut costs but poses a real risk; sometimes users prefer tools other than the ones selected by their IT or Security teams. Cloudflare’s in-line <a href=\"https://www.cloudflare.com/learning/access-management/what-is-a-casb/\">Cloud Access Security Broker (CASB)</a> gives administrators the tools to make sure employees use SaaS applications as intended. Teams can build tenant control rules that restrict employees from logging into personal accounts, policies that only allow file uploads of certain types to approved SaaS applications, and filters that restrict employees from using unapproved services.</p><p>Cloudflare’s <a href=\"/introducing-shadow-it-discovery/\">“Shadow IT” service</a> scans and catalogs user traffic to the Internet to help IT and Security teams detect and monitor the unauthorized use of SaaS applications. For example, teams can ensure that their approved cloud storage is the only place where users can upload materials.</p><p><b>API-driven Cloud Access Security Broker</b>Cloudflare’s superpower is our <a href=\"https://www.cloudflare.com/network/\">network</a>, but sometimes the worst attacks start with data sitting still. Teams that adopt SaaS applications can share work products and collaborate together from any location; that same convenience makes it simple for mistakes or bad actors to cause a serious <a href=\"https://www.cloudflare.com/learning/security/what-is-a-data-breach/\">data breach</a>.</p><p>In some cases, employees might overshare a document with sensitive information by selecting the wrong button in the “Share” menu. With just one click, a spreadsheet with customer contact data could become public on the Internet. In other situations, users might share a report with their personal account without realizing they just violated internal compliance rules.</p><p>Regardless of how the potential data breach started, Cloudflare’s <a href=\"https://www.cloudflare.com/products/zero-trust/casb/\">API-driven CASB</a> constantly scans the SaaS applications that your team uses for potential misconfiguration and data loss. Once detected, Cloudflare’s CASB will alert administrators and provide a comprehensive guide to remediating the incident.</p><p><b>Data Loss Prevention</b>Cloudflare’s <a href=\"https://www.cloudflare.com/products/zero-trust/dlp/\">Data Loss Prevention</a> service scans traffic to detect and block potential data loss. Administrators can select from common precreated profiles, like social security numbers or credit card numbers, or create their own criteria using regular expressions or integrate with existing Microsoft Information Protection labels.</p><p><b>Remote Browser Isolation</b>Cloudflare’s <a href=\"https://www.cloudflare.com/products/zero-trust/browser-isolation/\">browser isolation service</a> runs a browser inside of our network, in a data center just milliseconds from the user, and sends the vector rendering of the web page to the local device. Team members can use any modern browser and, <a href=\"/cloudflare-and-remote-browser-isolation/\">unlike other approaches</a>, the Internet just feels like the Internet. Administrators can <a href=\"https://www.cloudflare.com/learning/access-management/what-is-browser-isolation/\">isolate sites</a> on the fly, choosing to only isolate unknown destinations or providing contractors with an agentless workstation. Security teams can add additional protection like blocking copy-paste or printing.</p><h3>Security beyond the SSE</h3><p>Many of the customers who talk to us about their SSE goals are not ready to begin adopting every security service in the category from Day 1. Instead, they tend to have strategic SSE goals and tactical immediate problems. That’s fine. We <a href=\"https://zerotrustroadmap.org/\">can meet customers</a> wherever they begin on their journey and sometimes that journey starts with pain points that sit just a bit outside of the current SSE definition. We can help in those areas, too.</p><p>Many of the types of attacks that an SSE model aims to prevent begin with email, but that falls outside of the traditional SSE definition. Attackers will target specific employees or entire workforces with phishing links or <a href=\"https://www.cloudflare.com/learning/ddos/glossary/malware/\">malware</a> that the default filtering available from email providers today miss.</p><p>We want to help customers stop these attacks at the inbox before SSE features like <a href=\"https://www.cloudflare.com/learning/dns/what-is-dns/\">DNS</a> or SWG filtering need to apply. Cloudflare One includes <a href=\"https://www.cloudflare.com/products/zero-trust/email-security/\">industry-leading email security</a> through our Area 1 product to protect teams regardless of their email provider. Area 1 is not just a standalone solution bundled into our SSE; Cloudflare Zero Trust <a href=\"/email-link-isolation/\">features work better together</a> alongside Area 1. Suspicious emails can open links in an isolated browser, for example, to give customers a <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-defense-in-depth/\">defense-in-depth security model</a> without the risk of more IT help desk tickets.</p><p>Cloudflare One customers can also take advantage of another <a href=\"/cloudflare-waap-named-leader-gartner-magic-quadrant-2022/\">Gartner-recognized platform in Cloudflare</a>, our application security suite. Cloudflare’s industry-leading <a href=\"https://www.cloudflare.com/learning/security/what-is-web-application-security/\">application security</a> features, like our <a href=\"https://www.cloudflare.com/learning/ddos/glossary/web-application-firewall-waf/\">Web Application Firewall</a> and <a href=\"https://www.cloudflare.com/learning/ddos/ddos-mitigation/\">DDoS mitigation service</a>, can be deployed in-line with our <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust security features</a>. Teams can add bot management alerts, <a href=\"https://www.cloudflare.com/application-services/products/api-gateway/\">API protection</a>, and faster caching to their internal tools with a single click.</p><h2>Why Cloudflare?</h2><p>Over 10,000 organizations trust Cloudflare One to connect and secure their <a href=\"https://www.cloudflare.com/plans/enterprise/\">enterprise</a>. Cloudflare One helps protect and accelerate teams from the world’s largest IT organization, the US Federal Government, to thousands of small groups who rely on our free plan. A couple of months ago we spoke with customers as part of our <a href=\"https://www.cloudflare.com/cio-week/\">CIO Week</a> to listen to the reasons they select Cloudflare One. Their feedback followed a few <a href=\"/why-cios-select-cloudflare-one/\">consistent themes</a>.</p><p><b>1) Cloudflare One delivers more complete security</b>Nearly every SSE vendor offers improved security compared to a traditional <a href=\"https://www.cloudflare.com/learning/access-management/castle-and-moat-network-security/\">castle-and-moat model</a>, but that is a low bar. We built the security features in Cloudflare One to be best in class. Our industry-leading <a href=\"https://www.cloudflare.com/zero-trust/products/access/\">access control solution</a> provides more built-in options to control who can connect to the tools that power your business.</p><p>We partner leading identity providers and endpoint protection platforms, like <a href=\"/cloudflare-partners-with-microsoft-to-protect-joint-customers-with-global-zero-trust-network/\">Microsoft</a> and <a href=\"/cloudflare-crowdstrike-partnership/\">CrowdStrike</a>, to provide a Zero Trust VPN replacement that is better than anything else on the market. On the outbound filtering side, every filtering option relies on threat intelligence gathered and curated by <a href=\"/introducing-cloudforce-one-threat-operations-and-threat-research/\">Cloudforce One</a>, our dedicated threat research team.</p><p><b>2) Cloudflare One makes your team faster</b>Cloudflare One accelerates your end users from the first moment they connect to the Internet by starting with the <a href=\"https://1.1.1.1/\">world’s fastest DNS resolver</a>. End users send those DNS queries and establish connectivity over a secure tunnel optimized based on feedback from the millions of users who rely on our popular <a href=\"/1111-warp-better-vpn/\">consumer forward proxy</a>. Entire sites connect through a variety of tunnel options to Cloudflare’s network where we are the <a href=\"/network-performance-update-developer-week/\">fastest connectivity provider</a> for the most number of the world’s 3,000 largest networks.</p><p>We compete and measure ourselves against pure connectivity providers. When we measure ourselves against pure SSE providers, like Zscaler, <a href=\"/network-performance-update-cio-edition/\">we significantly outperform</a> by 38% to 59% depending on use case.</p><p><b>3) Cloudflare One is easier to manage</b>The Cloudflare Zero Trust products are unique in the SSE market in that we offer a <a href=\"https://www.cloudflare.com/plans/free/\">free plan</a> that covers nearly every feature. We make these services available at no cost to groups of up to 50 users because we believe that security on the Internet should be accessible to anyone on any budget.</p><p>A consequence of that commitment is that we built products that have to be easy to use. Unlike other SSE providers who only sell to the enterprise and can rely on large systems integrators for deployment, we had to create a solution that any team could deploy. From <a href=\"/cloudflare-zero-trust-for-galileo-and-athenian/\">human rights organizations</a> without full-time IT departments to <a href=\"/startup-program-v2/\">start ups</a> who want to spend more time building and less time worrying about vulnerabilities.</p><p>We also know that administrators want more options than just an intuitive dashboard. We provide <a href=\"https://api.cloudflare.com/\">API support</a> for managing every Cloudflare One feature, and we maintain a <a href=\"https://developers.cloudflare.com/cloudflare-one/api-terraform/access-with-terraform/\">Terraform provider</a> for teams that need the option for peer reviewed configuration-as-code management.</p><p><b>4) Cloudflare One is the most cost-efficient comprehensive SASE offering</b>Cloudflare is responsible for delivering and securing millions of websites on the Internet every day. To support that volume of traffic, we had to <a href=\"/cloudflares-gen-x-servers-for-an-accelerated-future/\">build our network</a> for scale and <a href=\"/extending-the-life-of-hardware/\">cost-efficiency</a>.</p><p>The largest enterprises’ internal network traffic does not (yet) match the volume of even moderately popular Internet properties. When those teams send traffic to Cloudflare One, we rely on the same hardware and the same data centers that power our <a href=\"https://www.cloudflare.com/application-services/\">application services</a> business to apply security and networking features. As a result, we can help deliver comprehensive security to any team at a price point that is made possible by our existing investment in our network.</p><p><b>5) Cloudflare can be your single, consolidated security vendor</b>Cloudflare One is only the most recent part of the Cloudflare platform to be recognized in industry analyst reports. In 2022 Gartner named Cloudflare a Leaderin <a href=\"/cloudflare-waap-named-leader-gartner-magic-quadrant-2022/\">Web Application and API Protection (WAAP)</a>. When customers select Cloudflare to solve their SSE challenges, they have the opportunity to add best-in-class solutions all from the same vendor.</p><p>Dozens of <a href=\"https://www.cloudflare.com/analysts/\">independent analyst firms</a> continue to recognize Cloudflare for our ability to deliver results to our customers on services ranging from <a href=\"https://www.cloudflare.com/ddos/\">DDoS protection</a>, <a href=\"https://www.cloudflare.com/cdn/\">CDN</a> and <a href=\"https://www.cloudflare.com/learning/serverless/glossary/what-is-edge-computing/\">edge computing</a> to <a href=\"https://www.cloudflare.com/application-services/products/bot-management/\">bot management</a>.</p><h2>What’s next?</h2><p>When customers choose Cloudflare One, they trust our network to secure the most sensitive aspects of their enterprise without slowing down their business. We are grateful to the more than 10,000 organizations who have selected us as their vendor in the last five years, from small teams on our free plan to <a href=\"https://www.cloudflare.com/nl-nl/case-studies/\">Fortune 500 companies</a> and <a href=\"/helping-keep-governments-safe-and-secure/\">government agencies</a>.</p><p>Today’s announcement only accelerates the momentum in Cloudflare One. We are focused on building the next wave of security and connectivity features our customers need to focus on their own mission. We’re going to keep going faster to help more and more organizations. Want to get started on that journey with us? Let us know <a href=\"https://www.cloudflare.com/products/zero-trust/plans/enterprise/\">here</a> and we’ll reach out.</p><p>Gartner, “Magic Quadrant for Security Service Edge”, Analyst(s): Charlie Winckless, Aaron McQuaid, John Watts, Craig Lawson, Thomas Lintemuth, Dale Koeppen, April 10, 2023.</p><p>......</p><p><sup>1</sup><a href=\"https://www.gartner.com/en/information-technology/glossary/security-service-edge-sse\">https://www.gartner.com/en/information-technology/glossary/security-service-edge-sse</a></p><p>GARTNER is a registered trademark and service mark of Gartner and Magic Quadrant is a registered trademark of Gartner, Inc. and/or its affiliates in the U.S. and internationally and are used herein with permission. All rights reserved.Gartner does not endorse any vendor, product or service depicted in its research publications and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.</p>",
		"id": "6PFNNYIxIykzs5nijXYK8",
		"localeList": {
			"name": "Cloudflare One named in Gartner® Magic Quadrant™ for Security Service Edge Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Cloudflare Zero Trust named to Gartner® Magic Quadrant™ for Security Service Edge.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2023-04-13T16:13:42.000+01:00",
		"reading_time": 13,
		"slug": "cloudflare-sse-gartner-magic-quadrant",
		"tags": [
			{
				"id": "J61Eszqn98amrYHq4IhTx",
				"name": "Zero Trust",
				"slug": "zero-trust"
			},
			{
				"id": "41sgHc8qY4N0DiEEGw3eRq",
				"name": "Gartner",
				"slug": "gartner"
			},
			{
				"id": "2UI24t7uddD0CIIUJCu1f4",
				"name": "SASE",
				"slug": "sase"
			},
			{
				"id": "4Z2oveL0P0AeqGa5lL4Vo1",
				"name": "Cloudflare One",
				"slug": "cloudflare-one"
			}
		],
		"title": "Cloudflare One named in Gartner® Magic Quadrant™ for Security Service Edge",
		"updated_at": "2024-08-27T01:20:49.430Z",
		"url": "https://blog.cloudflare.com/cloudflare-sse-gartner-magic-quadrant"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}