{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"ja-jp",
		"ko-kr"
	],
	"post": {
		"authors": [
			{
				"name": "João Tomé",
				"slug": "joao-tome",
				"bio": "After years as a journalist covering technology, cinema, sports (soccer/football), and mobility (including hosting a TV show about it), I’m now telling data-driven and other stories at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/KOYiYhfI8O9WNWxB8IWk7/a87510f59b05f585ec6a0e4fd71f7352/joao-tome.jpeg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": "@emot",
				"facebook": null
			}
		],
		"excerpt": "In this reading list, we want to highlight some of the new additions to Radar, as well as some of the Internet disruptions and trends we’ve observed and published posts about during this year",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5xErepHtHIPWPTyX5jbNU0/7cf38b00def0c4edd255e0c62bdb84e4/cloudflare-radars-2023-overview-of-new-tools-and-insights.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5imoQffUu0UPjdhLetN7hC/a51b5a2a0a8c41ea49ebdd758c8b34fb/image4-10.png\" alt=\"\" class=\"kg-image\" width=\"1800\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare Radar was launched in September <a href=\"/introducing-cloudflare-radar/\">2020</a>, almost three years ago, when the pandemic was affecting Internet traffic usage. It is a free tool to show Internet usage patterns from both human and automated systems, as well as attack trends, top domains, and adoption and usage of browsers and protocols. As Cloudflare has been publishing data-driven insights related to the general Internet for more than <a href=\"/why-google-went-offline-today-and-a-bit-about\">10 years</a> now, Cloudflare Radar is a natural evolution.</p><p>This year, we have introduced several new features to Radar, also available through our public <a href=\"https://developers.cloudflare.com/radar/\">API</a>, that enables deeper data exploration. We’ve also launched an <a href=\"https://radar.cloudflare.com/quality\">Internet Quality</a> section, a <a href=\"https://radar.cloudflare.com/domains\">Trending Domains</a> section, a <a href=\"https://radar.cloudflare.com/scan\">URL Scanner</a> tool, and a <a href=\"https://radar.cloudflare.com/routing\">Routing</a> section to track network interconnection, routing security, and observed routing anomalies.</p><p>In this reading list, we want to highlight some of those new additions, as well as some of the Internet disruptions and trends we’ve observed and published posts about during this year, including the war in Ukraine, the impact of Easter, and exam-related shutdowns in Iraq and Algeria.</p><p>We also encourage everyone to explore Cloudflare Radar and its new features, and to give you a partial review of the year, in terms of Internet insights — our 2023 Year in Review is coming later this year.</p><h2>New additions to Cloudflare Radar</h2><p>In 2022, <a href=\"/radar2/\">Cloudflare Radar 2.0</a> was released last September, refreshing the look &amp; feel and building on a new platform that allows us to easily add new features in the future. At that time, we added two new sections:</p><ul><li><p><a href=\"https://radar.cloudflare.com/domains\">Domain Rankings</a> (“<a href=\"/radar-domain-rankings/\">Goodbye, Alexa. Hello, Cloudflare Radar Domain Rankings</a>”), which includes worldwide and by country views of popular domains;</p></li><li><p>The <a href=\"https://radar.cloudflare.com/outage-center\">Outage Center</a> (“<a href=\"/announcing-cloudflare-radar-outage-center/\">The status page the Internet needs: Cloudflare Radar Outage Center</a>”), which monitors observed Internet disruptions.</p></li></ul><p>Cloudflare Radar’s <a href=\"https://radar.cloudflare.com/year-in-review/2022\">2022 Year in Review</a> and the related <a href=\"/radar-2022-year-in-review/\">blog</a> were published at the end of the year.</p><p>Without further ado, here are some of the new features launched in 2023.</p><h4>Analyze any URL safely using the Cloudflare Radar URL Scanner (<a href=\"/radar-url-scanner-early-access/\">✍️</a>)</h4><p>If you&#39;re invited to click on a link and if you&#39;re unsure about its safety, or if you simply want to verify technical details about a particular site, <a href=\"https://radar.cloudflare.com/scan\">URL Scanner</a> is here to assist. Provide us with a URL, and our scanner will compile a report containing a myriad of technical details: risk assessment, SSL certificate data, HTTP request and response data, page performance data, DNS records, associated cookies, what technologies and libraries the page uses, and more.</p><h4>Introducing the Cloudflare Radar Internet Quality Page (<a href=\"/introducing-radar-internet-quality-page/\">✍️</a>)</h4><p>In June 2023, the new <a href=\"https://radar.cloudflare.com/quality\">Internet Quality</a> page was introduced to Cloudflare Radar, offering both country and network (autonomous system) level insight. This provides information on Internet connection performance (bandwidth) and quality (latency, jitter) over time based on benchmark test data as well as speed.cloudflare.com test results.</p><p>You can also see in a world map how the different countries compare with each other in different metrics from bandwidth to latency and jitter. <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-an-autonomous-system/\">Autonomous systems (AS)</a> or networks are presented on individual pages, including Starlink’s <a href=\"https://radar.cloudflare.com/quality/as14593?dateRange=24w\">AS14593</a>. Latency is the metric that gives a better perspective on quality and improved Internet experience. Here’s the most recent global view on latency-based connection quality (lower is better):</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/f5r5Hgwputaa7i5mP9jSC/9bf5bb9be5340982a1f30133b13b525d/image6-2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><h4>Measuring the Internet&#39;s pulse: trending domains now on Cloudflare Radar  (<a href=\"/radar-trending-domains/\">✍️</a>)</h4><p>Starting July 2023, our Domain Rankings page received enhancements through the inclusion of specific <a href=\"https://radar.cloudflare.com/domains\">Trending Domains</a> lists. While the top 100 list is typically dominated by the big names such as Google, Facebook, and Apple, there are trending domains that also tell interesting and even more local stories.</p><p>The Trending Domains lists highlight surges in interest from the previous day and previous week. For instance, we captured how nba.com was trending in 28 locations during the NBA Draft 2023, and how rt.com (a Russian-based news site) gained attention in multiple countries during the Wagner group mutiny in Russia. More recently, on the same subject, after the death of Wagner’s leader, Yevgeny Prigozhin, in a plane crash, flightradar24.com was trending in our daily list both in Russia and Ukraine.</p><h4>Routing information now on Cloudflare Radar (<a href=\"/radar-routing/\">✍️</a>)</h4><p>The Internet is a vast, sprawling collection of networks (autonomous systems) that connect to each other, and routing is one of the most critical operations of the Internet. Launched in late July 2023, the new Cloudflare Radar <a href=\"https://radar.cloudflare.com/routing\">Routing page</a> examines the routing status of the Internet, including secure routing protocol deployment for a country and routing changes and anomalies. Included are routing security statistics, and also announced prefixes and connectivity insights. Why is that important? Routing decides how and where the Internet traffic should flow from the source to the destination, and deviations or anomalies can indicate potential issues that lead to connectivity disruptions.</p><p><a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-bgp/\">Border Gateway Protocol (BGP)</a>, is considered the postal service of the Internet, but as a routing protocol suffers from a number of security weaknesses. Within the Routing page, we also present <a href=\"/route-leak-detection-with-cloudflare-radar/\">BGP route leaks</a> and BGP hijack detection results, highlighting relevant events detected for any given network or globally. Notably, BGP origin hijacks allow attackers to intercept, monitor, redirect, or drop traffic destined for the victim&#39;s networks. In this related blog post, we also explain how Cloudflare built its BGP hijack detection system (including notifications), from its design and implementation to its integration: <a href=\"/bgp-hijack-detection/\"><b>Cloudflare Radar&#39;s new BGP origin hijack detection system</b></a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1XozCOBHmiXnkEtwNAO2he/e5acb34d5a55dc4c6714712a8d92bc28/image1-23.png\" alt=\"One year of war in Ukraine: Internet trends, attacks, and resilience.\" class=\"kg-image\" width=\"1201\" height=\"675\" loading=\"lazy\"/>\n            \n            </figure><h2>General Internet insights from 2023</h2><h4>One year of war in Ukraine: Internet trends, attacks, and resilience (<a href=\"/one-year-of-war-in-ukraine/\">✍️</a>)</h4><p>This blog <a href=\"/one-year-of-war-in-ukraine/\">post</a> details Internet insights during the war in Europe and discusses how Ukraine&#39;s Internet remained resilient in spite of dozens of attacks and disruptions in three different stages of the conflict.</p><p>Cloudflare observed multiple Internet disruptions in the first weeks of the war (Internet infrastructure was damaged, and Internet access was limited in besieged areas, like Mariupol), as well as airstrikes on Ukrainian energy infrastructure. We also emphasize how application-layer cyber attacks in Ukraine rose 1,300% in early March 2022 as compared to pre-war levels, the country’s Internet resilience during the war, and major growth in Starlink traffic from the country.</p><h4>Cloudflare’s view of the Virgin Media outage in the UK (<a href=\"/virgin-media-outage-april-4-2023/\">✍️</a>)</h4><p>At times, major Internet operators experience significant outages due to technical issues. In 2022, it was <a href=\"/cloudflares-view-of-the-rogers-communications-outage-in-canada/\">Canada’s Rogers</a> that experienced a 17-hour disruption impacting millions of users, and in early April 2023, a similar incident occurred with the United Kingdom’s Virgin Media. In this case, there were two clear outages for a few hours during April 4, 2023.</p><p>The post examines the impact on Internet traffic, the availability of Virgin Media web properties, and how BGP activity offered insights into the root cause.</p><h4>How Easter, Passover and Ramadan show up in Internet trends (<a href=\"/easter-passover-ramadan-internet-trends-2023/\">✍️</a>)</h4><p>National holidays celebrated in various countries can influence local Internet traffic trends. That was the case during Easter, celebrated between April 7-10, 2023. In countries including Italy, Poland, Germany, France, Spain, Portugal, the United States, Mexico, and Australia, the Easter long weekend led to the lowest traffic levels of 2023 up to that point—over 100 days into the year. Traffic dipped most significantly on Easter Sunday, compared to the previous Sunday, in Poland (22% lower), Italy (18% lower), France (16% lower).</p><p>The post also illustrates Orthodox Easter trends, with Greece being most impacted. It examines Ramadan-related changes, where eating rituals impacted Internet patterns in several countries with significant Muslim populations, and Passover trends, showing how Israel’s Internet traffic dropped as much as 24%.</p><h4>Effects of the conflict in Sudan on Internet patterns (<a href=\"/sudan-armed-conflict-impact-on-the-internet-since-april-15-2023/\">✍️</a>)</h4><p>We’ve been monitoring changes and disruptions in Internet patterns linked to military interventions. In this Sudan-related blog post, we analyze the impact of the armed conflict between rival factions of the military government that began on April 15, 2023. Cloudflare observed varying disruptions in Internet traffic after that day, with a mix of clear outages and general decrease in traffic.</p><p>The country’s Internet <a href=\"https://twitter.com/CloudflareRadar/status/1648054950159605762\">continues to be impacted ever since</a>, as our <a href=\"https://radar.cloudflare.com/sd?dateRange=52w\">12-month</a> traffic graph illustrates, with the relevant <a href=\"https://radar.cloudflare.com/as15706?dateRange=52w\">Sudatel</a>, <a href=\"https://radar.cloudflare.com/as36998?dateRange=52w\">Mobitel</a>, and <a href=\"https://radar.cloudflare.com/as36972?dateRange=52w\">MTN</a> autonomous systems from local ISPs remaining the most affected.</p><p>The most recent Internet pattern change linked to military intervention is the ongoing coup in Niger. This particular event caused a <a href=\"https://twitter.com/CloudflareRadar/status/1684671763513298944?s=20\">distinct traffic drop</a>, likely tied to shifts in human Internet usage, given the absence of signs of consistent connectivity disruption.</p><h4>How the coronation of King Charles III affected Internet traffic (<a href=\"/how-the-coronation-of-king-charles-iii-affected-internet-traffic/\">✍️</a>)</h4><p>As the coronation ceremony of King Charles III unfolded in London on May 6, 2023, distinct spikes and dips in Internet traffic were observed, each coinciding with key moments of the event. Also, on Sunday during the <a href=\"https://www.royal.uk/news-and-activity/2023-05-07/the-big-coronation-lunch\">Coronation Big Lunch</a> event, and Prince William’s speech at night, both instances led to a clear traffic drop of up to 18% compared with the previous Sunday. The accompanying chart displays this trend.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6u0K9vMknOlaC78rips2QR/59bc59b628bcac7c54741066fff23d5e/image2-14.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"630\" loading=\"lazy\"/>\n            \n            </figure><p>During the coronation weekend, Canada and Australia also exhibited shifts in Internet traffic patterns. And within this coronation post, there’s also analysis on Internet traffic pattern changes when Queen Elizabeth II passed away on September 8, 2022.</p><h4>Cloudflare’s view of Internet disruptions in Pakistan (<a href=\"/cloudflares-view-of-internet-disruptions-in-pakistan/\">✍️</a>)</h4><p>Following the arrest of ex-PM Imran Khan, violent protests led the Pakistani government to order the shutdown of mobile Internet services and blocking of social media platforms. Mobile network shutdowns in the country lasted for several days.</p><p>We examined the impact of these shutdowns on Internet traffic in Pakistan and traffic to Cloudflare’s 1.1.1.1 DNS resolver and how Pakistanis appeared to be using it in an attempt to maintain access to the open Internet.</p><h4>Nine years of Project Galileo and how the last year has changed it <a href=\"/investing-in-security-to-protect-data-privacy/\">(</a><a href=\"/nine-years-of-project-galileo-and-how-the-last-year-has-changed-it/\">✍️</a>)</h4><p>For the ninth anniversary of our <a href=\"https://www.cloudflare.com/galileo/\">Project Galileo</a> in June 2023, the focus turned towards providing access to affordable cybersecurity tools and sharing our learnings from protecting the most vulnerable communities. We also published a ninth anniversary <a href=\"https://radar.cloudflare.com/reports/project-galileo-9th-anniv\">Project Galileo report</a>.</p><p>One of the highlights of the report was a clear DDoS attack targeting an organization related to international law. This incident occurred on the same day <a href=\"https://edition.cnn.com/2023/03/17/europe/icc-russia-war-crimes-charges-intl/index.html\">an international arrest warrant</a> was issued for Russian President Vladimir Putin and Russian official Maria Lvova-Belova, on March 17, 2023. Another standout observation involved the spikes in traffic experienced by Ukrainian emergency and humanitarian services, coinciding with bombings within the country.</p><h4>Exam-related Internet shutdowns in Iraq and Algeria put connectivity to the test (<a href=\"/exam-internet-shutdowns-iraq-algeria/\">✍️</a>)</h4><p>Since early June 2023, we’ve seen Iraq implementing a series of multi-hour shutdowns that continued through July and into <a href=\"https://twitter.com/CloudflareRadar/status/1693451780963618945\">August</a>, as documented in our <a href=\"https://radar.cloudflare.com/outage-center?dateRange=52w\">Outage Center</a>. Algeria took similar actions, but using a content blocking-based approach, instead of the wide-scale Internet shutdowns, to prevent cheating on baccalaureate exams. This summer, these exam-related shutdowns were also  implemented in <a href=\"https://twitter.com/CloudflareRadar/status/1689626100660330498\">Syria</a>.</p><p>Cloudflare has previously observed and reported on similar occurrences in <a href=\"/q2-2022-internet-disruption-summary/\">2022</a> and also in 2021, in <a href=\"/syria-exam-related-internet-shutdowns/\">Syria</a> and <a href=\"/sudans-exam-related-internet-shutdowns/\">Sudan</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5ICZxw65qPhdLJnGhF04E6/90b4d5c8ec31c3570c5d913fbfdb39a9/image3-8.png\" alt=\"Q2 2023 Internet disruption summary\" class=\"kg-image\" width=\"1999\" height=\"1126\" loading=\"lazy\"/>\n            \n            </figure><p><i>2023 has been a busy year for different types of Internet disruptions and outages, from government-directed shutdowns to natural incidents.</i></p><h2>Reports: DDoS, Internet disruptions, and application security</h2><p>Within Cloudflare Radar’s <a href=\"https://radar.cloudflare.com/reports\">reports</a> section, you will find a diverse array of perspectives on the Internet. From the <a href=\"https://radar.cloudflare.com/reports/project-galileo-9th-anniv\">Project Galileo 9th Anniversary</a> — focused on aiding significant yet vulnerable online voices — to the more recent Q2 2023 <a href=\"https://radar.cloudflare.com/reports/browser-market-share-2023-q2\">Browsers</a> and <a href=\"https://radar.cloudflare.com/reports/searchengines-2023-q2\">Search Engines</a> reports. Some reports, such as the <a href=\"https://radar.cloudflare.com/reports/ddos-2023-q2\">DDoS attack trends</a> one, are also blog posts. Others are only available as blog posts, like the Internet disruptions summary, expanding on entries in the <a href=\"https://radar.cloudflare.com/outage-center\">Outage Center</a>, and the <a href=\"/application-security-report-q2-2023/\">Application Security report</a>.</p><h4>Q2 2023 Internet disruption summary (<a href=\"/q2-2023-internet-disruption-summary/\">✍️</a>)</h4><p>This <a href=\"/q2-2023-internet-disruption-summary/\">post</a> delves into Internet disruptions observed by Cloudflare during the second quarter of 2023. Since 2022, we have been consistently offering these quarterly overviews of disruptions, and Q2 proved to be a busy quarter, with different types of disruptions:</p><ul><li><p>There were several <b>government directed</b> shutdowns, including the ones related to “exam season” in several Middle Eastern and African countries, that continue <a href=\"https://twitter.com/CloudflareRadar/status/1689626100660330498\">through August</a>.</p></li><li><p><b>Severe weather</b> also played a role with a <a href=\"https://apnews.com/article/super-typhoon-mawar-guam-pacific-fd49b810f85f69d1e86f9ee6b0cc3583\">“Super Typhoon”</a>-related disruption on the US territory of Guam.</p></li><li><p><b>Cable damage</b> was behind disruptions in Bolivia, the Gambia and the Philippines.</p></li><li><p><b>Power outage</b>-related Internet disruptions were observed in Curaçao, Portugal, and Botswana.</p></li><li><p>More generic <b>technical problems</b> impacted SpaceX Starlink’s satellite service, and Virgin Media in the United Kingdom.</p></li><li><p><b>Cyberattacks</b> played a role in disruptions in both Russia and Ukraine.</p></li><li><p><b>Military action</b>-related outages were observed in Chad and Sudan.</p></li><li><p>There were also <b>maintenance</b> related outages that affected Togo, Republic of Congo (Brazzaville), and Burkina Faso.</p></li></ul><p>The <a href=\"/q1-2023-internet-disruption-summary/\">Internet disruptions overview for Q1 2023</a> included another cause, a massive earthquake. The early February <a href=\"https://en.wikipedia.org/wiki/2023_Turkey%E2%80%93Syria_earthquake\">7.8 magnitude earthquake</a> in Turkey, which also affected Syria, caused widespread damage and tens of thousands of fatalities, and resulted in significant disruptions to Internet connectivity in multiple regions for <a href=\"https://twitter.com/CloudflareRadar/status/1633145887961542662\">several weeks</a>.</p><h4>DDoS threat report for 2023 Q2 (<a href=\"/ddos-threat-report-2023-q2/\">✍️</a>)</h4><p>Since 2020, our DDoS reports/blog posts have been focused on uncovering new attack trends, identifying the most affected countries, and showing targeted industries. Our Q2 2023 DDoS threats <a href=\"/ddos-threat-report-2023-q2/\">blog post</a> highlights an unprecedented escalation in DDoS attack sophistication. Pro-Russian hacktivists REvil, Killnet, and Anonymous Sudan joined forces to attack Western sites. Exploits related to the <a href=\"https://www.cloudflare.com/en-gb/learning/security/threats/zero-day-exploit/\">zero-day vulnerability</a> known as <a href=\"/cve-2022-26143-amplification-attack/\">TP240PhoneHome</a> surged by a whopping 532%, and attacks on crypto rocketed up by 600%.</p><p>An associated <a href=\"https://radar.cloudflare.com/reports/ddos-2023-q2\">interactive</a> version of this report is available on <a href=\"https://radar.cloudflare.com/reports/ddos-2023-q2\">Cloudflare Radar</a>. Furthermore, we’ve also added a new <a href=\"https://radar.cloudflare.com/security-and-attacks\">interactive component</a> to Radar’s security section that allows you to dive deeper into attack activity in each country or region.</p><p>Our previous <a href=\"/ddos-threat-report-2023-q1/\">2023 Q1 DDoS threat report</a> highlighted a record-breaking hyper volumetric <a href=\"/cloudflare-mitigates-record-breaking-71-million-request-per-second-ddos-attack/\">71 million requests per second</a> (rps) attack.</p><h4>Application Security Report: Q2 2023  (<a href=\"/application-security-report-q2-2023/\">✍️</a>)</h4><p>Our Application Security report has been around since 2022. The latest one highlights new attack trends and insights visible through Cloudflare’s global network. Some highlights include:</p><ul><li><p>Daily mitigated HTTP requests decreased by 2 percentage points to 6% on average from 2021 to 2022, but days with larger than usual malicious activity were clearly seen across the network.</p></li><li><p>Application owners are increasingly relying on geo location blocks.</p></li><li><p>Old CVEs (Common Vulnerabilities and Exposures) are still exploited en masse. In that regard, also in August 2023, we also published a “<a href=\"/unmasking-the-top-exploited-vulnerabilities-of-2022/\">Unmasking the top exploited vulnerabilities of 2022</a>” analysis.</p></li><li><p>On average, more than 10% of non-verified bot traffic is mitigated. Compared to the last report, non-verified bot HTTP traffic mitigation is currently on a downward trend (down 6 percentage points).</p></li><li><p>65% of global API traffic is generated by browsers.</p></li><li><p>HTTP Anomalies are the most common attack vector on API endpoints, with 64%, followed by SQLi injection attacks (11%) and <a href=\"https://www.cloudflare.com/learning/security/threats/cross-site-scripting/\">XSS attacks</a> (9%).</p></li></ul><p>For a comprehensive overview of online attacks and security in 2023, you can also explore the post titled “<a href=\"/an-august-reading-list-about-online-security-and-2023-attacks-landscape/\">An August reading list about online security and 2023 attacks landscape</a>”.</p><h2>Wrap up</h2><p>The network of networks, also known as the Internet, is both complex and already seen as a <a href=\"https://en.wikipedia.org/wiki/Right_to_Internet_access\">human basic right</a>—enabling work, leisure, communication, knowledge acquisition, and the pursuit of opportunities.</p><p>In 2023, Cloudflare Radar introduced new capabilities that facilitate the exploration of a broader array of insights and trends showing the Internet&#39;s various facets. These include Internet quality, insights into trending domains, and pertinent routing changes. There’s also no lack of general Internet insights and reports that try to offer different perspectives on 2023 events and occurrences and their impact. And already in August 2023, we’ve launched the “date picker” functionality, allowing any user to go back in time by selecting arbitrary date ranges. It looks like this:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2NCsQ54rfQwKcRaWqnG6si/be3e7e388eecb2b0ec080464aef81c27/image7-2.png\" alt=\"\" class=\"kg-image\" width=\"1330\" height=\"724\" loading=\"lazy\"/>\n            \n            </figure><p>Visit <a href=\"https://radar.cloudflare.com/\">Cloudflare Radar</a> for additional insights around (Internet disruptions, routing issues, Internet traffic trends, attacks, Internet quality, etc.). Follow us on social media at <a href=\"https://twitter.com/CloudflareRadar\">@CloudflareRadar</a> (Twitter), <a href=\"https://noc.social/@cloudflareradar\">https://noc.social/@cloudflareradar</a> (Mastodon), and <a href=\"https://bsky.app/profile/radar.cloudflare.com\">radar.cloudflare.com</a> (Bluesky), or contact us via <a href=\"mailto:radar@cloudflare.com\">e-mail</a>.</p>",
		"id": "3QJDoWVlvO4ERtaU4DIP3m",
		"localeList": {
			"name": "Cloudflare Radar’s 2023 overview of new tools and insights Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"title": "Cloudflare Radar’s 2023 overview of new tools and insights",
			"description": null,
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/762dPSUcW2IRqko7mUO66N/82377f4905778a80370cfb10f54fa1f4/cloudflare-radars-2023-overview-of-new-tools-and-insights-TZGak3.png"
		},
		"primary_author": {},
		"published_at": "2023-08-31T17:33:55.000+01:00",
		"reading_time": 10,
		"slug": "cloudflare-radars-2023-overview-of-new-tools-and-insights",
		"tags": [
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "3yArjf0gLKZy8ObEDxbNNi",
				"name": "Trends",
				"slug": "trends"
			},
			{
				"id": "5kIxDMJCg3PXQxVINDL0Cw",
				"name": "Attacks",
				"slug": "attacks"
			}
		],
		"title": "Cloudflare Radar’s 2023 overview of new tools and insights",
		"updated_at": "2024-08-27T01:07:02.168Z",
		"url": "https://blog.cloudflare.com/cloudflare-radars-2023-overview-of-new-tools-and-insights"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}