{
	"initialReadingTime": "6",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Nick Sullivan",
				"slug": "nick-sullivan",
				"bio": "Nick Sullivan was Head of Research (& Cryptography) at Cloudflare until 2023. He is passionate about improving security and privacy through cutting-edge research and the development of open standards.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1awsFzXodRY6h5BEcWKcCE/85e0d04bb0360398b832e6476173945e/nick-sullivan.jpg",
				"location": "San Francisco",
				"website": "https://crypto.dance",
				"twitter": "@grittygrease",
				"facebook": null
			}
		],
		"excerpt": "Cloudflare’s mission is to help build a better Internet. One of the tools used in pursuit of this goal is computer science research. We’ve learned that some of the difficult problems to solve are best approached through research",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/54pEZtaDwieRfjbpUGRZQU/ffbecaf421ad23fdd992b99bcca7ff79/cloudflares-approach-to-research.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VEaqQTGEMe0SRUo6BU3ai/8c3a31282017e4bf535d1bfeefc72714/image1.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1098\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare’s mission is to help build a better Internet. One of the tools used in pursuit of this goal is computer science research. We’ve learned that some of the difficult problems to solve are best approached through research and experimentation to understand the solution before engineering it at scale. This research-focused approach to solving the big problems of the Internet is exemplified by the work of the Cryptography Research team, which leverages research to help build a safer, more secure and more performant Internet. Over the years, the team has worked on more than just cryptography, so <b>we’re taking the model we’ve developed and expanding the scope of the team to include more areas of computer science research</b>. Cryptography Research at Cloudflare is now Cloudflare Research. I am excited to share some of the insights we’ve learned over the years in this blog post.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"cloudflares-research-model\">Cloudflare’s research model</h2>\n            <a href=\"#cloudflares-research-model\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>Principle</p><p>Description</p><p>Team structure</p><p><b>Hybrid approach.</b> We have a program that allows research engineers to be embedded into product and operations teams for temporary assignments. This gives people direct exposure to practical problems.</p><p>Problem philosophy</p><p><b>Impact-focused.</b> We use our expertise and the expertise of partners in industry and academia to select projects that have the potential to make a big impact, and for which existing solutions are insufficient or not yet popularized.</p><p>Promoting solutions</p><p><b>Open collaboration.</b> Popularizing winning ideas through public outreach, working with industry partners to promote standardization, and implementing ideas at scale to show they’re effective.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"the-hybrid-approach-to-research\">The hybrid approach to research</h2>\n            <a href=\"#the-hybrid-approach-to-research\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p><i>“Super-ambitious goals tend to be unifying and energizing to people; but only if they believe there&#39;s a chance of success.” - Peter Diamandis</i></p><p>Given the scale and reach of Cloudflare, research problems (and opportunities) present themselves all the time. Our approach to research is a practical one. We choose to tackle <b>projects that have the potential to make a big impact, and for which existing solutions are insufficient</b>. <b>This stems from a belief that the interconnected systems that make up the Internet can be changed and improved in a fundamental way</b>. While some research problems are solvable in a few months, some may take years. We don’t shy away from long-term projects, but the Internet moves fast, so it’s important to break down long-term projects into smaller, independently-valuable pieces in order to continually provide value while pursuing a bigger vision.</p><p>Successful technological innovation is not purely about technical accomplishments. New creations need the social and political scaffolding to support it while being built, and the momentum and support to gain popularity. We are better able to innovate if grounded in a deep understanding of the current day-to-day. To stay grounded, our research team members spend part of their time solving practical problems that affect Cloudflare and our customers right now.</p><p>Cloudflare employs a hybrid research model similar to the model <a href=\"https://static.googleusercontent.com/media/research.google.com/en//pubs/archive/38149.pdf\">pioneered by Google</a>. Innovation can come from everywhere in a company, so teams are encouraged to find the right balance between research and engineering activities. The research team works with the same tools, systems, and constraints as the rest of the engineering organization.</p><p>Research engineers are expected to write production-quality code and contribute to engineering activities. This enables researchers to leverage the rich data provided by Cloudflare’s production environment for experiments. To further break down silos, we have a program that allows research engineers to be embedded into product and operations teams for temporary assignments. This gives people direct exposure to practical problems.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"continuing-a-successful-tradition-our-tradition\">Continuing a successful tradition (our tradition)</h2>\n            <a href=\"#continuing-a-successful-tradition-our-tradition\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p><i>“Skate to where the puck is going, not where it has been.” - Wayne Gretzky</i></p><p>The output of the research team is both new knowledge and technology that can lead to innovative products. Research works hand-in-hand with both product and engineering to help drive long-term positive outcomes for both Cloudflare and the Internet at large.</p><p><b>An example of a long-term project that requires both research and engineering is helping the Internet migrate from insecure to secure network protocols</b>. To tackle the problem, we pursued several smaller projects with discrete and measurable outcomes. This included:</p><ul><li><p>Building designs and <a href=\"/ecdsa-the-digital-signature-algorithm-of-a-better-internet/\">supporting</a> <a href=\"/tls-session-resumption-full-speed-and-secure/\">systems</a> to enable <a href=\"/introducing-universal-ssl/\">Cloudflare SSL certificates to scale to all free customers</a></p></li><li><p><a href=\"/introducing-cfssl/\">Open sourcing software</a> that helped Let’s Encrypt do the same</p></li><li><p><a href=\"/monsters-in-the-middleboxes/\">Measuring the prevalence of middleboxes</a> harmful to security</p></li><li><p>Helping <a href=\"/rfc-8446-aka-tls-1-3/\">design</a> and <a href=\"/introducing-0-rtt/\">deploy TLS 1.3</a></p></li><li><p>Supporting accountability in the PKI with <a href=\"/introducing-certificate-transparency-and-nimbus/\">Certificate Transparency</a></p></li><li><p>Promoting secure time synchronization via <a href=\"https://www.cloudflare.com/time/\">NTS and Roughtime</a></p></li><li><p>Encrypting DNS with <a href=\"https://developers.cloudflare.com/1.1.1.1/dns-over-https/\">DoH and DoT</a></p></li></ul><p>and many other smaller projects. Each step along the way contributed something concrete to help make the Internet more secure.</p><p>This year’s <a href=\"/welcome-to-crypto-week-2019/\">Crypto Week</a> is a great example of the type of impact an effective hybrid research organization can make. Every day that week, a new announcement was made that helped take research results and realize their practical impact. From the League of Entropy, which is based on fundamental work by <a href=\"https://github.com/dedis/drand/\">researchers at EPFL</a>, to Cloudflare Time Services, which helps address time security issues raised in papers by former Cloudflare intern <a href=\"https://scholar.google.com/citations?hl=en&user=WVff3wsAAAAJ\">Aanchal Malhotra</a>, to our own (currently running) <a href=\"/towards-post-quantum-cryptography-in-tls/\">post-quantum experiment</a> with Google Chrome, <b>engineers at Cloudflare combined research with building large-scale production systems to help solve some unsolved problems on the Internet</b>.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"open-collaboration-open-standards-and-open-source\">Open collaboration, open standards, and open source</h2>\n            <a href=\"#open-collaboration-open-standards-and-open-source\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p><i>“We reject kings, presidents and voting. We believe in rough consensus and running code.” - Dave Clark</i></p><p>Effective research requires:</p><ul><li><p>Choosing interesting problems to solve</p></li><li><p>Popularizing the ideas discovered while studying the solution space</p></li><li><p>Implementing the ideas at scale to show they’re effective</p></li></ul><p>Cloudflare’s massive popularity puts us in a very privileged position. We can research, implement and deploy experiments at a scale that simply can’t be done by most organizations. This makes Cloudflare an attractive research partner for universities and other research institutions who have domain knowledge but not data. We rely on our own expertise along with that of peers in both academia and industry to decide which problems to tackle in order to achieve common goals and make new scientific progress. Our <a href=\"/monsters-in-the-middleboxes/\">middlebox detection project</a>, proposed by researchers at the University of Michigan, is an example of such a problem.</p><p>We’re not purists who are only interested in pursuing our own ideas. Some interesting problems have already been solved, but the solution isn’t widely known or implemented. In this situation, we contribute our efforts to help elevate the best ideas and make them available to the public in an accessible way. Our early work popularizing <a href=\"/a-relatively-easy-to-understand-primer-on-elliptic-curve-cryptography/\">elliptic curves</a> on <a href=\"/ecdsa-the-digital-signature-algorithm-of-a-better-internet/\">the Internet</a> is such an example.</p><p>Popularizing an idea and implementing the idea at scale are two different things. Along with popularizing winning ideas, we want to ensure these ideas stick and provide benefits to Internet users. To promote the widespread deployment of useful ideas, we work on standards and deploy newly emerging standards early on. Doing so helps the industry easily adopt innovations and supports interoperability. For example, the work done for Crypto Week 2019 has helped the development of international technical standards. Aspects of the League of Entropy are <a href=\"https://tools.ietf.org/html/draft-irtf-cfrg-bls-signature-00\">now being standardized</a> at the <a href=\"https://irtf.org/cfrg\">CFRG</a>, Roughtime is now <a href=\"https://tools.ietf.org/html/draft-roughtime-aanchal-03\">being considered for adoption</a> as an IETF standard, and we are presenting our post-quantum results as part of NIST’s <a href=\"https://csrc.nist.gov/Projects/Post-Quantum-Cryptography/Post-Quantum-Cryptography-Standardization\">post-quantum cryptography standardization effort</a>.</p><p>Open source software is another key aspect of scaling the implementation of an idea. We <a href=\"https://github.com/cloudflare/circl\">open source</a> associated code whenever possible. The research team collaborates with the wider research world as well as internally with other teams at Cloudflare.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"focus-areas-going-forward\">Focus areas going forward</h2>\n            <a href=\"#focus-areas-going-forward\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>Doing research, sharing it in an accessible way, working with top experts to validate it, and working on standardization has several benefits. It provides an opportunity to educate the public, further scientific understanding, and improve the state of the art; but it’s also a great way to attract candidates. Great engineers want to work on interesting projects and great researchers want to see their work have an impact. This hybrid research approach is attractive to both types of candidates.</p><p>Computer science is a vast arena, so the areas we’re currently focusing on are:</p><ul><li><p>Security and privacy</p></li><li><p>Cryptography</p></li><li><p>Internet measurement</p></li><li><p>Low-level networking and operating systems</p></li><li><p>Emerging networking paradigms</p></li></ul><p>Here are some highlights of publications we’ve co-authored over the last few years in these areas. We’ll be building on this tradition going forward.</p><ul><li><p><a href=\"https://dl.acm.org/citation.cfm?id=2995314\">Attacking White-Box AES Constructions</a>. Created during investigations into protecting keys in untrusted locations.</p></li><li><p><a href=\"https://www.petsymposium.org/2018/files/papers/issue3/popets-2018-0026.pdf\">Privacy Pass</a>. Arose from <a href=\"/cloudflare-supports-privacy-pass/\">discussions</a> around reducing CAPTCHA friction without reducing site protection.</p></li><li><p><a href=\"https://dl.acm.org/citation.cfm?id=3278543\">Is the Web Ready for OCSP Must-Staple?</a> Arose during the development of <a href=\"/high-reliability-ocsp-stapling/\">high-availability OCSP stapling</a>.</p></li><li><p><a href=\"https://arxiv.org/abs/1905.13737\">Protocols for Checking Compromised Credentials</a>. Work that came out of collaborations with <a href=\"https://haveibeenpwned.com/\">Have I Been Pwned</a>.</p></li><li><p><a href=\"https://jhalderm.com/pub/papers/interception-ndss17.pdf\">The Security Impact of HTTPS Interception</a>. Came about when exploring the end-to-end security of customer connections and discussing with researchers interested in the same topic. Resulted in <a href=\"/monsters-in-the-middleboxes/\">MALCOLM</a>.</p></li><li><p><a href=\"https://ieeexplore.ieee.org/abstract/document/8406612/\">In search of CurveSwap: Measuring elliptic curve implementations in the wild</a>. New attack devised when analyzing TLS 1.2 vulnerabilities.</p></li><li><p><a href=\"https://ai.google/research/pubs/pub47551\">Does Certificate Transparency Break the Web? Measuring Adoption and Error Rate</a>. Partly motivated by the difficulty of running <a href=\"/introducing-certificate-transparency-and-nimbus/\">Nimbus</a>.</p></li></ul><p>And by the way, we’re hiring!</p><p><a href=\"https://boards.greenhouse.io/cloudflare/jobs/1744503\"><b>Product Management</b></a>Help the research team explore the future of peer-to-peer systems by building and managing projects like the <a href=\"https://developers.cloudflare.com/distributed-web/\">Distributed Web Gateway</a>.</p><p><a href=\"https://www.cloudflare.com/careers/jobs/?department=Engineering\"><b>Engineering</b></a>Engineering Manager (<a href=\"https://boards.greenhouse.io/cloudflare/jobs/1861694\">San Francisco</a>, <a href=\"https://boards.greenhouse.io/cloudflare/jobs/1346216\">London</a>)Systems Engineer - Cryptography Research (<a href=\"https://boards.greenhouse.io/cloudflare/jobs/634967\">San Francisco</a>)Cryptography Research Engineer Internship (<a href=\"https://boards.greenhouse.io/cloudflare/jobs/608495\">San Francisco</a>, <a href=\"https://boards.greenhouse.io/cloudflare/jobs/1025810\">London</a>)</p><p>If none of these fit you perfectly, but you still want to reach out, send us an email at: <a href=\"/cloudflares-approach-to-research/research@cloudflare.com\">ask-research@cloudflare.com</a>.</p>",
		"id": "4iB150QzhKAoKOvXt91ON7",
		"localeList": {
			"name": "Cloudflare’s Approach to Research Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2019-09-18T15:03:38.000+01:00",
		"slug": "cloudflares-approach-to-research",
		"tags": [
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			}
		],
		"title": "Cloudflare’s Approach to Research",
		"updated_at": "2024-08-27T02:09:15.159Z",
		"url": "https://blog.cloudflare.com/cloudflares-approach-to-research"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}