{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"ja-jp",
		"ko-kr",
		"id-id",
		"th-th"
	],
	"post": {
		"authors": [
			{
				"name": "Rustam Lalkaka",
				"slug": "rustam",
				"bio": "In his role as Vice President of Product Management at Cloudflare, Rustam leads teams helping make the Internet safer, faster, more secure, and more private for all 4 billion Internet users. ",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3LfyxlQxrrH8oXHQWznrU1/b0de3d5944a5a97038f19f59424a6384/rustam.jpg",
				"location": null,
				"website": null,
				"twitter": "@lalkaka",
				"facebook": null
			},
			{
				"name": "Sam Rhea",
				"slug": "sam",
				"bio": " ",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2U8kgggIwXALYQIRjBDjyp/92b2ece0016e6d71c0e97606f47b2692/sam.png",
				"location": null,
				"website": null,
				"twitter": "@LakeAustinBlvd",
				"facebook": null
			}
		],
		"excerpt": "Cloudflare One helps enterprises build modern enterprise networks, operate efficiently and securely, and throw out on-premise hardware. It’s been more than a year since we announced the product suite, and we wanted to check in on how things are going.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4RvzfZ5zuo86XuPkTCKsyV/36fe4271e8acffaa2c2904cfbffffa60/cloudflare-one-one-year-later.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6kXSmxhrD3yAAXPFRgRKWU/832fecd1f8fa92a9ced5e3538324d91e/image6-3.png\" alt=\"Cloudflare One: One Year Later\" class=\"kg-image\" width=\"1800\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare One helps enterprises build modern <a href=\"https://www.cloudflare.com/learning/network-layer/enterprise-networking/\">enterprise networks</a>, operate efficiently and securely, and throw out on-premise hardware. It’s been more than a year since we <a href=\"/introducing-cloudflare-one/\">announced</a> the <a href=\"/cloudflare-one/\">product suite</a>, and we wanted to check in on how things are going.</p><p>We’re celebrating Chief Information Officers this week. Regardless of the size of their organization, they’ve had a challenging year. Overnight, their teams became responsible for years of digital transformation to prepare their networks and users to support work-from-home and to adopt new technologies. They worked with partners across security, engineering, and people teams to keep their critical infrastructure running.</p><p>Today, we want to focus on the problems that CIOs have been able to solve with Cloudflare One in the last year. Customers are using Cloudflare One at a scale we couldn’t have imagined a year ago to solve interesting problems that we didn&#39;t know existed yet. We’ll walk through some specific use cases later in the post, but first, let’s recap why we built Cloudflare One, what problems it solves, and some of the new things we’re launching this week.</p><h2>What is Cloudflare One?</h2><p>Cloudflare One allows companies to purchase, provision, and manage connectivity, security, and analytics tools needed to operate a corporate network from one vendor and one control plane.</p><p>Historically, CIOs purchased point solutions from dozens of hardware vendors. They assembled a patchwork of appliances and services to keep their organization connected and secure. The band-aids held together for a while, despite the cost and maintenance burden.</p><p>However, the growth of what needed to be connected broke this model. Office locations became more distributed and, more recently, <a href=\"https://www.cloudflare.com/products/zero-trust/remote-workforces/\">remote work</a> became widespread. Applications that only existed in the corporate data center moved to public cloud providers or SaaS models. As these shifts pushed the limits on what these band-aids could support, the attacks against networks and endpoints became more sophisticated.</p><p>We talked to customers who explained that these changes presented a hierarchy of problems: at its base layer, they need their users, offices, data centers and clouds connected to each other and to the Internet. Next, they needed to filter the traffic between these entities. Finally, they needed to log, diagnose, and analyze that traffic. Once those initial needs were met, the <a href=\"https://www.cloudflare.com/network-security/\">network security solution</a> needed to be fast and reliable, and comply with local laws and regulations.</p><p>Cloudflare runs a global, programmable edge network. We use that network to improve the speed and security of some of the largest websites and services on the Internet. We built Cloudflare One to make that network available to corporate customers to solve their new challenges. Today, Cloudflare helps CIOs deliver connectivity, security, and visibility without sacrificing performance, no matter where a customer or their employees work.</p><h2>How does it work?</h2><p>Cloudflare One starts with connectivity. Your team can connect offices, data centers, devices and cloud properties to Cloudflare’s network. We’re flexible with how you want to send that traffic to us. Connect your offices and data centers to Cloudflare through <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-an-sd-wan/\">SD-WAN</a> partnerships or soon our Cloudflare for Offices infrastructure. New this week, you can start using IPsec Tunnels in addition to our existing GRE Tunnels.</p><p>Connect your internal resources and the rest of the Internet with a lightweight agent. Does your team rely on contractors and unmanaged devices? Connect them to internal tools in a fully agentless mode. We’ll also be announcing new improvements to Cloudflare Tunnel and our network interfacing provisioning to keep making it easier to connect your organization to our global network.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6yfMqUcIenHv29kuYOCCit/6120fcfe4827827a880fbc11482ee1a6/image3-4.png\" alt=\"\" class=\"kg-image\" width=\"1184\" height=\"758\" loading=\"lazy\"/>\n            \n            </figure><p>Once connected, Cloudflare’s network provides a comprehensive suite of security functions to protect your traffic. Customers can rely on our network for everything from IP-layer DDoS mitigation to blocking threats with <a href=\"https://www.cloudflare.com/learning/access-management/what-is-browser-isolation/\">remote browser isolation</a>. Later this week, we’ll be sharing details of new network firewall features that help your team continue to rip out even more boxes.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/HoJtTc6yeVLLIn4FaoqCM/aac2d4073fd3cad8fdd8d0e0061b102d/image8-2.png\" alt=\"\" class=\"kg-image\" width=\"1190\" height=\"640\" loading=\"lazy\"/>\n            \n            </figure><p>Beyond <a href=\"https://www.cloudflare.com/products/zero-trust/threat-defense/\">securing your organization from threats</a> on the Internet, Cloudflare One also provides your team with comprehensive Zero Trust control over who can access your internal resources and SaaS applications.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6HGAYjrvspURppBYc0RKSW/babe51f35c13e35f19dfbb3e9233b725/image4-6.png\" alt=\"\" class=\"kg-image\" width=\"1176\" height=\"738\" loading=\"lazy\"/>\n            \n            </figure><p>Now that traffic is connected and secured through Cloudflare, we can help make you faster. Cloudflare is building the fastest network in the world. You can read more about where we are the fastest today and how we’re working to be the fastest in any location. New this week, we’ll be sharing updates to our network performance and new features that intelligently accelerate packets in our network.</p><p>Just being faster is not enough. The network that powers your organization should also be reliable, even despite factors out of your control. Cloudflare’s network is peered with over 10,000 networks around the world. With one of the most interconnected networks, we can find lots of paths from point A to point B when disruptions elsewhere on the Internet occur.</p><p>Finally, we hear from more and more customers that they need a global network with localized compliance features. Cloudflare One makes compliance with local data protection regulations easy. Customers <a href=\"/introducing-regional-services/\">can choose where</a> Cloudflare’s network applies security functions and <a href=\"/introducing-the-cloudflare-data-localization-suite/\">how we store and export</a> your logs. As part of CIO week, we’ll be previewing new features that give your team the ability to create metadata boundaries in our network.</p><p>All that said, we think the best way to understand how Cloudflare One works is to walk through the problems that our customers no longer have.</p><h3>Customers defended 5x more traffic</h3><p>Overall network traffic growth through Cloudflare One has increased by nearly 400% over the last year, with advanced traffic controls and filtering applied at wire-speed to each of those bits.</p><p>Cloudflare’s composable traffic filtering stack lets customers pick and choose which security controls to apply to which traffic, allowing for flexibility and specificity in how traffic is managed. Some customers are using simple “4-tuple” rules to allow or deny traffic to their networks based on IP addresses and port numbers, others are writing their own network filters in eBPF (more on this later this week!) to perform custom logic on hundreds of gigabits per second of traffic at a time, and others are using pure Zero Trust architectures with identity-based policy enforcement and endpoint protection integration.</p><p>Over a recent (and typical) stretch of 24 hours, customers prevented over <b>9.3 trillion</b> unwanted packets, requests, and other network “nouns” from reaching their networks with custom rules. These rules can all be managed centrally, impose no performance penalty, and can be enforced on traffic no matter where it is coming from or where it is going, whether that is offices, data centers, or cloud providers.</p><p>The same rules and filtering logic are applied to traffic wherever it enters our network. Because our entire edge network is one giant firewall, there is no backhaul required to a central device or network location for a firewall policy to be applied.</p><p>We think Cloudflare One’s architectural advantages make for a pretty killer firewall, and the growth in usage we’ve seen bears that out. But what really sets our network and its integrated security functionality apart is our ability to offer Zero Trust controls from the same network, allowing CIOs to think about <a href=\"https://www.cloudflare.com/application-services/solutions/\">securing applications</a> and users instead of IP addresses and TCP ports.</p><h3>Customers protected over 192,000 applications</h3><p>Legacy private networks and VPN clients provided brittle connectivity without real security. In most deployments, a user in the private network could connect to any resource unless explicitly prohibited. Security teams had no identity-driven controls and lacked visibility into their network while IT teams struggled with help desk tickets.</p><p><a href=\"https://www.cloudflare.com/teams/access/\">Cloudflare Access</a> replaces <a href=\"https://www.cloudflare.com/learning/network-layer/network-security/\">private network</a> security with a <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust model</a> that also makes any internal application feel like the Internet’s fastest SaaS applications. Customers connect their internal resources to Cloudflare’s network without poking holes in their firewall. Once connected, administrators can build global rules and per-resource rules to control who can log in and how they can connect. Users launch applications with a single click while Cloudflare’s network enforces those rules and accelerates their traffic around the world.</p><p>In the past year, customers have protected over 192,000 applications with Zero Trust rules in Cloudflare. These applications range from mission-critical tools that power the business to administrative panels that hold the company’s most sensitive data, and the next version of the new marketing website. Since announcing Cloudflare One last year, we’ve also brought non-HTTP use cases to the browser with <a href=\"/browser-ssh-terminal-with-auditing/\">SSH</a> and <a href=\"/browser-vnc-with-zero-trust-rules/\">VNC clients</a> rendered without any additional client software.</p><p>Regardless of what’s being protected, customers can layer rules starting from “only my team can log in” all the way to “only allow access to this group of users, connecting from <a href=\"/zero-trust-with-managed-devices/\">a corporate device</a>, with a <a href=\"/require-hard-key-auth-with-cloudflare-access/\">physical hardkey</a>, <a href=\"/two-clicks-to-enable-regional-zero-trust-compliance/\">from these countries</a>.” We also know that sometimes security needs a second opinion. Earlier this year, we introduced new features that <a href=\"/access-purpose-justification/\">prompt users to input why</a> they are connecting to a resource and <a href=\"/announcing-access-temporary-authentication/\">require a second admin to sign off</a> on the request in real time.</p><p>We also believe that security should <a href=\"/the-zero-trust-platform-built-for-speed/\">never require a compromise in performance</a>. The applications that customers secure with our Zero Trust products benefit from the same routing acceleration that some of the Internet’s largest websites use. We also bring security decisions closer to the user to avoid slowing them down — Cloudflare’s network enforces Zero Trust rules in every one of our 250 data centers around the world, made even faster by running on our own serverless compute platform.</p><h3>Over 10,000 small teams are now safer</h3><p>We launched Cloudflare One with the goal of making Zero Trust security accessible to organizations of any size. When we first released Cloudflare Access over three years ago, smaller teams had limited or no options to replace their VPN. They were turned away from vendors who only serviced the enterprise and had to stick to a legacy private network.</p><p>We’re excited that more than 10,000 organizations are now protecting their resources without the need to sign a contract with Cloudflare. We’ve also made these tools even more accessible to smaller organizations. Last year, we raised the number of free users that customers could add to their plan to <a href=\"/teams-plans/\">50 seats</a>.</p><h3>More than 5,500 organizations now secure their outbound Internet traffic</h3><p>Zero Trust rules do not just apply to your internal applications. When your users connect to the rest of the Internet, attackers work to phish their passwords, get malware on their devices, and steal their data.</p><p>Cloudflare One provides customers with multiple layers of security filters and across multiple on-ramps  that keep your organization safe from data loss and threats. Since last year’s Cloudflare One announcement, over 5,500 organizations secure the traffic leaving their devices, offices, and data centers.</p><p>In the last year, the security they deploy has improved every month. Customers rely on the world’s fastest DNS resolver and the intelligence from Cloudflare’s visibility into the Internet to filter DNS traffic for security threats and content categories. Cloudflare <a href=\"/network-based-policies-in-cloudflare-gateway/\">filters their network traffic</a> with identity-based policies, <a href=\"/gateway-app-policies/\">block file transfers</a>, and inspect HTTP traffic for <a href=\"/announcing-antivirus-in-cloudflare-gateway/\">viruses</a>. Organizations <a href=\"/gateway-tenant-control/\">control which tenants</a> of SaaS applications employees can use and Cloudflare’s network generates a comprehensive <a href=\"/introducing-shadow-it-discovery/\">Shadow IT report</a>.</p><p>When organizations don’t trust anything on the Internet, they can connect to Cloudflare’s isolated browser. Customers can isolate all destinations or just specific ones, without requiring users to use a special browser client or to suffer through legacy approaches to browser isolation like pixel pushing and DOM manipulation. Cloudflare’s network can also add <a href=\"/data-protection-browser/\">data control directly in the browser</a> — blocking copy-paste, printing, or even text input by user and destination.</p><h3>All this delivered over a growing global network engineered for scale</h3><p>All of this functionality is delivered from our entire global network, on bare metal hardware Cloudflare owns and operates in over 250 cities around the world. There are no public clouds in the mix here, and all our services run on every server in every location in the world. There is no location selection of sizing of hardware, physical or virtualized. Every server is capable of processing every customer’s packet.</p><p>This unique architecture allows us to build reliable products quickly and efficiently. Our network is now handling more than 1.69Tbps of peak forward proxy traffic per day, our largest customers do traffic measured in hundreds of gigabits per second delivered over single virtual interfaces.</p><p>Customers are able to get value both from the connectivity, security and visibility products we offer, but also through the network of our customers themselves. Most Cloudflare One customers have significant interactions with other customer networks connected to Cloudflare, many of them through direct physical connections available in <a href=\"https://www.peeringdb.com/asn/13335\">158 peering facilities</a> around the world.</p><h2>How are customers using it?</h2><p>Tens of thousands of customers solved problems at scale with Cloudflare One in the last year. We also want to highlight a few organizations and their specific journeys migrating to this model since last year’s announcement.</p><h3>Protecting the United States Federal Government from attacks</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7AROZFvSzpMCxkb2avgpWJ/03db61e0efaa340bc77ce547f7479def/image5-4.png\" alt=\"\" class=\"kg-image\" width=\"1253\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>Within the United States Department of Homeland Security, the Cybersecurity and Infrastructure Security Agency (CISA) works as “the nation’s risk advisor.” CISA partners with teams across the public and private sector to secure critical infrastructure across the federal government as well as State, Local, Tribal, and Territorial agencies and departments.</p><p>One risk that CISA has <a href=\"https://media.defense.gov/2021/Mar/03/2002593055/-1/-1/0/CSI_Selecting-Protective-DNS_UOO11765221.PDF\">repeatedly flagged</a> is the threat of malicious hostnames, phishing emails with malicious links, and untrustworthy upstream Domain Name System resolvers. Attackers can compromise devices and users by tricking those endpoints into sending a DNS query to a specific hostname. When users connect to the destination behind that resolved query, attackers can steal passwords, data, and put malware on the devices.</p><p>Earlier this year, CISA and the National Security Agency (NSA) recommended that teams deploy protective DNS resolvers to prevent those attacks from becoming incidents. Unlike standard DNS resolvers, protective DNS resolvers check the hostname being queried to determine if the destination is malicious. If the hostname poses a risk, the resolver blocks the connection by not answering the DNS query.</p><p>Earlier this year, CISA announced that they are not only recommending a protective DNS resolver — they are delivering one to their partner agencies. <a href=\"/helping-keep-governments-safe-and-secure/\">CISA selected Cloudflare and Accenture Federal Services</a> to deliver a joint solution to help the government defend itself against cyberattacks.</p><h3>Keeping the workforce of a hardware manufacturer safe and productive</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5Gqev4Eha2EqQsU2lq9NSA/2695de2ac5b3adb9436b85798cacb55c/image7-1.png\" alt=\"\" class=\"kg-image\" width=\"1253\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>Back in 2018, the developer operations team inside of one of the world’s largest telecom and network equipment companies lost patience with their legacy VPN. Developers in their organization relied on the VPN to connect to the tools they needed to do their jobs. The requirement slowed them down and created user headaches, eventually leading to IT help desk tickets.</p><p>The leadership team in that group decided to fix their VPN frustrations by getting rid of it. They signed up to use Cloudflare Access, initially with the personal credit of one of the administrators, to move their development tools to a seamless platform that made their internal applications just feel like SaaS applications for their users.</p><p>Over the next three years, more departments in the organization became jealous and asked to also deprecate the VPN usage in their group. As thousands of users across the organization moved to a Zero Trust model, their security team began to take advantage of the rules that could be created, and the logs generated without the need for any server-side code changes.</p><p>Last month, that security team began using Cloudflare One to build Zero Trust rules for the rest of the Internet. Their organization chose Cloudflare Gateway to replace their legacy DNS filtering solution with a faster, more manageable platform that keeps the 100,000+ team members safe from phishing attacks, malware, and ransomware in any location.</p><h3>Securing the team building BlockFi</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6oB1CxywNN29ZADx00Qrjv/69e1572b1ac315dced1301989d3a1f86/image1-15.png\" alt=\"\" class=\"kg-image\" width=\"1253\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>BlockFi’s mission is to bring financial empowerment to traditionally underserved markets. BlockFi’s interest accounts, cryptocurrency-backed loans, rewards cards and crypto trading platforms connect hundreds of thousands of users to new financial tools. As of June 30, 2021, BlockFi supports over 450,000 funded clients and manages more than $10 billion in assets.</p><p>Keeping their service available and secure presented new challenges as they grew. <a href=\"https://www.cloudflare.com/case-studies/blockfi/\">BlockFi started their Cloudflare One journey</a> after experiencing a major DDoS attack on its sign-up API. The BlockFi team contacted Cloudflare, and we were able to help mitigate the DDoS and API attacks, getting their systems back up and running within a few hours. BlockFi was then able to block approximately 10 million malicious bots in the first day of the addition of Cloudflare’s Bot Management platform.</p><p>Once their public web infrastructure was up and running again, BlockFi started to evaluate how to improve the security of their internal users and applications. BlockFi relied on a private network that used IP addresses to block or allow users to connect, spending engineering time just maintaining IP lists. As users left the office, that model fell apart.</p><p>BlockFi solved that challenge by replacing their legacy network with Cloudflare One to bring identity-driven Zero Trust control to their internal resources. Team members connect from any location and authenticate with their single-sign on.</p><p>Their security team didn’t stop there. To protect their employees from phishing and malware attacks, BlockFi deployed Cloudflare One’s DNS filtering and Secure Web Gateway to stop attacks that targeted their entire workforce or specific employees.</p><h3>Keeping phones ringing with Cloudflare’s network reach</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4zHsAUywmMMgAhvYnP4ZSp/355ebf55d9c8ce03a095dbbeb443d933/image2-7.png\" alt=\"\" class=\"kg-image\" width=\"1880\" height=\"751\" loading=\"lazy\"/>\n            \n            </figure><p>Our last customer story involves a large VoIP and unified communications infrastructure company that recently came under ransom attack. They quickly (over the course of less than 24 hours) deployed Cloudflare Magic Transit in front of their entire Internet presence, including their corporate and production networks.</p><p>Given the nature of Internet telephony, they were very concerned about performance regressions and impact to call quality. Fortunately, deploying Cloudflare actually <i>improved</i> key network quality metrics like latency and jitter, surprising their network administrators.</p><p>Cloudflare’s network excels at powering and protecting performance critical workloads where milliseconds matter and reliability is paramount.</p><h2>What’s next?</h2><p>Over the course of this week, we’re going to share dozens of new announcements that solve new problems with Cloudflare One. We’re just getting started building the next-generation of the corporate network, so stay tuned to learn more this week.</p><p>We’re also grateful for every organization that trusted Cloudflare One to be your corporate network since last year’s launch. For teams who are ready to begin that journey, follow <a href=\"https://dash.cloudflare.com/sign-up/teams\">this link</a> to get started today.</p>",
		"id": "4FXeDOXhOEvARMWPGOkTXa",
		"localeList": {
			"name": "Cloudflare One: One Year Later Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "Translated for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "Translated for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Cloudflare One helps enterprises build modern enterprise networks, operate efficiently and securely, and throw out on-premise hardware. It’s been more than a year since we announced the product suite, and we wanted to check in on how things are going.",
		"metadata": {
			"title": "Cloudflare One: One Year Later",
			"description": "Cloudflare One helps enterprises build modern enterprise networks, operate efficiently and securely, and throw out on-premise hardware. It’s been more than a year since we announced the product suite, and we wanted to check in on how things are going.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4fcXD9sevU4DWLNGCiFhJz/cc5202913318689c48cec6eaa596dcbe/cloudflare-one-one-year-later-XJs3QV.png"
		},
		"primary_author": {},
		"published_at": "2021-12-06T13:59:36.000+00:00",
		"reading_time": 12,
		"slug": "cloudflare-one-one-year-later",
		"tags": [
			{
				"id": "6PL1qd9UWWPNeHpKrVcurc",
				"name": "CIO Week",
				"slug": "cio-week"
			},
			{
				"id": "4Z2oveL0P0AeqGa5lL4Vo1",
				"name": "Cloudflare One",
				"slug": "cloudflare-one"
			}
		],
		"title": "Cloudflare One: One Year Later",
		"updated_at": "2024-08-27T01:40:04.787Z",
		"url": "https://blog.cloudflare.com/cloudflare-one-one-year-later"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}