{
	"initialReadingTime": "10",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Emily Hancock",
				"slug": "emily-hancock",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6WoITZeDW2tg5JO91UOF0Y/07a429e5b8e59813a81a593faad0115e/emily-hancock.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "2020 was a big year for data protection, so what does 2021 have in store? On this Data Privacy Day, we talk about the key role data localization and encryption technologies will play in data protection this year.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7K1Yjh3jOibZYQeZkuMcYk/8bd20879d1a0327a60f44adaac253ede/data-privacy-day-2021-looking-ahead-at-the-always-on-always-secure-always-private-internet.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/46Ee9HuJIDt4xhY6JhVFzi/02f505163b2b068549db091517bdce22/image3-in-blog.png\" alt=\"Global Privacy Day 2021 - Looking ahead at the always on, always secure, always private Internet\" class=\"kg-image\" width=\"1928\" height=\"927\" loading=\"lazy\"/>\n            \n            </figure><p>Welcome to Data Privacy Day 2021! Last year at this time, I was writing about how <a href=\"/empowering-your-privacy/\">Cloudflare builds privacy into everything we do</a>, with little idea about how dramatically the world was going to change. The tragedy of the COVID-19 pandemic has reshaped the way we go about our daily lives. Our dependence on the Internet grew exponentially in 2020 as we started working from home, attending school from home, and participating in online weddings, concerts, parties, and more. So as we begin this new year, it’s impossible to think about data privacy in 2021 without thinking about how an <a href=\"/internet-privacy/\">always-on, always secure, always private Internet</a> is more important than ever.</p><p>The pandemic wasn’t the only thing to dramatically shape data privacy conversations last year. We saw a flurry of new activity on data protection legislation around the globe, and a trend toward data localization in a variety of jurisdictions.</p><p>I don’t think I’m taking any risks when I say that 2021 looks to be another busy year in the world of privacy and data protection. Let me tell you a bit about what that looks like for us at Cloudflare. We’ll be spending a lot of time in 2021 helping our customers find the solutions they need to meet data protection obligations; enhancing our technical, organizational, and contractual measures to protect the privacy of personal data no matter where in the world it is processed; and continuing to develop privacy-enhancing technologies that can help everyone on the Internet.</p><h3>Focus on International Data Transfers</h3><p>One of the biggest stories in data protection in 2020 was the Court of Justice of the European Union’s decision in the “Schrems II” case (Case C-311/18, <i>Data Protection Commissioner v Facebook Ireland and Maximillian Schrems</i>) that invalidated the EU-U.S. Privacy Shield. The court’s interpretation of U.S. surveillance laws meant that data controllers transferring EU personal data to U.S. data processors now have an obligation to make sure additional safeguards are in place to provide the same level of data protection as the General Data Protection Regulation (“GDPR”).</p><p>The court decision was followed by draft guidance from the European Data Protection Board (EDPB) that created new expectations and challenges for transfers of EU personal data to processors outside the EU pursuant to the GDPR. In addition, the EU Commission issued new draft standard contractual clauses that further emphasized the need for data transfer impact assessments and due diligence to be completed prior to transferring EU personal data to processors outside the EU. Meanwhile, even before the EDPB and EU Commission weighed in, France’s data protection authority, the CNIL, challenged the use of a U.S. cloud service provider for the processing of certain health data.</p><p>This year, the EDPB is poised to issue its final guidance on international data transfers, the EU Commission is set to release a final version of new standard contractual clauses, and the new Biden administration in the United States has already appointed a deputy assistant secretary for services at the U.S. Department of Commerce who will focus on negotiations around a new EU-U.S. Privacy Shield or another data transfer mechanism.</p><p>However, the trend to regulate international data transfers isn’t confined to Europe. India’s Personal Data Protection Bill, likely to become law in 2021, would bar certain types of personal data from leaving India. And Brazil’s Lei Geral de Proteção de Dados (**“**LGPD”), which went into effect in 2020, contains requirements for contractual guarantees that need to be in place for personal data to be processed outside Brazil.</p><p>Meanwhile, we’re seeing more data protection regulation across the globe: The California Consumer Privacy Act (“CCPA”) was amended by a new ballot initiative last year. Countries like Japan, China, Singapore, Canada, and New Zealand, that already had data protection legislation in some form, proposed or enacted amendments to strengthen those protections. And even the United States is considering comprehensive Federal data privacy regulation.</p><p>In light of last year’s developments and those we expect to see in 2021, Cloudflare is thinking a lot about what it means to process personal data outside its home jurisdiction. One of the key messages to come out of Europe in the second half of 2020 was the idea that to be able to transfer EU personal data to the United States, data processors would have to provide additional safeguards to ensure GDPR-level protection for personal data, even in light of the application of U.S. surveillance laws. While we are eagerly awaiting the EDPB’s final guidance on the subject, we aren’t waiting to ensure that we have in place the necessary additional safeguards.</p><p>In fact, Cloudflare has long maintained policies to address concerns about access to personal data. We’ve done so because we believe it’s the right thing to do, and because the conflicts of law we are seeing today seemed inevitable. We feel so strongly about our ability to provide that level of protection for data processed in the U.S., that today we are publishing a paper, “<a href=\"https://www.cloudflare.com/privacy-and-compliance/\">Cloudflare’s Policies around Data Privacy and Law Enforcement Requests</a>,” to describe how we address government and other legal requests for data.</p><p>Our paper describes our policies around data privacy and data requests, such as providing notice to our customers of any legal process requesting their data, and the measures we take to push back on any legal process requesting data where we believe that legal process creates a conflict of law. The paper also describes our public commitments about how we approach requests for data and public statements about things we have never done and, in CEO Matthew Prince’s words, that we “will fight like hell to never do”:</p><ul><li><p>Cloudflare has never turned over our encryption or authentication keys or our customers&#39; encryption or authentication keys to anyone.</p></li><li><p>Cloudflare has never installed any law enforcement software or equipment anywhere on our network.</p></li><li><p>Cloudflare has never provided any law enforcement organization a feed of our customers&#39; content transiting our network.</p></li><li><p>Cloudflare has never modified customer content at the request of law enforcement or another third party.</p></li></ul><p>In 2021, the Cloudflare team will continue to focus on these safeguards to protect <i>all</i> our customers’ personal data.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4JH1gTlP1F84hlrmh5OUFx/3f4d30111263e45d354ed54666f8b5e6/image4-22.png\" alt=\"\" class=\"kg-image\" width=\"1186\" height=\"552\" loading=\"lazy\"/>\n            \n            </figure><h3>Addressing Data Localization Challenges</h3><p>We also recognize that attention to international data transfers isn’t just a jurisdictional issue. Even if jurisdictions don’t require data localization by law, highly regulated industries like banking and healthcare may adopt best practice guidance asserting more requirements for data if it is to be processed outside a data subject’s home country.</p><p>With so much activity around data localization trends and international data transfers, companies will continue to struggle to understand regulatory requirements, as well as update products and business processes to meet those requirements and trends. So while we believe that Cloudflare can provide adequate protections for this data regardless of whether it is processed inside or outside its jurisdiction of origin, we also recognize that our customers are dealing with unique compliance challenges that we can help them face.</p><p>That means that this year we’ll also continue the work we started with our <a href=\"https://www.cloudflare.com/data-localization/\">Cloudflare Data Localization Suite</a>, which we announced during our Privacy &amp; Compliance Week in December 2020. The Data Localization Suite is designed to help customers build local requirements into their global online operations. We help our customers ensure that their data stays as private as they want it to, and only goes where they want it to go in the following ways:</p><ol><li><p>DDoS attacks are detected and mitigated at the data center closest to the end user.</p></li><li><p>Data centers inside the preferred region decrypt TLS and apply services like <a href=\"https://www.cloudflare.com/learning/ddos/glossary/web-application-firewall-waf/\">WAF</a>, CDN, and Cloudflare Workers.</p></li><li><p>Keyless SSL and Geo Key Manager store private SSL keys in a user-specified region.</p></li><li><p>Edge Log Delivery securely transmits logs from the inspection point to the log storage location of your choice.</p></li></ol><h3>Doubling Down on Privacy-Enhancing Technologies</h3><p>Cloudflare’s mission is to “Help Build a Better Internet,” and we’ve said repeatedly that a privacy-respecting Internet is a better Internet. We believe in empowering individuals and entities of all sizes with technological tools to reduce the amount of personal data that gets funnelled into the data ocean — regardless of whether someone lives in a country with laws protecting the privacy of their personal data. If we can build tools to help individuals share less personal data online, then that’s a win for privacy no matter what their country of residence.</p><p>For example, when Cloudflare launched the  <a href=\"/announcing-1111/\">1.1.1.1 public DNS resolver</a> — the Internet&#39;s <a href=\"https://www.dnsperf.com/#!dns-resolvers\">fastest</a>, privacy-first public DNS resolver — we committed to our public resolver users that we would not retain any personal data about requests made using our 1.1.1.1 resolver. And because we baked anonymization best practices into the 1.1.1.1 resolver when we built it, we were able to demonstrate that we didn’t have any personal data to sell when we asked independent accountants to conduct a <a href=\"/announcing-the-results-of-the-1-1-1-1-public-dns-resolver-privacy-examination/\">privacy examination</a> of the 1.1.1.1 resolver.</p><p>2021 will also see a continuation of a number of initiatives that we <a href=\"/next-generation-privacy-protocols/\">announced</a> during Privacy and Compliance Week that are aimed at improving Internet protocols related to user privacy:</p><ol><li><p>Fixing one of the last information leaks in HTTPS through Encrypted Client Hello (ECH), the evolution of Encrypted SNI.</p></li><li><p>Developing a superior protocol for password authentication, OPAQUE, that makes password breaches less likely to occur.</p></li><li><p>Making DNS even more private by supporting Oblivious DNS-over-HTTPS (ODoH).</p></li></ol><h3>Encrypted Client Hello (ECH)</h3><p>Under the old TLS handshake, privacy-sensitive parameters were negotiated completely in the clear and available to network observers. One example is the Server Name Indication (SNI), used by the client to indicate to the server the website it wants to reach — this is not information that should be exposed to eavesdroppers. Previously, this problem was mitigated through the Encrypted SNI (ESNI) extension. While ESNI took a significant step forward, it is an incomplete solution; a major shortcoming is that it protects only SNI. The <a href=\"/encrypted-client-hello/\">Encrypted Client Hello (ECH)</a> extension aims to close this gap by enabling encryption of the entire ClientHello, thereby protecting <b>all</b> privacy-sensitive handshake parameters. These changes represent a significant upgrade to TLS, one that will help preserve end-user privacy as the protocol continues to evolve. As this work continues, Cloudflare is committed to doing its part, along with close collaborators in the standards process, to ensure this important upgrade for TLS reaches Internet-scale deployment.</p><h3>OPAQUE</h3><p>Research has repeatedly shown that passwords are hard for users to manage — and they are also a challenge for servers: passwords are difficult to store securely, they’re frequently leaked and subsequently brute-forced. As long as people still use passwords, we’d like to make the process as secure as possible. Current methods rely on the risky practice of handling plaintext passwords on the server side while checking their correctness. One potential alternative is to use <a href=\"/opaque-oblivious-passwords/\">OPAQUE</a>, an asymmetric Password-Authenticated Key Exchange (aPAKE) protocol that allows secure password login without ever letting the server see the passwords.</p><p>With OPAQUE, instead of storing a traditional salted password hash, the server stores a secret envelope associated with the user that is “locked” by two pieces of information: the user’s password (known only by the user), and a random secret key (known only by the server). To log in, the client initiates a cryptographic exchange that reveals the envelope key only to the client (but not to the server). The server then sends this envelope to the user, who now can retrieve the encrypted keys. Once those keys are unlocked, they will serve as parameters for an Authenticated Key Exchange (AKE) protocol, which establishes a secret key for encrypting future communications.</p><p>Cloudflare has been pushing the development of OPAQUE forward, and has released a reference core OPAQUE <a href=\"https://github.com/cloudflare/opaque-core\">implementation in Go</a> and a demo <a href=\"https://github.com/cloudflare/opaque-ea\">TLS integration</a> (with a <a href=\"https://opaque.research.cloudflare.com/\">running version</a> you can try out). A Typescript client implementation of OPAQUE is coming soon.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/HUVstGR6Lt0JnL529KyST/dc640bcb6bd2e05473f0eb0efaf1d73a/image1-38.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1068\" loading=\"lazy\"/>\n            \n            </figure><h3>Oblivious DNS-over-HTTPS (ODoH)</h3><p>Encryption is a powerful tool that protects the privacy of personal data. This is why Cloudflare has doubled down on its implementation of <a href=\"/dns-encryption-explained/\">DNS over HTTPS (DoH)</a>. In the snail mail world, courts have long recognized a distinction between the level of privacy afforded to the contents of a letter vs. the addressing information on an envelope. But we’re not living in an age where the only thing someone can tell from the outside of the envelope are the “to” and “from” addresses and place of postage. The “digital envelopes” of DNS requests can contain much more information about a person than one might expect. Not only is there information about the sender and recipient addresses, but there is specific timestamp information about when requests were submitted, the domains and subdomains visited, and even how long someone stayed on a certain site. Encrypting those requests ensures that only the user and the resolver get that information, and that no one involved in the transit in between sees it. Given that our digital envelopes tell a much more robust story than the envelope in your physical mailbox, we think encrypting these envelopes is just as important as encrypting the messages they carry.</p><p>However, there are more ways in which DNS privacy can be enhanced, and Cloudflare took another incremental step in December 2020 by <a href=\"/oblivious-dns/\">announcing support for Oblivious DoH (ODoH)</a>. ODoH is a proposed DNS standard — co-authored by engineers from Cloudflare, Apple, and Fastly — that separates IP addresses from queries, so that no single entity can see both at the same time. ODoH requires a proxy as a key part of the communication path between client and resolver, with encryption ensuring that the proxy does not know the contents of the DNS query (only where to send it), and the resolver knowing what the query is but not who originally requested it (only the proxy’s IP address). Barring collusion between the proxy and the resolver, the identity of the requester and the content of the request are unlinkable.</p><p>As with DoH, successful deployment requires partners. A key component of ODoH is a proxy that is disjoint from the target resolver. Cloudflare is working with several leading proxy partners — currently PCCW, SURF, and Equinix — who are equally committed to privacy, and hopes to see this list grow.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7sNi1Sbcfs9uDZntGHHXQV/2465285550ad38afba4d3790b1e21870/image2-21.png\" alt=\"\" class=\"kg-image\" width=\"1314\" height=\"676\" loading=\"lazy\"/>\n            \n            </figure><h3><b>Post-Quantum Cryptography</b></h3><p>Even with all of these encryption measures, we also know that everything encrypted with today’s public key cryptography can likely be decrypted with tomorrow’s quantum computers. This makes deploying post-quantum cryptography a pressing privacy concern. We’re likely 10 to 15 years away from that development, but as our Head of Research Nick Sullivan described in his <a href=\"/securing-the-post-quantum-world/\">blog post in December</a>, we’re not waiting for that future. We’ve been paying close attention to the <a href=\"https://csrc.nist.gov/Projects/Post-Quantum-Cryptography\">National Institute of Standards and Technology (NIST)</a>’s initiative to define post-quantum cryptography algorithms to replace RSA and ECC. Last year, Cloudflare and Google performed the <a href=\"/the-tls-post-quantum-experiment/\">TLS Post-Quantum Experiment</a>, which involved implementing and supporting new key exchange mechanisms based on post-quantum cryptography for all Cloudflare customers for a period of a few months.</p><p>In addition, Cloudflare’s Research Team has been working with researchers from the University of Waterloo and Radboud University on a new protocol called <a href=\"/kemtls-post-quantum-tls-without-signatures/\">KEMTLS</a>. KEMTLS is designed to be fully post-quantum and relies only on public-key encryption. On the implementation side, Cloudflare has developed high-speed assembly versions of several of the NIST finalists (Kyber, Dilithium), as well as other relevant post-quantum algorithms (CSIDH, SIDH) in our CIRCL cryptography library written in Go. Cloudflare is endeavoring to use post-quantum cryptography for most internal services by the end of 2021, and plans to be among the first services to offer post-quantum cipher suites to customers as standards emerge.</p><h3>Looking forward to 2021</h3><p>If there’s anything 2020 taught us, it’s that our world can change almost overnight. One thing that doesn’t change, though, is that people will always want privacy for their personal data, and regulators will continue to define rules and requirements for what data protection should look like. And as these rules and requirements evolve, Cloudflare will be there every step of the way, developing innovative product and security solutions to protect data, and building privacy into everything we do.</p><h3>Watch on Cloudflare TV</h3><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/a0c227eacc1e5a74afd052e918e3df15?preload=true\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\"  allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div><!--kg-card-end: html-->",
		"id": "2obgCaLFacucryYIYVWfXX",
		"localeList": {
			"name": "Data Privacy Day 2021 - Looking ahead at the always on, always secure, always private Internet Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "2020 was a big year for data protection, so what does 2021 have in store? On this Data Privacy Day, we talk about the key role data localization and encryption technologies will play in data protection this year.",
		"metadata": {
			"title": "Data Privacy Day 2021 - Looking ahead at the always on, always secure, always private Internet",
			"description": "2020 was a big year for data protection, so what does 2021 have in store? On this Data Privacy Day, we talk about the key role data localization and encryption technologies will play in data protection this year.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5JzZfbvDJ7yJ3yfBrQXImZ/2dd3016f4689aee10790ce9e758ee2d0/data-privacy-day-2021-looking-ahead-at-the-always-on-always-secure-always-private-internet-z4XFw7.png"
		},
		"primary_author": {},
		"published_at": "2021-01-28T09:00:00.000+00:00",
		"slug": "data-privacy-day-2021-looking-ahead-at-the-always-on-always-secure-always-private-internet",
		"tags": [
			{
				"id": "3BWeMuiOShelE7QM48sW9j",
				"name": "Privacy",
				"slug": "privacy"
			},
			{
				"id": "5F2b6sVB63kQL3HwtfiHhf",
				"name": "Data Localization",
				"slug": "data-localization"
			}
		],
		"title": "Data Privacy Day 2021 - Looking ahead at the always on, always secure, always private Internet",
		"updated_at": "2024-08-27T01:53:55.832Z",
		"url": "https://blog.cloudflare.com/data-privacy-day-2021-looking-ahead-at-the-always-on-always-secure-always-private-internet"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}