{
	"initialReadingTime": "11",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"ko-kr",
		"pt-br",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Omer Yoachimik",
				"slug": "omer",
				"bio": "Product Manager / Cloudflare's DDoS Protection Service",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6TXRnB1v4ZHGiL3nRlvRTZ/946efe152cca5f55320466c0d3208fc1/omer.png",
				"location": "London",
				"website": null,
				"twitter": "@OmerYoahimik",
				"facebook": null
			}
		],
		"excerpt": "Welcome to our 2022 Q2 DDoS report. This report includes insights and trends about the DDoS threat landscape — as observed across the global Cloudflare network",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3mzmUIi60MjBkgClG4HzoJ/642d1127b3e8a268ccf75a5f2101ca98/ddos-attack-trends-for-2022-q2.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4PwTj2tCMoggQJjwZmRV1N/fad76ec75863540cf45c92295393b2f2/image22-2.png\" alt=\"DDoS attack trends for 2022 Q2\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Welcome to our 2022 Q2 DDoS report. This report includes insights and trends about the DDoS threat landscape — as observed across the global Cloudflare network. An interactive version of this report is also available on <a href=\"https://radar.cloudflare.com/notebooks/ddos-2022-q2\">Radar</a>.</p><p>In Q2, we’ve seen some of the largest attacks the world has ever seen including a <a href=\"/26m-rps-ddos/\">26 million request per second HTTPS DDoS attacks</a> that Cloudflare automatically detected and mitigated. Furthermore, attacks against Ukraine and Russia continue, whilst a new <a href=\"https://www.cloudflare.com/learning/ddos/ransom-ddos-attack/\">Ransom DDoS attack</a> campaign emerged.</p><h2>The Highlights</h2><h3>Ukrainian and Russian Internet</h3><ul><li><p>The war on the ground is accompanied by attacks targeting the spread of information.</p></li><li><p>Broadcast Media companies in the Ukraine were the most targeted in Q2 by DDoS attacks. In fact, all the top five most attacked industries are all in online/Internet media, publishing, and broadcasting.</p></li><li><p>In Russia on the other hand, Online Media drops as the most attacked industry to the third place. Making their way to the top, Banking, Financial Services and Insurance (BFSI) companies in Russia were the most targeted in Q2; almost 45% of all application-layer DDoS attacks targeted the BFSI sector. Cryptocurrency companies in Russia were the second most attacked.</p></li></ul><p>Read more about <a href=\"/what-cloudflare-is-doing-to-keep-the-open-internet-flowing-into-russia-and-keep-attacks-from-getting-out/\">what Cloudflare is doing to keep the Open Internet flowing into Russia and keep attacks from getting out</a>.</p><h3>Ransom DDoS attacks</h3><ul><li><p>We’ve seen a new wave of Ransom DDoS attacks by entities claiming to be the Fancy Lazarus.</p></li><li><p>In June 2022, ransom attacks peaked to the highest of the year so far: one out of every five survey respondents who experienced a DDoS attack reported being subject to a Ransom DDoS attack or other threats.</p></li><li><p>Overall in Q2, the percent of Ransom DDoS attacks increased by 11% QoQ.</p></li></ul><h3>Application-layer DDoS attacks</h3><ul><li><p>In 2022 Q2, application-layer DDoS attacks increased by 72% YoY.</p></li><li><p>Organizations in the US were the most targeted, followed by Cyprus, Hong Kong, and China. Attacks on organizations in Cyprus increased by 166% QoQ.</p></li><li><p>The Aviation &amp; Aerospace industry was the most targeted in Q2, followed by the Internet industry, Banking, Financial Services and Insurance, and Gaming / Gambling in fourth place.</p></li></ul><h3>Network-layer DDoS attacks</h3><ul><li><p>In 2022 Q2, network-layer DDoS attacks increased by 109% YoY. Attacks of 100 Gbps and larger increased by 8% QoQ, and attacks lasting more than 3 hours increased by 12% QoQ.</p></li><li><p>The top attacked industries were Telecommunications, Gaming / Gambling and the Information Technology and Services industry.</p></li><li><p>Organizations in the US were the most targeted, followed by China, Singapore, and Germany.</p></li></ul><p>This report is based on DDoS attacks that were automatically detected and mitigated by Cloudflare’s DDoS Protection systems. To learn more about how it works, check out <a href=\"/deep-dive-cloudflare-autonomous-edge-ddos-protection/\">this deep-dive blog post</a>.</p><p><b>A note on how we measure DDoS attacks observed over our network</b></p><p>To analyze attack trends, we calculate the “DDoS activity” rate, which is either the percentage of attack traffic out of the total traffic (attack + clean) observed over our global network, or in a specific location, or in a specific category (e.g., industry or billing country). Measuring the percentages allows us to normalize data points and avoid biases reflected in absolute numbers towards, for example, a Cloudflare data center that receives more total traffic and likely, also more attacks.</p><h2>Ransom Attacks</h2><p>Our systems constantly analyze traffic and automatically apply mitigation when DDoS attacks are detected. Each DDoS’d customer is prompted with an automated survey to help us better understand the nature of the attack and the success of the mitigation.</p><p>For over two years now, Cloudflare has been surveying attacked customers — one question on the survey being if they received a threat or a ransom note demanding payment in exchange to stop the DDoS attack.</p><p>The number of respondents reporting threats or ransom notes in Q2 increased by 11% QoQ and YoY. During this quarter, we’ve been mitigating Ransom DDoS attacks that have been launched by entities claiming to be the Advanced Persistent Threat (APT) group “Fancy Lazarus”. The campaign has been focusing on financial institutions and cryptocurrency companies.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3LekSaUnzoF3WKmsKWhnHu/6ce4a1c0b69b103515da8f3f1485d250/image15-1.png\" alt=\"Graph of ransom DDoS attacks by quarter\" class=\"kg-image\" width=\"2000\" height=\"1000\" loading=\"lazy\"/>\n            \n            </figure><p><b>The percentage of respondents reported being targeted by a ransom DDoS attack or that have received threats in advance of the attack.</b></p><p>Drilling down into Q2, we can see that in June one out of every five respondents reported receiving a ransom DDoS attack or threat — the highest month in 2022, and the highest since December 2021.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2eTKJ7CS0gEfyXbA3EUnJd/319267341935d81521271669d01636b0/image6-1.png\" alt=\"Graph of ransom DDoS attacks by month\" class=\"kg-image\" width=\"2000\" height=\"1000\" loading=\"lazy\"/>\n            \n            </figure><h2>Application-layer DDoS attacks</h2><p><a href=\"https://www.cloudflare.com/learning/ddos/application-layer-ddos-attack/\">Application-layer DDoS attacks</a>, specifically HTTP DDoS attacks, are attacks that usually aim to disrupt a web server by making it unable to process legitimate user requests. If a server is bombarded with more requests than it can process, the server will drop legitimate requests and — in some cases — crash, resulting in degraded performance or an outage for legitimate users.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2obOKJucCHHwfzjfSp15GA/f2db752ebc36df70eb8c96caee08f7cf/image3-2.png\" alt=\"A diagram of a DDoS attack denying service to legitimate users\" class=\"kg-image\" width=\"1701\" height=\"900\" loading=\"lazy\"/>\n            \n            </figure><h3>Application-layer DDoS attacks by month</h3><p><b>In Q2, application-layer DDoS attacks increased by 72% YoY.</b></p><p>Overall, in Q2, the volume of application-layer DDoS attacks increased by 72% YoY, but decreased 5% QoQ. May was the busiest month in the quarter. Almost 41% of all application-layer DDoS attacks took place in May, whereas the least number of attacks took place in June (28%).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4qwd7buXAUhojmsIB3rOpU/dc4807961f52c857253aa7689b376eb2/image20-1.png\" alt=\"Graph of the yearly distribution of application-layer DDoS attacks by month in the past 12 months\" class=\"kg-image\" width=\"2000\" height=\"1000\" loading=\"lazy\"/>\n            \n            </figure><h3>Application-layer DDoS attacks by industry</h3><p><b>Attacks on the Aviation and Aerospace industry increased by 493% QoQ.</b></p><p>In Q2, Aviation and Aerospace was the most targeted industry by application-layer DDoS attacks. After it, was the Internet industry, Banking, Financial Institutions and Insurance (BFSI) industry, and in fourth place the Gaming / Gambling industry.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6PKfB1M18FZ4GwzL59sqlM/7a89890789337ed373003c4b964dd163/image9-2.png\" alt=\"Graph of the distribution of HTTP DDoS attacks by industry in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Ukraine and Russia cyberspace</h3><p><b>Media and publishing companies are the most targeted in Ukraine.</b></p><p>As the war in Ukraine continues on the ground, in the air and on the water, so does it continue in cyberspace. Entities targeting Ukrainian companies appear to be trying to silence information. The top five most attacked industries in the Ukraine are all in broadcasting, Internet, online media, and publishing — that’s almost 80% of all DDoS Attacks targeting Ukraine.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4hYnRS2MRBsydLh7HZ260z/fb74c124e926ed50718389070c6c4534/image1-2.png\" alt=\"Graph of the distribution of HTTP DDoS attacks on Ukrainian industries by source country in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>On the other side of the war, the Russian Banks, Financial Institutions and Insurance (BFSI) companies came under the most attacks. Almost 45% of all DDoS attacks targeted the BFSI sector. The second most targeted was the Cryptocurrency industry, followed by Online media.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2SuLnGNWkX83CMCh4Knqnj/758c64f5c746d65e6a24747b8f48f370/image10.png\" alt=\"Graph of the distribution of HTTP DDoS attacks on Russian industries by source country in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>In both sides of the war, we can see that the attacks are highly distributed, indicating the use of globally distributed botnets.</p><h3>Application-layer DDoS attacks by source country</h3><p><b>In Q2, attacks from China shrank by 78%, and attacks from the US shrank by 43%.</b></p><p>To understand the origin of the HTTP attacks, we look at the geolocation of the source IP address belonging to the client that generated the attack HTTP requests. Unlike network-layer attacks, source IP addresses cannot be <a href=\"https://www.cloudflare.com/learning/ddos/glossary/ip-spoofing/\">spoofed</a> in HTTP attacks. A high percentage of DDoS activity in a given country doesn’t mean that that specific country is launching the attacks but rather indicates the presence of botnets operating from within the country&#39;s borders.</p><p>For the second quarter in a row, the United States tops the charts as the main source of HTTP DDoS attacks. Following the US is China in second place, and India and Germany in the third and fourth. Even though the US remained in the first place, attacks originating from the US shrank by 48% QoQ while attacks from other regions grew; attacks from India grew by 87%, from Germany by 33%, and attacks from Brazil grew by 67%.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2vk1N76Ouhfo9PnAmbGtrV/08b02841a42108377284bdab095919c8/image16-1.png\" alt=\"Graph of the distribution of HTTP DDoS attacks by source country in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Application-layer DDoS attacks by target country</h3><p>In order to identify which countries are targeted by the most HTTP DDoS attacks, we bucket the DDoS attacks by our customers&#39; billing countries and represent it as a percentage out of all DDoS attacks.</p><p>HTTP DDoS attacks on US-based countries increased by 67% QoQ pushing the US back to the first place as the main target of application-layer DDoS attacks. Attacks on Chinese companies plunged by 80% QoQ dropping it from the first place to the fourth. Attacks on Cyprus increase by 167% making it the second most attacked country in Q2. Following Cyprus is Hong Kong, China, and the Netherlands.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5FYRI0hCsXZZ4TVkyNNod2/92765a6bf4b2cc9df3c51edb5e3bc08b/image8-1.png\" alt=\"Graph of the distribution of HTTP DDoS attacks by target country in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h2>Network-layer DDoS attacks</h2><p>While application-layer attacks target the application (Layer 7 of the <a href=\"https://www.cloudflare.com/learning/ddos/glossary/open-systems-interconnection-model-osi/\">OSI model</a>) running the service that end users are trying to access (HTTP/S in our case), <a href=\"https://www.cloudflare.com/learning/ddos/layer-3-ddos-attacks/\">network-layer attacks</a> aim to overwhelm network infrastructure (such as in-line routers and servers) and the Internet link itself.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/G9kSKRT459XrlobrASHLn/c034b94842b759ae2cd2310e5075a92a/image23-1.png\" alt=\"\" class=\"kg-image\" width=\"1701\" height=\"900\" loading=\"lazy\"/>\n            \n            </figure><h3>Network-layer DDoS attacks by month</h3><p><b>In Q2, network-layer DDoS attacks increased by 109% YoY, and volumetric attacks of 100 Gbps and larger increased by 8% QoQ.</b></p><p>In Q2, the total amount of network-layer DDoS attacks increased by 109% YoY and 15% QoQ. June was the busiest month of the quarter with almost 36% of the attacks occurring in June.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/63wvQwZOAcqCfuGWLIC4d7/7ac230f33fea7bd0809a897a609de8ea/image12.png\" alt=\"Graph of the yearly distribution of network-layer DDoS attacks by month in the past 12 months\" class=\"kg-image\" width=\"2000\" height=\"1000\" loading=\"lazy\"/>\n            \n            </figure><h3>Network-layer DDoS attacks by industry</h3><p><b>In Q2, attacks on Telecommunication companies grew by 66% QoQ.</b></p><p>For the second consecutive quarter, the Telecommunications industry was the most targeted by network-layer DDoS attacks. Even more so, attacks on Telecommunication companies grew by 66% QoQ. The Gaming industry came in second place, followed by Information Technology and Services companies.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1AqUyyBbet85BZ804EmvXa/a8b7d9a552bc6f40b63d2fd9d9c7c8a6/image2-2.png\" alt=\"Graph of the distribution of network-layer DDoS attack bytes by industry in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Network-layer DDoS attacks by target country</h3><p><b>Attacks on US networks grew by 95% QoQ.</b></p><p>In Q2, the US remains the most attacked country. After the US came China, Singapore and Germany.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/48CEVlhmbUEAVjFtztOrAa/0ac52e0901d12cfe0a2429b3e99accb4/image17-1.png\" alt=\"Graph of the distribution of network-layer DDoS attack bytes by target country in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Network-layer DDoS attacks by ingress country</h3><p><b>In Q2, almost a third of the traffic Cloudflare observed in Palestine and a fourth in Azerbaijan was part of a network-layer DDoS attack.</b></p><p>When trying to understand where network-layer DDoS attacks originate, we cannot use the same method as we use for the application-layer attack analysis. To launch an application-layer DDoS attack, <a href=\"https://www.cloudflare.com/learning/ssl/what-happens-in-a-tls-handshake/\">successful handshakes</a> must occur between the client and the server in order to establish an HTTP/S connection. For a successful handshake to occur, the attacks cannot spoof their source IP address. While the attacker may use botnets, proxies, and other methods to obfuscate their identity, the attacking client&#39;s source IP location does sufficiently represent the attack source of application-layer DDoS attacks.</p><p>On the other hand, to launch network-layer DDoS attacks, in most cases, no handshake is needed. Attackers can spoof the source IP address in order to obfuscate the attack source and introduce randomness into the attack properties, which can make it harder for simple DDoS protection systems to block the attack. So if we were to derive the source country based on a spoofed source IP, we would get a ‘spoofed country’.</p><p>For this reason, when analyzing network-layer DDoS attack sources, we bucket the traffic by the Cloudflare data center locations where the traffic was ingested, and not by the (potentially) spoofed source IP to get an understanding of where the attacks originate from. We are able to achieve geographical accuracy in our report because we have data centers in <a href=\"http://www.cloudflare.com/network\">over 270 cities</a> around the world. However, even this method is not 100% accurate, as traffic may be back hauled and routed via various Internet Service Providers and countries for reasons that vary from cost reduction to congestion and failure management.</p><p>Palestine jumps from the second to the first place as the Cloudflare location with the highest percentage of network-layer DDoS attacks. Following Palestine is Azerbaijan, South Korea, and Angola.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7eLWg6GnqkwtT8se0EXZU2/6556cc50e208203ba1552b577abb2173/image21-1.png\" alt=\"Graph of the distribution of network-layer DDoS attacks by source country in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/g7HPkqNU8zeuSzWnBmZdH/c2cfa76944b40f3b519222dd6effcc9d/image7-1.png\" alt=\"Map of the distribution of network-layer DDoS attacks by source country in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"800\" loading=\"lazy\"/>\n            \n            </figure><p>To view all regions and countries, check out the <a href=\"https://radar.cloudflare.com/notebooks/ddos-2022-q2#network-layer-ddos-attacks-by-ingress-country\">interactive map</a>.</p><h3>Attack vectors</h3><p><b>In Q2, DNS attacks increased making it the second most frequent attack vector.</b></p><p>An attack vector is a term used to describe the method that the attacker uses to launch their DDoS attack, i.e., the IP protocol, packet attributes such as TCP flags, flooding method, and other criteria.</p><p>In Q2, 53% of all network-layer attacks were <a href=\"https://www.cloudflare.com/learning/ddos/syn-flood-ddos-attack/\">SYN floods</a>. SYN floods remain the most popular attack vector. They abuse the initial connection request of the stateful <a href=\"https://www.cloudflare.com/learning/ddos/glossary/tcp-ip/\">TCP</a> handshake. During this initial connection request, servers don’t have any context about the TCP connection as it is new and without the proper protection may find it hard to mitigate a flood of initial connection requests. This makes it easier for the attacker to consume an unprotected server’s resources.</p><p>After the SYN floods are attacks targeting DNS infrastructure, RST floods again abusing TCP connection flow, and generic attacks over UDP.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3AKhwoAGSHqlrQLHjecZAZ/48eacf28383907228439f0dc976b3f25/image13-1.png\" alt=\"Graph of the top network-layer DDoS attack vectors in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Emerging threats</h3><p><b>In Q2, the top emerging threats included attacks over CHARGEN, Ubiquiti and Memcached.</b></p><p>Identifying the top attack vectors helps organizations understand the threat landscape. In turn, this may help them improve their security posture to protect against those threats. Similarly, learning about new emerging threats that may not yet account for a significant portion of attacks, can help mitigate them before they become a significant force.</p><p>In Q2, the top emerging threats were amplification attacks abusing the Character Generator Protocol (CHARGEN), amplification attacks reflecting traffic off of exposed Ubiquiti devices, and the notorious Memcached attack.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/60X75WXzKulAjLCdpDS55b/1ef1de45c07aa5c25dae82ea7a8b2d08/image5-2.png\" alt=\"Graph of the top emerging network-layer DDoS attack threats in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Abusing the CHARGEN protocol to launch amplification attacks</h3><p><b>In Q2, attacks abusing the CHARGEN protocol increased by 378% QoQ.</b></p><p>Initially defined in <a href=\"https://datatracker.ietf.org/doc/html/rfc864\">RFC 864</a> (1983), the Character Generator (CHARGEN) protocol is a service of the <a href=\"https://en.wikipedia.org/wiki/Internet_protocol_suite\">Internet Protocol Suite</a> that does exactly what it says it does - it generates characters arbitrarily, and it doesn’t stop sending them to the client until the client closes the connection. Its original intent was for testing and debugging. However, it’s rarely used because it can so easily be abused to generate amplification/reflection attacks.</p><p>An attacker can spoof the source IP of their victim and fool supporting servers around the world to direct a stream of arbitrary characters “back” to the victim’s servers. This type of attack is amplification/reflection. Given enough simultaneous CHARGEN streams, the victim’s servers, if unprotected, would be flooded and unable to cope with legitimate traffic — resulting in a denial of service event.</p><h3>Amplification attacks exploiting the Ubiquiti Discovery Protocol</h3><p><b>In Q2, attacks over Ubiquity increased by 327% QoQ.</b></p><p><a href=\"https://www.ui.com/\">Ubiquiti</a> is a US-based company that provides networking and Internet of Things (IoT) devices for consumers and businesses. Ubiquiti devices can be discovered on a network using the <a href=\"https://help.ui.com/hc/en-us/articles/204976244-EdgeRouter-Ubiquiti-Device-Discovery\">Ubiquiti Discovery protocol</a> over UDP/TCP port 10001.</p><p>Similarly to the CHARGEN attack vector, here too, attackers can spoof the source IP to be the victim’s IP address and spray IP addresses that have port 10001 open. Those would then respond to the victim and essentially flood it if the volume is sufficient.</p><h3>Memcached DDoS attacks</h3><p><b>In Q2, Memcached DDoS attacks increased by 287% QoQ.</b></p><p><a href=\"https://www.cloudflare.com/learning/ddos/memcached-ddos-attack/\">Memcached</a> is a database caching system for speeding up websites and networks. Similarly to CHARGEN and Ubiquiti, Memcached servers that support UDP can be abused to launch amplification/reflection DDoS attacks. In this case, the attacker would request content from the caching system and spoof the victim&#39;s IP address as the source IP in the UDP packets. The victim will be flooded with the Memcache responses which can be amplified by a factor of up to 51,200x.</p><h2>Network-layer DDoS attacks by attack rate</h2><p><b>Volumetric attacks of over 100 Gbps increase by 8% QoQ.</b></p><p>There are different ways of measuring the size of an L3/4 DDoS attack. One is the volume of traffic it delivers, measured as the bit rate (specifically, terabits per second or gigabits per second). Another is the number of packets it delivers, measured as the packet rate (specifically, millions of packets per second).</p><p>Attacks with high bit rates attempt to cause a denial-of-service event by clogging the Internet link, while attacks with high packet rates attempt to overwhelm the servers, routers, or other in-line hardware appliances. These devices dedicate a certain amount of memory and computation power to process each packet. Therefore, by bombarding it with many packets, the appliance can be left with no further processing resources. In such a case, packets are “dropped,” i.e., the appliance is unable to process them. For users, this results in service disruptions and denial of service.</p><h3>Distribution by packet rate</h3><p>The majority of network-layer DDoS attacks remain below 50,000 packets per second. While 50 kpps is on the lower side of the spectrum at Cloudflare scale, it can still easily take down unprotected Internet properties and congest even a standard Gigabit Ethernet connection.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5edVFCX1vigbfc2CfCDz6g/fdafde458985ed3165640a402c6439d5/image4-1.png\" alt=\"Graph of the distribution of network-layer DDoS attacks by packet rate in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>When we look at the changes in the attack sizes, we can see that packet-intensive attacks above 50 kpps decreased in Q2, resulting in an increase of 4% in small attacks.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/152vteTszixrwCKNzrszuw/9f30a4d0c91a9338c141393e28d96afc/image11-1.png\" alt=\"Graph of the change in the distribution of network-layer DDoS attacks by packet rate quarter over quarter for 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Distribution by bitrate</h3><p>In Q2, most of the network-layer DDoS attacks remain below 500 Mbps. This too is a tiny drop in the water at <a href=\"https://www.cloudflare.com/network/\">Cloudflare scale</a>, but can very quickly shut down unprotected Internet properties with less capacity or at the very least cause congestion for even a standard Gigabit Ethernet connection.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1lUj3pmi7Ch0uSG5ZCuURH/ff979c4bced3b797d9a5803b917d0198/image18-1.png\" alt=\"Graph of the distribution of network-layer DDoS attacks by bit rate in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>Interestingly enough, large attacks between 500 Mbps and 100 Gbps decreased by 20-40% QoQ, but volumetric attacks above 100 Gbps increased by 8%.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2aCjsSBcyiqdAXY6ZDamo9/53cf22f9aae35ea8b722070437b9409f/image24-1.png\" alt=\"Graph of the change in the distribution of network-layer DDoS attacks by bit rate quarter over quarter for 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><h3>Network-layer DDoS attacks by duration</h3><p><b>In Q2, attacks lasting over three hours increased by 9%.</b></p><p>We measure the duration of an attack by recording the difference between when it is first detected by our systems as an attack and the last packet we see with that attack signature towards that specific target.</p><p>In Q2, 52% of network-layer DDoS attacks lasted less than 10 minutes. Another 40% lasted 10-20 minutes. The remaining 8% include attacks ranging from 20 minutes to over three hours.</p><p>One important thing to keep in mind is that even if an attack lasts only a few minutes, if it is successful, the repercussions could last well beyond the initial attack duration. IT personnel responding to a successful attack may spend hours and even days restoring their services.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3emu9oLw9gcXbz5AZWAZtM/5ad9e09d83c32de5ea66dd69f6cf61c2/image19-2.png\" alt=\"Graph of the distribution of network-layer DDoS attacks by duration in 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>While most of the attacks are indeed short, we can see an increase of over 15% in attacks ranging between 20-60 minutes, and a 12% increase of attacks lasting more than three hours.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4hSf9t1KjaWIMXy4roHCla/8f4c12089b03a37b8ca56ab51384e7dd/image14-1.png\" alt=\"Graph of the change in the distribution of network-layer DDoS attacks by duration quarter over quarter for 2022 Q2\" class=\"kg-image\" width=\"1000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>Short attacks can easily go undetected, especially burst attacks that, within seconds, bombard a target with a significant number of packets, bytes, or requests. In this case, DDoS protection services that rely on manual mitigation by security analysis have no chance in mitigating the attack in time. They can only learn from it in their post-attack analysis, then deploy a new rule that filters the attack fingerprint and hope to catch it next time. Similarly, using an “on-demand” service, where the security team will redirect traffic to a DDoS provider during the attack, is also inefficient because the attack will already be over before the traffic routes to the on-demand DDoS provider.</p><p>It’s recommended that companies use <a href=\"https://www.cloudflare.com/ddos/\">automated, always-on DDoS protection services</a> that analyze traffic and apply real-time fingerprinting fast enough to block short-lived attacks.</p><h2>Summary</h2><p>Cloudflare’s mission is to help build a better Internet. A better Internet is one that is more secure, faster, and reliable for everyone — even in the face of DDoS attacks. As part of our mission, since 2017, we’ve been providing <a href=\"/unmetered-mitigation/\">unmetered and unlimited DDoS protection</a> for free to all of our customers. Over the years, it has become increasingly easier for attackers to launch DDoS attacks. But as easy as it has become, we want to make sure that it is even easier — and free — for organizations of all sizes to protect themselves against DDoS attacks of all types.</p><p>Not using Cloudflare yet? <a href=\"https://dash.cloudflare.com/sign-up\">Start now</a> with our Free and <a href=\"https://www.cloudflare.com/plans/pro/\">Pro plans</a> to protect your websites, or <a href=\"https://www.cloudflare.com/magic-transit/\">contact us</a> for comprehensive DDoS protection for your entire network using Magic Transit.</p>",
		"id": "i4xr8wP9XJwugHF1dG7F8",
		"localeList": {
			"name": "DDoS attack trends for 2022 Q2 Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "Translated for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Welcome to our 2022 Q2 DDoS report. This report includes insights and trends about the DDoS threat landscape — as observed across the global Cloudflare network.",
		"metadata": {
			"title": "DDoS attack trends for 2022 Q2",
			"description": "Welcome to our 2022 Q2 DDoS report. This report includes insights and trends about the DDoS threat landscape — as observed across the global Cloudflare network.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1ECgUO9HSf3pa8aOkPapln/d7dcfcfa3e2f797a9acd9296dde50cce/ddos-attack-trends-for-2022-q2-mSHQVQ.png"
		},
		"primary_author": {},
		"published_at": "2022-07-06T13:55:42.000+01:00",
		"slug": "ddos-attack-trends-for-2022-q2",
		"tags": [
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "54Tkjs4keJGD0ddq0dfL5Y",
				"name": "DDoS Reports",
				"slug": "ddos-reports"
			},
			{
				"id": "5kIxDMJCg3PXQxVINDL0Cw",
				"name": "Attacks",
				"slug": "attacks"
			},
			{
				"id": "3yArjf0gLKZy8ObEDxbNNi",
				"name": "Trends",
				"slug": "trends"
			},
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "3A8zENWUQfuFg8Pwk89BtL",
				"name": "Ransom Attacks",
				"slug": "ransom-attacks"
			},
			{
				"id": "2miIdHTluQ1AZhjztN4npX",
				"name": "Ukraine",
				"slug": "ukraine"
			},
			{
				"id": "Kyyh4MAXXNM1AUZgRirSD",
				"name": "Russia",
				"slug": "russia"
			}
		],
		"title": "DDoS attack trends for 2022 Q2",
		"updated_at": "2024-08-27T01:50:32.081Z",
		"url": "https://blog.cloudflare.com/ddos-attack-trends-for-2022-q2"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}