{
	"initialReadingTime": "8",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"de-de",
		"ja-jp",
		"ko-kr"
	],
	"post": {
		"authors": [
			{
				"name": "Vivek Ganti",
				"slug": "vivek",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/62IKvdVNrkquydlyN6ffOD/783ec521b9579788f78de393095e6c8b/vivek.jpeg",
				"location": null,
				"website": null,
				"twitter": "@VivekGanti",
				"facebook": null
			},
			{
				"name": "Omer Yoachimik",
				"slug": "omer",
				"bio": "Product Manager / Cloudflare's DDoS Protection Service",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6TXRnB1v4ZHGiL3nRlvRTZ/946efe152cca5f55320466c0d3208fc1/omer.png",
				"location": "London",
				"website": null,
				"twitter": "@OmerYoahimik",
				"facebook": null
			}
		],
		"excerpt": "Today, along with this deep-dive analysis blog, we’re excited to announce the new Radar DDoS Report page, our first fully automated data notebook built on top of Jupyter, Clickhouse, and Workers.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1JK7DFAr6GfqIUySv1YvZY/665e6ff0f7c77b4cfa0673229d30fb39/ddos-attack-trends-for-2021-q1.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6ZcnllWNgU3yYvhX7z2svi/4d6063667c89b43e35bd4b89cbf86d0a/image6-4.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1033\" loading=\"lazy\"/>\n            \n            </figure><p>Last week was <a href=\"/developers-developers-developers/\">Developer Week</a> at Cloudflare. During that week, our teams released a bunch of cool new products, including a bunch of <a href=\"/location-based-personalization-using-workers/\">improvements to Workers</a>. And it&#39;s not just our customers that love deploying apps with Workers, but also our engineering teams. Workers is also what powers our Internet traffic and attack trends on <a href=\"https://radar.cloudflare.com/\">Cloudflare Radar</a>. Today, along with this deep-dive analysis blog, we’re excited to announce the new <a href=\"https://radar.cloudflare.com/notebooks/ddos\">Radar DDoS Report</a> page, our first fully automated data notebook built on top of <a href=\"https://jupyter.org/\">Jupyter</a>, <a href=\"/explaining-cloudflares-abr-analytics/\">Clickhouse</a>, and <a href=\"https://workers.cloudflare.com/\">Workers</a>.</p><p>Last month, we introduced our <a href=\"/deep-dive-cloudflare-autonomous-edge-ddos-protection/\">autonomous edge DDoS (Distributed Denial of Service) protection system</a> and explained how it is able to drop attacks at wire speed without impacting performance. It runs in our networks’ edge, analyzes traffic asynchronously to avoid impacting performance, and pushes mitigation rules in-line immediately once attacks are detected. All of this is done autonomously, i.e., without requiring centralized consensus.</p><p>Today, we’d like to share the latest DDoS insights and trends that are based on attacks that our system mitigated during the first quarter of 2021. When we analyze attacks, we calculate the “DDoS activity” rate, which is the percent of attack traffic out of the total traffic (attack + clean). This allows us to normalize the data points and avoid biases towards, for example, a data center that sees more traffic and therefore also more attacks.</p><h2>Highlights</h2><h4>Application-layer DDoS attacks</h4><ul><li><p>In 2021 Q1, the country with the highest percentage of HTTP attack traffic was China. This was followed by the United States, Malaysia, and India.</p></li><li><p>The telecommunication industry was the most attacked in Q1, followed by Consumer Services, Security and Investigations, Internet, and Cryptocurrency.</p></li><li><p>The most attacked Internet properties were of companies based in China, the US, and Morocco.</p></li></ul><h4>Network-layer DDoS attacks</h4><ul><li><p>On the Cloudflare network, the highest DDoS activity was observed in our data centers in Rwanda, China, and Brunei.</p></li><li><p>Almost 44% of all of the attacks in Q1 occurred in January.</p></li><li><p>Top emerging threats include attacks targeting Jenkins and TeamSpeak3 servers, which increased by 940% and 203% QoQ, respectively.</p></li><li><p>Additional emerging threats include floods of QUIC version negotiation packets that may have been an attempt to disrupt Cloudflare’s infrastructure.</p></li></ul><h2>Application-layer DDoS attacks</h2><p><a href=\"https://www.cloudflare.com/learning/ddos/application-layer-ddos-attack/\">Application-layer DDoS attacks</a>, or HTTP DDoS attacks, are attacks that aim to disrupt an HTTP server by making it unable to process requests. If a server is bombarded with more requests than it can process, the server will drop legitimate requests or even crash.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7zHfLkEUKYGWOIpgUYwdOc/f58a614b3f5d5dfa2adec881d9b89846/image9.png\" alt=\"\" class=\"kg-image\" width=\"746\" height=\"452\" loading=\"lazy\"/>\n            \n            </figure><h3>DDoS attack activity per industry</h3><p>When we break down DDoS activity by our customer’s market industry, we can see that Telecommunication was the most targeted industry in Q1. This is a significant jump from sixth place in 2020 Q4. Following in second place is the Consumer Services industry, and in third place the Security and Investigations industry.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5sK5ELeb1Eij8hODdzJt4U/d23e951b8ab6b45d49411b1c78063ebc/image12.png\" alt=\"\" class=\"kg-image\" width=\"1226\" height=\"409\" loading=\"lazy\"/>\n            \n            </figure><h3>DDoS activity by source country</h3><p>As opposed to network-layer attacks, the source IP cannot be <a href=\"https://www.cloudflare.com/learning/ddos/glossary/ip-spoofing/\">spoofed</a> in an HTTP attack. A connection must be established. By looking up the location of the source IP of the client, we can identify the source country. A high DDoS activity rate in a given country indicates large botnets operating from within. Both in 2020 Q4 and 2021 Q1, China came in first place, with the US not far behind.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2FpP9q0YTMzJDb417AgsLE/60422e09ef93967820dfd6717d0612ad/image2-24.png\" alt=\"\" class=\"kg-image\" width=\"1223\" height=\"405\" loading=\"lazy\"/>\n            \n            </figure><h3>DDoS activity by target country</h3><p>In order to identify which countries are being attacked the most, we break down the DDoS activity by our customer’s billing country. Similar to the attack source breakdown, China and the US come in first and second places, respectively. Interestingly enough, in the previous quarter, India dethroned China from the first place, perhaps due to the <a href=\"https://en.wikipedia.org/wiki/2020_elections_in_India\">elections in India</a> that also occurred throughout 2020 Q4.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6G47cuf1hYvoQZO3wULEWv/af52ed72728afc2f3d99dea1f3e428b9/image8-2.png\" alt=\"\" class=\"kg-image\" width=\"1229\" height=\"408\" loading=\"lazy\"/>\n            \n            </figure><h3>Ransom attacks</h3><p>As we’ve seen, our customers on the non-Enterprise plans were the most targeted by DDoS attacks. However, it’s not just the quantity of attacks that is high, but these customers also reported the highest number of <a href=\"https://www.cloudflare.com/learning/ddos/ransom-ddos-attack/\">Ransom DDoS attacks</a> (RDDoS). In 2021 Q1, 13% of surveyed Cloudflare customers that were hit by a DDoS attack reported they were either extorted by an RDDoS attack or received a threat in advance. Of those, 62% are on the Pro plan and 33% on the Business plan. This is a continued trend from 2020 Q4 where the number of extorted customers was 17%, including a <a href=\"/ransom-ddos-attacks-target-a-fortune-global-500-company/\">Fortune Global 500 company that was targeted by a group claiming to be the Lazarus Group</a>, a company which we onboarded and protected.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/kLEhKiSOs26DK1eJRQhkH/61b33b6aa9388a451b7cd168dceb97fb/image7-2.png\" alt=\"\" class=\"kg-image\" width=\"1214\" height=\"415\" loading=\"lazy\"/>\n            \n            </figure><h2>Network-layer DDoS attacks</h2><p>While application layer attacks strike the application (Layer 7 of the <a href=\"https://www.cloudflare.com/learning/ddos/glossary/open-systems-interconnection-model-osi/\">OSI model</a>) running the service end users are trying to access, <a href=\"https://www.cloudflare.com/learning/ddos/layer-3-ddos-attacks/\">network layer attacks</a> target exposed network infrastructure (such as in-line routers and other network servers) and the Internet link itself.</p><h3>Number of attacks</h3><p>On a monthly basis, January was Q1’s busiest month for attackers, constituting 42% of the total attacks observed in the quarter. Followed by March with 34.2% and February with 23.8%.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/p03PCIyhshKZKFNbz3cXB/552e709cefa83edeaedbd537bc539c56/image11.png\" alt=\"\" class=\"kg-image\" width=\"1221\" height=\"399\" loading=\"lazy\"/>\n            \n            </figure><p>In February, we did however see the largest attacks of Q1 peaking at 300-400 Gbps.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4zpiMkoaYbMGQeMnpWLeuM/106d414246427f35320caf81a89153d8/image1-29.png\" alt=\"\" class=\"kg-image\" width=\"1220\" height=\"403\" loading=\"lazy\"/>\n            \n            </figure><h3>Size of attacks</h3><p>There are different ways of measuring a L3/4 DDoS attack’s size. One is the volume of traffic it delivers, measured as the bit rate (specifically, gigabits-per-second). Another is the number of packets it delivers, measured as the packet rate (specifically, packets-per-second). Attacks with high bit rates attempt to saturate the Internet link, while attacks with high packet rates attempt to overwhelm the routers or other in-line hardware devices.</p><p>In 2021 Q1, a vast majority (over 97%) of the L3/4 attacks observed were smaller than 1 mpps and 500 Mbps.</p><p>This is a continuation of the trend we observed all of last year. However, this does not imply that these attacks are harmless.</p><p>Attacks under 500 Mbps are often sufficient to create major disruptions for Internet properties that are not protected by a cloud-based DDoS protection service. Many organizations have uplinks provided by their service providers with less bandwidth capacity than 1 Gbps. Assuming their public facing network interface also serves legitimate traffic, you can see how even DDoS attacks under 500 Mbps can easily take down Internet properties.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7oPtvs3zwGtwsACiQEynA1/ba8f026ce55e9f5019c3117461105d18/image.png\" alt=\"\" class=\"kg-image\" width=\"1220\" height=\"408\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3LiAZ3oYFU4s0V31k1inlJ/ae472e7252ea0136743095a5ad087620/image4-9.png\" alt=\"\" class=\"kg-image\" width=\"1228\" height=\"413\" loading=\"lazy\"/>\n            \n            </figure><h3>Duration of attacks</h3><p>Over 90% of attacks lasted under one hour in duration. Short burst attacks may attempt to cause damage without being detected by DDoS detection systems. DDoS services that rely on manual analysis and mitigation may prove to be useless against these types of attacks because they are over before the analyst can even identify the attack traffic.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/15WjsZ3uHu23zy7hzkr9x4/68e82c3db23ceb315b99720ed90eb291/image13.png\" alt=\"\" class=\"kg-image\" width=\"1221\" height=\"414\" loading=\"lazy\"/>\n            \n            </figure><p>Short attacks are often also used to probe the cyber defenses of the target. Load-testing tools and automated DDoS tools, widely available on the dark web, can generate short bursts of, say, a SYN flood, and then following up with another short attack using an alternate attack vector. This allows attackers to understand the security posture of their targets before they decide to potentially launch larger attacks at larger rates and longer durations.</p><h3>Attack vectors</h3><p>An attack vector is the attack method that the attacker utilizes. In 2021 Q1, SYN attacks continued to remain the most popular attack vector used by attackers, followed by RST, UDP, and DNS amplification attacks.</p><p>What is a <a href=\"https://www.cloudflare.com/learning/ddos/syn-flood-ddos-attack/\">SYN flood</a> attack? It’s a DDoS attack that exploits the very foundation of a TCP connection. A stateful TCP connection between a client and a server begins with a <a href=\"https://www.cloudflare.com/learning/ddos/glossary/tcp-ip/\">3-way TCP handshake</a>. The client sends an initial connection request packet with a synchronize flag (SYN). The server responds with a packet that contains a synchronized acknowledgment flag (SYN-ACK). Finally, the client responds with an acknowledgment (ACK) packet. At this point, a connection is established and data can be exchanged until the connection is closed. This stateful process can be abused by attackers to cause denial of service events.</p><p>By repeatedly sending SYN packets, the attacker attempts to overwhelm a server or the router’s connection table that tracks the state of TCP connections. The router replies with a SYN-ACK packet, allocates a certain amount of memory for each given connection, and falsely waits for the client to respond with the final ACK. Given a sufficient number of connections occupying the router’s memory, the router is unable to allocate more memory for legitimate clients, causing the router to crash or preventing it from handling legitimate client connections, i.e., a denial of service event.</p><p>Similarly, a RST amplification flood attack exhausts the target servers by depleting their system resources used to look up incoming packets for a current session.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3uURPZrVY130yaOVkCaHLI/6ed26f8930edb5205b543be925cd524e/image5-10.png\" alt=\"\" class=\"kg-image\" width=\"1229\" height=\"410\" loading=\"lazy\"/>\n            \n            </figure><h3>Emerging threats</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6AVVildNSyWCtEtNvrB3wB/38ee4c2d1a7e2f8d962130a42839bf4d/image10-1.png\" alt=\"\" class=\"kg-image\" width=\"1225\" height=\"408\" loading=\"lazy\"/>\n            \n            </figure><p>While SYN attacks remain popular, this quarter we’ve seen an enormous uptick of 940% in attacks targeting <a href=\"https://en.wikipedia.org/wiki/Jenkins_(software)\">Jenkins</a> servers. Jenkins is a free open-source automation server. It helps engineering teams facilitate software development. A vulnerability in an older version of the server (<a href=\"https://nvd.nist.gov/vuln/detail/CVE-2020-2100\">Jenkins 2.218 and earlier</a>) aided the launch of DDoS attacks. This vulnerability was fixed in Jenkins 2.219 by disabling UDP multicast/broadcast messages by default. However, there are still many vulnerable and exposed devices running UDP-based services which are being harnessed to generate volumetric amplification attacks.</p><p>Cloudflare also observed a 433% increase in L3/4 DDoS attacks over the <a href=\"/the-road-to-quic/\">QUIC protocol</a>, a new encrypted-by-default Internet transport protocol that runs over UDP. Version negotiations packets sent by a server to client allow the server to indicate the version of QUIC it supports to the client. Since UDP is stateless, it is easy for attackers to mimic Version Negotiation packets by spoofing the source IP address and overwhelm a client.</p><p>The attacks targeting Cloudflare may have meant to impact Cloudflare’s infrastructure — perhaps by downgrading the versions being used — rather than targeting specific customers. You can learn more about QUIC amplification attacks <a href=\"https://www.cloudflare.com/learning/ddos/what-is-a-quic-flood/\">here</a>.</p><p>The third emerging threat vector observed was <a href=\"https://en.wikipedia.org/wiki/TeamSpeak\">TeamSpeak</a>, a proprietary <a href=\"https://en.wikipedia.org/wiki/Voice_over_IP\">voice-over-Internet Protocol (VoIP)</a> that runs over UDP to help gamers talk with other gamers in real time. This emerging threat increased by 203% QoQ.Talking instead of just chatting can significantly improve a gaming team’s efficiency and help them win. DDoS attacks that target TeamSpeak servers may be launched by rival groups in an attempt to disrupt their communication path during real-time multiplayer games and thus impact their team’s performance.</p><h3>DDoS activity by Cloudflare data center country</h3><p>Looking at country-based distribution for network layer DDoS attacks, Rwanda, China, and Brunei observed the most number of L3/4 DDoS attacks. Unlike application layer DDoS attacks, attackers can (and typically do) spoof the source IP address to obfuscate the source location of the DDoS attack. For this reason, when analyzing L3/4 DDoS attacks, we bucket the traffic by the Cloudflare edge data center locations where the traffic was ingested, and not by the location of the source IP. Cloudflare is able to overcome the challenges of spoofed IPs by displaying the attack data by the location of Cloudflare’s data center in which the attack was observed. We’re able to achieve geographical accuracy in our report because we have <a href=\"https://www.cloudflare.com/network/\">data centers in over 200 cities around the world</a>.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4jzyvvFcp0SUb34CmLFP3o/678e0f6944eee3816f32354565fc37d7/image3-11.png\" alt=\"\" class=\"kg-image\" width=\"1222\" height=\"409\" loading=\"lazy\"/>\n            \n            </figure><p>To view all regions and countries, check out the <a href=\"https://radar.cloudflare.com/notebooks/ddos#ddos-activity-by-cloudflare-data-center-country\">Radar DDoS Report dashboard’s interactive map</a>.</p><h3>Helping build a better Internet</h3><p>Cloudflare was founded with the mission to help build a better Internet — one where the impact of DDoS attacks is a thing of the past. Over the last 10 years, we have been unwavering in our efforts to protect our customers’ Internet properties from DDoS attacks of any size or kind. <a href=\"https://www.cloudflare.com/case-studies/ccp-games/\">CCP Games</a> and <a href=\"https://www.cloudflare.com/case-studies/panasonic/\">Panasonic</a> are two of many customers that benefit from Cloudflare’s DDoS Protection.</p><p>Cloudflare was also recently named a leader in The Forrester WaveTM: DDoS Mitigation Solutions, Q1 2021. You can download a complimentary copy of the report <a href=\"https://www.cloudflare.com/forrester-wave-ddos-mitigation-2021/\">here</a>.</p><p>According to the report, written by Forrester Senior Analyst for Security and Risk, David Holmes, “Cloudflare protects against DDoS from the edge, and fast… customer references view Cloudflare’s edge network as a compelling way to protect and deliver applications.”</p><p>There are three key reasons Cloudflare DDoS Protection is recognized by customer and industry analysts alike:</p><ol><li><p><b>Cloudflare’s network architecture</b>: Cloudflare <a href=\"/no-scrubs-architecture-unmetered-mitigation/\">doesn&#39;t operate scrubbing centers</a>, as we believe that the scrubbing center model is a flawed approach to DDoS protection. Scrubbing centers cause delays and cost too much to build and run. Instead, we run DDoS protection from every server in every data center in our network. Our Anycast-based architecture makes our capacity equivalent to our DDoS scrubbing capacity, the largest in the market at 59 Tbps. This means Cloudflare detects and mitigates DDoS attacks close to the source of attack. Better yet, Cloudflare’s global threat intelligence acts like an immune system for the Internet — employing our machine learning models to learn from and mitigate attacks against any customer to protect them all.</p></li><li><p><b>Fast performance</b>: Our customers constantly tell us that they want robust security but not at the expense of performance. From its inception, Cloudflare was architected so that customers do not incur a latency penalty as a result of attacks. Our Anycast architecture allows us to mitigate attacks closest to the source and analyze traffic out-of-path, ensuring that our DDoS mitigation solution doesn’t add any latency to legitimate traffic. The rule is applied at the most optimal place in the Linux stack for a cost efficient mitigation, ensuring that there&#39;s no performance penalty. <a href=\"https://assets.ctfassets.net/slt3lc6tev37/6tiRCy6p07AlHfUIPkYfpI/cad96e1cef8a048fd2a007cffbb2b92e/Magic_Transit_protects_networks_while_also_improving_performance__1_.pdf\">Performance tests</a> over Cloudflare’s network show that the latency decreased by 3 ms and packet loss was nearly zero when traffic was routed over <a href=\"https://www.cloudflare.com/magic-transit/\">Cloudflare Magic Transit</a>.</p></li><li><p><b>Cloudflare’s support</b>: Every Cloudflare enterprise customer account is assigned a team (including an Account Executive, Solution Engineer, and Customer Success Manager) that actively supports customers through onboarding and beyond to help identify areas for optimization in customer configurations.</p></li></ol><p>Cloudflare’s 24x7x365 global “follow the sun” support team is always ready to pick up the phone and provide instant human response when our enterprise customers request urgent support.</p><p>To quote Grant Ingersoll, CTO of the Wikimedia Foundation, “Cloudflare has reliable infrastructure and an extremely competent and responsive team. They are well-positioned to deflect even the largest of attacks.”</p><p>To learn more about Cloudflare’s DDoS solution <a href=\"https://www.cloudflare.com/plans/enterprise/\">contact us</a> or <a href=\"http://dash.cloudflare.com\">get started</a>.</p>",
		"id": "6PbbUFBpriR3EcOUROnxbv",
		"localeList": {
			"name": "DDoS attack trends for 2021 Q1 Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Today, along with this deep-dive analysis blog, we’re excited to announce the new Radar DDoS Report page, our first fully automated data notebook built on top of Jupyter, Clickhouse, and Workers.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2021-04-19T12:00:00.000+01:00",
		"slug": "ddos-attack-trends-for-2021-q1",
		"tags": [
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "3yArjf0gLKZy8ObEDxbNNi",
				"name": "Trends",
				"slug": "trends"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "54Tkjs4keJGD0ddq0dfL5Y",
				"name": "DDoS Reports",
				"slug": "ddos-reports"
			}
		],
		"title": "DDoS attack trends for 2021 Q1",
		"updated_at": "2024-08-27T01:50:13.182Z",
		"url": "https://blog.cloudflare.com/ddos-attack-trends-for-2021-q1"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}