{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Drew Dowling",
				"slug": "drew",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6qUPE4X7uR1BTxmmR6Li6j/474d198186ce7eb8e3a10b466b90ad2c/drew.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Robert Cepa",
				"slug": "robert",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3iV5H2l0YzrdzkEex75OqI/531584a89e0a0a32cd708750c961a40a/robert.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "One of the interesting challenges with deep linking in the Cloudflare Dashboard is that most interesting resources are “locked” behind the context of an account and a zone/domain/website. To illustrate this, look at a tree of possible URL paths into Cloudflare’s Dashboard.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6neEMhq4G7VLzdtb8taQok/68ee08d5f7bef0e79fdc09af4d87cb45/deeplinks-and-scrollanchor.png",
		"featured": false,
		"html": "<h3>What are DeepLinks?</h3><p>To directly quote <a href=\"https://en.wikipedia.org/wiki/Deep_linking\">Wikipedia</a>:</p><p><b>“Deep linking</b> is the use of a hyperlink that links to a specific, generally searchable or indexed, piece of web content on a website (e.g. <code>http://example.com/path/page</code>), rather than the website&#39;s home page (e.g., <code>http://example.com</code>). The URL contains all the information needed to point to a particular item.”</p><h3>Why DeepLinks in Dashboard?</h3><p>There are many user experiences in Cloudflare’s Dashboard that are enhanced by the use of deep linking, such as:</p><ul><li><p>We’re able to direct users from marketing pages directly into the Dashboard so they can interact with new/changed features.</p></li><li><p>Troubleshooting docs can have clearer, more intently directions. e.g. “Enable SSL encryption here” vs “Log into the Dashboard, choose your account and zone, navigate to the security tab, change SSL encryption level, blah blah blah”.</p></li></ul><p>One of the interesting challenges with deep linking in the Dashboard is that most interesting resources are “locked” behind the context of an account and a zone/domain/website. To illustrate this, look at a tree of possible URL paths into Cloudflare’s Dashboard:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">dash.cloudflare.com/ -&gt; root-level resources: login, sign-up, forgot-password, two-factor\n\ndash.cloudflare.com/&lt;accountId&gt;/ -&gt; account-level resources: analytics, workers, domains, stream, billing, audit-log\n\ndash.cloudflare.com/&lt;accountId&gt;/&lt;zoneId&gt; -&gt; zone-level resources: dns, ssl-tls, firewall, speed, caching, page-rules, traffic, etc.</pre></code>\n            <p>You might notice that in order to deep link to anything more interesting than logging in, a deep linker will need to know a user’s account or zone beforehand. A troubleshooting doc might want to send a user to the Page Rules tab in Dashboard to help a user fix their zone, but <i>the linker doesn’t know what that zone is</i>.</p><p>Another highly desired feature was the ability for a deep link to scroll to a particular piece of content on a Dashboard page, making it even easier for users to navigate. Instead of a troubleshooting doc asking a user to fumble around to find a setting, we could helpfully scroll that setting right into view. Now that would be slick!</p><h3>What do DeepLinks look like in Dashboard?</h3><p>The solution we came up with involves 3 main parts:</p><ul><li><p>Deep links URLs expose an intuitive schema for dynamic value resolution.</p></li><li><p>A React component, DeepLink, consolidates routing/resolving deep links.</p></li><li><p>A React component, ScrollAnchor, encapsulates a simple algorithm which scrolls its content into view when the DOM has “finished loading”.</p></li></ul><p>Just to prove that it works, here’s a GIF of us deep linking to the “TLS 1.3” setting on the security settings page:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6ffkWLOQ4Jux6PfgoDaF6r/204d780d0cf867de01cb8a7a3e8184a2/image1-1.gif\" alt=\"\" class=\"kg-image\" width=\"1665\" height=\"968\" loading=\"lazy\"/>\n            \n            </figure><p>It works! I was asked to select one of my several accounts, then our DeepLink routing component was smart enough to know that I have only one zone within that account and auto-filled the rest of the URL path. After the page was fully loaded, we were automatically scrolled to the TLS 1.3 setting. If you’re curious how all of this works and want to jump into the nitty gritty details, read on!</p><h3>How are DeepLinks exposed?</h3><p>If you were paying attention to the URL bar in the GIF above, you already know what’s coming. In order to deal with dynamic account/zone resolution, a deep link can use a to query parameter to specify a path into Dashboard. I think it reads quite nicely:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">dash.cloudflare.com/?to=/:account/:zone/ssl-tls/edge-certificates</pre></code>\n            <p>This example is saying that we’d like to link to the “Edge Certificates” section of the “SSL-TLS” product for <i>some</i> account and <i>some</i> zone that a user needs to manually resolve, as you saw above. It’s easy to imagine removing “?to=/” to transform the link URL into the resolved one:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">dash.cloudflare.com/&lt;resolvedAccount&gt;/&lt;resolvedZone&gt;/ssl-tls/edge-certificates</pre></code>\n            <p>The URL-like schema of the to parameter makes it very natural to support different variations such as account-level resources</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">dash.cloudflare.com/?to=/:account/billing</pre></code>\n            <p>Or allowing the linker to supply known information</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">dash.cloudflare.com/?to=/1234567890abcdef/:zone/traffic</pre></code>\n            <p>This link takes the user to the “Traffic” product tab for <i>some</i> zone inside of account 1234567890abcdef. Indeed, the :account and :zone symbols are placeholders for user-supplied values, but they can be replaced with any permutation of real, known values to speed up resolution time to provide a better UX.</p><h3>DeepLink routing</h3><p>These links are parsed and resolved in our top-level routing component, DeepLink. At a high level, this component contains a series of “resolvers” for unknown symbols that need automatic or user-interactive resolution (i.e. :account and :zone). But before we dive in, let’s take a step back and gain appreciation for how cool this component is.</p><p>Cloudflare’s Dashboard is a single page React app, which means we use React Router to create routing components that handle what’s rendered on different URLs:</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">&lt;Switch&gt;\n  &lt;Route path=&quot;/login&quot;&gt;&lt;Login /&gt;&lt;/Route&gt;\n  &lt;Route path=&quot;/sign-up&quot;&gt;&lt;Signup /&gt;&lt;/Route&gt;\n  ...\n  &lt;AccountRoutes /&gt;\n&lt;/Switch&gt;</pre></code>\n            <p>When a page is loaded, a lot of things need to happen: API calls need to be made to fetch all the data needed to render a page, like account/user/zone info not cached in the browser. Many components need to be rendered. It turns out that we can improve the UX of many users by <i>blocking React Router</i> to make specific queries to our API instead of rendering an entire page that anecdotally fetches the information we need. For example, there’s no need to render a zone selection page if a user only has one zone, like in our GIF above ☝️.</p><h3>Resolvers</h3><p>When a deep link gets parsed and split into parts, the framework iterates over those parts and tries to build a URL string that is later used to redirect users to a specific location in the dashboard.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">// to=/:account/:zone/traffic\n// parts = [‘:account’, ‘:zone’, ‘traffic’]\nfor (const part of parts) {\n  // do something with each part\n}</pre></code>\n            <p>We can build up the dynamic URL by looking at prefixes. If a part starts with “:”, it’s considered a symbol that needs to be resolved. Everything else is a static string that just gets appended.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">const resolvedParts: string[] = [];\n// parts = [‘:account’, ‘:zone’, ‘traffic’]\nfor (let part of parts) {\n  if (part.startsWith(‘:’)) {\n    // resolve\n  }\n\n  resolvedParts.push(part);\n}\nconst finalUrl = resolvedParts.join(‘/’);</pre></code>\n            <p>Symbols are handled by functions we call “resolvers”. A resolver is a function that:</p><ol><li><p>Is async.</p></li><li><p>Has a context parameter.</p></li><li><p>Always returns a string - the value it resolves to.</p></li></ol><p>In JavaScript, async functions always return a promise. Return values that are not type of Promise are wrapped in a resolved promise implicitly. They also allow “await” to be used in them. The async/await syntax is used for resolvers so they can perform any kind of asynchronous work - such as calling the API, while being able to “pause” JavaScript with “await” until that asynchronous work is done.</p><p>Each dynamic symbol has its own resolver. We currently have two resolvers - for account and for zone.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">const RESOLVERS: Resolvers = {\n  account: accountResolver,\n  zone: zoneResolver\n};\nconst resolvedParts: string[] = [];\n// parts = [‘:account’, ‘:zone’, ‘traffic’]\nfor (let part of parts) {\n  if (part.startsWith(‘:’)) {\n    // for :account, accountResolver is awaited and returns “abc123”\n    // for :zone, zoneResolver is awaited and returns “testsite.io”\n    part = await RESOLVERS[part.slice(1)];\n  }\n  resolvedParts.push(part);\n}\nconst finalUrl = resolvedParts.join(‘/’);</pre></code>\n            <p>The internal implementation is a little bit more complicated, but this is a rough overview of how our DeepLink works.</p><h3>Resolver context</h3><p>We mentioned that each resolver has a context parameter. Context is an object that is passed to resolvers from the DeepLink component and it contains a bunch of handy utilities that give resolvers control over any part of the app. For example, it has access to the Redux store (we use Redux.js in the Dashboard to help us manage the application’s state). It has access to previously resolved values, and to all other parts of the deep link. It also has functions to help with user interactions.</p><h3>User interactions</h3><p>In many cases, a resolver is not able to resolve without the user&#39;s help. For example, if a user has multiple zones, the resolver working on :zone symbol needs to wait for the user to select a zone.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">const zoneResolver: Resolver = async ctx =&gt; {\n  const zones = await fetchZone();\n  // Just one zone, :zone symbols can be resolved to zone.name without user’s help\n  if (zones.length === 1) return zones[0].name;\n  if (zones.length &gt; 1) {\n    // need user’s help to pick a zone\n  }\n};</pre></code>\n            <p>We already have a page in the dashboard with a zone list that looks like this.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/57MLM5FGHiSN9LiWocJ7Se/663a9fd12d64fe9d8da9e1c690761f0f/image3-5.png\" alt=\"\" class=\"kg-image\" width=\"1300\" height=\"542\" loading=\"lazy\"/>\n            \n            </figure><p>What we need to do is give the resolver the ability to somehow show this page, and wait for the result of the user&#39;s interaction.You might be asking: “But how do we show this page? You just told me that DeepLink blocks the entire page!”That’s true!</p><p>We decided to block the React Router to prevent unnecessary API calls and DOM updates while a deep link is resolving. But there is no harm in showing some part of the UI, if needed. To be able to do that, we added two functions to context - unblockRouter and blockRouter. These functions just toggle the state that is gating our Router component.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">const zoneResolver: Resolver = async ctx =&gt; {\n  // ...\n  if (zones.length &gt; 1) {\n    // delegate to React Router to render the page with zone picker\n    ctx.unblockRouter();\n    // need users help to pick a zone\n    // block the router again\n    ctx.blockRouter();\n  }\n};</pre></code>\n            <p>Now, the last piece is to somehow observe user interactions from within the resolver. To be able to do that, we have written a powerful utility.</p><h3>waitForPageAction</h3><p>Resolvers are isolated functions that live outside of the application’s components. To be able to observe anything that happens in distant branches of React DOM, we created a function called <code>waitForPageAction</code>. This function takes two parameters:</p><p>1. <code>pageToAwaitActionOn</code> - URL string pointing to a page we want to await the user&#39;s action on. For example, “dash.cloudflare.com/123abc”</p><p>2. <code>actionType</code> - Unique string describing the action. For example, <code>ZONE_SELECTED</code>.</p><p>As you may have guessed, waitForPageAction is an async function. It returns a promise that resolves with action metadata whenever that action happens on the page specified by <code>pageToAwaitActionOn</code>. The promise rejects when the user navigates away from <code>pageToAwaitActionOn</code>. Otherwise, it keeps waiting… forever.</p><p>This helps us to write a code that is very easy to understand.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">const zoneResolver: Resolver = async ctx =&gt; {\n  // ...\n  if (zones.length &gt; 1) {\n    // delegate to React Router to render the page with zone picker\n    ctx.unblockRouter();\n    // need users help to pick a zone. Wait for ‘ZONE_SELECTED’ action at ‘dash.cloudflare.com/abc123’\n    // action is an object with metadata about zone. It contains zoneName, which can be used in this resolver to resolve :zone symbol\n    const action = ctx.waitForPageAction(\n      ‘dash.cloudflare.com/abc123’,\n      ‘ZONE_SELECTED’\n    );\n    // block the router again\n    ctx.blockRouter();\n    return action.zoneName\n  }\n};</pre></code>\n            <h3>How does waitForPageAction work?</h3><p>As mentioned above, we use Redux to manage our state. The <code>actionType</code> parameter is nothing else than a type of Redux action. Whenever a zone is selected, React dispatches a Redux action in an onClick handler.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">&lt;ZoneCard onClick={zoneName =&gt; { dispatch({type: ‘ZONE_SELECTED’, zoneName}) }} /&gt;</pre></code>\n            <p>Now, how does <code>waitForPageAction</code> know that <code>ZONE_SELECTED’</code> has been dispatched? Aren’t we supposed to write a reducer?!</p><p>Not really. <code>waitForPageAction</code> is not changing any state, it’s just an observer that resolves whenever some action, that is dispatched, satisfies a predicate. And Redux has an API to subscribe to any store changes - <code>store.subscribe(listener)</code>.</p><p>The listener will be called any time an action is dispatched, and some part of the state tree may have changed. Unfortunately, the listener does not have access to the currently dispatched action. We can only read the current state.</p><p>Solution? Store the action in the Redux store!</p><p>Redux actions are just plain objects (mostly), and thus easy to serialize. We added a simple reducer that stores all actions in the Redux state.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">export function deepLinkReducer(\n  state: State = DEFAULT_STATE,\n  action: AnyAction\n){\n  const nextState = { ... state, lastAction: action };\n  return nextState;\n}</pre></code>\n            <p>Anytime an action is dispatched, we can read that action’s metadata in <code>store.getState().lastAction</code>. Now, we have everything we need to finally implement <code>waitForPageAction</code>.</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">export function waitForPageAction = (store: Store&lt;DashState&gt;) =&gt;(\n  pageToAwaitActionOn: string,\n  actionType: string\n) =&gt;\n  new Promise&lt;AnyAction&gt;((resolve, reject) =&gt; {\n    // Subscribe to redux store\n    const unsubscribe = store.subscribe(() =&gt; {\n      const state = store.getState();\n      const currentPage = state.router.location.pathname;\n      const lastAction = state.lastAction;\n      if (currentPage !== pageToAwaitActionOn) {\n        // user navigated away -unsubscribe and reject\n        unsubscribe();\n        reject(‘User navigated away’);\n      } else if (lastAction.type === actionType) {\n        // Action types match! Unsubscribe and resolve with action object\n        unsubscribe();\n        resolve(lastAction);\n      }\n    });\n  });</pre></code>\n            <p>The listener reads the current state and grabs the <code>currentPage</code> and <code>lastAction</code> data. If <code>currentPage</code> doesn’t match <code>pageToAwaitActionOn</code>, it means the user navigated away, and there’s no need to continue resolving the deep link - we unsubscribe, and reject the promise. Deep link resolvers are stopped, and React Router unblocked.</p><p>Else, if <code>lastAction.type</code> matches the <code>actionType</code> parameter, it means the action we are waiting on just happened! Unsubscribe, and resolve the promise with action metadata. The deep link keeps resolving.</p><p>That’s it! We also added a similar function - <code>waitForAction</code> - which does exactly the same thing, but is not restricted to a specific page.</p><h3>ScrollAnchor component</h3><p>We implemented a wrapper component ScrollAnchor that will scroll to its wrapped content, making our deep links even more targeted. A client would wrap some content like this:</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">&lt;ScrollAnchor id=”super-important-setting-card”&gt;\n  &lt;SuperImportantSettingCard /&gt;\n&lt;/ScrollAnchor&gt;</pre></code>\n            <p>And then reference it via a typical URL anchor:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">dash.cloudflare.com/path/to/content#super-important-setting-card</pre></code>\n            <p>Now I can hear you saying, “what’s the point? Can’t we get the same behavior with any old ID?”</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">&lt;div id=”super-important-setting-card”&gt;\n  &lt;SuperImportantSettingCard /&gt;\n&lt;/div&gt;</pre></code>\n            <p>We thought so too! But it turns out that there are a few problems that prevent this super simple approach:</p><ul><li><p>The Dashboard’s fixed header</p></li><li><p>DOM updates after page load</p></li></ul><p>Since the Dashboard contains a fixed header at the top of the page, we can’t simply anchor to any ID, since the content will be scrolled to the top of the browser window <i>behind</i> the header. Fortunately, there’s a simple CSS solution using negative margins:</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">&lt;div id=”super-important-setting-card” padding-top={headerOffset} margin-top={headerOffset}&gt;\n  &lt;SuperImportantSettingCard /&gt;\n&lt;/div&gt;</pre></code>\n            \n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5fsQmMLnn9G44KEnxEuhtd/6c0506139893fff355230aacb511e99d/image2-5.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"735\" loading=\"lazy\"/>\n            \n            </figure><p>This CSS trick alone would work for a static site with a fixed header, but the Dashboard is very dynamic. We found early on in testing that using a normal HTML ID anchor in a URL would cause the browser to jump to the tag <i>on page load</i> but the DOM would change in response to newly fetched information or re-rendering, and the anchored content would be pushed out of view.</p><p>A solution: scroll to the anchored content after the page content is fully loaded, i.e. after all API calls are resolved, spinners removed, content is rendered. Fortunately, there’s a good way to programmatically scroll a browser window: <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Element/scrollIntoView\">Element.scrollIntoView()</a>. However, there isn’t a good way to tell <i>when</i> the DOM is finished changing, since it can be modified at any time after page load. Let’s consider two possible strategies for determining when to scroll anchored content into view.</p><p>Strategy #1: scroll after a fixed duration. If our goal is to make sure we only scroll to content after a page is “fully loaded”, we can simplify the problem by making some assumptions. Namely, we can assume a maximum amount of time it will take a given page to fetch resources from the backend and re-render the DOM. Let’s call this assumed max duration <code>M</code> milliseconds. We can then easily scroll to some content by running a timeout on page load:</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">setTimeout(() =&gt; scrollTo(htmlId), M)</pre></code>\n            <p>The problem with this approach is that the DOM might finish updating before or after we scroll. We end up with vertical alignment problems (as the DOM is still settling) or a jarring, unexpected scroll (if we scroll long after the DOM is settled). Both options are bad UX, and in practice it’s difficult to choose a duration constant M that is “just right” for every single page.</p><p>Strategy #2: scroll after the DOM has “settled”. If we know that choosing a good duration <code>M</code> for every page isn’t practical, we should try to come up with an algorithm that can choose a better <code>M</code>:</p><ol><li><p>Define an arbitrary threshold of DOM “busyness”, <code>B</code> milliseconds.</p></li><li><p>On page load, start a timer that will scroll to anchored content after <code>B</code> milliseconds.</p></li><li><p>If we observe any changes to the DOM, reset the timer.</p></li><li><p>Once the timer expires, we know that the DOM hasn’t changed in <code>B</code> milliseconds.</p></li></ol><p>By varying our choice of <code>B</code>, we’re able to have some control over how long we’re willing to wait for a page to “finish loading”. If B is 0 milliseconds, we’ll scroll to the anchored content immediately. If it’s 1000 milliseconds, we’ll wait a full second after any DOM change before scrolling. This algorithm is more resilient than fixed threshold scrolling since it explicitly listens to the DOM, but the chosen threshold is somewhat arbitrary. After some trial and error loading a sample of Dashboard pages, we determined that a 500 millisecond busyness threshold was sufficient to allow all content to load onto a page. Here’s what the implementation looks like:</p>\n            <pre class=\"language-typescript\"><code class=\"language-typescript\">const SETTLE_THRESHOLD = 500;\nconst scrollThunk = (observer: MutationObserver) =&gt; {\n  scrollToAnchor(id);\n  observer.disconnect();\n};\n\nlet domTimer: number;\n\nconst observer = new MutationObserver((_mutationsList, observer) =&gt; {\n  domTimer = resetTimeout(domTimer, scrollTunk, SETTLE_THRESHOLD, observer);\n});\n\nobserver.observe(document.body, {childList: true, subtree: true});\n\ndomTimer = window.setTimeout(scrollThunk, SETTLE_THRESHOLD, observer);</pre></code>\n            <p>A key assumption is that API calls take roughly the same amount of time to resolve. If most fetches take 250ms to resolve but others take 1500ms, we might see that the DOM hasn’t been changed for a while and think that it’s settled. Who knew there would be so much work involved in scrolling!</p><h3>Conclusion</h3><p>There you have it. A fully-featured deep linking solution with an intuitive schema, React Router blocking, autofilling, and scrolling. Thanks for reading.</p>",
		"id": "3JQbpMpNgxg57bTRqRyZTi",
		"localeList": {
			"name": "DeepLinks and ScrollAnchor Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "One of the interesting challenges with deep linking in the Cloudflare Dashboard is that most interesting resources are “locked” behind the context of an account and a zone/domain/website. To illustrate this, look at a tree of possible URL paths into Cloudflare’s Dashboard.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2020-05-18T12:02:30.000+01:00",
		"reading_time": 11,
		"slug": "deeplinks-and-scrollanchor",
		"tags": [
			{
				"id": "uegedi11MDlivX9pYn2ri",
				"name": "Dashboard",
				"slug": "dashboard-tag"
			}
		],
		"title": "DeepLinks and ScrollAnchor",
		"updated_at": "2024-08-27T02:02:21.176Z",
		"url": "https://blog.cloudflare.com/deeplinks-and-scrollanchor"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}