{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Celso Martinho",
				"slug": "celso",
				"bio": "From when Mosaic took over Gopher. Engineering Director at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2pzgat1zmt1oF1byi7hskH/7e3b95ac25469b2640929caf376fa4c8/celso.png",
				"location": "Portugal, Lisbon",
				"website": "https://celso.io/",
				"twitter": "@celso",
				"facebook": null
			}
		],
		"excerpt": "So, if a developer wants to run their next hit, say a real-time multiplayer game, using nothing but their app and Workers, without any servers or traditional infrastructure, can they? Let’s prove they can. Here's Doom Multiplayer running on top of Cloudflare Workers.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6znCORNJZm0t1OlhjEuVKN/aefc6fb2f0d696ac305005eac4d84ab2/doom-multiplayer-workers.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/16RPVD3fcKFokPCTcXiIH5/94bfb663b5c0b2e58589373077495439/image4-7.png\" alt=\"\" class=\"kg-image\" width=\"1531\" height=\"796\" loading=\"lazy\"/>\n            \n            </figure><p>There are halls and corridors in Cloudflare engineering, dangerous places for innocent wanderers, filled with wild project ideas, experiments that we should do, and extremely convincing proponents. A couple of months ago, John Graham-Cumming, our CTO, bumped into me in one of those places and asked: &quot;What if we ported Doom multiplayer to work with our edge network?&quot;. He fatally <a href=\"https://xkcd.com/356/\">nerd-sniped</a> me.</p><p><i>Aside by John: I nerd-sniped him because I wanted to show how Cloudflare Workers and Durable Objects are a new architectural paradigm where, rather than choosing between two places to write code (the client, the browser or app, and the server, perhaps in a cloud provider availability zone), there’s a third way: put code on the edge.</i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1flL8m65cCzhna5RnwQN1N/0e1d3a49ea469ab04fa1767eecc48c24/image9.png\" alt=\"\" class=\"kg-image\" width=\"1112\" height=\"828\" loading=\"lazy\"/>\n            \n            </figure><p><i>Writing code that runs on a client (such as JavaScript that runs in a browser or a native app on a phone) has advantages. Because the code runs close to the end-user it can be highly interactive, there’s almost no latency since it’s literally running on the device. But client-side code has security problems: it’s literally in the hands of the end-user and thus can be reverse engineered or modified. And client-side code can be slow to update as it depends on the end-user. If the client is actually an IoT device then updates can be even slower or essentially never.</i></p><p><i>On the other hand, code running on a server is quick to update and secure. You can keep secrets in that code, and modify it at will. But it tends to be far from the end-user which limits interactivity because of latency.</i></p><p><i>The edge offers advantages from both worlds: the code is secured and can contain secrets since it runs in a controlled environment and not on the end-user device, the code can be updated quickly since it doesn’t depend on the end-user and the edge is close to end-users meaning low latency and opportunity for high interactivity.</i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1R6ugEyfhCTweXRvKsl1UO/97f7f77bb53de281cfa7421669e1752b/image5-4.png\" alt=\"\" class=\"kg-image\" width=\"1480\" height=\"504\" loading=\"lazy\"/>\n            \n            </figure><p><i>Games are fun, interactive and tend to stress systems. Doom Multiplayer was the perfect example because it demonstrates the power of WebAssembly to run code in the browser and the power of Durable Objects to provide the backend for multiplayer games with low latency.</i></p><p><i>So while you’re enjoying multiplayer Doom running in the browser and coordinated by Durable Objects and Cloudflare Workers, try to keep in mind this new architecture for applications. And we’ve open sourced the code for all of it:</i> <a href=\"https://github.com/cloudflare/doom-wasm\"><i>Doom running in Wasm</i></a><i>, the associated</i> <a href=\"https://github.com/cloudflare/doom-workers\"><i>website</i></a> <i>and the message</i> <a href=\"https://github.com/cloudflare/doom-workers\"><i>routing</i></a> <i>code that runs on the edge using Cloudflare Workers and Durable Objects.</i></p><p><i>Back to Celso...</i></p><p>Doom <a href=\"https://www.youtube.com/watch?v=6A4-SVUHQYI\">is considered</a> the first popularized FPS (first-person shooter) game of all time. When id Software launched it in 1993, it boasted 3D graphics, spatial navigation, networked multiplayer, and an open format (WAD) to define levels, sprites, and all sorts of game modifications, also known as Doom <a href=\"https://en.wikipedia.org/wiki/Doom_modding\">modding</a>. It became an instant revolution and sparked both a new game industry and a global community of gamers and Doom fans that lasts up until today.</p><p>If you want to read more about this period and how the &quot;<a href=\"https://en.wikipedia.org/wiki/Masters_of_Doom\">Two Johns</a>&quot; changed everything in gaming back in the 90s, I highly recommend you get a copy of the book <a href=\"https://www.goodreads.com/book/show/222146.Masters_of_Doom\">Masters of Doom</a>.</p><p>But Doom has gone beyond the gaming community. In 1997, <a href=\"https://twitter.com/ID_AA_Carmack\">John Carmack</a>, still at id Software, <a href=\"https://github.com/id-Software/DOOM\">open-sourced the original code</a> and presented it as &quot;a useful base to experiment and build on.&quot; Little did he know. Since then, his masterpiece was ported to run on pretty much anything that has a CPU on it, including a <a href=\"https://twitter.com/Foone/status/1302820468819288066\">pregnancy test</a> and a <a href=\"https://www.youtube.com/watch?v=ztVI7r7C-1w\">spectrum analyser</a>. Running Doom is effectively the new “Hello, World” in computing.</p><p>A few weeks ago, we introduced a major feature in our Workers edge computing platform: <a href=\"/introducing-websockets-in-workers/\">WebSockets support</a>. Not only that, but we improved <a href=\"https://developers.cloudflare.com/workers/learning/using-durable-objects\">Durable Objects</a> to seamlessly interface with WebSocket connections and provide state and storage capabilities. This opened a large door to start implementing real-time, interactive applications that can communicate over persistent data connections, all on top of <a href=\"https://developers.cloudflare.com/workers/\">Workers</a>.</p><p>So, if a developer wants to run their next hit, say a real-time multiplayer game, using nothing but their app and Workers, without any servers or traditional infrastructure, can they? Let’s prove they can.</p><p>Here&#39;s Doom Multiplayer running on top of Cloudflare Workers showcasing this scenario…</p><p><a href=\"https://silentspacemarine.com/\">https://silentspacemarine.com/</a></p><p>...and read it to find out how we did it.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5Ocpe3WmkxWK6eBo7I4yov/ecd5343aede14fce514ffbfae08b50b0/image8-1.png\" alt=\"\" class=\"kg-image\" width=\"1502\" height=\"591\" loading=\"lazy\"/>\n            \n            </figure><h2>Keeping it simple</h2><p>We wanted this demo to be as simple as possible, to run in the browser, end to end, with no downloads or native binaries required. This meant one first task: porting Doom to compile to <a href=\"https://webassembly.org/\">WebAssembly</a>, an open standard that defines a portable binary-code format for executable programs and enables high-performance applications in multiple environments, including web pages on modern browsers.</p><p>We looked around for other Wasm Doom ports <b>that included the network layer</b> but didn&#39;t find any. It was time to get our hands dirty and do it ourselves. How hard could it be?</p><p>Enter the world of <a href=\"https://emscripten.org/\">Emscripten</a>, “a complete compiler toolchain to WebAssembly, using LLVM” that provides Web support for popular portable APIs such as SDL, effectively allowing ports of complex applications such as Doom.</p><p>We also found <a href=\"https://github.com/chocolate-doom/chocolate-doom\">Chocolate Doom</a>, a modern, community-driven, well-maintained port that aims to reproduce the original DOS version of Doom and has a few bonuses, like networked multiplayer support, and a decent, readable, and modular codebase. Perfect match.</p><p>Long story short, we got Emscripten to compile Chocolate Doom a few days later. It felt like magic when we saw Doom running in a browser window for the first time. The magic is WebAssembly.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2OV1anLelzHYNVKTgAwfc3/3724412e9cd29357a81e93a5e8e59cb8/image3-5.png\" alt=\"\" class=\"kg-image\" width=\"1791\" height=\"1628\" loading=\"lazy\"/>\n            \n            </figure><p>It cost us a few head bangs on the wall, but we learned a lot in the process. Here&#39;s a few things I think you’ll find interesting:</p><h3>No main() loop</h3><p>Unlike many C/C++ graphical apps, like games, you can&#39;t have an infinite loop running on a page. The browser environment is <a href=\"https://developer.mozilla.org/en-US/docs/Learn/JavaScript/Building_blocks/Events\">event-driven</a>. When an event is processed, it then needs to return control to the browser so that the next event gets its turn.</p><p>Emscripten provides a function to solve this problem. With <a href=\"https://emscripten.org/docs/api_reference/emscripten.h.html#c.emscripten_set_main_loop\"><code>emscripten_set_main_loop()</code></a>, you can have your infinite loop running at, say, 60 frames per second, but the other browser functions can still run between iterations without hanging the page.</p><p>In <a href=\"https://github.com/chocolate-doom/chocolate-doom/blob/master/src/doom/d_main.c#L499\"><code>d_main.c</code></a></p>\n            <pre class=\"language-js\"><code class=\"language-js\">while (1)\n{\n\tD_RunFrame();\n}</pre></code>\n            <p>Became:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">emscripten_set_main_loop(D_RunFrame, 0, 0);</pre></code>\n            <h3>No UDP</h3><p>The original MS-DOS Doom used the <a href=\"https://en.wikipedia.org/wiki/IPX/SPX\">IPX</a> networking protocol from Novell NetWare. Later versions and current ports migrated to UDP (though some still maintain compatibility with IPX, because why not?). There&#39;s a good reason why action games use UDP (instead of TCP) for their multiplayer protocols. UDP is simple, fast, and non-blocking. However, you need to deal with packet loss or out-of-order packets at the application level. You&#39;re basically trading responsiveness, low latency, and speed for guarantees and reliability.</p><p>Emscripten has some <a href=\"https://emscripten.org/docs/porting/networking.html\">wrappers</a> to emulate POSIX TCP sockets over WebSockets, but not UDP. Also, we don&#39;t want UDP; we want to use WebSockets, which in turn use TCP.</p><p>It became evident that we&#39;d have to write a new Chocolate Doom network module to use TCP and WebSockets instead of UDP while working to mitigate the problems mentioned above.</p><h3>Enter the net_websockets.c driver</h3><p>We had to deal with a few challenges to make the WebSockets module work the way we wanted. The first was the network topology:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3KhI6dUsDJDbyuDs07Pe4R/b251b2bfe66c1d3cebc432beef215442/image7-1.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"816\" loading=\"lazy\"/>\n            \n            </figure><p>On the left, let’s imagine there are four players in the original LAN topology: the server (the one who starts the game) and the other three players who connect to the server via UDP. If you wanted to play Doom over the Internet, you&#39;d have to make sure all players had public IP addresses and specific firewall and forwarding rules configured. Chocolate Doom even has some <a href=\"https://en.wikipedia.org/wiki/Hole_punching_(networking)\">hole punching</a> code in it. We don&#39;t want to deal with any of this.</p><p>On the right, in our case, we want everything to be Web-based and zero-config, so all of the four players connect to a single WebSockets server that acts as a message router between the group.</p><p>We won’t have IP addresses anymore, just a WebSocket connection to which we need to tunnel our UDP-based point-to-point protocol through. To emulate the standard behaviour we create a <a href=\"https://github.com/cloudflare/doom-wasm/blob/main/src/d_loop.c#L438\">fake IP at startup</a>, just a random uint32_t number, and we add ourselves and the other clients we discover in the WebSocket protocol and have to talk to, to an internal <a href=\"https://github.com/cloudflare/doom-wasm/blob/main/src/net_websockets.c#L41\">routing</a> table.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// Generate UID for this instance - it will be used as the websocketsID\nsrand((unsigned int)time(NULL));\ninstanceUID = rand() % 0xfffe;\n\n// addresses table\nstatic int addrs_index = 0;\nnet_addr_t addrs[MAX_QUEUE_SIZE];\nuint32_t ips[MAX_QUEUE_SIZE];\n\n// add a new fake ip to the routing table\naddrs[addrs_index].refcount = 1;\naddrs[addrs_index].module = &net_websockets_module;\nips[addrs_index] = ip;\naddrs[addrs_index].handle = &ips[addrs_index];\nreturn (&addrs[addrs_index++]);</pre></code>\n            <p>Next, we wanted to avoid blocking Doom at all costs, so we created an intermediate queue between the asynchronous WebSockets layer and the internal Doom routines to act as a buffer and alleviate the fact that, indeed, we&#39;ll be using TCP. This worked nicely.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// WebSockets packet queue\ntypedef struct {\n    net_packet_t *packets[MAX_QUEUE_SIZE];\n    uint32_t froms[MAX_QUEUE_SIZE];\n    int head, tail;\n} packet_queue_t;\n\n// Pushes one packet into the queue\nstatic void WebsocketsQueuePush(packet_queue_t *queue, net_packet_t *packet, uint32_t from)\n\n// Pops one packet from the queue\nstatic ws_packet_t *WebsocketsQueuePop(packet_queue_t *queue)</pre></code>\n            <p>This queue is then fed every time we receive a new WebSockets packet, asynchronously, outside the game main loop and logic.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">WebSocketMessage(int t, const WebSocketMessageEvent *e, void *data) {\n    ...\n    packet = NET_NewPacket(e->numBytes - 4);\n    memcpy(packet->data, &e->data[4], e->numBytes - 4);\n    ...\n    WebsocketsQueuePush(&client_queue, packet, ip);\n}\n\nemscripten_websocket_set_onmessage_callback(websocket, (void *)45, WebSocketMessage);</pre></code>\n            <p>And then, when the main game loop asks for newly received packets as part of its “main loop”, we’re now able to instantly return everything we see in our queue, close to how UDP would behave.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">NET_Websockets_RecvPacket(net_addr_t **addr, net_packet_t **packet)\n{\n    ws_packet_t *popped;\n\n    if (InitWebSockets() == false) return false;\n\n    popped = WebsocketsQueuePop(&client_queue);\n\n    if (popped != NULL) {\n        *packet = popped->packet;\n        *addr = FindAddressByIp((*(uint32_t *)(popped->from)));\n        return true;\n    }\n\n    return false;\n}</pre></code>\n            <p>Finally we use <a href=\"https://github.com/cloudflare/doom-wasm/blob/main/src/net_websockets.c#L200\">NET_Websockets_SendPacket()</a> and <a href=\"http://emscripten_websocket_send_binary\">emscripten_websocket_send_binary</a>() to send the traffic out. The messages are sent through the WebSocket using a simple envelope that contains the “From” and the “To” fake IPs, 4 bytes each (UInt32 little-endian), and the original packet from the Doom protocol.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">NET_Websockets_SendPacket(net_addr_t *addr, net_packet_t *packet)\n{\n    char *wspacket = malloc(packet->len + 8);\n    to_ip = (*(uint32_t *)(addr->handle));\n    memcpy(&wspacket[0], &to_ip, 4);       // to\n    memcpy(&wspacket[4], &instanceUID, 4); // from\n    memcpy(&wspacket[8], packet->data, packet->len);\n    emscripten_websocket_send_binary(websocket, wspacket, packet->len + 8);\n    free(wspacket);\n}</pre></code>\n            <p>The message router in Cloudflare Workers, explained below, then keeps its own table of connections and uses the address headers to, well, route the incoming messages to the correspondent client.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6OwE9gWdMhH3joECmbiI6i/b38c2caa44f5a8984176e336ffc18dfb/image1-6.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"506\" loading=\"lazy\"/>\n            \n            </figure><p>We also added a few options to the original Chocolate Doom code base, like choosing your name from the command line, and support for multiple keys for the same action.</p><p>The open-sourced code and instructions to compile and run Wasm Doom locally can be found in <a href=\"http://github.com/cloudflare/doom-wasm\">this repo</a>.</p><h2>The Message Router</h2><p>The message router runs on Cloudflare edge and handles the incoming and outgoing messages between the clients and the server. It has the following requirements:</p><ul><li><p>Accept WebSocket connections</p></li><li><p>Build a routing table that maps a connection to a “From” address</p></li><li><p>Receive and parse the incoming messages</p></li><li><p>Broadcast the messages to the corresponding clients</p></li><li><p>Handle some REST APIs to create and validate Doom rooms (game sessions)</p></li></ul><p>We&#39;re using Cloudflare Workers’ <a href=\"https://developers.cloudflare.com/workers/learning/using-websockets\">WebSockets</a> support to handle the client connections and <a href=\"https://developers.cloudflare.com/workers/learning/using-durable-objects\">Durable Objects</a> to provide state across them for the message router.</p><p>WebSockets are persistent connections between the client and, in this case, Cloudflare edge. Inside the connection, both ends can exchange data fast, whenever they want, without additional overhead, which make them ideal for real-time interactive applications like chats, sports results, stock information, or gaming.</p><p>A Durable Object is simply a class in our Worker code that contains data and methods to access and manipulate that data and other logic. You interact with your Durable Object through the well-known <a href=\"https://developers.cloudflare.com/workers/runtime-apis/fetch\">Fetch API</a>, just like any regular Worker.</p><p>Let&#39;s go through some code:</p><p>This is the default Worker class, all it does to handover things to handleApiRequest()</p>\n            <pre class=\"language-js\"><code class=\"language-js\">export default {\n    ...\n    return handleApiRequest(url.pathname, request, env)\n    ...\n}</pre></code>\n            <p>Each multiplayer game session creates a unique Id, or &quot;room&quot;, which corresponds to its own Durable Object instance. This Id is used in the URL when the user invites friends to his new game.</p><p><a href=\"https://github.com/cloudflare/doom-workers/blob/3fc79f1822e4455414fdd6b6a669774c087ae93c/router/index.mjs#L57\"><code>handleApiRequest()</code></a>validates the room Id in the URL and forwards the API request or WebSocket connection to the corresponding Durable Object object.</p><p>There&#39;s a small performance trick in here. There are two ways you can ask Workers to generate a unique Durable Object Id. One is by using <a href=\"https://developers.cloudflare.com/workers/runtime-apis/durable-objects#generating-ids-randomly\"><code>newUniqueId()</code></a>, which is very fast; another one is to use <code>idFromName()</code>, which derives the Id from your arbitrary input string. The latter can be convenient for some use-cases, but it requires our platform to do a global network lookup, which can be expensive time-wise. We&#39;re using <code>newUniqueId()</code>, and we construct our room Id with it (Thanks, Kenton Varda).</p>\n            <pre class=\"language-js\"><code class=\"language-js\">async function handleApiRequest(path, request, env) {\n  ...\n  switch (parts[1]) {\n    case 'ws':\n    case 'room':\n      room = await checkRoom(parts[2], env)\n      if (room) {\n        let id = env.router.idFromString(room)\n        let routerObject = env.router.get(id)\n        return routerObject.fetch(path, request)\n      }\n    case 'newroom':\n      room = await createRoom(env)\n      return jsonReply({ room: room }, 200)\n  }\n}</pre></code>\n            <p>Here’s how we create a new room Id:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">async function createRoom(env) {\n  const room = env.router.newUniqueId().toString()\n  const digest = await crypto.subtle.digest({ name: 'SHA-256' },\n    new TextEncoder().encode(room + env.DOOM_KEY),\n  )\n  const hash = Array.from(new Uint8Array(digest))\n  const hex = hash.slice(0, 4).map(b => b.toString(16)\n    .padStart(2, '0'))\n    .join('')\n  return `${room}-${hex}`\n}</pre></code>\n            <p>Finally, our Router takes over and handles the WebSockets messages. <code>webSocket.addEventListener(&#39;message&#39;)</code>runs on every received message and does a few things.</p><p>First it decodes the packet:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">let data = msg.data\nlet from = new Uint32Array(data.slice(4, 8))[0]\nlet to = new Uint32Array(data.slice(0, 4))[0]</pre></code>\n            <p>Then, it adds every new client to a routing table, a list of WebSocket objects (open connections), and corresponding &quot;From&quot; Ids (see our Doom protocol packet scheme above).</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// if it's a new client, add it to the table of clients\nif (this.sessions.map(c => c.from).indexOf(from) == -1) {\n    let session = { ws: webSocket, from: from }\n    this.sessions.push(session)\n}</pre></code>\n            <p>And finally, it sends the message to its destination, the &quot;To&quot; client.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// send this packet to the corresponding client\ni = this.sessions.map(c => c.from).indexOf(to)\nif (i != -1) this.sessions[i].ws.send(data.slice(4))</pre></code>\n            <p>You can check the full source code and setup instructions for the message router in our GitHub repo <a href=\"https://github.com/cloudflare/doom-wasm\">here</a>. We also provide a simplified NodeJS implementation to facilitate local development.</p><h2>The Website</h2><p>The cherry on top of our little pet project is the website, the thing that glues everything together. We will, of course, be using <a href=\"https://pages.cloudflare.com/\">Cloudflare Pages</a> for this.</p><p>The website needs to do a couple of things:</p><ul><li><p>Run Wasm Doom on the page and adjust its input arguments according to the user context (multiplayer, initiator or friend, deathmatch or cooperative, solo play, etc.)</p></li><li><p>Have great UX and the most straightforward possible game setup and game join sequences.</p></li><li><p>Interact with Doom and provide feedback to the user.</p></li><li><p>Have that retro feeling 90s dark look.</p></li></ul><h3>Running Wasm Doom</h3><p>Emscripten Wasm binaries use <a href=\"https://emscripten.org/docs/api_reference/module.html\">Module</a>, a global JavaScript object, as their environment configuration. When the app starts, it looks at the Module&#39;s definitions and applies them during the different execution stages.</p><p>Module allows you to define things like the input arguments (like the ones you&#39;d pass to a command-line app), code to run before the Wasm starts, the function to handle stdout, and many other parameters.</p><p>For instance, we use <a href=\"https://emscripten.org/docs/api_reference/module.html#Module.preRun\">PreRun</a> to make sure we load two files, <code>doom1.wad</code> and <code>default.cfg</code> into Emscripten’s <a href=\"https://emscripten.org/docs/api_reference/Filesystem-API.html\">virtual file-system</a> before Doom starts. Without them, the app wouldn’t start.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">preRun: () => {\n    Module.FS.createPreloadedFile(\"\", \"doom1.wad\", \"doom1.wad\");\n    Module.FS.createPreloadedFile(\"\", \"default.cfg\", \"default.cfg\");\n}</pre></code>\n            <p>You can see our website’s <a href=\"https://github.com/cloudflare/doom-workers/blob/main/assets/carmack.js\">JavaScript code</a> and how we configure Module and interact with Wasm Doom and our Message Router APIs here.</p><p>One other neat trick is to show important messages coming from the game while it&#39;s running, using a bottom scrolling ticker just below the game canvas. There are other, more sophisticated ways to interface between the web page and the Wasm process, but in this case we’re simply parsing <i>stdout</i> messages using a custom purpose handcrafted text protocol.</p><p>This is what the user sees:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7yTo8A9oUj2WdisykWhw5C/22715a0b4f256b8676b38a0c92fa387b/image2-4.png\" alt=\"\" class=\"kg-image\" width=\"1812\" height=\"308\" loading=\"lazy\"/>\n            \n            </figure><p>This is our <i>stdout</i> based <a href=\"https://github.com/cloudflare/doom-wasm#stdout-procotol\">protocol</a>:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">doom: 1, failed to connect to websockets server\ndoom: 2, connected to %s\ndoom: 3, we're out of client addresses</pre></code>\n            <p>And this is all we have to do in Doom’s C source code:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">net_websockets.c: printf(\"doom: 2, connected to %s\\n\", attr.url);</pre></code>\n            <h2>Game setup</h2><p>The game setup is as easy as it can be. You go to <a href=\"https://silentspacemarine.com\">silentspacemarine.com</a>, start a multiplayer game, get a unique game permalink, share it with your friends online, wait for them to join, and start playing. The person who starts the game becomes &quot;the server&quot; in the network, but we handle that for you; there&#39;s no need to worry about technical details.</p><p>If you receive one of these permalink invites, all you need to do is click on it, choose your name, wait for your host to start the game, and that&#39;s it.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1CvLSy0XDL9vz5NATbJEHz/185c0e8b8e6ac7cb91321b599d8cbf3e/image6.gif\" alt=\"\" class=\"kg-image\" width=\"480\" height=\"431\" loading=\"lazy\"/>\n            \n            </figure><p>The source and Worker Pages wrangler configuration for the <a href=\"https://silentspacemarine.com\">silentspacemarine.com</a> website can be found in this <a href=\"https://github.com/cloudflare/doom-workers\">repo</a>.</p><h2>Conclusion</h2><p>You can play our demo at <a href=\"https://silentspacemarine.com/\">https://silentspacemarine.com/</a>.</p><p>Our Wasm Doom with WebSockets implementation runs in the browser, supports mouse, sound and fullscreen (press F during the game), works on the desktop and mobile phones (using virtual gamepads) and supports real-time networked multiplayer (up to four players) on top of the Cloudflare edge.</p><p>There is certainly room for improvement in this project. For instance, we don&#39;t handle reconnects or disconnects very well if players drop off abruptly (ex: close their web browser window). We&#39;re also not using <a href=\"https://developers.cloudflare.com/workers/runtime-apis/durable-objects#transactional-storage-api\">storage</a> in our Durable Object to persist a session over an unlikely but possible <a href=\"https://developers.cloudflare.com/workers/learning/how-workers-works\">isolate</a> termination.</p><p>Doom&#39;s original protocol (1994) is not well suited for modern Internet multiplayer fast-paced games either. Every client receives a full copy of all the input (keyboard, mouse) from all the other clients. The game only advances when everyone receives the commands from all the other players in the group. The result is that the game&#39;s playability depends on the player with the slowest connection.</p><p>Modern FPS gaming protocols solve these and other challenges by predicting future movements (games are mostly deterministic), using compression, sending only the deltas, and other techniques. You can read more about this in “<a href=\"https://mrelusive.com/publications/papers/The-DOOM-III-Network-Architecture.pdf\">The DOOM III Network Architecture</a>”.</p><p>However, as John put it, we wanted to showcase a paradigm shift and the opportunity to build real-time networked applications, now made possible because new and powerful technologies and features are available on our edge computing platform.</p><p>Having said this, the source code for <a href=\"https://github.com/cloudflare/doom-wasm\">Wasm Doom</a>, <a href=\"https://github.com/cloudflare/doom-workers\">Message Router</a>, and website is all open-sourced and available in our GitHub, and you can start playing with it. Comments, issues, or even PRs are welcome. We tried to package everything together so that you can run things locally or deploy your version in Cloudflare.</p><p>Edge Doom (or Durable Objects Offer Multiplayer, as we like to call it) was a fun project to put together. We hope you found this tech write-up interesting and inspiring to do other things with our edge computing components, and we can&#39;t wait to see what you come up with.</p><h3>Watch on Cloudflare TV</h3><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/fdd394c53bf9df1d244eefead56c2031?preload=true\" style=\"border: none; position: absolute; top: 0; height: 100%; width: 100%;\"  allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html-->",
		"id": "1SsE7TQu2QtSvOYD6CzuAE",
		"localeList": {
			"name": "Multiplayer Doom on Cloudflare Workers Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Here's Doom Multiplayer running on top of Cloudflare Workers.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2021-05-18T13:59:57.000+01:00",
		"reading_time": 13,
		"slug": "doom-multiplayer-workers",
		"tags": [
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "5v2UZdTRX1Rw9akmhexnxs",
				"name": "Durable Objects",
				"slug": "durable-objects"
			}
		],
		"title": "Multiplayer Doom on Cloudflare Workers",
		"updated_at": "2024-08-27T01:49:36.094Z",
		"url": "https://blog.cloudflare.com/doom-multiplayer-workers"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}