{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"ja-jp",
		"ko-kr"
	],
	"post": {
		"authors": [
			{
				"name": "David Belson",
				"slug": "david-belson",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/en7vkXf6rLBm4F8IcNHXT/b2a7716e786872139c873c8f5a2fc825/david-belson.jpeg",
				"location": null,
				"website": null,
				"twitter": "@dbelson",
				"facebook": null
			}
		],
		"excerpt": "The new Email Security section on Cloudflare Radar provides insights into the latest trends around threats found in malicious email, sources of spam and malicious email, and the adoption of technologies designed to prevent abuse of email",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/76ur8aY8OPMoLuPHez75wj/09104f05e954783d4e2307852c2825b6/email-security-insights-on-cloudflare-radar.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/67tt8jiqO9RDouWNc2IuIg/03b5d99927971de344f448a2954c0112/image2-28.png\" alt=\"Launching email security insights on Cloudflare Radar\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>During 2021&#39;s Birthday Week, we <a href=\"/introducing-email-routing\">announced</a> our <a href=\"https://www.cloudflare.com/learning/email-security/what-is-email-routing/\">Email Routing</a> service, which allows users to direct different types of email messages (such as marketing, transactional, or administrative) to separate accounts based on criteria such as the recipient’s address or department. Its capabilities and the volume of messages routed have <a href=\"/email-routing-subdomains\">grown significantly</a> since launch.</p><p>Just a few months later, on February 23, 2022, we announced our intent to acquire Area 1 Security to protect users from phishing attacks in email, web, and network environments. Since the completion of the acquisition on April 1, 2022, Area 1&#39;s email security capabilities have been integrated into Cloudflare&#39;s <a href=\"https://www.cloudflare.com/learning/access-management/what-is-sase/\">secure access service edge (SASE)</a> solution portfolio, and now processes tens of millions of messages daily.</p><p>Processing millions of email messages each day on behalf of our customers gives us a unique perspective on the threats posed by malicious emails, spam volume, the adoption of <a href=\"https://www.cloudflare.com/learning/email-security/dmarc-dkim-spf/\">email authentication methods like SPF, DMARC, and DKIM</a>, and the use of IPv4/IPv6 and TLS by email servers. Today, we are launching a new <a href=\"https://radar.cloudflare.com/email-security\">Email Security section</a> on <a href=\"https://radar.cloudflare.com/\">Cloudflare Radar</a> to share these perspectives with you. The insights in this new section can help you better understand the state of email security as viewed across various metrics, as well as understanding real-time trends in email-borne threats. (For instance, correlating an observed increase within your organization in messages containing malicious links with a similar increase observed by Cloudflare.) Below, we review the new metrics that are now available on Radar.</p><h3>Tracking malicious email</h3><p>As Cloudflare’s <a href=\"https://www.cloudflare.com/zero-trust/products/email-security/\">email security</a> service processes email messages on behalf of customers, we are able to identify and classify offending messages as malicious. As examples, malicious emails may attempt to trick recipients into sharing personal information like login details, or the messages could attempt to spread malware through embedded images, links, or attachments. The new Email Security section on Cloudflare Radar now <a href=\"https://radar.cloudflare.com/email-security\">provides insight</a> at a global level into the aggregate share of processed messages that we have classified as malicious over the selected timeframe. During <a href=\"https://radar.cloudflare.com/email-security?dateStart=2024-02-01&dateEnd=2024-02-29\">February 2024</a>, as shown in the figure below, we found that an average of 2.1% of messages were classified as being malicious. Spikes in malicious email volume were seen on February 10 and 11, accounting for as much as 29% of messages. These spikes occurred just ahead of the Super Bowl, in line with <a href=\"/super-bowl-lviii\">previous observations</a> of increases in malicious email volume in the week ahead of the game. Other notable (but lower) spikes were seen on February 13, 15, 17, 24, and 25. The <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-summary-by-malicious\">summary</a> and <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-timeseries-group-by-malicious\">time series</a> data for malicious email share are available through the Radar API.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/39j34s8TPPt3cQj6j2ZTsF/17b8e298126af0f6f898f84faa1d5619/pasted-image-0-6.png\" alt=\"\" class=\"kg-image\" width=\"901\" height=\"415\" loading=\"lazy\"/>\n            \n            </figure><h3>Threat categorization</h3><p>The <a href=\"https://radar.cloudflare.com/year-in-review/2023#top-email-threats\">Cloudflare Radar 2023 Year in Review</a> highlighted some of the techniques used by attackers when carrying out attacks using malicious email messages. As noted above, these can include links or attachments leading to malware, as well as approaches like identity deception, where the message appears to be coming from a trusted contact, and brand impersonation, where the message appears to be coming from a trusted brand. In analyzing malicious email messages, Cloudflare’s <a href=\"https://www.cloudflare.com/zero-trust/solutions/email-security-services/\">email security service</a> categorizes the threats that it finds these messages contain. (Note that a single message can contain multiple types of threats — the sender could be impersonating a trusted contact while the body of the email contains a link leading to a fake login page.)</p><p>Based on these assessments, Cloudflare Radar now <a href=\"https://radar.cloudflare.com/email-security#malicious-email-threat-categories\">provides insights</a> into trends observed across several different groups of threat types including “Attachment”, “Link”, “Impersonation”, and “Other”. “Attachment” groups individual threat types where the attacker has attached a file to the email message, “Link” groups individual threat types where the attacker is trying to get the user to click on something, and “Impersonation” groups individual threat types where the attacker is impersonating a trusted brand or contact. The “Other” grouping includes other threat types not covered by the previous three.</p><p>During February 2024 for the “Link” grouping, as the figure below illustrates, link-based threats were unsurprisingly the most common, and were found in 58% of malicious emails. Since the display text for a link (i.e., hypertext) in HTML can be arbitrarily set, attackers can make a URL appear as if it links to a benign site when, in fact, it is actually malicious. Nearly a third of malicious emails linked to something designed to harvest user credentials. The <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-summary-by-threat-category\">summary</a> and <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-timeseries-group-by-threat-category\">time series</a> data for these threat categories are available through the Radar API.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5ZVsVPQccuYKQjUpKcOoEq/238c03bf9a393ba394f9e0d5607f62a6/pasted-image-0--1--3.png\" alt=\"\" class=\"kg-image\" width=\"901\" height=\"415\" loading=\"lazy\"/>\n            \n            </figure><p>For the “Attachment” grouping, during February 2024, nearly 13% of messages were found to have a malicious attachment that when opened or executed in the context of an attack, includes a call-to-action (e.g. lures target to click a link) or performs a series of actions set by an attacker. The share spiked several times throughout the month, reaching as high as 70%. The attachments in nearly 6% of messages attempted to download additional software (presumably malware) once opened.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7Akp5aqpIDDj99BdAsZ82C/e8a299b2dc499fd305976978837a532a/pasted-image-0--2--2.png\" alt=\"\" class=\"kg-image\" width=\"901\" height=\"415\" loading=\"lazy\"/>\n            \n            </figure><p>If an email message appears to be coming from a trusted brand, users may be more likely to open it and take action, like checking the shipping status of a package or reviewing a financial transaction. During February 2024, on average, over a quarter of malicious emails were sent by attackers attempting to impersonate well-known brands. Similar to other threat categories, this one also saw a number of significant spikes, reaching as high as 88% of February 17. Just over 18% of messages were found to be trying to extort users in some fashion. It appears that such campaigns were very active in the week ahead of Valentine&#39;s Day (February 14), although the peak was seen on February 15, at over 95% of messages.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7H5mYJCU0Z2mWmY2zOoH7b/f293fbec1e2e26f0265f5df87abd28fd/Impersonation.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"745\" loading=\"lazy\"/>\n            \n            </figure><p>Identity deception occurs when an attacker or someone with malicious intent sends an email claiming to be someone else, whether through use of a similar-looking domain or display name manipulation. This was the top threat category for the “Other” grouping, seen in over 36% of malicious emails during February 2024. The figure below shows three apparent “waves” of the use of this technique — the first began at the start of the month, the second around February 9, and the third around February 20. Over 11% of messages were categorized as malicious because of the reputation of the network (<a href=\"https://www.cloudflare.com/learning/network-layer/what-is-an-autonomous-system/\">autonomous system</a>) that they were sent from; some network providers are well-known sources of malicious and unwanted email.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3YFNUNtGqXHm2ORhNgIS0e/d47924aeb70038839b6a5f1954abd02c/pasted-image-0--3--1.png\" alt=\"\" class=\"kg-image\" width=\"901\" height=\"415\" loading=\"lazy\"/>\n            \n            </figure><h3>Dangerous domains</h3><p><a href=\"https://www.cloudflare.com/learning/dns/top-level-domain/\">Top-level domains, also known as TLDs</a>, are found in the right-most portion of a hostname. For example, <code>radar.cloudflare.com</code> is in the <code>.com</code> <a href=\"https://icannwiki.org/Generic_top-level_domain\">generic Top Level Domain (gTLD)</a>, while <code>bbc.co.uk</code> is in the <code>.uk</code> <a href=\"https://icannwiki.org/Country_code_top-level_domain\">country code Top Level Domain (ccTLD)</a>. As of February 2024, there are nearly 1600 Top Level Domains listed in the <a href=\"https://www.iana.org/domains/root/db\">IANA Root Zone Database</a>. Over the last 15 years or so, several reports have been published that look at the “most dangerous TLDs” — that is, which TLDs are most favored by threat actors. The “top” TLDs in these reports are often a mix of ccTLDs from smaller counties and <a href=\"https://icannwiki.org/All_New_gTLD_Applications\">newer gTLDs</a>. On Radar, we are now sharing our own perspective on these dangerous TLDs, highlighting those where we have observed the largest shares of malicious and spam emails. The analysis is based on the sending domain’s TLD, found in the <code>From:</code> header of an email message. For example, if a message came from <code>joe@example.com</code>, then <code>example.com</code> is the sending domain, and <code>.com</code> is the associated TLD.</p><p>On Radar, users can view shares of spam and malicious email, and can also filter by timeframe and “type” of TLD, with options to view all (the complete list), ccTLDs (country codes), or “classic” TLDs (the original set of gTLDs specified in <a href=\"https://www.rfc-editor.org/rfc/rfc1591.txt\">RFC 1591</a>). Note that spam percentages shown here may be lower than those published in other industry analyses. Cloudflare cloud email security customers may be performing initial spam filtering before messages arrive at Cloudflare for processing, resulting in a lower percentage of messages characterized as spam by Cloudflare.</p><p>Looking back across February 2024, we found that new gTLD <code>associates</code> and the ccTLD <code>zw</code> (Zimbabwe) were the TLDs with domains originating the largest shares of malicious email, at over 85% each. New TLDs <code>academy</code>, <code>directory</code>, and <code>bar</code> had the largest shares of spam in email sent by associated domains, at upwards of 95%.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2tvfVUvg028MjExbUn6DuB/76d1ffea1e2cd3b00991675de0ea45c6/pasted-image-0--4-.png\" alt=\"TLDs with the highest percentage of malicious email in February 2024\" class=\"kg-image\" width=\"904\" height=\"471\" loading=\"lazy\"/>\n            \n            </figure><p><i>TLDs with the highest percentage of malicious email in February 2024</i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VeBDm1f5fYRJqZdq0ho3b/be740ca10d613e3e6d4b7581206ffe6f/pasted-image-0--5-.png\" alt=\"TLDs with the highest percentage of spam email in February 2024\" class=\"kg-image\" width=\"904\" height=\"471\" loading=\"lazy\"/>\n            \n            </figure><p><i>TLDs with the highest percentage of spam email in February 2024</i></p><p>The figure below breaks out ccTLDs, where we found that at least half of the messages coming from domains in <code>zw</code> (Zimbabwe, at 85%) and <code>bd</code> (Bangladesh, at 50%) were classified as malicious. While the share of malicious email vastly outweighed the share of spam seen from <code>zw</code> domains, it was much more balanced in <code>bd</code> and <code>pw</code> (Palau). A total of 80 ccTLDs saw fewer than 1% of messages classified as malicious in February 2024.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6ngA84qYZiS1djPnyAN9K9/fa34902ff6ac7564d8b9a4f4b9a5417b/pasted-image-0--6-.png\" alt=\"ccTLDs with the highest percentage of malicious email in February 2024\" class=\"kg-image\" width=\"904\" height=\"471\" loading=\"lazy\"/>\n            \n            </figure><p><i>ccTLDs with the highest percentage of malicious email in February 2024</i></p><p>Among the “classic” TLDs, we can see that the shares of both malicious emails and spam are relatively low. Perhaps unsurprisingly, as the largest TLD, <code>com</code> has the largest shares of both in February 2024. Given the restrictions around registering <a href=\"https://www.iana.org/domains/int\"><code>int</code></a> and <a href=\"https://get.gov/domains/requirements/\"><code>gov</code></a> domains, it is interesting to see that even 2% of the messages from associated domains are classified as malicious.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2iWhtYDtbuSikcDtmgGtn4/60cdae6954e57bc3e53936bf191b7f12/pasted-image-0--7-.png\" alt=\"Classic TLDs with the highest percentage of malicious email in February 2024.\" class=\"kg-image\" width=\"904\" height=\"302\" loading=\"lazy\"/>\n            \n            </figure><p><i>Classic TLDs with the highest percentage of malicious email in February 2024.</i></p><p>The reasons that some TLDs are responsible for a greater share of malicious and/or spam email vary — some may have loose or non-existent registration requirements, some may be more friendly to so-called “<a href=\"https://icannwiki.org/Domain_tasting\">domain tasting</a>”, and some may have particularly low domain registration fees.The <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-top-tlds-by-malicious\">malicious</a> and <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-top-tlds-by-spam\">spam</a> summary shares per TLD are available through the Radar API.</p><h3>Adoption of email authentication methods</h3><p><a href=\"https://www.cloudflare.com/en-gb/learning/email-security/dmarc-dkim-spf/\">SPF, DKIM, and DMARC</a> are three email <a href=\"https://www.cloudflare.com/learning/access-management/what-is-authentication/\">authentication</a> methods and when used together, they help prevent spammers, <a href=\"https://www.cloudflare.com/learning/access-management/phishing-attack/\">phishers</a>, and other unauthorized parties from sending <a href=\"https://www.cloudflare.com/learning/email-security/what-is-email/\">emails</a> on behalf of a <a href=\"https://www.cloudflare.com/learning/dns/glossary/what-is-a-domain-name/\">domain</a> they do not own.</p><p>Sender Policy Framework (SPF) is a way for a domain to list all the servers they send emails from, with <a href=\"https://www.cloudflare.com/learning/dns/dns-records/dns-spf-record/\">SPF records</a> in the DNS listing the <a href=\"https://www.cloudflare.com/learning/dns/glossary/what-is-my-ip-address/\">IP addresses</a> of all the servers that are allowed to send emails from the domain. Mail servers that receive an email message can check it against the SPF record before passing it on to the recipient&#39;s inbox. DomainKeys Identified Mail (DKIM) enables domain owners to automatically &quot;sign&quot; emails from their domain with a digital “signature” that uses cryptography to mathematically verify that the email came from the domain. Domain-based Message Authentication Reporting and Conformance (DMARC) tells a receiving email server what to do, given the results after checking SPF and DKIM. A domain&#39;s DMARC policy, stored in <a href=\"https://www.cloudflare.com/learning/dns/dns-records/dns-dmarc-record/\">DMARC records</a>, can be set in a variety of ways, instructing mail servers to quarantine emails that fail SPF or DKIM (or both), to reject such emails, or to deliver them.</p><p>These authentication methods have recently taken on increased importance, as both <a href=\"https://blog.google/products/gmail/gmail-security-authentication-spam-protection/\">Google</a> and <a href=\"https://blog.postmaster.yahooinc.com/post/730172167494483968/more-secure-less-spam\">Yahoo!</a> have announced that during the first quarter of 2024, as part of a more aggressive effort to reduce spam, they will require bulk senders to follow <a href=\"https://senders.yahooinc.com/best-practices/\">best practices</a> that include implementing stronger email authentication using standards like SPF, DKIM, and DMARC. When a given email message is evaluated against these three methods, the potential outcomes are PASS, FAIL, and NONE. The first two are self-explanatory, while NONE means that there was no associated SPF/DKIM/DMARC policy associated with the message’s sending domain.</p><p>Reviewing the average shares across February 2024, we find that over 93% of messages passed SPF authentication, while just 2.7% failed. When considering this metric, FAIL is the outcome of greater interest because SPF is easier to spoof than DKIM, and also because failure may be driven by “shadow IT” situations, such as when a company’s Marketing department uses a third party to send email on behalf of the company, but fails to add that third party to the associated SPF records. An average of 88.5% of messages passed DKIM evaluation in February, while just 2.1% failed. For DKIM, the focus should be on PASS, as there are potential non-malicious reasons that a given signature may fail to verify. For DMARC, 86.5% of messages passed authentication, while 4.2% failed, and the combination of PASS and FAIL is the focus, as the presence of an associated policy is of greatest interest for this metric, and whether the message passed or failed less so. For all three methods in this section, NONE indicates the lack of an associated policy. SPF (<a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-summary-by-spf\">summary</a>, <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-timeseries-group-by-spf\">time series</a>), DKIM (<a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-summary-by-dkim\">summary</a>, <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-timeseries-group-by-dkim\">time series</a>), and DMARC (<a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-summary-by-dmarc\">summary</a>, <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-timeseries-group-by-dmarc\">time series</a>) data is available through the Radar API.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7D1Kfig1lHwIgoEJ3XGx8i/57228f60b47ed93aba559d30a2f6ae00/Screenshot-2024-03-08-at-12.51.49.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1097\" loading=\"lazy\"/>\n            \n            </figure><h3>Protocol usage</h3><p>Cloudflare has <a href=\"/introducing-cloudflares-automatic-ipv6-gatewa/\">long evangelized IPv6 adoption</a>, although it has largely been focused on making Web resources available via this <a href=\"https://datatracker.ietf.org/doc/html/rfc2460\">not-so-new version</a> of the protocol. However, it’s also important that other Internet services begin to support and use IPv6, and this is an area where <a href=\"/ipv6-from-dns-pov/\">our recent research</a> shows that providers may be lacking.</p><p>Through analysis of inbound connections from senders’ mail servers to Cloudflare’s email servers, we can gain insight into the distribution of these connections across IPv4 and IPv6. Looking at this distribution for February 2024, we find that 95% of connections were made over IPv4, while only 5% used IPv6. This distribution is in sharp contrast to the share of IPv6 requests for IPv6-capable (dual stacked) Web content, which was 37% <a href=\"https://radar.cloudflare.com/adoption-and-usage?dateStart=2024-02-01&dateEnd=2024-02-29#i-pv4-vs-i-pv6\">for the same time period</a>. The <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-routing-summary-by-ip-version\">summary</a> and <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-routing-timeseries-group-by-ip-version\">time series</a> data for IPv4/v6 distribution are available through the Radar API.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2BLLzGXJ18q7LFhuRteSmG/79905c46609216a0c62a576497b9daca/Screenshot-2024-03-08-at-12.52.26.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"794\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare has also been a long-time advocate for secure connections, launching <a href=\"/introducing-universal-ssl/\">Universal SSL</a> during 2014’s Birthday Week, to enable secure connections between end users and Cloudflare for all of our customers’ sites (which numbered ~2 million at the time). Over the last 10 years, SSL has completed its evolution to <a href=\"https://www.cloudflare.com/learning/ssl/transport-layer-security-tls/\">TLS</a>, and although many think of TLS as only being relevant for Web content, possibly due to years of being told to look for the 🔒 padlock in our browser’s address bar, TLS is also used to encrypt client/server connections across other protocols including SMTP (email), FTP (file transfer), and XMPP (messaging).</p><p>Similar to the IPv4/v6 analysis discussed above, we can also calculate the share of inbound connections to Cloudflare’s email servers that are using TLS. Messages are encrypted in transit when the connection is made over TLS, while messages sent over unencrypted connections can potentially be read or modified in transit. Fortunately, the vast majority of messages received by Cloudflare’s email servers are made over encrypted connections, with just 6% sent unencrypted during February 2024. The <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-summary-by-tls-version\">summary</a> and <a href=\"https://developers.cloudflare.com/api/operations/radar-get-email-security-timeseries-group-by-tls-version\">time series</a> data for TLS usage are available through the Radar API.</p><h3>Conclusion</h3><p>Although younger Internet users may eschew email in favor of communicating through a variety of messaging apps, email remains an absolutely essential Internet service, relied on by individuals, enterprises, online and offline retailers, governments, and more. However, because email is so ubiquitous, important, and inexpensive, it has also become an attractive threat vector. Cloudflare’s email <a href=\"https://www.cloudflare.com/developer-platform/email-routing/\">routing</a> and <a href=\"https://www.cloudflare.com/zero-trust/products/email-security/\">security</a> services help customers manage and secure their email, and Cloudflare Radar’s new <a href=\"https://radar.cloudflare.com/email-security\">Email Security section</a> can help security researchers, email administrators, and other interested parties understand the latest trends around threats found in malicious email, sources of spam and malicious email, and the adoption of technologies designed to prevent abuse of email.</p><p>If you have any questions about this new section, you can contact the Cloudflare Radar team at <a href=\"mailto:radar@cloudflare.com\">radar@cloudflare.com</a> or on social media at <a href=\"https://twitter.com/CloudflareRadar\">@CloudflareRadar</a> (X/Twitter), <a href=\"https://noc.social/@cloudflareradar\">https://noc.social/@cloudflareradar</a> (Mastodon), and <a href=\"https://bsky.app/profile/radar.cloudflare.com\">radar.cloudflare.com</a> (Bluesky).</p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\">\n  <iframe\n    src=\"https://customer-rhnwzxvb3mg4wz3v.cloudflarestream.com/eb97ddce50440762ec625fedc79d9b2f/iframe?preload=true&poster=https%3A%2F%2Fcustomer-rhnwzxvb3mg4wz3v.cloudflarestream.com%2Feb97ddce50440762ec625fedc79d9b2f%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D%26height%3D600\"\n    loading=\"lazy\"\n    style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\"\n    allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\"\n    allowfullscreen=\"true\"\n  ></iframe>\n</div><!--kg-card-end: html--><p>Tune in for more news, announcements and thought-provoking discussions! Don&#39;t miss the full <a href=\"https://cloudflare.tv/shows/security-week\">Security Week hub page</a>.</p>",
		"id": "7oGmED46jTkj7AiKDzGujo",
		"localeList": {
			"name": "Launching email security insights on Cloudflare Radar Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "The new Email Security section on Cloudflare Radar provides insights into the latest trends around threats found in malicious email, sources of spam and malicious email, and the adoption of technologies designed to prevent abuse of email.",
		"metadata": {
			"title": "Launching email security insights on Cloudflare Radar",
			"description": "The new Email Security section on Cloudflare Radar provides insights into the latest trends around threats found in malicious email, sources of spam and malicious email, and the adoption of technologies designed to prevent abuse of email.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5xAx3us2SSrmTxfDZ9jzIF/ac623222bb180d65fca587add9db86fa/email-security-insights-on-cloudflare-radar-3L2Oce.png"
		},
		"primary_author": {},
		"published_at": "2024-03-08T14:00:58.000+00:00",
		"slug": "email-security-insights-on-cloudflare-radar",
		"tags": [
			{
				"id": "3DmitkNK6euuD5BlhuvOLW",
				"name": "Security Week",
				"slug": "security-week"
			},
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "4azVuztqQ45Opsj9BG2RaV",
				"name": "Email",
				"slug": "email"
			},
			{
				"id": "4q9TVDLe1bTzFjK0ADWivB",
				"name": "Email Routing",
				"slug": "email-routing"
			},
			{
				"id": "2Kxh34kIQRA3gyymmhJpsR",
				"name": "Email Security",
				"slug": "email-security"
			},
			{
				"id": "3yArjf0gLKZy8ObEDxbNNi",
				"name": "Trends",
				"slug": "trends"
			}
		],
		"title": "Launching email security insights on Cloudflare Radar",
		"updated_at": "2024-08-27T00:59:21.656Z",
		"url": "https://blog.cloudflare.com/email-security-insights-on-cloudflare-radar"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}