{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "6",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Abhi Das",
				"slug": "abhi",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1aSM2Cr0Slgy7gVytmzkgS/528b55e02da8bb82997ad1fb14ccf1c6/abhi.jpeg",
				"location": null,
				"website": null,
				"twitter": "@abhidasone",
				"facebook": null
			},
			{
				"name": "Mythili Prabhu",
				"slug": "mythili",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7SQKWPwCqqjj4hYR7JufX/35a9906ad74dd16ab7665330cbbe4d5e/mythili.png",
				"location": "San Jose, California",
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Kenny Johnson",
				"slug": "kenny",
				"bio": "Cloudflare Zero Trust PM\nAustin TX",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4sLNWTlos4CkLxMZ9WzkKg/4cec366f9d9df7ca187d104e23b112f5/kenny.jpeg",
				"location": null,
				"website": null,
				"twitter": "@KennyJohnsonATX",
				"facebook": null
			}
		],
		"excerpt": "As CIOs navigate the complexities of stitching together multiple solutions, we are extending our collaboration with Microsoft to create one of the best Zero Trust solutions available.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/41Ovlpcpt80AdTnMBeB54f/203545609513d4d8473eac289f451db3/expanding-our-collaboration-with-microsoft-proactive-and-automated-zero-trust-security.png",
		"featured": false,
		"html": "<p><i></i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6Ru2fdT46ERm7sRSdZAsEQ/261a12681d1d8f01c1ca720c45d540d9/image2-66.png\" alt=\"Expanding our collaboration with Microsoft: proactive and automated Zero Trust security for customers\" class=\"kg-image\" width=\"1600\" height=\"900\" loading=\"lazy\"/>\n            \n            </figure><p>As CIOs <a href=\"https://www.cloudflare.com/cio/\">navigate the complexities</a> of stitching together multiple solutions, we are extending our partnership with Microsoft to create one of <a href=\"https://www.cloudflare.com/zero-trust/solutions/\">the best Zero Trust solutions</a> available. Today, we are announcing four new integrations between Azure AD and Cloudflare Zero Trust that reduce risk proactively. These integrated offerings increase automation allowing security teams to focus on threats versus <a href=\"https://www.cloudflare.com/learning/access-management/how-to-implement-zero-trust/\">implementation</a> and maintenance.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-is-zero-trust-and-why-is-it-important\">What is Zero Trust and why is it important?</h3>\n            <a href=\"#what-is-zero-trust-and-why-is-it-important\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Zero Trust is an overused term in the industry and creates a lot of confusion. So, let&#39;s break it down. Zero Trust architecture emphasizes the “never trust, always verify” approach. One way to think about it is that in the <a href=\"https://www.cloudflare.com/learning/access-management/what-is-the-network-perimeter/\">traditional security perimeter</a> or “castle and moat” model, you have access to all the rooms inside the building (e.g., apps) simply by having access to the main door (e.g., typically a VPN).  In the <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust model</a> you would need to obtain access to each locked room (or app) individually rather than only relying on access through the main door. Some key components of the Zero Trust model are identity e.g., Azure AD (who), apps e.g., a SAP instance or a custom app on Azure (applications), policies e.g. Cloudflare Access rules (who can access what application), devices e.g. a laptop managed by Microsoft Intune (the security of the endpoint requesting the access) and other contextual signals.</p><p>Zero Trust is even more important today since companies of all sizes are faced with an accelerating digital transformation and an increasingly distributed workforce. Moving away from the castle and moat model, to the Internet becoming your corporate network, requires security checks for every user accessing every resource. As a result, all companies, especially those whose use of Microsoft’s broad cloud portfolio is increasing, are adopting a Zero Trust architecture as an essential part of their cloud journey.</p><p>Cloudflare’s Zero Trust platform provides a modern approach to authentication for internal and SaaS applications. Most companies likely have a mix of corporate applications - some that are SaaS and some that are hosted on-premise or on Azure. Cloudflare’s Zero Trust Network Access (ZTNA) product as part of our Zero Trust platform makes these applications feel like SaaS applications, allowing employees to access them with a simple and consistent flow. Cloudflare Access acts as a unified reverse proxy to enforce <a href=\"https://www.cloudflare.com/learning/access-management/what-is-access-control/\">access control</a> by making sure every request is authenticated, authorized, and encrypted.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"cloudflare-zero-trust-and-microsoft-azure-active-directory\">Cloudflare Zero Trust and Microsoft Azure Active Directory</h3>\n            <a href=\"#cloudflare-zero-trust-and-microsoft-azure-active-directory\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>We have thousands of customers using Azure AD and Cloudflare Access as part of their Zero Trust architecture. Our <a href=\"/cloudflare-partners-with-microsoft-to-protect-joint-customers-with-global-zero-trust-network/\">partnership with Microsoft</a>  announced last year strengthened security without compromising performance for our joint customers. Cloudflare’s Zero Trust platform integrates with Azure AD, providing a seamless application access experience for your organization&#39;s hybrid workforce.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2v5Iehf1svBNs9FvFTEcOG/8eacc21f4f30d2cd3b3a8a3402221903/1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"812\" loading=\"lazy\"/>\n            \n            </figure><p>As a recap, the integrations we launched solved <a href=\"/cloudflare-partners-with-microsoft-to-protect-joint-customers-with-global-zero-trust-network/\">two key problems</a>:</p><ol><li><p><i>For on-premise legacy applications</i>, Cloudflare’s participation as Azure AD <a href=\"https://azure.microsoft.com/en-us/services/active-directory/sso/secure-hybrid-access/#overview\">secure hybrid access</a> partner enabled customers to centrally manage access to their legacy on-premise applications using SSO authentication without incremental development. Joint <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/manage-apps/cloudflare-azure-ad-integration\">customers now easily use</a> Cloudflare Access as an additional layer of security with built-in performance in front of their legacy applications.</p></li><li><p><i>For apps that run on Microsoft Azure</i>, joint customers can integrate Azure AD <a href=\"https://developers.cloudflare.com/cloudflare-one/identity/idp-integration/azuread/\">with Cloudflare Zero Trust</a> and build rules based on user identity, group membership and Azure AD Conditional Access policies. Users will authenticate with their Azure AD credentials and connect to <a href=\"https://www.cloudflare.com/zero-trust/products/access/\">Cloudflare Access</a> with just a few simple steps using Cloudflare’s app connector, <a href=\"https://azuremarketplace.microsoft.com/en-us/marketplace/apps/cloudflare.cloudflare_tunnel_vm?tab=Overview\">Cloudflare Tunnel</a>, that can expose applications running on <a href=\"https://azuremarketplace.microsoft.com/en-us/marketplace/apps/\">Azure</a>. See guide to <a href=\"https://developers.cloudflare.com/cloudflare-one/connections/connect-apps/install-and-setup/tunnel-guide/\">install and configure Cloudflare Tunnel</a>.</p></li></ol><p>Recognizing Cloudflare&#39;s innovative approach to Zero Trust and Security solutions, Microsoft awarded us the <a href=\"https://www.microsoft.com/security/blog/2022/06/06/announcing-2022-microsoft-security-excellence-awards-winners/#:~:text=Security%20Software%20Innovator\">Security Software Innovator</a> award at the 2022 Microsoft Security Excellence Awards, a prestigious classification in the Microsoft partner community.</p><p><i>But we aren’t done innovating</i>. We listened to our customers’ feedback and to address their pain points are announcing several new integrations.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"microsoft-integrations-we-are-announcing-today\">Microsoft integrations we are announcing today</h3>\n            <a href=\"#microsoft-integrations-we-are-announcing-today\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>The four new integrations we are announcing today are:</p><p><b>1. Per-application conditional access:</b> Azure AD customers <a href=\"https://developers.cloudflare.com/cloudflare-one/tutorials/azuread-conditional-access/\">can use their existing Conditional Access policies</a> in Cloudflare Zero Trust.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3DrhzGns2IQDHUVSY105rq/7db93de4e120659b9ddb449bd01a9402/2.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"917\" loading=\"lazy\"/>\n            \n            </figure><p>Azure AD allows administrators to create and enforce policies on both applications and users using Conditional Access. It provides a wide range of parameters that can be used to control user access to applications (e.g. user risk level, sign-in risk level, device platform, location, client apps, etc.). Cloudflare Access now supports Azure AD Conditional Access policies per application. This allows security teams to define their security conditions in Azure AD and enforce them in Cloudflare Access.</p><p>For example, customers might have tighter levels of control for an internal payroll application and hence will have specific conditional access policies on Azure AD. However, for a general info type application such as an internal wiki, customers might enforce not as stringent rules on Azure AD conditional access policies. In this case both app groups and relevant Azure AD conditional access policies can be directly plugged into Cloudflare Zero Trust seamlessly without any code changes.</p><p>**2. **<a href=\"https://developers.cloudflare.com/cloudflare-one/identity/idp-integration/azuread/#synchronize-users-and-groups\"><b>SCIM</b></a>****: Autonomously synchronize Azure AD groups between Cloudflare Zero Trust and Azure AD, saving hundreds of hours in the CIO org.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1bU3bURsLCASnT6AqrV6nU/6dc8e2c3501b2fe748354c80a85042ec/3.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"790\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare Access policies can use Azure AD to verify a user&#39;s identity and provide information about that user (e.g., first/last name, email, group membership, etc.). These user attributes are not always constant, and can change over time. When a user still retains access to certain sensitive resources when they shouldn’t, it can have serious consequences.</p><p>Often when user attributes change, an administrator needs to review and update all access policies that may include the user in question. This makes for a tedious process and an error-prone outcome.</p><p>The SCIM (System for Cross-domain Identity Management) specification ensures that user identities across entities using it are always up-to-date. We are excited to announce that joint customers of Azure AD and Cloudflare Access can now enable SCIM user and group provisioning and deprovisioning. It will accomplish the following:</p><ul><li><p>The IdP policy group selectors are now pre-populated with Azure AD groups and will remain in sync. Any changes made to the policy group will instantly reflect in Access without any overhead for administrators.</p></li><li><p>When a user is deprovisioned on Azure AD, all the user&#39;s access is revoked across Cloudflare Access and Gateway. This ensures that change is made in near real time thereby reducing security risks.</p></li></ul><p>**3. **<a href=\"https://developers.cloudflare.com/cloudflare-one/tutorials/azuread-risky-users/\"><b>Risky user isolation</b></a>****: Helps joint customers add an extra layer of security by isolating high risk users (based on AD signals) such as contractors to browser isolated sessions via Cloudflare’s RBI product.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6jsV2YQ0MD6yy7lLEuZJY2/f1d0899c1c97780de4095aace4ac78fa/4.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1021\" loading=\"lazy\"/>\n            \n            </figure><p>Azure AD classifies users into low, medium and high risk users based on many data points it analyzes. Users may move from one risk group to another based on their activities. Users can be deemed risky based on many factors such as the nature of their employment i.e. contractors, risky sign-in behavior, credential leaks, etc. While these users are high-risk, there is a low-risk way to provide access to resources/apps while the user is assessed further.</p><p>We now support integrating <a href=\"https://developers.cloudflare.com/cloudflare-one/tutorials/azuread-risky-users/\">Azure AD groups with Cloudflare Browser Isolation</a>. When a user is classified as high-risk on Azure AD, we use this signal to automatically isolate their traffic with our Azure AD integration. This means a high-risk user can access resources through a secure and isolated browser. If the user were to move from high-risk to low-risk, the user would no longer be subjected to the isolation policy applied to high-risk users.</p><p><b>4. Secure joint Government Cloud customers</b>: Helps Government Cloud customers achieve better security with centralized identity &amp; access management via Azure AD, and an additional layer of security by connecting them to the Cloudflare global network, not having to open them up to the whole Internet.</p><p>Via <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/manage-apps/secure-hybrid-access-integrations\">Secure Hybrid Access</a> (SHA) program, Government Cloud (‘GCC’) customers will soon be able to integrate Azure AD <a href=\"https://developers.cloudflare.com/cloudflare-one/identity/idp-integration/azuread/\">with Cloudflare Zero Trust</a> and build rules based on user identity, group membership and Azure AD conditional access policies. Users will authenticate with their Azure AD credentials and connect to Cloudflare Access with just a few simple steps using <a href=\"https://azuremarketplace.microsoft.com/en-us/marketplace/apps/cloudflare.cloudflare_tunnel_vm?tab=Overview\">Cloudflare Tunnel</a> that can expose applications running on <a href=\"https://azuremarketplace.microsoft.com/en-us/marketplace/apps/\">Microsoft Azure</a>.</p><blockquote><p><i>“Digital transformation has created a new security paradigm resulting in organizations accelerating their adoption of Zero Trust. The </i><b><i>Cloudflare Zero Trust</i></b><i> and </i><b><i>Azure Active Directory</i></b><i> joint solution has been a growth enabler for Swiss Re by easing Zero Trust deployments across our workforce allowing us to focus on our core business. Together, the joint solution enables us to go beyond SSO to empower our adaptive workforce with frictionless, secure access to applications from anywhere. The joint solution also delivers us a holistic Zero Trust solution that encompasses people, devices, and networks.”</i><b>– Botond Szakács, Director, Swiss Re</b></p></blockquote><blockquote><p><i>“A cloud-native Zero Trust security model has become an absolute necessity as enterprises continue to adopt a cloud-first strategy. Cloudflare has developed robust product integrations with Microsoft to help security and IT leaders prevent attacks proactively, dynamically control policy and risk, and increase automation in alignment with zero trust best practices.”</i><b>– Joy Chik, President, Identity &amp; Network Access, Microsoft</b></p></blockquote>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"try-it-now\">Try it now</h3>\n            <a href=\"#try-it-now\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Interested in learning more about how our Zero Trust products integrate with Azure Active Directory? Take a look at this <a href=\"https://assets.ctfassets.net/slt3lc6tev37/5h3XO6w3UdOxmBNZswJjDV/84aa56dd5ade5c05f01436d19f8dc4f8/Cloudflare_Microsoft_Azure_AD_Reference_Archtecture_v2__BDES-4130.pdf\">extensive reference architecture</a> that can help you get started on your Zero Trust journey and then add the specific use cases above as required. Also, check out this joint <a href=\"https://www.google.com/url?q=https://gateway.on24.com/wcc/eh/2153307/lp/3939569/achieving-zero-trust-application-access-with-cloudflare-and-azure-ad&sa=D&source=docs&ust=1673477613350582&usg=AOvVaw0hstOTz5JVlwWEGp8_Ifu_\">webinar</a> with Microsoft that highlights our joint Zero Trust solution and how you can get started.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-next\">What next</h3>\n            <a href=\"#what-next\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p><i>We are just getting started</i>. We want to continue innovating and make the Cloudflare Zero Trust and Microsoft Security joint solution to solve your problems. Please give us <a href=\"https://www.cloudflare.com/partners/technology-partners/microsoft/\">feedback</a> on what else you would like us to build as you continue using this joint solution.</p>",
		"id": "4pqoxyMztGcYC13k3EKdI3",
		"localeList": {
			"name": "Expanding our Microsoft collaboration: proactive and automated Zero Trust security for customers Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Today, we are announcing four new integrations between Azure AD and Cloudflare Zero Trust that reduce risk proactively. These integrated offerings increase automation allowing security teams to focus on threats versus implementation and maintenance.",
		"metadata": {
			"title": "Expanding our Microsoft collaboration: proactive and automated Zero Trust security for customers",
			"description": "Today, we are announcing four new integrations between Azure AD and Cloudflare Zero Trust that reduce risk proactively. These integrated offerings increase automation allowing security teams to focus on threats versus implementation and maintenance.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/10WAXYriIXa9EJNfKJJBTn/6a9ae01fd05e6b235a32c9736898df6a/expanding-our-collaboration-with-microsoft-proactive-and-automated-zero-trust-security-paVPKU.png"
		},
		"primary_author": {},
		"published_at": "2023-01-12T14:00:00.000+00:00",
		"slug": "expanding-our-collaboration-with-microsoft-proactive-and-automated-zero-trust-security",
		"tags": [
			{
				"id": "6PL1qd9UWWPNeHpKrVcurc",
				"name": "CIO Week",
				"slug": "cio-week"
			},
			{
				"id": "23kIyNBxzjAbQ8H2QApHlX",
				"name": "Microsoft",
				"slug": "microsoft"
			},
			{
				"id": "J61Eszqn98amrYHq4IhTx",
				"name": "Zero Trust",
				"slug": "zero-trust"
			},
			{
				"id": "V86khSc459Yi1AhTlvtY7",
				"name": "Partners",
				"slug": "partners"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			}
		],
		"title": "Expanding our Microsoft collaboration: proactive and automated Zero Trust security for customers",
		"updated_at": "2024-08-27T01:46:12.869Z",
		"url": "https://blog.cloudflare.com/expanding-our-collaboration-with-microsoft-proactive-and-automated-zero-trust-security"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}