{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"ko-kr",
		"id-id",
		"th-th"
	],
	"post": {
		"authors": [
			{
				"name": "Hannes Gerhart",
				"slug": "hannes",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4NLFewzqaiZmAizzu5u0wA/46df636c3ee8f049602ccb7768d2b44f/hannes.jpg",
				"location": "Berlin, Germany",
				"website": "https://linkedin.com/in/hannesgerhart",
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Today we’re launching Foundation DNS — our new premium DNS offering! Leverage Cloudflare DNS and ensure your domain is always globally available within milliseconds.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7LGqVwE4G20GZWc4inYW2b/eb5848989636a4a4a74996a3a99e9f03/foundation-dns.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/34R953nb1tDrQyXtp6FtI4/afb6ddc69d2be358e678e0abe9b52fe1/image4-9.png\" alt=\"Announcing Foundation DNS - Cloudflare’s new premium DNS offering\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Today, we’re announcing <b>Foundation DNS</b>, Cloudflare’s new premium DNS offering that provides unparalleled reliability, supreme performance and is able to meet the most complex requirements of infrastructure teams.</p><h2>Let’s talk money first</h2><p>When you’re signing an enterprise DNS deal, usually DNS providers request three inputs from you in order to generate a quote:</p><ul><li><p>Number of zones</p></li><li><p>Total DNS queries per month</p></li><li><p>Total DNS records across all zones</p></li></ul><p>Some are considerably more complicated and many have pricing calculators or opaque “Contact Us” pricing. Planning a budget around how you may grow brings unnecessary complexity, and we think we can do better. Why not make this even simpler? Here you go: We decided to charge Foundation DNS based on a single input for our enterprise customers: <b>Total DNS queries per month</b>. This way, we expect to save companies money and even more importantly, remove complexity from their DNS bill.</p><p>And don’t worry, just like the rest of our products, DDoS mitigation is still unmetered. There won’t be any hidden overage fees in case your nameservers are DDoS’d or the number of DNS queries exceeds your quota for a month or two.</p><h2>Why is DNS so important?</h2>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1RcHjKK6E0UAoaY32n5sso/3284ca6e0b9f862d5aaa9461d9bdd669/image1-27.png\" alt=\"\" class=\"kg-image\" width=\"800\" height=\"1236\" loading=\"lazy\"/>\n            \n            </figure><p>The <a href=\"https://www.cloudflare.com/learning/dns/what-is-dns/\">Domain Name System (DNS)</a> is nearly as old as the Internet itself. It was originally defined in <a href=\"https://datatracker.ietf.org/doc/html/rfc882\">RFC882</a> and <a href=\"https://datatracker.ietf.org/doc/html/rfc883\">RFC883</a> in 1983 out of the need to create a mapping between hostnames and IP addresses. Back then, the authors wisely stated: “<i>[The Internet] is a large system and is likely to grow much larger.</i>” [<a href=\"https://datatracker.ietf.org/doc/html/rfc882\">RFC882</a>]. Today there are almost 160 Million domain names just under the .com, one of the largest Top Level Domains (TLD) [<a href=\"https://www.verisign.com/en_US/channel-resources/domain-registry-products/zone-file/index.xhtml\">source</a>].</p><p>By design, DNS is a hierarchical and highly distributed system, but as an end user you usually only communicate with a resolver (1) that is either assigned or operated by your Internet Service Provider (ISP) or directly configured by your employer or yourself. The resolver communicates with one of the root servers (2), the responsible TLD server (3) and the authoritative nameserver (4) of the domain in question. In many cases all of these four parties are operated by a different entity and located in different regions, maybe even continents.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5kSCksXv3eQ1TM6oBjkwAU/445957644b6c7a0020a75db3b7cdde18/image6-5.png\" alt=\"\" class=\"kg-image\" width=\"1902\" height=\"1206\" loading=\"lazy\"/>\n            \n            </figure><p>As we have seen in the <a href=\"/october-2021-facebook-outage/\">recent past</a>, if your DNS infrastructure goes down you are in serious trouble, and it likely will cost you a lot of money and potentially damage your reputation. So as a domain owner you want that DNS lookups to your domain are answered 100% of the time and ideally as quickly as possible. So what can you do? You cannot influence which resolver your users have configured. You cannot influence the root server. You can choose which TLD server is involved by picking a domain name with the respective TLD. But if you are bound to a certain TLD for other reasons then that is out of your control as well. What you can easily influence is the provider for your authoritative nameservers. So let’s take a closer look at Cloudflare’s authoritative DNS offering.</p><h2>A look at Cloudflare’s Authoritative DNS</h2><p>Authoritative DNS is one of our <a href=\"/robust-free-dns/\">oldest products</a>, and we have spent a lot of time making it great. All DNS queries are answered from our global anycast network with a presence in more than 250 cities. This way we can deliver supreme performance while always guaranteeing global availability. And of course, we leverage our extensive experience in mitigating DDoS attacks to prevent anyone from knocking down our nameservers and with that the domains of our customers.</p><p>DNS is critically important to Cloudflare because up until the release of <a href=\"https://www.cloudflare.com/magic-transit/\">Magic Transit</a>, DNS was how every user on the Internet was directed to Cloudflare to protect and accelerate our customer’s applications. If our DNS answers were slow, Cloudflare was slow. If our DNS answers were unavailable, Cloudflare was unavailable. Speed and reliability of our authoritative DNS is paramount to the speed and reliability of Cloudflare, as it is to our customers. We have also had our customers push our DNS infrastructure as they’ve grown with Cloudflare. Today our largest customer zone has more than 3 million records and the top 5 are reaching almost 10 million records combined. Those customers rely on Cloudflare to push new DNS record updates to our edge in seconds, not minutes. Due to this importance and our customer’s needs, over the years we have grown our dedicated DNS engineering team focused on keeping our <a href=\"/how-we-made-our-dns-stack-3x-faster/\">DNS stack fast and reliable</a>.</p><p>The security of the DNS ecosystem is also important. Cloudflare has always been a proponent of <a href=\"/dnssec-an-introduction/\">DNSSEC</a>. Signing and validating DNS answers through DNSSEC ensures that an on-path attacker <a href=\"/bgp-leaks-and-crypto-currencies/\">cannot hijack answers and redirect traffic</a>. Cloudflare has always offered DNSSEC for free on all plan levels, and it will continue to be a no charge option for Foundation DNS. For customers who also choose to use Cloudflare as a <a href=\"https://www.cloudflare.com/learning/dns/glossary/what-is-a-domain-name-registrar/\">registrar</a>, <a href=\"/one-click-dnssec-with-cloudflare-registrar/\">simple one-click deployment of DNSSEC</a> is another key feature that ensures our customers&#39; domains are not hijacked, and their users are protected. We support <a href=\"https://datatracker.ietf.org/doc/html/rfc8078\">RFC 8078</a> for <a href=\"/automatically-provision-and-maintain-dnssec/\">one-click deployment on external registrars</a> as well.</p><p>But there are other issues that can bring parts of the Internet to a halt and these are mostly out of our control: <a href=\"/route-leak-detection/\">route leaks</a> or even worse <a href=\"https://isbgpsafeyet.com/#whats-a-bgp-hijack\">route hijacking</a>. While DNSSEC can help with mitigating route hijacks, unfortunately not all recursive resolvers will <a href=\"https://stats.labs.apnic.net/dnssec\">validate DNSSEC</a>. And even if the resolver does validate, a route leak or hijack to your nameservers will still result in downtime. If all your nameserver IPs are affected by such an event, your domain becomes unresolvable.</p><p>With many providers each of your nameservers usually resolves to only one IPv4 and one IPv6 address. If that IP address is not reachable — for example because of network congestion or, even worse, a route leak — the entire nameserver becomes unavailable leading to your domain becoming unresolvable. Even worse, some providers even use the same IP subnet for all their nameservers. So if there is an issue with that subnet all nameservers are down.</p><p>Let’s take a look at an example:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ dig aws.com ns +short              \nns-1500.awsdns-59.org.\nns-164.awsdns-20.com.\nns-2028.awsdns-61.co.uk.\nns-917.awsdns-50.net.\n\n$ dig ns-1500.awsdns-59.org. +short\n205.251.197.220\n$ dig ns-164.awsdns-20.com. +short\n205.251.192.164\n$ dig ns-2028.awsdns-61.co.uk. +short\n205.251.199.236\n$ dig ns-917.awsdns-50.net. +short\n205.251.195.149</pre></code>\n            <p>All nameserver IPs are part of <code>205.251.192.0/21</code>. Thankfully, <a href=\"https://aws.amazon.com/blogs/networking-and-content-delivery/how-aws-is-helping-to-secure-internet-routing/\">AWS is now signing their ranges</a> through <a href=\"https://isbgpsafeyet.com/#what-is-rpki\">RPKI</a> and this makes it less likely to leak… provided that the resolver ISP is validating RPKI. But if the resolver ISP does not validate RPKI and should this subnet be leaked or hijacked, resolvers wouldn’t be able to reach any of the nameservers and aws.com would become unresolvable.</p><p>It goes without saying that Cloudflare signs all of our routes and are <a href=\"https://isbgpsafeyet.com/\">pushing the rest of the Internet</a> to minimize the impact of route leaks, but what else can we do to ensure that our DNS systems remain resilient through route leaks while we wait for RPKI to be ubiquitously deployed?</p><p>Today, when you’re using Cloudflare DNS on the Free, Pro, Business or Enterprise plan, your domain gets two nameservers of the structure <code>&lt;name&gt;.ns.cloudflare.com</code> where <code>&lt;name&gt;</code> is a random first name.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ dig isbgpsafeyet.com ns +short\ntom.ns.cloudflare.com.\nkami.ns.cloudflare.com.</pre></code>\n            <p>Now, as we learned before, in order for a domain to be available, its nameservers have to be available. This is why each of these nameservers resolves to 3 anycast IPv4 and 3 anycast IPv6 addresses.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ dig tom.ns.cloudflare.com a +short\n173.245.59.147\n108.162.193.147\n172.64.33.147\n\n$ dig tom.ns.cloudflare.com aaaa +short\n2606:4700:58::adf5:3b93\n2803:f800:50::6ca2:c193\n2a06:98c1:50::ac40:2193</pre></code>\n            <p>The essential detail to notice here is that each of the 3 IPv4 and 3 IPv6 addresses is from a different /8 IPv4 (/45 for IPv6) block. So in order for your nameservers to become unavailable via IPv4, the route leak would have to affect exactly the corresponding subnets across all three /8 IPv4 blocks. This type of event, while theoretically is possible, is virtually impossible in practical terms.</p><h3>How can this be further improved?</h3><p>Customers using Foundation DNS will be assigned a new set of advanced nameservers hosted on foundationdns.com and foundationdns.net. These nameservers will be even more resilient than the default Cloudflare nameservers. We will be announcing more details about how we’re achieving this early next year, so stay tuned. All external Cloudflare domains (such as cloudflare.com) will transition to these nameservers in the new year.</p><h2>There is even more</h2><p>We’re glad to announce that we are launching two highly requested features:</p><ul><li><p>Support for outgoing zone transfers for Secondary DNS</p></li><li><p><a href=\"https://developers.cloudflare.com/logs/about\">Logpush</a> for authoritative and secondary DNS queries</p></li></ul><p>Both of them will be available as part of Foundation DNS and to enterprise customers without any additional costs. Let’s take a closer look at each of these and see how they make our DNS offering even better.</p><h3>Support for outgoing zone transfers for Secondary DNS</h3><p>What is Secondary DNS, and why is it important? Many large enterprises have requirements to use more than one DNS provider for redundancy in case one provider becomes unavailable. They can achieve this by adding their domain’s DNS records on two independent platforms and manually keeping the zone files in sync — this is referred to as “multi-primary” setup. With Secondary DNS there are two mechanisms how this can be automated using a “primary-secondary” setup:</p><ul><li><p>DNS NOTIFY: The primary nameserver notifies the secondary on every change on the zone. Once the secondary receives the NOTIFY, it sends a zone transfer request to the primary to get in sync with it.</p></li><li><p>SOA query: Here, the secondary nameserver regularly queries the SOA record of the zone and checks if the serial number that can be found on the SOA record is the same with the latest serial number the secondary has stored in it’s SOA record of the zone. If there is a new version of the zone available, it sends a zone transfer request to the primary to get those changes.</p></li></ul><p>Alex Fattouche has written a very insightful blog post about <a href=\"/secondary-dns-deep-dive/\">how Secondary DNS works behind the scenes</a> if you want to learn more about it. Another flavor of the primary-secondary setup is to hide the primary, thus referred to as “hidden primary”. The difference of this setup is that only the secondary nameservers are authoritative — in other words configured at the domain’s registrar. The diagram below illustrates the different setups.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6EJTWFCk1W0gDjsQ0tG52h/1a09cc81bddd5aad1b86a3655ac93609/image7-2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1453\" loading=\"lazy\"/>\n            \n            </figure><p>Since 2018, we have been supporting primary-secondary setups where Cloudflare takes the role of the secondary nameserver. This means from our perspective that we are accepting incoming zone transfers from the primary nameservers.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/28isU7lACkmQqBKEcgSp0K/9aee405dfd146e61cbe2d2d8601fa2fc/image2-15.png\" alt=\"\" class=\"kg-image\" width=\"1808\" height=\"1000\" loading=\"lazy\"/>\n            \n            </figure><p>Starting today, we are now also supporting outgoing zone transfers, meaning taking the role of the primary nameserver with one or multiple external secondary nameservers receiving zone transfers from Cloudflare. Exactly as for incoming transfers, we are supporting</p><ul><li><p>zone transfers via AXFR and IXFR</p></li><li><p>automatic notifications via DNS NOTIFY to trigger zone transfers on every change</p></li><li><p>signed transfers using TSIG to ensure zone files are authenticated during transfer</p></li></ul><h3>Logpush for authoritative and secondary DNS</h3><p>Here at Cloudflare we love logs. In Q3 2021, we processed 28 Million HTTP requests per second and 13.6 Million DNS queries per second on average and blocked 76 Billion threats each day. All these events are stored as logs for a limited time frame in order to provide our users near real-time analytics in the dashboard. For those customers who want to — or have to — permanently store these logs we’ve built <a href=\"/cloudflare-logpush-the-easy-way-to-get-your-logs-to-your-cloud-storage/\">Logpush</a> back in 2019. Logpush allows you to stream logs in near real time to one of our analytics partners Microsoft Azure Sentinel, Splunk, Datadog and Sumo Logic or to any cloud storage destination with <a href=\"/introducing-r2-object-storage/\">R2</a>-compatible API.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/60ZmOi9HwfZR8x2OIouXqv/a83d4ac88ff5a92718dadf2fa17c3259/wHYBm0Y8Qwe4CD_N5DTx5nizhz61UjVh82f9V3k58VTSN_Jz73Xb_v_sGA7bTfTvNeqq63gFQN6QJypZP6aJPYDzbN8THBcGV_NWjcgqxpyTigVZAw2hlW5afs_e.png\" alt=\"\" class=\"kg-image\" width=\"983\" height=\"670\" loading=\"lazy\"/>\n            \n            </figure><p>Today, we’re adding one additional data set for Logpush: <b>DNS logs</b>. In order to configure Logpush and stream DNS logs for your domain, just head over to the <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/analytics/logs\">Cloudflare dashboard</a>, create a new Logpush job, select DNS logs and configure the log fields you’re interested in:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/33M87j3q8a6cLhpYxFELBN/340d10cabe64f69c4607683a92e75998/unnamed-8.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1434\" loading=\"lazy\"/>\n            \n            </figure><p>Check out our <a href=\"https://developers.cloudflare.com/logs/reference/log-fields/zone/dns_logs\">developer documentation</a> for detailed instructions on how to do this through the API and for a thorough description of the new DNS log fields.</p><h2>One more thing (or two…)</h2><p>When looking at the entirety of DNS within your infrastructure, it’s important to review how your traffic is flowing through your systems and how that traffic is behaving. At the end of the day, there is only so much processing power, memory, server capacity, and overall compute resources available. One of the best and important tools we have available is <a href=\"https://www.cloudflare.com/load-balancing/\">Load Balancing</a> and Health Monitoring!</p><p>Cloudflare has provided a Load Balancing solution <a href=\"/cloudflare-traffic/\">since 2016</a>, supporting customers to leverage their existing resources in a scalable and intelligent manner. But our Load Balancer was limited to A, AAAA, and CNAME records. This covered a lot of major use cases required by customers, but did not cover all of them. Many customers have more needs such as load balancing MX or email server traffic, SRV records to declare which ports and weight that respective traffic should travel across for a specific service, HTTPS records to ensure the respective traffic uses the secure protocol regardless of port and many more. We want to ensure that our customers&#39; needs are covered and support their ability to align business goals with technical implementation.</p><p>We are happy to announce that we have added additional Health Monitoring methods to support Load Balancing MX, SRV, HTTPS and TXT record traffic without any additional configuration necessary. Create your respective DNS records in Cloudflare and set your Load Balancer as the destination...it’s as easy as that! By leveraging ICMP Ping, SMTP, and UDP-ICMP methods, customers will always have a pulse on the health of their servers and be able to apply intelligent steering decisions based on the respective health information.</p><p>When thinking about intelligent steering, there is no one size fits all answer. Different businesses have different needs, especially when looking at where your servers are located around the globe, and where your customers are situated. A common rule of thumb to follow is to place servers where your customers are. This ensures they have the most performant and localized experience possible. One common scenario is to steer your traffic based on where your end-user request originates and create a mapping to the server closest to that area. Cloudflare’s geo steering capability allows our customers to do just that — easily create a mapping of regions to pools, ensuring if we see a request originate from Eastern Europe, to send that request to the proper server to suffice that request. But sometimes, regions can be quite large and lend to issues around not being able to tightly couple together that mapping as closely as one might like.</p><p>Today, we are very excited to announce country support within our Geo Steering functionality. Now, customers will be able to choose either one of our thirteen regions, or a specific country to map against their pools to give further granularity and control to how customers traffic should behave as it travels through their system. Both country-level steering and our new health monitoring methods to support load balancing more DNS records will be available in January 2022!</p><h2>Advancing the DNS Ecosystem</h2><p>Furthermore, we have some other exciting news to share: We’re finishing the work on <b>Multi-Signer DNSSEC</b> (<a href=\"https://datatracker.ietf.org/doc/html/rfc8901\">RFC8901</a>) and plan to roll this out in Q1 2022. Why is this important? Two common requirements of large enterprises are:</p><ul><li><p><b>Redundancy</b>: Having multiple DNS providers responding authoritatively for their domains</p></li><li><p><b>Authenticity</b>: Deploying DNSSEC to ensure DNS responses can be properly authenticated</p></li></ul><p>Both can be achieved by having the primary nameserver sign the domain and transfer its DNS records plus the record signatures to the secondary nameserver which will serve both as is. This setup is supported with Cloudflare Secondary DNS today. What cannot be supported when transferring pre-signed zones are non-standard DNS features like country-level steering. This is where Multi-Signer DNSSEC comes in. Both DNS providers need to know the signing keys of the other provider and perform their own online (or on-the-fly) signing. If you’re curious to learn more about how Multi-Signer DNSSEC works, go check out this <a href=\"https://blog.apnic.net/2021/08/25/multi-signer-dnssec-models/\">excellent blog post</a> published by APNIC.</p><p>Last but not least, Cloudflare is joining the <a href=\"https://www.dns-oarc.net/\">DNS Operations, Analysis, and Research Center (DNS-OARC)</a> as a gold member. Together with other researchers and operators of DNS infrastructure we want to tackle the most challenging problems and continuously work on implementing new standards and features.</p><blockquote><p><i>&quot;The DNS is a critical tool for management and delivery of content at the edge where consumers demand performance and reliability. Cloudflare is an important member of the DNS community, and have been a regular participant in OARC workshops for many years presenting their innovations and operational findings to our DNS-focused audience. It is a pleasure to now welcome them on-board as a full Member of our community, and we look forward to building upon their unique contributions as Gold OARC Members.&quot;-</i> <b>Keith Mitchell</b>, OARC President</p></blockquote><p>While we’ve been at DNS since day one of Cloudflare, we’re still just getting started. We know there are more granular and specific features our future customers will ask of us and the launch of Foundation DNS is our stake in the ground that we will continue to invest in all levels of DNS while building the most feature rich enterprise DNS platform on the planet. If you have ideas, let us know what you’ve always dreamed your DNS provider would do. If you want to help build these features, we are <a href=\"https://boards.greenhouse.io/cloudflare/jobs/3262004?gh_jid=3262004\">hiring</a>.</p>",
		"id": "5ANFeCU4Ji4Ttq59SrZXBx",
		"localeList": {
			"name": "Announcing Foundation DNS — Cloudflare’s new premium DNS offering Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "Translated for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "Translated for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Today we’re launching Foundation DNS — our new premium DNS offering! Leverage Cloudflare DNS and ensure your domain is always globally available within milliseconds.",
		"metadata": {
			"title": "Announcing Foundation DNS — Cloudflare’s new premium DNS offering",
			"description": "Today we’re launching Foundation DNS — our new premium DNS offering! Leverage Cloudflare DNS and ensure your domain is always globally available within milliseconds.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1aKWm4h47UFDJZoexeznfz/dafe63f7ea6259593f079ee79aaa556a/foundation-dns-zod0rC.png"
		},
		"primary_author": {},
		"published_at": "2021-12-08T13:58:58.000+00:00",
		"reading_time": 12,
		"slug": "foundation-dns",
		"tags": [
			{
				"id": "6PL1qd9UWWPNeHpKrVcurc",
				"name": "CIO Week",
				"slug": "cio-week"
			},
			{
				"id": "5fZHv2k9HnJ7phOPmYexHw",
				"name": "DNS",
				"slug": "dns"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			}
		],
		"title": "Announcing Foundation DNS — Cloudflare’s new premium DNS offering",
		"updated_at": "2024-08-27T01:39:45.937Z",
		"url": "https://blog.cloudflare.com/foundation-dns"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}