{
	"post": {
		"id": "6239d8fa216a93000b53cd81",
		"uuid": "0af0698f-31d7-4c24-a67b-3a4684968c18",
		"title": "Get updates on the health of your origin where you need them",
		"slug": "get-updates-on-the-health-of-your-origin-where-you-need-them",
		"html": "<figure class=\"kg-card kg-image-card\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image12-1.png\" class=\"kg-image\" alt=\"Get updates on the health of your origin where you need them\" loading=\"lazy\"></figure><p>We are thrilled to announce the availability of Health Checks in the Cloudflare Dashboard’s Notifications tab, available to all Pro, Business, and Enterprise customers. Now, you can get critical alerts on the health of your origin without checking your inbox! Keep reading to learn more about how this update streamlines notification management and unlocks countless ways to stay informed on the health of your servers.</p><h2 id=\"keeping-your-site-reliable\">Keeping your site reliable</h2><p>We first announced Health Checks when we realized some customers were setting up Load Balancers for their origins to monitor the origins’ availability and responsiveness. The Health Checks product provides a similarly powerful interface to Load Balancing, offering users the ability to ensure their origins meet criteria such as reachability, responsiveness, correct HTTP status codes, and correct HTTP body content. Customers can also receive email alerts when a Health Check finds their origin is unhealthy based on their custom criteria. In building a more focused product, we’ve added a slimmer, monitoring-based configuration, Health Check Analytics, and made it available for all paid customers. Health Checks run in multiple locations within Cloudflare’s edge network, meaning customers can monitor site performance across geographic locations.</p><h2 id=\"what-s-new-with-health-checks-notifications\">What’s new with Health Checks Notifications</h2><p>Health Checks email alerts have allowed customers to respond quickly to incidents and guarantee minimum disruption for their users. As before, Health Checks users can still select up to 20 email recipients to notify if a Health Check finds their site to be unhealthy. And if email is the right tool for your team, we’re excited to share that we have jazzed up our notification emails and added details on which Health Check triggered the notification, as well as the status of the Health Check:</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image9-1.png\" class=\"kg-image\" alt=\"New Health Checks email format with Time, Health Status, and Health Check details\" loading=\"lazy\"><figcaption><em>New Health Checks email format with Time, Health Status, and Health Check details</em></figcaption></figure><p>That being said, monitoring an inbox is not ideal for many customers needing to stay proactively informed. If email is not the communication channel your team typically relies upon, checking emails can at best be inconvenient and, at worst, allow critical updates to be missed. That's where the Notifications dashboard comes in.</p><p>Users can now create Health Checks notifications within the Cloudflare Notifications dashboard. By integrating Health Checks with Cloudflare's powerful Notification platform, we have unlocked myriad new ways to ensure customers receive critical updates for their origin health. One of the key benefits of Cloudflare's Notifications is webhooks, which give customers the flexibility to sync notifications with various external services. Webhook responses contain JSON-encoded information, allowing users to ingest them into their internal or third-party systems.</p><p>For real-time updates, users can now use webhooks to send Health Check alerts directly to their preferred instant messaging platforms such as Slack, Google Chat, or Microsoft Teams, to name a few. Beyond instant messaging, customers can also use webhooks to send Health Checks notifications to their internal APIs or their <a href=\"https://www.cloudflare.com/learning/security/what-is-siem/\">Security Information and Event Management (SIEM)</a> platforms, such as DataDog or Splunk, giving customers a single pane of glass for all Cloudflare activity, including notifications and event logs. For more on how to configure popular webhooks, <a href=\"https://developers.cloudflare.com/fundamentals/notifications/create-notifications/configure-webhooks\">check out our developer docs</a>. Below, we'll walk you through a couple of powerful webhook applications. But first, let's highlight a couple of other ways the update to Health Checks notifications improves user experience.</p><p>By including Health Checks in the Notifications tab, users need only to access one page for a single source of truth where they can manage their account notifications.  For added ease of use, users can also migrate to Notification setup directly from the Health Check creation page as well.  From within a Health Check, users will also be able to see what Notifications are tied to it.</p><p>Additionally, configuring notifications for multiple Health Checks is now simplified. Instead of configuring notifications one Health Check at a time, users can now set up notifications for multiple or even all Health Checks from a single workflow.</p><figure class=\"kg-card kg-image-card\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image6-8.png\" class=\"kg-image\" alt=\"Notification creation workflow:  Tie one or multiple Health Checks to the same notification and select notification trigger–Becomes unhealthy, Becomes healthy, or both.\" loading=\"lazy\"></figure><p>Also, users can now access Health Checks notification history, and Enterprise customers can integrate Health Checks <a href=\"https://developers.cloudflare.com/fundamentals/notifications/create-notifications/create-pagerduty\">directly with PagerDuty</a>. Last but certainly not least, as Cloudflare’s Notifications infrastructure grows in capabilities, Health Checks will be able to leverage all of these improvements. This guarantees Health Checks users the most timely and versatile notification capabilities that Cloudflare offers now and into the future.</p><h2 id=\"setting-up-a-health-checks-webhook\">Setting up a Health Checks webhook</h2><p>To get notifications for health changes at an origin, <a href=\"https://support.cloudflare.com/hc/en-us/articles/4404867308429-About-Health-Checks\">we first need to set up a Health Check for it.</a> In this example, we'll monitor HTTP responses: leave the Type and adjacent fields to their defaults. We will also monitor HTTP response codes: add `200` as an expected code, which will cause any other HTTP response code to trigger an unhealthy status.</p><figure class=\"kg-card kg-image-card\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image13.png\" class=\"kg-image\" alt=\"Health Check creation page set to monitor HTTP response codes with 200 as expected code.\" loading=\"lazy\"></figure><h3 id=\"creating-the-webhook-notification-policy\">Creating the webhook notification policy</h3><p>Once we’ve got our Health Check set up, we can create a webhook to link it to. Let’s start with a popular use case and send our Health Checks to a Slack channel. Before creating the webhook in the Cloudflare Notifications dashboard, we <a href=\"https://api.slack.com/messaging/webhooks\">enable webhooks in our Slack workspace and retrieve the webhook URL of the Slack channel we want to send notifications to.</a> Next, we navigate to our account’s Notifications tab to add the Slack webhook as a Destination, entering the name and URL of our webhook — the secret will populate automatically.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image2-91.png\" class=\"kg-image\" alt=\"Webhook creation page with the following user input: Webhook name, Slack webhook url, and auto-populated Secret\" loading=\"lazy\"><figcaption><em>Webhook creation page with the following user input: Webhook name, Slack webhook url, and auto-populated Secret</em></figcaption></figure><p>Once we hit <strong>Save and Test</strong>, we will receive a message in the designated Slack channel verifying that our webhook is working.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image5-23.png\" class=\"kg-image\" alt=\"Message sent in Slack via the configured webhook, verifying the webhook is working\" loading=\"lazy\"><figcaption><em>Message sent in Slack via the configured webhook, verifying the webhook is working</em></figcaption></figure><p>This webhook can now be used for any notification type available in the Notifications dashboard. To have a Health Check notification sent to this Slack channel, simply add a new Health Check notification from the Notifications dashboard, selecting the Health Check(s) to tie to this webhook and the Slack webhook we just created. And, voilà! Anytime our Health Check detects a response status code other than 200 or goes from unhealthy to healthy, this Slack channel will be notified.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image10-1.png\" class=\"kg-image\" alt=\"Health Check notification sent to Slack, indicating our server is online and Healthy.\" loading=\"lazy\"><figcaption><em>Health Check notification sent to Slack, indicating our server is online and Healthy.</em></figcaption></figure><h3 id=\"create-an-origin-health-status-page\">Create an Origin Health Status Page</h3><p>Let’s walk through another powerful webhooks implementation with Health Checks. Using the Health Check we configured in our last example, let’s create a simple status page using Cloudflare Workers and Durable Objects that stores an origin’s health, updates it upon receiving a webhook request, and displays a status page to visitors.</p><p><strong>Writing our worker</strong><br>You can find the code for this example <a href=\"https://github.com/georgethomas111/status-page\">in this GitHub repository</a>, if you want to clone it and try it out.</p><p>We’ve got our Health Check set up, and we’re ready to write our worker and durable object. To get started, we first need to <a href=\"https://developers.cloudflare.com/workers/cli-wrangler/install-update\">install</a> wrangler, our CLI tool for testing and deploying more complex worker setups.</p><!--kg-card-begin: markdown--><pre><code>$ wrangler -V\nwrangler 1.19.8\n</code></pre>\n<!--kg-card-end: markdown--><p>The examples in this blog were tested in this wrangler version.</p><p>Then, to speed up writing our worker, we will use a template to generate a project:</p><!--kg-card-begin: markdown--><pre><code>$ wrangler generate status-page [https://github.com/cloudflare/durable-objects-template](https://github.com/cloudflare/durable-objects-template)\n$ cd status-page\n</code></pre>\n<!--kg-card-end: markdown--><p>The template has a Durable Object with the name <code>Counter</code>. We’ll rename that to <code>Status</code>, as it will store and update the current state of the page.</p><p>For that, we update <code>wrangler.toml</code> to use the correct name and type, and rename the <code>Counter</code> class in <code>index.mjs</code>.</p><!--kg-card-begin: markdown--><pre><code>name = &quot;status-page&quot;\n# type = &quot;javascript&quot; is required to use the `[build]` section\ntype = &quot;javascript&quot;\nworkers_dev = true\naccount_id = &quot;&lt;Cloudflare account-id&gt;&quot;\nroute = &quot;&quot;\nzone_id = &quot;&quot;\ncompatibility_date = &quot;2022-02-11&quot;\n \n[build.upload]\n# Upload the code directly from the src directory.\ndir = &quot;src&quot;\n# The &quot;modules&quot; upload format is required for all projects that export a Durable Objects class\nformat = &quot;modules&quot;\nmain = &quot;./index.mjs&quot;\n \n[durable_objects]\nbindings = [{name = &quot;status&quot;, class_name = &quot;Status&quot;}]\n</code></pre>\n<!--kg-card-end: markdown--><p>Now, we’re ready to fill in our logic. We want to serve two different kinds of requests: one at <code>/webhook</code> that we will pass to the Notification system for updating the status, and another at <code>/</code> for a rendered status page.</p><p>First, let’s write the <code>/webhook</code> logic. We will receive a JSON object with a <code>data</code> and a <code>text</code> field. The `data` object contains the following fields:</p><!--kg-card-begin: markdown--><pre><code>time - The time when the Health Check status changed.\nstatus - The status of the Health Check.\nreason - The reason why the Health Check failed.\nname - The Health Check name.\nexpected_codes - The status code the Health Check is expecting.\nactual_code - The actual code received from the origin.\nhealth_check_id - The id of the Health Check pushing the webhook notification. \n</code></pre>\n<!--kg-card-end: markdown--><p>For the status page we are using the Health Check <code>name</code>, <code>status</code>, and <code>reason</code> (the reason a Health Check became unhealthy, if any) fields. The <code>text</code> field contains a user-friendly version of this data, but it is more complex to parse.</p><!--kg-card-begin: markdown--><pre><code> async handleWebhook(request) {\n  const json = await request.json();\n \n  // Ignore webhook test notification upon creation\n  if ((json.text || &quot;&quot;).includes(&quot;Hello World!&quot;)) return;\n \n  let healthCheckName = json.data?.name || &quot;Unknown&quot;\n  let details = {\n    status: json.data?.status || &quot;Unknown&quot;,\n    failureReason: json.data?.reason || &quot;Unknown&quot;\n  }\n  await this.state.storage.put(healthCheckName, details)\n }\n</code></pre>\n<!--kg-card-end: markdown--><p>Now that we can store status changes, we can use our state to render a status page:</p><!--kg-card-begin: markdown--><pre><code> async statusHTML() {\n  const statuses = await this.state.storage.list()\n  let statHTML = &quot;&quot;\n \n  for(let[hcName, details] of statuses) {\n   const status = details.status || &quot;&quot;\n   const failureReason = details.failureReason || &quot;&quot;\n   let hc = `&lt;p&gt;HealthCheckName: ${hcName} &lt;/p&gt;\n         &lt;p&gt;Status: ${status} &lt;/p&gt;\n         &lt;p&gt;FailureReason: ${failureReason}&lt;/p&gt; \n         &lt;br/&gt;`\n   statHTML = statHTML + hc\n  }\n \n  return statHTML\n }\n \n async handleRoot() {\n  // Default of healthy for before any notifications have been triggered\n  const statuses = await this.statusHTML()\n \n  return new Response(`\n     &lt;!DOCTYPE html&gt;\n     &lt;head&gt;\n      &lt;title&gt;Status Page&lt;/title&gt;\n      &lt;style&gt;\n       body {\n        font-family: Courier New;\n        padding-left: 10vw;\n        padding-right: 10vw;\n        padding-top: 5vh;\n       }\n      &lt;/style&gt;\n     &lt;/head&gt;\n     &lt;body&gt;\n       &lt;h1&gt;Status of Production Servers&lt;/h1&gt;\n       &lt;p&gt;${statuses}&lt;/p&gt;\n     &lt;/body&gt;\n     `,\n   {\n    headers: {\n     'Content-Type': &quot;text/html&quot;\n    }\n   })\n }\n</code></pre>\n<!--kg-card-end: markdown--><p>Then, we can direct requests to our two paths while also returning an error for invalid paths within our durable object with a <code>fetch</code> method:</p><!--kg-card-begin: markdown--><pre><code>async fetch(request) {\n  const url = new URL(request.url)\n  switch (url.pathname) {\n   case &quot;/webhook&quot;:\n    await this.handleWebhook(request);\n    return new Response()\n   case &quot;/&quot;:\n    return await this.handleRoot();\n   default:\n    return new Response('Path not found', { status: 404 })\n  }\n }\n</code></pre>\n<!--kg-card-end: markdown--><p>Finally, we can call that <code>fetch</code> method from our worker, allowing the external world to access our durable object.</p><!--kg-card-begin: markdown--><pre><code>export default {\n async fetch(request, env) {\n  return await handleRequest(request, env);\n }\n}\nasync function handleRequest(request, env) {\n let id = env.status.idFromName(&quot;A&quot;);\n let obj = env.status.get(id);\n \n return await obj.fetch(request);\n}\n</code></pre>\n<!--kg-card-end: markdown--><h3 id=\"testing-and-deploying-our-worker\">Testing and deploying our worker</h3><p>When we’re ready to deploy, it’s as simple as running the following command:</p><p><code>$ wrangler publish --new-class Status</code></p><p>To test the change, we create a webhook pointing to the path the worker was deployed to. On the Cloudflare account dashboard, navigate to Notifications &gt; Destinations, and create a webhook.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image11.png\" class=\"kg-image\" alt=\"Webhook creation page, with the following user input: name of webhook, destination URL, and optional secret is left blank.\" loading=\"lazy\"><figcaption><em>Webhook creation page, with the following user input: name of webhook, destination URL, and optional secret is left blank.</em></figcaption></figure><p>Then, while still in the Notifications dashboard, create a Health Check notification tied to the status page webhook and Health Check.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image4-26.png\" class=\"kg-image\" alt=\"Notification creation page, with the following user input: Notification name and the Webhook created in the previous step added.\" loading=\"lazy\"><figcaption><em>Notification creation page, with the following user input: Notification name and the Webhook created in the previous step added.</em></figcaption></figure><p>Before getting any updates the <code>status-page</code> worker should look like this:</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image1-103.png\" class=\"kg-image\" alt=\"Status page without updates reads: “Status of Production Servers”\" loading=\"lazy\"><figcaption><em>Status page without updates reads: “Status of Production Servers”</em></figcaption></figure><p>Webhooks get triggered when the Health Check status changes. To simulate the change of Health Check status we take the origin down, which will send an update to the worker through the webhook. This causes the status page to get updated.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image8-3.png\" class=\"kg-image\" alt=\"Status page showing the name of the Health Check as &quot;configuration-service&quot;, Status as &quot;Unhealthy&quot;, and the failure reason as &quot;TCP connection failed&quot;. \" loading=\"lazy\"><figcaption><em>Status page showing the name of the Health Check as \"configuration-service\", Status as \"Unhealthy\", and the failure reason as \"TCP connection failed\".&nbsp;</em></figcaption></figure><p>Next, we simulate a return to normal by changing the Health Check expected status back to 200. This will make the status page show the origin as healthy.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image7-3.png\" class=\"kg-image\" alt=\"Status page showing the name of the Health Check as &quot;configuration-service&quot;, Status as &quot;Healthy&quot;, and the failure reason as &quot;No failures&quot;. \" loading=\"lazy\"><figcaption><em>Status page showing the name of the Health Check as \"configuration-service\", Status as \"Healthy\", and the failure reason as \"No failures\".&nbsp;</em></figcaption></figure><p>If you add more Health Checks and tie them to the webhook durable object, you will see the data being added to your account.</p><h3 id=\"authenticating-webhook-requests\">Authenticating webhook requests</h3><p>We already have a working status page! However, anyone possessing the webhook URL would be able to forge a request, pushing arbitrary data to an externally-visible dashboard. Obviously, that’s not ideal. Thankfully, webhooks provide the ability to authenticate these requests by supplying a secret. Let’s create a new webhook that will provide a secret on every request. We can generate a secret by generating a pseudo-random UUID with Python:</p><!--kg-card-begin: markdown--><pre><code class=\"language-python\">$ python3\n&gt;&gt;&gt; import uuid\n&gt;&gt;&gt; uuid.uuid4()\nUUID('4de28cf2-4a1f-4abd-b62e-c8d69569a4d2')\n</code></pre>\n<!--kg-card-end: markdown--><p>Now we create a new webhook with the secret.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://blog.cloudflare.com/content/images/2022/03/image3-42.png\" class=\"kg-image\" alt=\"Webhook creation page, with the following user input: name of webhook, destination URL, and now with a secret added.\" loading=\"lazy\"><figcaption><em>Webhook creation page, with the following user input: name of webhook, destination URL, and now with a secret added.</em></figcaption></figure><p>We also want to provide this secret to our worker. Wrangler has a command that lets us save the secret.</p><!--kg-card-begin: markdown--><pre><code>$ wrangler secret put WEBHOOK_SECRET\nEnter the secret text you'd like assigned to the variable WEBHOOK_SECRET on the script named status-page:\n4de28cf2-4a1f-4abd-b62e-c8d69569a4d2\n? Creating the secret for script name status-page\n✨ Success! Uploaded secret WEBHOOK_SECRET.\n</code></pre>\n<!--kg-card-end: markdown--><p>Wrangler will prompt us for the secret, then provide it to our worker. Now we can check for the token upon every webhook notification, as the secret is provided by the header <code>cf-webhook-auth</code>. By checking the header’s value against our secret, we can authenticate incoming webhook notifications as genuine. To do that, we modify <code>handleWebhook</code>:</p><!--kg-card-begin: markdown--><pre><code> async handleWebhook(request) {\n  // ensure the request we receive is from the Webhook destination we created\n  // by examining its secret value, and rejecting it if it's incorrect\n  if((request.headers.get('cf-webhook-auth') != this.env.WEBHOOK_SECRET) {\n    return\n   }\n  ...old code here\n }\n</code></pre>\n<!--kg-card-end: markdown--><p>This origin health status page is just one example of the versatility of webhooks, which allowed us to leverage Cloudflare Workers and Durable Objects to support a custom Health Checks application. From highly custom use cases such as this to more straightforward, out-of-the-box solutions, pairing webhooks and Health Checks empowers users to respond to critical origin health updates effectively by delivering that information where it will be most impactful.</p><h2 id=\"migrating-to-the-notifications-dashboard\">Migrating to the Notifications Dashboard</h2><p>The Notifications dashboard is now the centralized location for most Cloudflare services. In the interest of consistency and streamlined administration, we will soon be limiting Health Checks notification setup to the Notifications dashboard.  Many existing Health Checks customers have emails configured via our legacy alerting system. Over the next three months, we will support the legacy system, giving customers time to transition their Health Checks notifications to the Notifications dashboard. Customers can expect the following timeline for the phasing out of existing Health Checks notifications:</p><ul><li>For now, customers subscribed to legacy emails will continue to receive them unchanged, so any parsing infrastructure will still work. From within a Health Check, you will see two options for configuring notifications–the legacy format and a deep link to the Notifications dashboard.</li><li>On <strong>May 24, 2022,</strong> we will disable the legacy method for the configuration of email notifications from the Health Checks dashboard.</li><li>On <strong>June 28, 2022,</strong> we will stop sending legacy emails, and adding new emails at the <code>/healthchecks</code> endpoint will no longer send email notifications.</li></ul><p>We strongly encourage all our users to migrate existing Health Checks notifications to the Notifications dashboard within this timeframe to avoid lapses in alerts.</p>",
		"comment_id": "6239d8fa216a93000b53cd81",
		"feature_image": "http://blog.cloudflare.com/content/images/2022/03/image12.png",
		"featured": false,
		"visibility": "public",
		"created_at": "2022-03-22T14:11:06.000+00:00",
		"updated_at": "2024-03-20T15:28:14.000+00:00",
		"published_at": "2022-03-22T15:08:45.000+00:00",
		"custom_excerpt": "We are thrilled to announce Health Checks availability within Cloudflare’s centralized Notification tab, available to all Pro, Business, and Enterprise customers. Now, you can get critical alerts on the health of your origin without checking your inbox!",
		"codeinjection_head": null,
		"codeinjection_foot": null,
		"custom_template": null,
		"canonical_url": null,
		"authors": [
			{
				"id": "6239daf8216a93000b53cd92",
				"name": "Darius Jankauskas",
				"slug": "darius",
				"profile_image": "http://blog.cloudflare.com/content/images/2022/03/Darius-Jankauskas.jpg",
				"cover_image": null,
				"bio": null,
				"website": null,
				"location": null,
				"facebook": null,
				"twitter": null,
				"meta_title": null,
				"meta_description": null,
				"url": "http://blog.cloudflare.com/author/darius/"
			},
			{
				"id": "6239dbaf216a93000b53cd99",
				"name": "Arielle Olache",
				"slug": "arielle",
				"profile_image": "http://blog.cloudflare.com/content/images/2022/03/20181111-144427-Original-1-.jpg",
				"cover_image": null,
				"bio": null,
				"website": null,
				"location": null,
				"facebook": null,
				"twitter": null,
				"meta_title": null,
				"meta_description": null,
				"url": "http://blog.cloudflare.com/author/arielle/"
			},
			{
				"id": "5ee399cac2524901bc7ae5e5",
				"name": "George Thomas",
				"slug": "george",
				"profile_image": "http://blog.cloudflare.com/content/images/2023/09/George-Thomas.png",
				"cover_image": null,
				"bio": "I am a systems Engineer who works at the San Francisco office. ",
				"website": null,
				"location": "San Francisco",
				"facebook": null,
				"twitter": "@georgeagain",
				"meta_title": null,
				"meta_description": null,
				"url": "http://blog.cloudflare.com/author/george/"
			}
		],
		"tags": [
			{
				"id": "6239d90e216a93000b53cd85",
				"name": "#BLOG-999",
				"slug": "hash-blog-999",
				"description": null,
				"feature_image": null,
				"visibility": "internal",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/404/"
			},
			{
				"id": "5d16450341acde0011a951ee",
				"name": "Product News",
				"slug": "product-news",
				"description": "Product News (EN)",
				"feature_image": "http://blog.cloudflare.com/content/images/2020/10/Product-News-1.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Product News",
				"meta_description": "Collection of Cloudflare blog posts tagged 'Product News'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/product-news/"
			},
			{
				"id": "5d16450341acde0011a95204",
				"name": "Developers",
				"slug": "developers",
				"description": null,
				"feature_image": "http://blog.cloudflare.com/content/images/2020/10/Developers-1.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Developers",
				"meta_description": "Collection of Cloudflare blog posts tagged 'Developers'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/developers/"
			},
			{
				"id": "5d16450341acde0011a95252",
				"name": "Serverless",
				"slug": "serverless",
				"description": null,
				"feature_image": "http://blog.cloudflare.com/content/images/2020/10/Serverless.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Serverless",
				"meta_description": "Cloudflare blog posts tagged 'serverless'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/serverless/"
			},
			{
				"id": "5d16450341acde0011a95253",
				"name": "Cloudflare Workers",
				"slug": "workers",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/workers/"
			},
			{
				"id": "60e48c195458ba01ba85eea6",
				"name": "Notifications",
				"slug": "notifications",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/notifications/"
			},
			{
				"id": "64a3e2b834124c000b00b717",
				"name": "Developer Platform",
				"slug": "developer-platform",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/developer-platform/"
			}
		],
		"primary_author": {
			"id": "6239daf8216a93000b53cd92",
			"name": "Darius Jankauskas",
			"slug": "darius",
			"profile_image": "http://blog.cloudflare.com/content/images/2022/03/Darius-Jankauskas.jpg",
			"cover_image": null,
			"bio": null,
			"website": null,
			"location": null,
			"facebook": null,
			"twitter": null,
			"meta_title": null,
			"meta_description": null,
			"url": "http://blog.cloudflare.com/author/darius/"
		},
		"primary_tag": null,
		"url": "http://blog.cloudflare.com/get-updates-on-the-health-of-your-origin-where-you-need-them/",
		"excerpt": "We are thrilled to announce Health Checks availability within Cloudflare’s centralized Notification tab, available to all Pro, Business, and Enterprise customers. Now, you can get critical alerts on the health of your origin without checking your inbox!",
		"reading_time": 11,
		"access": true,
		"comments": false,
		"og_image": "http://blog.cloudflare.com/content/images/2022/03/Get-updates-on-the-health-of-your-origin-where-you-need-them-OG-1.png",
		"og_title": null,
		"og_description": null,
		"twitter_image": "http://blog.cloudflare.com/content/images/2022/03/Get-updates-on-the-health-of-your-origin-where-you-need-them-OG.png",
		"twitter_title": null,
		"twitter_description": null,
		"meta_title": null,
		"meta_description": "We are thrilled to announce Health Checks availability within Cloudflare’s centralized Notification tab, available to all Pro, Business, and Enterprise customers. Now, you can get critical alerts on the health of your origin without checking your inbox!",
		"email_subject": null,
		"frontmatter": null,
		"feature_image_alt": null,
		"feature_image_caption": null
	},
	"locale": "en-us"
}