{
	"initialReadingTime": "14",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "John Graham-Cumming",
				"slug": "john-graham-cumming",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5vGNsXzZrtSLn2X30pnpUY/a43660c54db33a4289ab5a7d99d3d414/john-graham-cumming.jpg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "I spoke with Greg Papadopoulos, former CTO of Sun Microsystems, to discuss the origins and meaning of “The Network is the Computer,” as well as Cloudflare’s role in the evolution of the phrase. Listen to our conversation and read the transcript.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5gQfTp2tBRdw1gRkIoX0xK/c567603611770522cc5cbec9e51844a1/greg-papadopoulos.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/24iTXfPdGV9jLsY6PiWWGz/db4989471a992791f19889f725db5969/NetworkIsTheComputer-Alt2-1.png\" alt=\"\" class=\"kg-image\" width=\"1500\" height=\"1305\" loading=\"lazy\"/>\n            \n            </figure><p>I spoke with Greg Papadopoulos, former CTO of Sun Microsystems, to discuss the origins and meaning of The Network is the Computer®, as well as Cloudflare’s role in the evolution of the phrase. During our conversation, we considered the inevitability of latency, the slowness of the speed of light, and the future of Cloudflare’s newly acquired trademark. Listen to our conversation and read the full transcript below (or  <a href=\"https://watch.cloudflarestream.com/12fb9446a88db23932070498004e5f31\">click here</a> to open in a new window).</p><hr/><h4>[00:00:08]</h4><p><b>John Graham-Cumming:</b> Thank you so much for taking the time to chat with me. I&#39;ve got Greg Papadopoulos who was CTO of Sun and is currently a venture capitalist. Tell us about “The Network is the Computer.”</p><h4>[00:00:22]</h4><p><b>Greg Papadopoulos:</b> Well, from certainly a Sun perspective, the very first Sun-1 was connected via Internet protocols and at that time there was a big war about what should win from a networking point of view. And there was a dedication there that everything that we made was going to interoperate on the network over open standards, and from day one in the company, it was always that thought. It&#39;s really about the collection of these machines and how they interact with one another, and of course that puts the network in the middle of it. And then it becomes hard to, you know, where&#39;s the line? But it is one of those things that I think even if you ask most people at Sun, you go, “Okay explain to me ‘The Network is the Computer.’” It would get rather meta. People would see that phrase and sort of react to it in their own way. But it would always come back to something similar to what I had said I think in the earlier days.</p><h4>[00:01:37]</h4><p><b>Graham-Cumming:</b> I remember it very well because it was obviously plastered everywhere in Silicon Valley for a while. And it sounded incredibly cool but I was never quite sure what it meant. It sounded like it was one of those things that was super deep but I couldn&#39;t dig deep enough. But it sort of seems like this whole vision has come true because if you dial back to I think it&#39;s 2006, you wrote a blog post about how the world was only going to need five or seven or some small number of computers. And that was also linked to this as well, wasn&#39;t it?</p><h4>[00:02:05]</h4><p><b>Papadopoulos:</b> Yeah, I think as things began to evolve into what we would call cloud computing today, but that you could put substantial resources on the other side of the network and from the end user’s perspective and those could be as effective or more effective than something you&#39;d have in front of you. And so this idea that you really could provide these larger scale computing services in early days — you know, grid was the term used before cloud — but if you follow that logic, and you watch what was happening to the improvements of the network. Dave Patterson at Cal was very fond of saying in that era and in the 90s, networks are getting to the place where the desk connected to another machine is transparent to you. I mean it could be your own, in fact, somebody else&#39;s memory may in fact be closer to you than your own disk. And that&#39;s a pretty interesting thought. And so where we ended up going was really a complete realization that these things we would call servers were actually just components of this network computer. And so it was very mysterious, “The Network is the Computer,” and it actually grew into itself in this way. And I&#39;ll say looking at Cloudflare, you see this next level of scale happening. It&#39;s not just, what are those things that you build inside a data center, how do you connect to it, but in fact, it&#39;s the network that is the computer that is the network.</p><h4>[00:04:26]</h4><p><b>Graham-Cumming:</b> It&#39;s interesting though that there have been these waves of centralization and then push the computing power to the edge and the PCs at some point and then Larry Ellison came along and he was going to have this networked computer thing, and it sort of seems to swing back and forth, so where do you think we are in this swinging?</p><h4>[00:04:44]</h4><p><b>Papadopoulos:</b> You know, I don&#39;t think so much swinging. I think it&#39;s a spiral upwards and we come to a place and we look down and it looks familiar. You know, where you&#39;ll say, oh I see, here&#39;s a 3270 connected to a mainframe. Well, that looks like a browser connected to a web server. And you know, here&#39;s the device, it’s connected to the web service. And they look similar but there are some very important differences as we&#39;re traversing this helix of sorts. And if you look back, for example the 3270, it was inextricably bound to a single server that was hosted. And now our devices have really the ability to connect to any other computer on the network. And so then I think we&#39;re seeing something that looks like a pendulum there, it’s really a refactoring question on what software belongs where and how hard is it to maintain where it is, and naturally I think that the Internet protocol clearly is a peer to peer protocol, so it doesn&#39;t take sides on this. And so that we end up in one state, with more on the client or less on the client. I think it really has to do with how well we&#39;ve figured out distributed computing and how well we can deliver code in a management-free way. And that&#39;s a longer conversation.</p><h4>[00:06:35]</h4><p><b>Graham-Cumming:</b> Well, it&#39;s an interesting conversation. One thing is what you talked about with Sun Grid which then we end up with Amazon Web Services and things like that, is that there was sort of the device, be it your handheld or your laptop talking to some cloud computing, and then what Cloudflare has done with this Workers product to say, well, actually I think there&#39;s three places where code could exist. There&#39;s something you can put inside the network.</p><h4>[00:07:02]</h4><p><b>Papadopoulos:</b> Yes. And by extension that could grow to another layer too. And it goes back to, I think it&#39;s Dave Clark who I first remember saying you can get all the bandwidth you want, that&#39;s money, but you can&#39;t reduce latency. That&#39;s God, right. And so I think there are certainly things and as I see the Workers architecture, there are two things going on. There&#39;s clearly something to be said about latency there, and having distributed points of presence and getting closer to the clients. And there’s IBM with interaction there too, but it is also something that is around management of software and how we should be thinking in delivery of applications, which ultimately I believe, in the limit, become more distributed-looking than they are now. It&#39;s just that it&#39;s really hard to write distributed applications in kind of the general way we think about it.</p><h4>[00:08:18]</h4><p><b>Graham-Cumming:</b> Yes, that&#39;s one of these things isn’t it, it is exceedingly hard to actually write these things which is why I think we&#39;re going through a bit of a transition right now where people are trying to figure out where that code should actually execute and what should execute where.</p><h4>[00:08:31]</h4><p><b>Papadopoulos:</b> Yeah. You had graciously pointed out this blog from a dozen years ago on, hey this is inevitable that we&#39;re going to have this concentration of computing, for a lot of economic reasons as anything else. But it&#39;s both a hammer and a nail. You know, cloud stuff in some ways is unnatural in that why should we expect computing to get concentrated like it is. If you really look into it more deeply, I think it has to do with management and control and capital cycles and really things that are kind of on the economic and the administrative side of things, are not about what&#39;s truth and beauty and the destination for where applications should be.</p><h4>[00:09:27]</h4><p><b>Graham-Cumming:</b> And I think you also see some companies are now starting to wrestle with the economics of the cloud where they realize that they are kind of locked into their cloud provider and are paying rent kind of thing; it becomes entirely economic at that point.</p><h4>[00:09:41]</h4><p><b>Papadopoulos:</b> Well it does, and you know, this was also something I was pretty vocal about, although I got misinterpreted for a while there as being, you know, anti-cloud or something which I&#39;m not, I think I&#39;m pragmatic about it. One of the dangers is certainly as people yield particularly to SaaS products, that in fact, your data in many ways, unless you have explicit contracts and abilities to disgorge that data from that service, that data becomes more and more captive. And that&#39;s the part that I think is actually the real question here, which is like, what&#39;s the switching cost from one service to another, from one cloud to another.</p><h4>[00:10:35]</h4><p><b>Graham-Cumming:</b> Yes, absolutely. That&#39;s one of the things that we faced, one of the reasons why we worked on this thing called the Bandwidth Alliance, which is one of the ways in which stuff gets locked into clouds is the egress fee is so large that you don&#39;t want to get your data out.</p><h4>[00:10:50]</h4><p><b>Papadopoulos:</b> Exactly. And then there is always the, you know, well we have these particular features in our particular cloud that are very seductive to developers and you write to them and it&#39;s kind of hard to undo, you know, just the physics of moving things around. So what you all have been doing there is I think necessary and quite progressive. But we can do more.</p><h4>[00:11:17]</h4><p><b>Graham-Cumming:</b> Yes definitely. Just to go back to the thought about latency and bandwidth, I have a jokey pair of slides where I show the average broadband network you can buy over time and it going up, and then the change in the speed of light over the same period, which of course is entirely flat, zero progress in the speed of light. Looking back through your biography, you wrote thinking machines and I assume that fighting latency at a much shorter distance of cabling must have been interesting in those machines because of the speeds at which they were operating.</p><h4>[00:11:54]</h4><p><b>Papadopoulos:</b> Yes, it surprises most people when you say it, but you know, computer architects complain that the speed of light is really slow. And you know, Grace Hopper who is really one of the founders, the pioneers of modern programming languages and COBOL. I think she was a vice admiral. And she would walk around with a wire that was a foot long and say, “this is a nanosecond”. And that seemed pretty short for a while but, you know a nanosecond is an eternity these days.</p><h4>[00:12:40]</h4><p><b>Graham-Cumming:</b> Yes, it&#39;s an eternity. People don&#39;t quite appreciate it if they&#39;re not thinking about it, how long it is. I had someone who was new to the computing world learning about it, come to me with a book which was talking about fiber optics, and in the book it said there is a laser that flashes on and off a billion times a second to send data down the fiber optic. And he came to me and said, “This can&#39;t possibly be true; it&#39;s just too fast.”</p><h4>[00:13:09]</h4><p><b>Papadopoulos:</b> No, it&#39;s too slow!</p><h4>[00:013:12]</h4><p><b>Graham-Cumming:</b> Right? And I thought, well that’s slow. And then I stepped back and thought, you know, to the average person, that is a ridiculous statement, that somehow we humans have managed to control time at this ridiculously small level. And then we keep pushing and pushing and pushing it and people don&#39;t appreciate how fast and actually how slow the light is, really.</p><h4>[00:13:33]</h4><p><b>Papadopoulos:</b> Yeah. And I think if it actually comes down to it, if you want to get into a very pure reckoning of this is latency is the only thing that matters. And one can look at bandwidth as a component of latency, so you can see bandwidth as a serialization delay and that kind of goes back to Clark thing, you know that, yeah I can buy that, I can&#39;t bribe God on the other side so you know I&#39;m fundamentally left with this problem that we have. Thank you, Albert Einstein, right? It&#39;s kind of hopeless to think about sending information faster than that.</p><h4>[00:14:09]</h4><p><b>Graham-Cumming:</b> Yeah exactly. There’s information limits, which is driving why we have such powerful phones, because in fact the latency to the human is very low if you have it in your hand.</p><h4>[00:14:23]</h4><p><b>Papadopoulos:</b> Yes, absolutely. This is where the edge architecture and the Worker structure that you guys are working on, and I think that&#39;s where it becomes really interesting too because it gives me — you talked about earlier, well we&#39;re now introducing this new tier — but it gives me a really closer place from a latency point of view to have some intimate relationship with a device, and at the same time be well-connected to the network.</p><h4>[00:14:55]</h4><p><b>Graham-Cumming:</b> Right. And I think the other thing that is interesting about that is that your device fundamentally is an insecure thing, so you know if you put code on that thing, you can&#39;t put secrets in it, like a cryptographic secrets, because the end user has access to them. Normally you would keep that in the server somewhere, but then the other funny thing is if you have this intermediary tier which is both secure and low latency to the end user, you suddenly have a different world in which you can put secrets, you can put code that is privileged, but it can interact with the user very very rapidly because the low latency.</p><h4>[00:15:30]</h4><p><b>Papadopoulos:</b> Yeah. And that essence of where’s my trust domain. Now I&#39;ve seen all kinds of like, oh my gosh, I cannot believe somebody is doing it, like putting their S3 credentials, putting it down on a device and having it talk, you know, the log in for a database or something. You must be kidding. I mean that trust proxy point at low latency is a really key thing.</p><h4>[00:16:02]</h4><p><b>Graham-Cumming:</b> Yes, I think it&#39;s just people need to start thinking about that architecture. Is there a sort of parallel with things that were going on with very high-performance computing with sort of the massively parallel stuff and what&#39;s happening today? What lessons can we take from work done in the 70s and 80s and apply it to the Internet of today?</p><h4>[00:16:24]</h4><p><b>Papadopoulos:</b> Well, we talked about this sort of, there are a couple of fundamental issues here. And one we&#39;ve been speaking about is latency. The other one is synchronization, and this comes up in a bunch of different ways. You know, whether it&#39;s when one looks at the cap theorem kinds of things that Eric Brewer has been famous for, can I get consistency and availability and survive partitionability, all that, at the same time. And so you end up in this kind of place of—goes back to maybe Einstein a bit—but you know, knowing when things have happened and when state has been actually changed or committed is a pretty profound problem.</p><h4>[00:17:15]</h4><p><b>Graham-Cumming:</b> It is, and what order things have happened.</p><h4>[00:17:18]</h4><p><b>Papadopoulos:</b> Yes. And that order is going to be relative to an observer here as well. And so if you&#39;re insisting on some total ordering then you&#39;re insisting on slowing things down as well. And that really is fundamental. We were pushing into that in the massively parallel stuff and you&#39;ll see that at Internet scale. You know there&#39;s another thing, if I could. This is one of my greatest “aha”s about networks and it&#39;s due to a fellow at Sun, Rob Gingell, who actually ended up being chief engineer at Sun and was one of the real pioneers of the software development framework that brought Solaris forward. But Rob would talk about this thing that I label as network entropy. It&#39;s basically what happens when you connect systems to networks, what do networks kind of do to those systems? And this is a little bit of a philosophical question; it’s not a physical one. And Rob observed that over time networks have this property of wanting to decompose things into constituent parts, have those parts get specialized and then reintegrated. And so let me make that less abstract. So in the early days of connecting systems to networks, one of the natural observations were, well why don&#39;t we take the storage out of those desktop systems or server systems and put them on the other side of at least a local network and into a file server or storage server. And so you could see that computer sort of get pulled apart between its computing and its storage piece. And then that storage piece, you know in Rob’s step, that would go on and get specialized. So we had whole companies start like Network Appliances, Pure Storage, EMC. And so, you know like big pieces of industry or look the original routers were RADb you know running on workstations and you know Cisco went and took that and made that into something and so you now see this effect happen at the next scale. One of the things that really got me excited when I first saw Cloudflare a decade ago was, wow okay in those early days, well we can take a component like a network firewall and that can get pulled away and created as its own network entity and specialized. And I think one of the things, at least from my history of Cloudflare, one of the most profound things was, particularly as you guys went in and separated off these functions early on, the fear of people was this is going to introduce latency, and in fact things got faster. Figure that.</p><h4>[00:20:51]</h4><p><b>Graham-Cumming:</b> Part of that of course is caching and then there&#39;s dealing with the speed of light by being close to people. But also if you say your company makes things faster and you do all these different things including security, you are forced to optimize the whole thing to live up to the claim. Whereas if you try and chain things together, nobody&#39;s really responsible for that overall latency budget. It becomes natural that you have to do it.</p><h4>[00:21:18]</h4><p><b>Papadopoulos:</b> Yes. And you all have done it brilliantly, you know, to sort of Gingell’s view. Okay so this piece got decomposed and now specialized, meaning optimized like heck, because that&#39;s what you do. And so you can see that over and over again and you see it in terms of even Twilio or something. You know, here&#39;s a messaging service. I’m just pulling my applications apart, letting people specialize. But the final piece, and this is really the punchline. The final piece is, Rob will talk about it, the value is in the reintegration of it. And so you know what are those unifying forces that are creating, if you will, the operating system for “The Network is the Computer.” You were asking about the massively parallel scale. Well, we had an operating system we wrote for this. As you get up to the higher scale, you get into these more distributed circumstances where the complexity goes up by some important number of orders of magnitude, and now what&#39;s that reintegration? And so I come back and I look at what Cloudflare is doing here. You&#39;re entering into that phase now of actually being that re-integrator, almost that operating system for the computer that is the network.</p><h4>[00:23:06]</h4><p><b>Graham-Cumming:</b> I think that&#39;s right. We often talk about actually being an operating system on the Internet, so very similar kind of thoughts.</p><h4>[00:23:14]</h4><p><b>Papadopoulos:</b> Yes. And you know as we were talking earlier about how developers make sense of this pendulum or cycle or whatever it is. Having this idea of an operating system or of a place where I can have ground truths and trust and sort of fixed points in this are terribly important.</p><h4>[00:23:44]</h4><p><b>Graham-Cumming:</b> Absolutely. So do you have any final thoughts on, what, it must be 30 years on from when “The Network is the Computer” was a Sun trademark. Now it&#39;s a Cloudflare trademark. What&#39;s the future going to look of that slogan and who&#39;s going to trademark it in 30 years time now?</p><h4>[00:24:03]</h4><p><b>Papadopoulos:</b> Well, it could be interplanetary at that point.</p><h4>[00:24:13]</h4><p><b>Graham-Cumming:</b> Well, if you talk about the latency problems of going interplanetary, we definitely have to solve the latency.</p><h4>[00:24:18]</h4><p><b>Papadopoulos:</b> Yeah. People do understand that. They go, wow it’s like seven minutes within here and Mars, hitting close approach.</p><h4>[00:24:28]</h4><p><b>Graham-Cumming:</b> The earthly equivalent of that is New Zealand. If you speak to people from New Zealand and they come on holiday to Europe or they move to the US, they suddenly say that the Internet works so much better here. And it’s just that it&#39;s closer. Now the Australians have figured this out because Australia is actually drifting northwards so they&#39;re actually going to get within. That&#39;s going to fix it for them but New Zealand is stuck.</p><h4>[00:24:56]</h4><p><b>Papadopoulos:</b> I do ask my physicist friends for one of two things. You know, either give me a faster speed of light — so far they have not delivered — or another dimension I can cut through. Maybe we&#39;ll keep working on the latter.</p><h4>[00:25:16]</h4><p><b>Graham-Cumming:</b> All right. Well listen Greg, thank you for the conversation. Thank you for thinking about this stuff many many years ago. I think we&#39;re getting there slowly on some of this work. And yeah, good talking to you.</p><h4>[00:25:27]</h4><p><b>Papadopoulos:</b> Well, you too. And thank you for carrying the torch forward. I think everyone from Sun who listens to this, and John, and everybody should feel really proud about what part they played in the evolution of this great invention.</p><h4>[00:25:48]</h4><p><b>Graham-Cumming:</b> It&#39;s certainly the case that a tremendous amount of work was done at Sun that was really fundamental and, you know, perhaps some of that was ahead of its time but here we are.</p><h4>[00:25:57]</h4><p><b>Papadopoulos:</b> Thank you.</p><h4>[00:25:58]</h4><p><b>Graham-Cumming:</b> Thank you very much.</p><h4>[00:25:59]</h4><p><b>Papadopoulos:</b> Cheers.</p><hr/><p>Interested in hearing more? Listen to my conversations with John Gage and Ray Rothrock of Sun Microsystems:</p><ul><li><p><a href=\"/john-gage/\">John Gage</a></p></li><li><p><a href=\"/ray-rothrock/\">Ray Rothrock</a></p></li></ul><p>To learn more about <a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a>, check out the use cases below:</p><ul><li><p><a href=\"/enhancing-optimizely-with-cloudflare-workers/\">Optimizely</a> - Optimizely chose Workers when updating their experimentation platform to provide faster responses from the edge and support more experiments for their customers.</p></li><li><p><a href=\"https://www.cloudflare.com/case-studies/cordial-workers-black-friday/\">Cordial</a> - Cordial used a “stable of Workers” to do custom Black Friday load shedding as well as using it as a serverless platform for building scalable customer-facing services.</p></li><li><p><a href=\"https://www.cloudflare.com/case-studies/ao-com-when-its-time-for-a-change/\">AO.com</a> - AO.com used Workers to avoid significant code changes to their underlying platform when migrating from a legacy provider to a modern cloud backend.</p></li><li><p><a href=\"/optimising-caching-on-pwnedpasswords/\">Pwned Passwords</a> - Troy Hunt’s popular &quot;Have I Been Pwned&quot; project benefits from cache hit ratios of 94% on its Pwned Passwords API due to Workers.</p></li><li><p><a href=\"/upgrading-cloud-infrastructure-with-workers-kv/\">Timely</a> - Using Workers and Workers KV, Timely was able to safely migrate application endpoints using simple value updates to a distributed key-value store.</p></li><li><p><a href=\"/create-cloudflare-worker-bootstrap-your-cloudflare-worker/\">Quintype</a> - Quintype was an eager adopter of Workers to cache content they previously considered un-cacheable and improve the user experience of their publishing platform.</p></li></ul>",
		"id": "3GjsRZA4P5bYum0Vgwh6ik",
		"localeList": {
			"name": "The Network is the Computer: A Conversation with Greg Papadopoulos Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2019-07-11T14:01:00.000+01:00",
		"slug": "greg-papadopoulos",
		"tags": [
			{
				"id": "1U6ifhBwTuaJ2w4pjNOzNT",
				"name": "Network",
				"slug": "network"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			},
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "5cye1Bh5KxFh3pKSnX8Dsy",
				"name": "Serverless",
				"slug": "serverless"
			},
			{
				"id": "7yC3egjaynFLDqD8TT81MM",
				"name": "Brand",
				"slug": "brand"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			}
		],
		"title": "The Network is the Computer: A Conversation with Greg Papadopoulos",
		"updated_at": "2024-08-27T02:10:38.363Z",
		"url": "https://blog.cloudflare.com/greg-papadopoulos"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}