{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "16",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Lucas Pardue",
				"slug": "lucas",
				"bio": "HTTP/2, HTTP/3 and QUIC @Cloudflare. IETF QUIC WG Co-Chair. I write some words, some code and occasionally speak.",
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1k0fbniT2p2wjRfMognV4V/dca8d2e3a3e7fa4e24d7ddd9832eff1d/lucas.jpg",
				"location": "London",
				"website": null,
				"twitter": "@SimmerVigor",
				"facebook": null,
				"publiclyIndex": true
			},
			{
				"name": "Evan Rittenhouse",
				"slug": "evan-rittenhouse",
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5WO6Pe2zBvR5M9p7vnUfVn/0e1b7219e62f5464e226a91921616bff/Image_20241218_063456_435.jpeg",
				"publiclyIndex": true
			}
		],
		"excerpt": "h3i is a command line tool and Rust library designed for low-level testing and debugging of HTTP/3, which runs over QUIC.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/260wIGiNfe3xebQgH4ihCO/974a2495b393d6f632479c394e5a938d/image5.png",
		"featured": false,
		"html": "<p>Have you ever built a piece of IKEA furniture, or put together a LEGO set, by following the instructions closely and only at the end realized at some point you didn&#39;t <i>quite</i> follow them correctly? The final result might be close to what was intended, but there&#39;s a nagging thought that maybe, just maybe, it&#39;s not as rock steady or functional as it could have been.</p><p>Internet protocol specifications are instructions designed for engineers to build things. Protocol designers take great care to ensure the documents they produce are clear. The standardization process gathers consensus and review from experts in the field, to further ensure document quality. Any reasonably skilled engineer should be able to take a specification and produce a performant, reliable, and secure implementation. The Internet is central to everyone&#39;s lives, and we depend on these implementations. Any deviations from the specification can put us at risk. For example, mishandling of malformed requests can allow attacks such as <a href=\"https://en.wikipedia.org/wiki/HTTP_request_smuggling\"><u>request smuggling</u></a>.</p><p>h3i is a binary command line tool and Rust library designed for low-level testing and debugging of HTTP/3, which runs over QUIC. <a href=\"https://crates.io/crates/h3i\"><u>h3i</u></a> is free and open source as part of Cloudflare&#39;s <a href=\"https://github.com/cloudflare/quiche\"><u>quiche</u></a> project. In this post we&#39;ll explain the motivation behind developing h3i, how we use it to help develop robust and safe standards-compliant software and production systems, and how you can similarly use it to test your own software or services. If you just want to jump into how to use h3i, go to the <a href=\"#the-h3i-command-line-tool\"><u>h3i command line tool</u></a> section.</p>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"a-recap-of-quic-and-http-3\">A recap of QUIC and HTTP/3</h2>\n      <a href=\"#a-recap-of-quic-and-http-3\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p><a href=\"https://blog.cloudflare.com/http3-the-past-present-and-future/\"><u>QUIC</u></a> is a secure-by-default transport protocol that provides performance advantages compared to TCP and TLS via a more efficient handshake, along with stream multiplexing that provides <a href=\"https://en.wikipedia.org/wiki/Head-of-line_blocking\"><u>head-of-line blocking</u></a> avoidance. <a href=\"https://www.cloudflare.com/en-gb/learning/performance/what-is-http3/\"><u>HTTP/3</u></a> is an application protocol that maps HTTP semantics to QUIC, such as defining how HTTP requests and responses are assigned to individual QUIC streams.</p><p>Cloudflare has supported QUIC on our global network in some shape or form <a href=\"https://blog.cloudflare.com/http3-the-past-present-and-future/\"><u>since 2018</u></a>. We started while the <a href=\"https://ietf.org/\"><u>Internet Engineering Task Force (IETF)</u></a> was earnestly standardizing the protocol, working through early iterations and using interoperability testing and experience to help provide feedback for the standards process. We <a href=\"https://blog.cloudflare.com/quic-version-1-is-live-on-cloudflare/\"><u>launched support</u></a> for QUIC version 1 and HTTP/3 as soon as <a href=\"https://datatracker.ietf.org/doc/html/rfc9000\"><u>RFC 9000</u></a> (and its accompanying specifications) were published in 2021.</p><p>We work on the Protocols team, who own the ingress proxy into the Cloudflare network. This is essentially Cloudflare’s “front door” — HTTP requests that come to Cloudflare from the Internet pass through us first. The majority of requests are passed onwards to things like rulesets, workers, caches, or a customer origin. However, you might be surprised that many requests don&#39;t ever make it that far because they are, in some way, invalid or malformed. Servers listening on the Internet have to be robust to traffic that is not RFC compliant, whether caused by accident or malicious intent.</p><p>The Protocols team actively participates in IETF standardization work and has also helped build and maintain other Cloudflare services that leverage quiche for QUIC and HTTP/3, from the proxies that help <a href=\"https://blog.cloudflare.com/icloud-private-relay/\"><u>iCloud Private Relay</u></a> via <a href=\"https://blog.cloudflare.com/unlocking-quic-proxying-potential/\"><u>MASQUE proxying</u></a>, to replacing <a href=\"https://blog.cloudflare.com/zero-trust-warp-with-a-masque/\"><u>WARP&#39;s use of Wireguard with MASQUE</u></a>, and beyond.</p><p>Throughout all of these different use cases, it is important for us to extensively test all aspects of the protocols. A deep dive into protocol details is a blog post (or three) in its own right. So let&#39;s take a thin slice across HTTP to help illustrate the concepts.</p><p><a href=\"https://www.rfc-editor.org/rfc/rfc9110.html\"><u>HTTP Semantics</u></a> are common to all versions of HTTP — the overall architecture, terminology, and protocol aspects such as request and response messages, methods, status codes, header and trailer fields, message content, and much more. Each individual HTTP version defines how semantics are transformed into a &quot;wire format&quot; for exchange over the Internet. You can read more about HTTP/1.1 and HTTP/2 in some of our previous <a href=\"https://blog.cloudflare.com/a-primer-on-proxies/\"><u>blog</u></a> <a href=\"https://blog.cloudflare.com/technical-breakdown-http2-rapid-reset-ddos-attack/\"><u>posts</u></a>.</p><p>With HTTP/3, HTTP request and response messages are split into a series of binary frames. <a href=\"https://datatracker.ietf.org/doc/html/rfc9114#section-7.2.2\"><u>HEADERS</u></a> frames carry a representation of HTTP metadata (method, path, status code, field lines). The payload of the frame is the encoded <a href=\"https://datatracker.ietf.org/doc/html/rfc9204\"><u>QPACK</u></a> compression output. <a href=\"https://datatracker.ietf.org/doc/html/rfc9114#section-7.2.1\"><u>DATA</u></a> frames carry <a href=\"https://datatracker.ietf.org/doc/html/rfc9110#section-6.4.1\"><u>HTTP content</u></a> (aka &quot;message body&quot;). In order to exchange these frames, HTTP/3 relies on QUIC <a href=\"https://datatracker.ietf.org/doc/html/rfc9000#section-2\"><u>streams</u></a>. These provide an ordered and reliable byte stream and each have an identifier (ID) that is unique within the scope of a connection. There are <a href=\"https://datatracker.ietf.org/doc/html/rfc9000#section-2.1\"><u>four different stream types</u></a>, denominated by the two least significant bits of the ID.</p><p>As a simple example, assuming a QUIC connection has already been established, a client can make a GET request and receive a 200 OK response with an HTML body using the follow sequence:</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7vVfQ5CYaaVPVmGloRUnkI/88bd727c3526e540bd493bc15fbe904a/unnamed.png\" alt=\"\" class=\"kg-image\" width=\"1222\" height=\"1392\" loading=\"lazy\"/>\n          </figure><ol><li><p>Client allocates the first available client-initiated bidirectional QUIC stream. (The IDs start at 0, then 4, 8, 12 and so on)</p></li><li><p>Client sends the request HEADERS frame on the stream and sets the stream&#39;s <a href=\"https://datatracker.ietf.org/doc/html/rfc9000#section-19.8\"><u>FIN bit</u></a> to mark the end of stream.</p></li><li><p>Server receives the request HEADERS frame and validates it against <a href=\"https://datatracker.ietf.org/doc/html/rfc9114#section-4.1.2\"><u>RFC 9114 rules</u></a>. If accepted, it processes the request and prepares the response.</p></li><li><p>Server sends the response HEADERS frame on the same stream.</p></li><li><p>Server sends the response DATA frame on the same stream and sets the FIN bit.</p></li><li><p>Client receives the response frames and validates them. If accepted, the content is presented to the user.</p></li></ol><p>At the QUIC layer, stream data is split into STREAM frames, which are sent in QUIC packets over UDP. QUIC deals with any loss detection and recovery, helping to ensure stream data is reliable. The layer cake diagram below provides a handy comparison of how HTTP/1.1, HTTP/2 and HTTP/3 use TCP, UDP and IP.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4049UpKGn4BJcYcEXSFgWz/32143a5ba3672786639908ad96851225/image2.png\" alt=\"\" class=\"kg-image\" width=\"1590\" height=\"1130\" loading=\"lazy\"/>\n          </figure>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"background-on-testing-quic-and-http-3-at-cloudflare\">Background on testing QUIC and HTTP/3 at Cloudflare</h2>\n      <a href=\"#background-on-testing-quic-and-http-3-at-cloudflare\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>The Protocols team has a diverse set of automated test tools that exercise our ingress proxy software in order to ensure it can stand up to the deluge that the Internet can throw at it. Just like a bouncer at a nightclub front door, we need to prevent as much bad traffic as possible before it gets inside and potentially causes damage.</p><p>HTTP/2 and HTTP/3 share several concepts. When we started developing early HTTP/3 support, we&#39;d already learned a lot from production experience with HTTP/2. While HTTP/2 addressed many issues with HTTP/1.1 (especially problems like <a href=\"https://www.cgisecurity.com/lib/HTTP-Request-Smuggling.pdf\"><u>request smuggling</u></a>, caused by its ASCII-based message delineation), HTTP/2 also added complexity and new avenues for attack. Security is an ongoing process, and the Protocols team continually hardens our software and systems to threats. For example, mitigating the range of <a href=\"https://blog.cloudflare.com/on-the-recent-http-2-dos-attacks/\"><u>denial-of-service attacks</u></a> identified by Netflix in 2019, or the <a href=\"https://blog.cloudflare.com/technical-breakdown-http2-rapid-reset-ddos-attack/\"><u>HTTP/2 Rapid Reset</u></a> attacks of 2023.</p><p>For testing HTTP/2, we rely on the Python <a href=\"https://pypi.org/project/requests/\"><u>Requests</u></a> library for testing conventional HTTP exchanges. However, that mostly only exercises HEADERS and DATA frames. There are eight other frame types and a plethora of ways that they can interact (hence the new attack vectors mentioned above). In order to get full testing coverage, we have to break down into the lower layer <a href=\"https://pypi.org/project/h2/\"><u>h2</u></a> library, which allows exact frame-by-frame control. However, even that is not always enough. Libraries tend to want to follow the RFC rules and prevent their users from doing &quot;the wrong thing&quot;. This is entirely logical for most purposes. For our needs though, we need to take off the safety guards just like any potential attackers might do. We have a few cases where the best way to exercise certain traffic patterns is to handcraft HTTP/2 frames in a hex editor, store that as binary, and replay it with a tool such as <a href=\"https://docs.openssl.org/1.0.2/man1/s_client/\"><u>OpenSSL s_client</u></a>.</p><p>We knew we&#39;d need similar testing approaches for HTTP/3. However, when we started in 2018, there weren&#39;t many other suitable client implementations. The rate of iteration on the specifications also meant it was hard to always keep in sync. So we built tests on quiche, using a mix of our <a href=\"https://github.com/cloudflare/quiche/blob/master/apps/src/client.rs\"><u>quiche-client</u></a> and <a href=\"https://github.com/cloudflare/quiche/tree/master/tools/http3_test\"><u>http3_test</u></a>. Over time, the python library <a href=\"https://github.com/aiortc/aioquic\"><u>aioquic</u></a> has matured, and we have used it to add a range of lower-layer tests that break or bend HTTP/3 rules, in order to prove our proxies are robust.</p><p>Finally, we would be remiss not to mention that all the tests in our ingress proxy are <b>in addition to </b>the suite of over 500 integration tests that run on the quiche project itself.</p>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"making-http-3-testing-more-accessible-and-maintainable-with-h3i\">Making HTTP/3 testing more accessible and maintainable with h3i</h2>\n      <a href=\"#making-http-3-testing-more-accessible-and-maintainable-with-h3i\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>While we are happy with the coverage of our current tests, the smorgasbord of test tools makes it hard to know what to reach for when adding new tests. For example, we&#39;ve had cases where aioquic&#39;s safety guards prevent us from doing something, and it has needed a patch or workaround. This sort of thing requires a time investment just to debug/develop the tests.</p><p>We believe it shouldn&#39;t take a protocol or code expert to develop what are often very simple to describe tests. While it is important to provide guide rails for the majority of conventional use cases, it is also important to provide accessible methods for taking them off.</p><p>Let&#39;s consider a simple example. In HTTP/3 there is something called the control stream. It&#39;s used to exchange frames such as SETTINGS, which affect the HTTP/3 connection. RFC 9114 <a href=\"https://datatracker.ietf.org/doc/html/rfc9114#section-6.2.1\"><u>Section 6.2.1</u></a> states:</p><blockquote><p><i>Each side MUST initiate a single control stream at the beginning of the connection and send its SETTINGS frame as the first frame on this stream. If the first frame of the control stream is any other frame type, this MUST be treated as a connection error of type H3_MISSING_SETTINGS. Only one control stream per peer is permitted; receipt of a second stream claiming to be a control stream MUST be treated as a connection error of type H3_STREAM_CREATION_ERROR. The sender MUST NOT close the control stream, and the receiver MUST NOT request that the sender close the control stream. If either control stream is closed at any point, this MUST be treated as a connection error of type H3_CLOSED_CRITICAL_STREAM. Connection errors are described in Section 8.</i></p></blockquote><p>There are many tests we can conjure up just from that paragraph:</p><ol><li><p>Send a non-SETTINGS frame as the first frame on the control stream.</p></li><li><p>Open two control streams.</p></li><li><p>Open a control stream and then close it with a FIN bit.</p></li><li><p>Open a control stream and then reset it with a RESET_STREAM QUIC frame.</p></li><li><p>Wait for the peer to open a control stream and then ask for it to be reset with a STOP_SENDING QUIC frame.</p></li></ol><p>All of the above actions should cause a remote peer that has implemented the RFC properly to close the connection. Therefore, it is not in the interest of the local client or server applications to ever do these actions.</p><p>Many QUIC and HTTP/3 implementations are developed as libraries that are integrated into client or server applications. There may be an extensive set of unit or integration tests of the library checking RFC rules. However, it is also important to run the same tests on the integrated assembly of library and application, since it&#39;s all too common that an unhandled/mishandled library error can cascade to cause issues in upper layers. For instance, the HTTP/2 Rapid Reset attacks affected Cloudflare due to their <a href=\"https://blog.cloudflare.com/technical-breakdown-http2-rapid-reset-ddos-attack/#impact-on-customers\"><u>impact on how one service spoke to another</u></a>.</p><p>We&#39;ve developed h3i, a command line tool and library, to make testing more accessible and maintainable for all. We started with a client that can exercise servers, since that&#39;s what our focus has been. Future developments could support the opposite, a server that behaves in unusual ways in order to exercise clients.</p><p><b>Note: </b>h3i is <i>not</i> intended to be a production client! Its flexibility may cause issues that are not observed in other production-oriented clients. It is also not intended to be used for any type of performance testing and measurement.</p>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"the-h3i-command-line-tool\">The h3i command line tool</h2>\n      <a href=\"#the-h3i-command-line-tool\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>The primary purpose of the h3i command line tool is quick low-level debugging and exploratory testing. Rather than worrying about writing code or a test script, users can quickly run an ad-hoc client test against a target, guided by interactive prompts.</p><p>In the simplest case, you can think of h3i a bit like <a href=\"https://curl.se/\"><u>curl</u></a> but with access to some extra HTTP/3 parameters. In the example below, we issue a request to <a href=\"https://cloudflare-quic.com\"><u>https://cloudflare-quic.com</u></a>/ and receive a response.</p><div style=\"position: relative; padding-top: 70.91172214182345%;\">\n  <iframe\n    src=\"https://customer-eq7kiuol0tk9chox.cloudflarestream.com/b1dadea8189831a6220d318d688d0ef8/iframe?muted=true&preload=true&loop=true&autoplay=true&poster=https%3A%2F%2Fcustomer-eq7kiuol0tk9chox.cloudflarestream.com%2Fb1dadea8189831a6220d318d688d0ef8%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D%26height%3D600\"\n    loading=\"lazy\"\n    style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\"\n    allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\"\n    allowfullscreen=\"true\"\n  ></iframe>\n</div><p>Walking through a simple GET with h3i step-by-step:</p><ol><li><p>Grab a copy of the h3i binary either by running <code>cargo install h3i</code> or cloning the quiche source repo at <a href=\"https://github.com/cloudflare/quiche/\"><u>https://github.com/cloudflare/quiche/</u></a>. Both methods assume you have some familiarity with Rust and Cargo. See the cargo <a href=\"https://doc.rust-lang.org/book/ch14-04-installing-binaries.html\"><u>documentation</u></a> for more information.</p><ol><li><p><code>cargo install</code> will place the binary on your path, so you can then just run it by executing <code>h3i</code>.</p></li><li><p>If running from source, navigate to the quiche/h3i directory and then use <code>cargo run</code>.</p></li></ol></li><li><p>Run the binary and provide the name and port of the target server. If the port is omitted, the default value 443 is assumed. E.g, <code>cargo run cloudflare-quic.com</code></p></li><li><p>h3i then enters the action prompting phase. A series of one or more HTTP/3 actions can be queued up, such as sending frames, opening or terminating streams, or waiting on data from the server. The full set of options is documented in the <a href=\"https://github.com/cloudflare/quiche/blob/master/h3i/README.md#command-line-tool\"><u>readme</u></a>.</p><ol><li><p>The prompting interface adapts to keyboard inputs and supports tab completion.</p></li><li><p>In the example above, the <code>headers</code> action is selected, which walks through populating the fields in a HEADERS frame. It includes <a href=\"https://datatracker.ietf.org/doc/html/rfc9114#section-4.3.1\"><u>mandatory fields</u></a> from RFC 9114 for convenience. If a test requires omitting these, the <code>headers_no_pseudo</code> can be used instead.</p></li></ol></li><li><p>The <code>commit</code> prompt choice finalizes the action list and moves to the connection phase. h3i initiates a QUIC connection to the server identified in step 2. Once connected, actions are executed in order.</p></li><li><p>By default, h3i reports some limited information about the frames the server sent. To get more detailed information, the <code>RUST_LOG</code> environment can be set with either <code>debug</code> or <code>trace</code> levels.</p></li></ol>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"instant-record-and-replay-powered-by-qlog\">Instant record and replay, powered by qlog</h2>\n      <a href=\"#instant-record-and-replay-powered-by-qlog\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>It can be fun to play around with the h3i command line tool to see how different servers respond to different combinations or sequences of actions. Occasionally, you&#39;ll find a certain set that you want to run over and over again, or share with a friend or colleague. Having to manually enter the prompts repeatedly, or share screenshots of the h3i input can turn tedious. Fortunately, h3i records all the actions in a log file by default — the file path is printed immediately after h3i starts. The format of this file is based on <a href=\"https://datatracker.ietf.org/doc/html/draft-ietf-quic-qlog-main-schema\"><u>qlog</u></a>, an in-progress standard in development at the IETF for network protocol logging. It’s a perfect fit for our low-level needs.</p><p>Here&#39;s an example h3i qlog file:</p>\n            <pre class=\"language-RUST\"><code class=\"language-RUST\">{&quot;qlog_version&quot;:&quot;0.3&quot;,&quot;qlog_format&quot;:&quot;JSON-SEQ&quot;,&quot;title&quot;:&quot;h3i&quot;,&quot;description&quot;:&quot;h3i&quot;,&quot;trace&quot;:{&quot;vantage_point&quot;:{&quot;type&quot;:&quot;client&quot;},&quot;title&quot;:&quot;h3i&quot;,&quot;description&quot;:&quot;h3i&quot;,&quot;configuration&quot;:{&quot;time_offset&quot;:0.0}}}\n{\n  &quot;time&quot;: 0.172783,\n  &quot;name&quot;: &quot;http:frame_created&quot;,\n  &quot;data&quot;: {\n    &quot;stream_id&quot;: 0,\n    &quot;frame&quot;: {\n      &quot;frame_type&quot;: &quot;headers&quot;,\n      &quot;headers&quot;: [\n        {\n          &quot;name&quot;: &quot;:method&quot;,\n          &quot;value&quot;: &quot;GET&quot;\n        },\n        {\n          &quot;name&quot;: &quot;:authority&quot;,\n          &quot;value&quot;: &quot;cloudflare-quic.com&quot;\n        },\n        {\n          &quot;name&quot;: &quot;:path&quot;,\n          &quot;value&quot;: &quot;/&quot;\n        },\n        {\n          &quot;name&quot;: &quot;:scheme&quot;,\n          &quot;value&quot;: &quot;https&quot;\n        },\n        {\n          &quot;name&quot;: &quot;user-agent&quot;,\n          &quot;value&quot;: &quot;h3i&quot;\n        }\n      ]\n    }\n  },\n  &quot;fin_stream&quot;: true\n}</pre></code>\n            <p>h3i logs can be replayed using the <code>--qlog-input</code> option. You can change the target server host and port, and keep all the same actions. However, most servers will validate the :authority pseudo-header or Host header contained in a HEADERS frame. The --replay-host-override option allows changing these fields without needing to modify the file by hand.</p><p>And yes, qlog files are human-readable text in the JSON-SEQ format. So you can also just write these by hand in the first place if you like! However, if you&#39;re going to start writing things, maybe Rust is your preferred option…</p>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"using-the-h3i-library-to-send-a-malformed-request-with-rust\">Using the h3i library to send a malformed request with Rust</h2>\n      <a href=\"#using-the-h3i-library-to-send-a-malformed-request-with-rust\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>In our previous example, we just sent a valid request so there wasn&#39;t anything interesting to observe. Where h3i really shines is in generating traffic that isn&#39;t RFC compliant, such as malformed HTTP messages, invalid frame sequences, or other actions on streams. This helps determine if a server is acting robustly and defensively.</p><p>Let&#39;s explore this more with an example of HTTP content-length mismatch. RFC 9114 <a href=\"https://datatracker.ietf.org/doc/html/rfc9114#section-4.1.2\"><u>section 4.1.2</u></a> specifies:</p><blockquote><p><i>A request or response that is defined as having content when it contains a Content-Length header field (Section 8.6 of [HTTP]) is malformed if the value of the Content-Length header field does not equal the sum of the DATA frame lengths received. A response that is defined as never having content, even when a Content-Length is present, can have a non-zero Content-Length header field even though no content is included in DATA frames.</i></p><p><i>Intermediaries that process HTTP requests or responses (i.e., any intermediary not acting as a tunnel) MUST NOT forward a malformed request or response. Malformed requests or responses that are detected MUST be treated as a stream error of type H3_MESSAGE_ERROR.</i></p><p><i>For malformed requests, a server MAY send an HTTP response indicating the error prior to closing or resetting the stream.</i></p></blockquote><p>There are good reasons that the RFC is so strict about handling mismatched content lengths. They can be a vector for <a href=\"https://portswigger.net/research/http2\"><u>desynchronization attacks</u></a> (similar to request smuggling), especially when a proxy is converting inbound HTTP/3 to outbound HTTP/1.1.</p><p>We&#39;ve provided an <a href=\"https://github.com/cloudflare/quiche/blob/master/h3i/examples/content_length_mismatch.rs\"><u>example</u></a> of how to use the h3i Rust library to write a tailor-made test client that sends a mismatched content length request. It sends a Content-Length header of 5, but its body payload is “test”, which is only 4 bytes. It then waits for the server to respond, after which it explicitly closes the connection by sending a QUIC CONNECTION_CLOSE frame.</p><p>When running low-level tests, it can be interesting to also take a packet capture (<a href=\"https://en.wikipedia.org/wiki/Pcap\"><u>pcap</u></a>) and observe what is happening on the wire. Since QUIC is an encrypted transport, we&#39;ll need to use the SSLKEYLOG environment variable to capture the session keys so that tools like Wireshark can <a href=\"https://wiki.wireshark.org/TLS#using-the-pre-master-secret\"><u>decrypt and dissect</u></a>.</p><p>To follow along at home, clone a copy of the quiche repository, start a packet capture on the appropriate network interface and then run:</p>\n            <pre class=\"language-RUST\"><code class=\"language-RUST\">cd quiche/h3i\nSSLKEYLOGFILE=&quot;h3i-example.keys&quot; cargo run --example content_length_mismatch</pre></code>\n            <p>In our decrypted capture, we see the expected sequence of handshake, request, response, and then closure.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6Qkdd3h0x826tH95S61u92/5de829e018b9d3ef409a2452362fa81e/image1.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1096\" loading=\"lazy\"/>\n          </figure>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"surveying-the-example-code\">Surveying the example code</h2>\n      <a href=\"#surveying-the-example-code\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>The <a href=\"https://github.com/cloudflare/quiche/blob/master/h3i/examples/content_length_mismatch.rs\"><u>example</u></a> is a simple binary app with a <code>main()</code> entry point. Let&#39;s survey the key elements.</p><p>First, we set up an h3i configuration to a target server:</p>\n            <pre class=\"language-RUST\"><code class=\"language-RUST\">let config = Config::new()\n        .with_host_port(&quot;cloudflare-quic.com&quot;.to_string())\n        .with_idle_timeout(2000)\n        .build()\n        .unwrap();</pre></code>\n            <p>The idle timeout is a QUIC concept which tells each endpoint when it should close the connection if the connection has been idle. This prevents endpoints from spinning idly if the peer hasn’t closed the connection. h3i’s default is 30 seconds, which can be too long for tests, so we set ours to 2 seconds here.</p><p>Next, we define a set of request headers and encode them with QPACK compression, ready to put in a HEADERS frame. Note that h3i does provide a <a href=\"https://docs.rs/h3i/latest/h3i/actions/h3/fn.send_headers_frame.html\"><u>send_headers_frame</u></a> helper method which does this for you, but the example does it manually for clarity:</p>\n            <pre class=\"language-Rust\"><code class=\"language-Rust\">let headers = vec![\n        Header::new(b&quot;:method&quot;, b&quot;POST&quot;),\n        Header::new(b&quot;:scheme&quot;, b&quot;https&quot;),\n        Header::new(b&quot;:authority&quot;, b&quot;cloudflare-quic.com&quot;),\n        Header::new(b&quot;:path&quot;, b&quot;/&quot;),\n        // We say that we&#039;re going to send a body with 5 bytes...\n        Header::new(b&quot;content-length&quot;, b&quot;5&quot;),\n    ];\n\n    let header_block = encode_header_block(&amp;headers).unwrap();</pre></code>\n            <p>Then, we define the set of h3i actions that we want to execute in order: send HEADERS, send a too-short DATA frame, wait for the server&#39;s HEADERS, then close the connection.</p>\n            <pre class=\"language-Rust\"><code class=\"language-Rust\">let actions = vec![\n        Action::SendHeadersFrame {\n            stream_id: STREAM_ID,\n            fin_stream: false,\n            headers,\n            frame: Frame::Headers { header_block },\n        },\n        Action::SendFrame {\n            stream_id: STREAM_ID,\n            fin_stream: true,\n            frame: Frame::Data {\n                // ...but, in actuality, we only send 4 bytes. This should yield a\n                // 400 Bad Request response from an RFC-compliant\n                // server: https://datatracker.ietf.org/doc/html/rfc9114#section-4.1.2-3\n                payload: b&quot;test&quot;.to_vec(),\n            },\n        },\n        Action::Wait {\n            wait_type: WaitType::StreamEvent(StreamEvent {\n                stream_id: STREAM_ID,\n                event_type: StreamEventType::Headers,\n            }),\n        },\n        Action::ConnectionClose {\n            error: quiche::ConnectionError {\n                is_app: true,\n                error_code: quiche::h3::WireErrorCode::NoError as u64,\n                reason: vec![],\n            },\n        },\n    ];</pre></code>\n            <p>Finally, we&#39;ll set things in motion with <code>connect()</code>, which sets up the QUIC connection, executes the actions list and collects the summary.</p>\n            <pre class=\"language-Rust\"><code class=\"language-Rust\">let summary =\n        sync_client::connect(config, &amp;actions).expect(&quot;connection failed&quot;);\n\n    println!(\n        &quot;=== received connection summary! ===\\n\\n{}&quot;,\n        serde_json::to_string_pretty(&amp;summary).unwrap_or_else(|e| e.to_string())\n    );</pre></code>\n            <p><a href=\"https://docs.rs/h3i/latest/h3i/client/connection_summary/struct.ConnectionSummary.html\"><u>ConnectionSummary</u></a>  provides data about the connection, including the frames h3i received, details about why the connection closed, and connection statistics. The example prints the summary out. However, you can programmatically check it. We do this to write our own internal automation tests.</p><p>If you&#39;re running the example, it should print something like the following:</p>\n            <pre class=\"language-Rust\"><code class=\"language-Rust\">=== received connection summary! ===\n\n{\n  &quot;stream_map&quot;: {\n    &quot;0&quot;: [\n      {\n        &quot;UNKNOWN&quot;: {\n          &quot;raw_type&quot;: 2471591231244749708,\n          &quot;payload&quot;: &quot;&quot;\n        }\n      },\n      {\n        &quot;UNKNOWN&quot;: {\n          &quot;raw_type&quot;: 2031803309763646295,\n          &quot;payload&quot;: &quot;4752454153452069732074686520776f7264&quot;\n        }\n      },\n      {\n        &quot;enriched_headers&quot;: {\n          &quot;header_block_len&quot;: 75,\n          &quot;headers&quot;: [\n            {\n              &quot;name&quot;: &quot;:status&quot;,\n              &quot;value&quot;: &quot;400&quot;\n            },\n            {\n              &quot;name&quot;: &quot;server&quot;,\n              &quot;value&quot;: &quot;cloudflare&quot;\n            },\n            {\n              &quot;name&quot;: &quot;date&quot;,\n              &quot;value&quot;: &quot;Sat, 07 Dec 2024 00:34:12 GMT&quot;\n            },\n            {\n              &quot;name&quot;: &quot;content-type&quot;,\n              &quot;value&quot;: &quot;text/html&quot;\n            },\n            {\n              &quot;name&quot;: &quot;content-length&quot;,\n              &quot;value&quot;: &quot;155&quot;\n            },\n            {\n              &quot;name&quot;: &quot;cf-ray&quot;,\n              &quot;value&quot;: &quot;8ee06dbe2923fa17-ORD&quot;\n            }\n          ]\n        }\n      },\n      {\n        &quot;DATA&quot;: {\n          &quot;payload_len&quot;: 104\n        }\n      },\n      {\n        &quot;DATA&quot;: {\n          &quot;payload_len&quot;: 51\n        }\n      }\n    ]\n  },\n  &quot;stats&quot;: {\n    &quot;recv&quot;: 10,\n    &quot;sent&quot;: 5,\n    &quot;lost&quot;: 0,\n    &quot;retrans&quot;: 0,\n    &quot;sent_bytes&quot;: 1712,\n    &quot;recv_bytes&quot;: 4178,\n    &quot;lost_bytes&quot;: 0,\n    &quot;stream_retrans_bytes&quot;: 0,\n    &quot;paths_count&quot;: 1,\n    &quot;reset_stream_count_local&quot;: 0,\n    &quot;stopped_stream_count_local&quot;: 0,\n    &quot;reset_stream_count_remote&quot;: 0,\n    &quot;stopped_stream_count_remote&quot;: 0,\n    &quot;path_challenge_rx_count&quot;: 0\n  },\n  &quot;path_stats&quot;: [\n    {\n      &quot;local_addr&quot;: &quot;0.0.0.0:64418&quot;,\n      &quot;peer_addr&quot;: &quot;104.18.29.7:443&quot;,\n      &quot;active&quot;: true,\n      &quot;recv&quot;: 10,\n      &quot;sent&quot;: 5,\n      &quot;lost&quot;: 0,\n      &quot;retrans&quot;: 0,\n      &quot;rtt&quot;: 0.008140072,\n      &quot;min_rtt&quot;: 0.004645536,\n      &quot;rttvar&quot;: 0.004238173,\n      &quot;cwnd&quot;: 13500,\n      &quot;sent_bytes&quot;: 1712,\n      &quot;recv_bytes&quot;: 4178,\n      &quot;lost_bytes&quot;: 0,\n      &quot;stream_retrans_bytes&quot;: 0,\n      &quot;pmtu&quot;: 1350,\n      &quot;delivery_rate&quot;: 247720\n    }\n  ],\n  &quot;error&quot;: {\n    &quot;local_error&quot;: {\n      &quot;is_app&quot;: true,\n      &quot;error_code&quot;: 256,\n      &quot;reason&quot;: &quot;&quot;\n    },\n    &quot;timed_out&quot;: false\n  }\n}\n</pre></code>\n            <p>Let’s walk through the output. Up first is the <a href=\"https://docs.rs/h3i/latest/h3i/client/connection_summary/struct.StreamMap.html\"><u>StreamMap</u></a>, which is a record of all frames received on each stream. We can see that we received 5 frames on stream 0: 2 UNKNOWNs, one <a href=\"https://docs.rs/h3i/latest/h3i/frame/struct.EnrichedHeaders.html\"><u>EnrichedHeaders</u></a> frame, and two DATA frames.</p><p>The UNKNOWN frames are extension frames that are unknown to h3i; the server under test is sending what are known as <a href=\"https://datatracker.ietf.org/doc/draft-edm-protocol-greasing/\"><u>GREASE</u></a> frames to help exercise the protocol and ensure clients are not erroring when they receive something unexpected per <a href=\"https://datatracker.ietf.org/doc/html/rfc9114#extensions\"><u>RFC 9114 requirements</u></a>.</p><p>The EnrichedHeaders frame is essentially an HTTP/3 HEADERS frame, but with some small helpers, like one to get the response status code. The server under test sent a 400 as expected.</p><p>The DATA frames carry response body bytes. In this case, the body is the HTML required to render the Cloudflare Bad Request page (you can peek at the HTML yourself in Wireshark). We chose to omit the raw bytes from the ConnectionSummary since they may not be representable safely as text. A future improvement could be to encode the bytes in base64 or hex, in order to support tests that need to check response content.</p>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"h3i-for-test-automation\">h3i for test automation</h2>\n      <a href=\"#h3i-for-test-automation\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>We believe h3i is a great library for building automated tests on. You can take the above example and modify it to fit within various types of (continuous) integration tests.</p><p>We outlined earlier how the Protocols team HTTP/3 testing has organically grown to use three different frameworks. Even within those, we still didn&#39;t have much flexibility and ease of use. Over the last year we&#39;ve been building h3i itself and reimplementing our suite of ingress proxy test cases using the Rust library. This has helped us improve test coverage with a range of new tests not previously possible. It also surprisingly identified some problems with the old tests, particularly for some edge cases where it wasn&#39;t clear how the old test code implementation was running under the hood.</p>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"bake-offs-interop-and-wider-testing-of-http\">Bake offs, interop, and wider testing of HTTP</h2>\n      <a href=\"#bake-offs-interop-and-wider-testing-of-http\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p><a href=\"https://datatracker.ietf.org/doc/html/rfc1025\"><u>RFC 1025</u></a> was published in 1987. Authored by <a href=\"https://icannwiki.org/Jon_Postel\"><u>Jon Postel</u></a>, it discusses bake offs:</p><blockquote><p><i>In the early days of the development of TCP and IP, when there were very few implementations and the specifications were still evolving, the only way to determine if an implementation was &quot;correct&quot; was to test it against other implementations and argue that the results showed your own implementation to have done the right thing.  These tests and discussions could, in those early days, as likely change the specification as change the implementation.</i></p><p><i>There were a few times when this testing was focused, bringing together all known implementations and running through a set of tests in hopes of demonstrating the N squared connectivity and correct implementation of the various tricky cases.  These events were called &quot;Bake Offs&quot;.</i></p></blockquote><p>While nearly 4 decades old, the concept of exercising Internet protocol implementations and seeing how they compare to the specification still holds true. The QUIC WG made heavy use of interoperability testing through its standardization process. We started off sitting in a room and running tests manually by hand (or with some help from scripts). Then <a href=\"https://seemann.io/\"><u>Marten Seemann</u></a> developed the <a href=\"https://interop.seemann.io/\"><u>QUIC Interop Runner</u></a>, which runs regular automated testing and collects and renders all the results. This has proven to be incredibly useful.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2OGnVUbatoX8Ya2IO5RdCl/754316e004a8e658ac089e10e70b72ca/image6.png\" alt=\"\" class=\"kg-image\" width=\"1797\" height=\"780\" loading=\"lazy\"/>\n          </figure><p>The state of HTTP/3 interoperability testing is not quite as mature. Although there are tools such as <a href=\"https://kazu-yamamoto.hatenablog.jp/\"><u>Kazu Yamamoto&#39;s</u></a> excellent <a href=\"https://github.com/kazu-yamamoto/h3spec\"><u>h3spec</u></a> (in Haskell) for testing conformance, there isn&#39;t a similar continuous integration process of collection and rendering of results. While h3i shares similarities with h3spec, we felt it important to focus on the framework capabilities rather than creating a corpus of tests and assertions. Cloudflare is a big fan of Rust and as several teams move to Rust-based proxies, having a consistent ecosystem provides advantages (such as developer velocity).</p><p>We certainly feel there is a great opportunity for continued collaboration and cross-pollination between projects in the QUIC and HTTP space. For example, h3i might provide a suitable basis to build another tool (or set of scripts) to run bake offs or interop tests. Perhaps it even makes sense to have a common collection of test cases owned by the community, that can be specialized to the most appropriate or preferred tooling. This topic was recently presented at the <a href=\"https://github.com/HTTPWorkshop/workshop2024/blob/main/talks/5.%20Testing/testing.pdf\"><u>HTTP Workshop 2024</u></a> by Mohammed Al-Sahaf, and it excites us to see <a href=\"https://www.caffeinatedwonders.com/2024/12/18/towards-validated-http-implementation/\"><u>new potential directions</u></a> of testing improvements.</p><p>When using any tools or methods for protocol testing, we encourage responsible handling of security-related matters. If you believe you may have identified a vulnerability in an IETF Internet protocol itself, please follow the IETF&#39;s <a href=\"https://www.ietf.org/standards/rfcs/vulnerabilities/\"><u>reporting guidance</u></a>. If you believe you may have discovered an implementation vulnerability in a product, open source project, or service using QUIC or HTTP, then you should report these directly to the responsible party. Implementers or operators often provide their own publicly-available guidance and contact details to send reports. For example, the Cloudflare quiche <a href=\"https://github.com/cloudflare/quiche/security/policy\"><u>security policy</u></a> is available in the Security tab of the GitHub repository.</p>\n    <div class=\"flex anchor relative\">\n      <h2 id=\"summary-and-outlook\">Summary and outlook</h2>\n      <a href=\"#summary-and-outlook\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n        <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n      </a>\n    </div>\n    <p>Cloudflare takes testing very seriously. While h3i has a limited feature set as a test HTTP/3 client, we believe it provides a strong framework that can be extended to a wider range of different cases and different protocols. For example, we&#39;d like to add support for low-level HTTP/2.</p><p>We&#39;ve designed h3i to integrate into a wide range of testing methodologies, from manual ad-hoc testing, to native Rust tests, to conformance testbenches built with scripting languages. We&#39;ve had great success migrating our existing zoo of test tools to a single one that is more accessible and easier to maintain.</p><p>Now that you&#39;ve read about h3i&#39;s capabilities, it&#39;s left as an exercise to the reader to go back to the example of HTTP/3 control streams and consider how you could write tests to exercise a server.</p><p>We encourage the community to experiment with h3i and provide feedback, and propose ideas or contributions to the <a href=\"https://github.com/cloudflare/quiche\"><u>GitHub repository</u></a> as issues or Pull Requests.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5rp4YDTbXm37OxK7dtjiKF/816c0eed08926b7d34842f4769808277/image4.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"304\" loading=\"lazy\"/>\n          </figure><p></p>",
		"id": "2yX9ADcaKBprzyI9BaBoqN",
		"localeList": {
			"name": "blog-english-only",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "h3i is a command line tool and Rust library designed for low-level testing and debugging of HTTP/3, which runs over QUIC. Read about the motivation and background for h3i, along with practical examples that you can build upon for your own purposes.",
		"metadata": {
			"title": "Open sourcing h3i: a command line tool and library for low-level HTTP/3 testing and debugging",
			"description": "Read about the motivation and background for h3i, along with practical examples that you can build upon for your own purposes.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/49kGUhFhN2iZIdcgGwDL6l/9f70e5deb1d4148f41be228340633c66/Open_sourcing_h3i-_a_command_line_tool_and_library_for_low-level_HTTP_3_testing_and_debugging-OG.png"
		},
		"primary_author": {},
		"publicly_index": true,
		"published_at": "2024-12-30T14:00+00:00",
		"slug": "h3i",
		"tags": [
			{
				"id": "76HSdQ6sNz56VVQXRUhhSw",
				"name": "QUIC",
				"slug": "quic"
			},
			{
				"id": "4mFivBDCciYNedwQVKLKAg",
				"name": "HTTP3",
				"slug": "http3"
			},
			{
				"id": "2IqedHUSRwmUemBf4R5nUa",
				"name": "Testing",
				"slug": "testing"
			},
			{
				"id": "7ihMshJdu4QleFdxzaQA87",
				"name": "Protocols",
				"slug": "protocols"
			},
			{
				"id": "w4e8pkoz9c8xNDVhy9eNe",
				"name": "Rust",
				"slug": "rust"
			}
		],
		"title": "Open sourcing h3i: a command line tool and library for low-level HTTP/3 testing and debugging",
		"updated_at": "2024-12-30T14:00:03.282Z",
		"url": "https://blog.cloudflare.com/h3i"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.icon_aria_label": "Search",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"search.result_stat_empty": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong>",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"search.autocomplete_title": "Insert a query. Press enter to send",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}