{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Yingchen Wang",
				"slug": "yingchen",
				"bio": "PhD student at UTAustin, Intern at Cloudflare",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/TYUsBWsOVN0QNFfS5Q2Ya/05ed38eb6221bb0f5e87e6ae73eb7c19/yingchen.JPG",
				"location": null,
				"website": null,
				"twitter": "@YingchenWang96",
				"facebook": null
			},
			{
				"name": "Armando Faz-Hernández",
				"slug": "armfazh",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1KZECWa5TCEPjjcRmbx9iT/078177db91eaccf0591ead7e387df80a/armfazh.png",
				"location": null,
				"website": "https://research.cloudflare.com/people/armando-faz/",
				"twitter": "@armfazh",
				"facebook": null
			}
		],
		"excerpt": "Hertzbleed is a brand-new family of side-channel attacks that monitors changes on CPU frequency",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/RNX8IaKvSSAjvZrdOm0bP/3f634e19d22b830f47d2d8e0b204b3b6/hertzbleed-explained.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6wNR7nycv8hI9sGsR6x1sr/ab362a7343f775ee16c6c2bdd01e36a7/image9-8.png\" alt=\"Hertzbleed explained\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>You may have heard a bit about the <a href=\"http://hertzbleed.com\">Hertzbleed</a> attack that was recently disclosed. Fortunately, one of the student researchers who was part of the team that discovered this vulnerability and developed the attack is spending this summer with Cloudflare Research and can help us understand it better.</p><p>The first thing to note is that Hertzbleed is a new type of side-channel attack that relies on changes in CPU frequency. Hertzbleed is a real, and practical, threat to the security of cryptographic software.</p><p>Should I be worried?</p><p>From the Hertzbleed <a href=\"https://www.hertzbleed.com/\">website</a>,</p><blockquote><p><i>“If you are an ordinary user and not a cryptography engineer, probably not: you don’t need to apply a patch or change any configurations right now. If you are a cryptography engineer, read on. Also, if you are running a SIKE decapsulation server, make sure to deploy the mitigation described below.”</i></p></blockquote><p><b>Notice:</b> As of today, there is no known attack that uses Hertzbleed to target conventional and standardized cryptography, such as the encryption used in Cloudflare products and services. Having said that, let’s get into the details of processor frequency scaling to understand the core of this vulnerability.</p><p>In short, the Hertzbleed attack shows that, under certain circumstances, dynamic voltage and frequency scaling (<a href=\"https://en.wikipedia.org/wiki/Dynamic_frequency_scaling\">DVFS</a>), a power management scheme of modern x86 processors, depends on the data being processed. This means that on modern processors, the same program can run at different CPU frequencies (and therefore take different wall-clock times). For example, we expect that a CPU takes the same amount of time to perform the following two operations because it uses the same algorithm for both. However, there is an observable time difference between them:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2T8HDeM152nUJmCOzb3lD3/240da64995514f24051cb8b3444fd186/image5-15.png\" alt=\"Bit operations that perform integer additions.\" class=\"kg-image\" width=\"791\" height=\"206\" loading=\"lazy\"/>\n            \n            </figure>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Trivia: Could you guess which operation runs faster?</pre></code>\n            <p>Before giving the answer we will explain some details about how Hertzbleed works and its impact on <a href=\"https://sike.org/\">SIKE</a>, a new cryptographic algorithm designed to be computationally infeasible for an adversary to break, even for an attacker with a quantum computer.</p><h3>Frequency Scaling</h3><p>Suppose a runner is in a long distance race. To optimize the performance, the heart monitors the body all the time. Depending on the input (such as distance or oxygen absorption), it releases the appropriate hormones that will accelerate or slow down the heart rate, and as a result tells the runner to speed up or slow down a little. Just like the heart of a runner, <a href=\"https://en.wikipedia.org/wiki/Dynamic_frequency_scaling\">DVFS</a> (dynamic voltage and frequency scaling) is a monitor system for the CPU. It helps the CPU to run at its best under present conditions without being overloaded.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3v9Z8954FqPDImeLnTcfns/1c701cd915ae52a297c8dcf44ba26882/image1-55.png\" alt=\"\" class=\"kg-image\" width=\"1801\" height=\"1014\" loading=\"lazy\"/>\n            \n            </figure><p>Just as a runner’s heart causes a runner’s pace to fluctuate throughout a race depending on the level of exertion, when a CPU is running a sustained workload, DVFS modifies the CPU’s frequency from the so-called <i>steady-state frequency.</i> DVFS causes it to switch among multiple performance levels (called P-states) and oscillate among them. Modern DVFS gives the hardware almost full control to adjust the P-states it wants to execute in and the duration it stays at any P-state. These modifications are totally opaque to the user, since they are controlled by hardware and the operating system provides limited visibility and control to the end-user.</p><p>The <a href=\"https://uefi.org/specs/ACPI/6.4/index.html\">ACPI</a> specification defines <a href=\"https://uefi.org/specs/ACPI/6.4/02_Definition_of_Terms/Definition_of_Terms.html#term-P0-Performance-State\">P0 state</a> as the state the CPU runs at its maximum performance capability. Moving to higher P-states makes the CPU less performant in favor of consuming less energy and power.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2y3DvoP97XLhnO8GzYfEVF/ea1594768143ef649f3062721946f792/image4-26.png\" alt=\"CPU with oscillating P-state\" class=\"kg-image\" width=\"898\" height=\"470\" loading=\"lazy\"/>\n            \n            </figure><p>Suppose a CPU’s <i>steady-state frequency</i> is 4.0 GHz. Under DVFS, frequency can oscillate between 3.9-4.1 GHz.</p><p>How long does the CPU stay at each P-state? Most importantly, how can this even lead to a vulnerability? Excellent questions!</p><p>Modern DVFS is designed this way because CPUs have a Thermal Design Point (TDP), indicating the expected power consumption at steady state under a sustained workload. For a typical computer desktop processor, such as a Core i7-8700, the TDP is 65 W.</p><p>To continue our human running analogy: a typical person can sprint only short distances, and must run longer distances at a slower pace. When the workload is of short duration, DVFS allows the CPU to enter a high-performance state, called Turbo Boost on Intel processors. In this mode, the CPU can temporarily execute very quickly while consuming much more power than TDP allows. But when running a sustained workload, the CPU average power consumption should stay below TDP to prevent overheating. For example, as illustrated below, suppose the CPU has been free of any task for a while, the CPU runs extra hard (Turbo Boost on) when it just starts running the workload. After a while, it realizes that this workload is not a short one, so it slows down and enters steady-state. How much does it slow down? That depends on the TDP. When entering steady-state, the CPU runs at a certain speed such that its current power consumption is not above TDP.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1moCuxakiYLVgwsyWE9axJ/a1fdbf61c25dbf2b3d4c51fb01efd1bc/image7-11.png\" alt=\"CPU entering steady state after running at a higher frequency\" class=\"kg-image\" width=\"928\" height=\"470\" loading=\"lazy\"/>\n            \n            </figure><p>CPU entering steady state after running at a higher frequency.</p><p>Beyond protecting CPUs from overheating, DVFS also wants to maximize the performance. When a runner is in a marathon, she doesn&#39;t run at a fixed pace but rather her pace floats up and down a little. Remember the P-state we mentioned above? CPUs oscillate between P-states just like runners adjust their pace slightly over time. P-states are CPU frequency levels with discrete increments of 100 MHz.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7mhdAzae9l9Ne6OIJ3AilO/d4177fb608af6da17abe936ea62c3adf/image16.png\" alt=\"CPU frequency changes at discrete increments.\" class=\"kg-image\" width=\"1800\" height=\"675\" loading=\"lazy\"/>\n            \n            </figure><p>CPU frequency levels with discrete increments</p><p>The CPU can safely run at a high P-state (low frequency) all the time to stay below TDP, but there might be room between its power consumption and the TDP. To maximize CPU performance, DVFS utilizes this gap by allowing the CPU to oscillate between multiple P-states. The CPU stays at each P-state for only dozens of milliseconds, so that its temporary power consumption might exceed or fall below TDP a little, but its average power consumption is equal to TDP.</p><p>To understand this, check out this figure again.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3jaAOzM60czbPTnCp758fI/30c03a443c74e2ac441159b400a788a0/image4-27.png\" alt=\"\" class=\"kg-image\" width=\"898\" height=\"470\" loading=\"lazy\"/>\n            \n            </figure><p>If the CPU only wants to protect itself from overheating, it can run at P-state 3.9 GHz safely. However, DVFS wants to maximize the CPU performance by utilizing all available power allowed by TDP. As a result, the CPU oscillates around the P-state 4.0 GHz. It is never far above or below. When at 4.1 GHz, it overloads itself a little, it then drops to a higher P-state. When at 3.9 GHz, it recovers itself, it quickly climbs to a lower P-state. It may not stay long in any P-state, which avoids overheating when at 4.1 GHz and keeps the average power consumption near the TDP.</p><p>This is exactly how modern DVFS monitors your CPU to help it optimize power consumption while working hard.</p><p>Again, how can DVFS and TDP lead to a vulnerability? We are almost there!</p><h3>Frequency Scaling vulnerability</h3><p>The design of DVFS and TDP can be problematic because CPU power consumption is data-dependent! The Hertzbleed <a href=\"https://www.hertzbleed.com/hertzbleed.pdf\">paper</a> gives an explicit leakage model of certain operations identifying two cases.</p><p>First, the larger the number of bits set (also known as the <a href=\"https://en.wikipedia.org/wiki/Hamming_weight\">Hamming weight</a>) in the operands, the more power an operation takes. The Hamming weight effect is widely observed with no known explanation of its root cause. For example,</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1SGcJDL8vmsFY0qpnYBRWe/31171f05e19385925b15d70ab39ed987/image5-16.png\" alt=\"hamming weight\" class=\"kg-image\" width=\"791\" height=\"206\" loading=\"lazy\"/>\n            \n            </figure><p>The addition on the left will consume more power compared to the one on the right.</p><p>Similarly, when registers change their value there are power variations due to transistor switching. For example, a register switching its value from A to B (as shown in the left) requires flipping only one bit because the <a href=\"https://en.wikipedia.org/wiki/Hamming_distance\">Hamming distance</a> of A and B is 1. Meanwhile, switching from C to D will consume more energy to perform six bit transitions since the Hamming distance between C and D is 6.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6eYZFPpLM2z5oFQc0LOCGO/3decd1e0f5cb4252db4c854e912f1de2/image3-33.png\" alt=\"Hamming distance\" class=\"kg-image\" width=\"738\" height=\"252\" loading=\"lazy\"/>\n            \n            </figure><p>Hamming distance</p><p>Now we see where the vulnerability is! When running sustained workloads, CPU overall performance is capped by TDP. Under modern DVFS, it maximizes its performance by oscillating between multiple P-states. At the same time, the CPU power consumption is data-dependent. Inevitably, workloads with different power consumption will lead to different CPU P-state distribution. For example, if workload w1 consumes less power than workload w2, the CPU will stay longer in lower P-state (higher frequency) when running w1.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7rvo9VT0yhKQVwVZq2ngcS/29f47052e8859d842fac2c65e5acd555/image10-3.png\" alt=\"Different P-state distribution with different workload power consumption\" class=\"kg-image\" width=\"600\" height=\"400\" loading=\"lazy\"/>\n            \n            </figure><p>Different power consumption leads to different P-state distribution</p><p>As a result, since the power consumption is data-dependent, it follows that CPU frequency adjustments (the distribution of P-states) and execution time (as 1 Hertz = 1 cycle per second) are data-dependent too.</p><p>Consider a program that takes five cycles to finish as depicted in the following figure.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/33ZYgaR34vUpsq9EmDP94V/6f7573807b86ad2b4889009ff4056838/image8-10.png\" alt=\"Different frequency resulting in different running time with constant-cycle program\" class=\"kg-image\" width=\"957\" height=\"538\" loading=\"lazy\"/>\n            \n            </figure><p>CPU frequency directly translate to running time</p><p>As illustrated in the table below, if the program with input 1 runs at 4.0 GHz (red) then it takes 1.25 nanoseconds to finish. If the program consumes more power with input 2, under DVFS, it will run at a lower frequency, 3.5 GHz (blue). It takes more time, 1.43 nanoseconds, to finish. If the program consumes even more power with input 3, under DVFS, it will run at an even lower frequency of 3.0 GHz (purple). Now it takes 1.67 nanoseconds to finish. This program always takes five cycles to finish, but the amount of power it consumes depends on the input. The power influences the CPU frequency, and CPU frequency directly translates to execution time. In the end, the program&#39;s execution time becomes data-dependent.</p><!--kg-card-begin: html--><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-3dm3{border-color:inherit;font-family:inherit;text-align:center;vertical-align:top}\n.tg .tg-sxqf{border-color:inherit;font-family:inherit;text-align:left;vertical-align:top}\n</style>\n<table class=\"tg\" width=\"100%\">\n<thead>\n  <tr>\n    <th class=\"tg-3dm3\" colspan=\"4\">Execution time of a five cycles program</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td class=\"tg-sxqf\">Frequency</td>\n    <td class=\"tg-3dm3\">4.0 GHz</td>\n    <td class=\"tg-3dm3\">3.5 GHz</td>\n    <td class=\"tg-3dm3\">3.0 GHz</td>\n  </tr>\n  <tr>\n    <td class=\"tg-sxqf\">Execution Time</td>\n    <td class=\"tg-3dm3\">1.25 ns</td>\n    <td class=\"tg-3dm3\">1.43 ns</td>\n    <td class=\"tg-3dm3\">1.67 ns</td>\n  </tr>\n</tbody>\n</table><!--kg-card-end: html--><p>To give you another concrete example: Suppose we have a sustained workload <code><i>Foo</i></code>. We know that <code><i>Foo</i></code> consumes more power with input <code><i>data 1</i></code><i>,</i> and less power with input <code><i>data 2</i></code>. As shown on the left in the figure below, if the power consumption of <i>Foo</i> is below the TDP, CPU frequency as well as running time stays the same regardless of the choice of input data. However, as shown in the middle, if we add a background stressor to the CPU, the combined power consumption will exceed TDP. Now we are in trouble. CPU overall performance is monitored by DVFS and capped by TDP. To prevent itself from overheating, it dynamically adjusts its P-state distribution when running workload with various power consumption. P-state distribution of <code><i>Foo(data 1)</i></code> will have a slight right shift compared to that of <code><i>Foo(data 2)</i></code>. As shown on the right, CPU running <code><i>Foo(data 1)</i></code> results in a lower overall frequency and longer running time. The observation here is that, if <code><i>data</i></code> is a binary secret, an attacker can infer <code><i>data</i></code> by simply measuring the running time of <code><i>Foo</i></code>!</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/70UwC6lCoxxW6tGJ0jDXgt/4e587aab6b7743a90803cfc9c1251b78/image11-2.png\" alt=\"Detailed explanation of Hertzbleed\" class=\"kg-image\" width=\"1105\" height=\"536\" loading=\"lazy\"/>\n            \n            </figure><p>Complete recap of Hertzbleed. Figure taken from Intel’s <a href=\"https://www.intel.com/content/www/us/en/developer/articles/technical/software-security-guidance/technical-documentation/frequency-throttling-side-channel-guidance.html\">documentation</a>.</p><p>This observation is astonishing because it conflicts with our expectation of a CPU. We expect a CPU to take the same amount of time computing these two additions.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4tUqIgy4Ujj7ex8Jn2IaPb/68a463ae7dffece44a835e2884a2808c/image17-1.png\" alt=\"\" class=\"kg-image\" width=\"768\" height=\"209\" loading=\"lazy\"/>\n            \n            </figure><p>However, Hertzbleed tells us that just like a person doing math on paper, <i>a CPU not only takes more power to compute more complicated numbers but also spends more time as well!</i> This is not what a CPU should do while performing a secure computation! Because anyone that measures the CPU execution time should not be able to infer the data being computed on.</p><p>This takeaway of Hertzbleed creates a significant problem for cryptography implementations because an attacker shouldn’t be able to infer a secret from program’s running time. When developers implement a cryptographic protocol out of mathematical construction, a goal in common is to ensure constant-time execution. That is, code execution does not leak secret information via a timing channel. We have witnessed that timing attacks are practical: notable examples are those shown by <a href=\"https://link.springer.com/content/pdf/10.1007/3-540-68697-5_9.pdf\">Kocher</a>, <a href=\"https://www.usenix.org/legacy/events/sec03/tech/brumley/brumley.pdf\">Brumley-Boneh</a>, <a href=\"http://www.isg.rhul.ac.uk/tls/Lucky13.html\">Lucky13</a>, and many others. How to properly implement constant-time code is subject of extensive study.</p><p>Historically, our understanding of which operations contribute to time variation did not take DVFS into account. The Hertzbleed vulnerability derives from this oversight: any workload which differs by significant power consumption will also differ in timing. Hertzbleed proposes a new perspective on the development of secure programs: any program vulnerable to power analysis becomes potentially vulnerable to timing analysis!</p><p>Which cryptographic algorithms are vulnerable to Hertzbleed is unclear. According to the authors, a systematic study of Hertzbleed is left as future work. However, Hertzbleed was exemplified as a vector for attacking SIKE.</p><h3>Brief description of SIKE</h3><p>The Supersingular Isogeny Key Encapsulation (<a href=\"http://sike.org\">SIKE</a>) protocol is a Key Encapsulation Mechanism (KEM) finalist of the NIST Post-Quantum Cryptography competition (currently at Round 3). The building block operation of SIKE is the calculation of isogenies (transformations) between elliptic curves. You can find helpful information about the calculation of isogenies in our previous <a href=\"/towards-post-quantum-cryptography-in-tls/\">blog post</a>. In essence, calculating isogenies amounts to evaluating mathematical formulas that take as inputs points on an elliptic curve and produce other different points lying on a different elliptic curve.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1GnJu9fPINA1O4TsbSgOeS/4d0ba3818e816d7494a76d67ee2669c1/image12-1.png\" alt=\"Isogeny between elliptic curves.\" class=\"kg-image\" width=\"848\" height=\"327\" loading=\"lazy\"/>\n            \n            </figure><p>SIKE bases its security on the difficulty of computing a relationship between two elliptic curves. On the one hand, it’s easy computing this relation (called an <i>isogeny</i>) if the points that generate such isogeny (called <i>the kernel</i> of the isogeny) are known in advance. On the other hand, it’s difficult to know the isogeny given only two elliptic curves, but without knowledge of the kernel points. An attacker has no advantage if the number of possible kernel points to try is large enough to make the search infeasible (computationally intractable) even with the help of a quantum computer.</p><p>Similarly to other algorithms based on elliptic curves, such as ECDSA or ECDH, the core of SIKE is calculating operations over points on elliptic curves. As usual, points are represented by a pair of coordinates (x,y) which fulfill the elliptic curve equation</p><p>$ y^2= x^3 + Ax^2 +x $</p><p>where A is a parameter identifying different elliptic curves.</p><p>For performance reasons, SIKE uses one of the fastest elliptic curve models: the <a href=\"https://youtu.be/abStWnmvJO0?t=2684\">Montgomery</a> curves. The special property that makes these curves fast is that it allows working only with the x-coordinate of points. Hence, one can express the x-coordinate as a fraction x = X / Z, without using the y-coordinate at all. This representation simplifies the calculation of point additions, scalar multiplications, and isogenies between curves. Nonetheless, such simplicity does not come for free, and there is a price to be paid.</p><p>The formulas for point operations using Montgomery curves have some edge cases. More technically, a formula is said to be complete if for any valid input a valid output point is produced. Otherwise, a formula is not complete, meaning that there are some exceptional inputs for which it cannot produce a valid output point.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1rU9vkaAs5EWFA8ab5h29J/9816193585159b79d206194a543d74b5/image6-14.png\" alt=\"Elliptic curve formulas have some exceptional points.\" class=\"kg-image\" width=\"848\" height=\"329\" loading=\"lazy\"/>\n            \n            </figure><p>In practice, algorithms working with incomplete formulas must be designed in such a way that edge cases never occur. Otherwise, algorithms could trigger some undesired effects. Let’s take a closer look at what happens in this situation.</p><p>A subtle yet relevant property of some incomplete formulas is the nature of the output they produce when operating on points in the exceptional set. Operating with anomalous inputs, the output has both coordinates equal to zero, so X=0 and Z=0. If we recall our basics on fractions, we can figure out that there is something odd in a fraction X/Z = 0/0; furthermore it was always regarded as something not well-defined. This intuition is not wrong, something bad just happened. This fraction does not represent a valid point on the curve. In fact, it is not even a (projective) point.</p><h3>The domino effect</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3bJS447Fs1QNCfQVXiw9zy/802453f535014546c177e61d1a35ced2/image15.png\" alt=\"Domino-effect, domino pieces falling down.\" class=\"kg-image\" width=\"1223\" height=\"343\" loading=\"lazy\"/>\n            \n            </figure><p>Exploiting this subtlety of mathematical formulas makes a case for the Hertzbleed side-channel attack. In SIKE, whenever an edge case occurs at some point in the middle of its execution, it produces a domino effect that propagates the zero coordinates to subsequent computations, which means the whole algorithm is stuck on 0. As a result, the computation gets corrupted obtaining a zero at the end, but what is worse is that an attacker can use this domino effect to make guesses on the bits of secret keys.</p><p>Trying to guess one bit of the key requires the attacker to be able to trigger an exceptional case exactly at the point in which the bit is used. It looks like the attacker needs to be super lucky to trigger edge cases when it only has control of the input points. Fortunately for the attacker, the internal algorithm used in SIKE has some invariants that can help to hand-craft points in such a way that triggers an exceptional case exactly at the right point. A systematic study of all exceptional points and edge cases was, independently, shown by <a href=\"https://ia.cr/2022/054\">De Feo et al.</a> as well as in the Hertzbleed <a href=\"https://www.hertzbleed.com/hertzbleed.pdf\">article</a>.</p><p>With these tools at hand, and using the DVFS side channel, the attacker can now guess bit-by-bit the secret key by passing hand-crafted invalid input points. There are two cases an attacker can observe when the SIKE algorithm uses the secret key:</p><ul><li><p>If the bit of interest is equal to the one before it, no edge cases are present and computation proceeds normally, and the program will take the expected amount of wall-time since all the calculations are performed over random-looking data.</p></li><li><p>On the other hand, if the bit of interest is different from the one before it, the algorithm will enter the exceptional case, triggering the domino effect for the rest of the computation, and the DVFS will make the program run faster as it automatically changes the CPU’s frequency.</p></li></ul><p>Using this oracle, the attacker can query it, learning bit by bit the secret key used in SIKE.</p><p>Ok, let’s recap.</p><p>SIKE uses special formulas to speed up operations, but if these formulas are forced to hit certain edge cases then they will fail. Failing due to these edge cases not only corrupts the computation, but also makes the formulas output coordinates with zeros, which in machine representation amount to several registers all loaded with zeros. If the computation continues without noticing the presence of these edge cases, then the processor registers will be stuck on 0 for the rest of the computation. Finally, at the hardware level, some instructions can consume fewer resources if operands are zeroed. Because of that, the DVFS behind CPU power consumption can modify the CPU frequency, which alters the steady-state frequency. The ultimate result is a program that runs faster or slower depending on whether it operates with all zeros versus with random-looking data.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6yRdFcbomVv9zUyfKCrJuk/c6c243acd767b9baa931fa39f273fe02/image2-48.png\" alt=\"Hertzbleed logo, a clock with a frequency signal.\" class=\"kg-image\" width=\"1200\" height=\"250\" loading=\"lazy\"/>\n            \n            </figure><p>Hertzbleed’s authors contacted Cloudflare Research because they showed a successful attack on <a href=\"https://github.com/cloudflare/circl/\">CIRCL</a>, our optimized Go cryptographic library that includes SIKE. We worked closely with the authors to find potential mitigations in the early stages of their research. While the embargo of the disclosure was in effect, another research group including <a href=\"https://eprint.iacr.org/2022/054\">De Feo et al.</a> independently described a systematic study of the possible failures of SIKE formulas, including the same attack found by the Hertzbleed team, and pointed to a proper countermeasure. Hertzbleed borrows such a countermeasure.</p><h3>What countermeasures are available for SIKE?</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/18GNQhMYFfv81mfUYuM0zo/f6de66a21d2815dacc8ab52a15e7a77d/image13-1.png\" alt=\"Stopping the domino effect.\" class=\"kg-image\" width=\"1223\" height=\"482\" loading=\"lazy\"/>\n            \n            </figure><p>The immediate action specific for SIKE is to prevent edge cases from occurring in the first place. Most SIKE implementations provide a certain amount of leeway, assuming that inputs will not trigger exceptional cases. This is not a safe assumption. Instead, implementations should be hardened and should validate that inputs and keys are well-formed.</p><p>Enforcing a strict validation of untrusted inputs is always the recommended action. For example, a common check on elliptic curve-based algorithms is to validate that inputs correspond to points on the curve and that their coordinates are in the proper range from 0 to p-1 (as described in <a href=\"https://www.secg.org/sec1-v2.pdf\">Section 3.2.2.1</a> of SEC 1). These checks also apply to SIKE, but they are not sufficient.</p><p>What malformed inputs have in common in the case of SIKE is that input points could have arbitrary order—that is, in addition to checking that points must lie on the curve, they must also have a prescribed <a href=\"https://medium.com/asecuritysite-when-bob-met-alice/whats-the-order-in-ecc-ac8a8d5439e8\">order</a>, so they are valid. This is akin to small <a href=\"https://link.springer.com/content/pdf/10.1007/BFb0052240.pdf\">subgroup attacks</a> for the Diffie-Hellman case using finite fields. In SIKE, there are several overlapping groups in the same curve, and input points having incorrect order should be detected.</p><p>The countermeasure, originally proposed by <a href=\"https://eprint.iacr.org/2016/413\">Costello, et al.</a>, consists of verifying whether the input points are of the right full-order. To do so, we check whether an input point vanishes only when multiplied by its expected order, and not before when multiplied by smaller scalars. By doing so, the hand-crafted invalid points will not pass this validation routine, which prevents edge cases from appearing during the algorithm execution. In practice, we observed around a 5-10% performance overhead on SIKE decapsulation. The <a href=\"https://github.com/cloudflare/circl/commit/10923e8d736009130170c06c1bdbd81bee4de56c\">ciphertext validation</a> is already available in CIRCL as of version <a href=\"https://github.com/cloudflare/circl/releases/tag/v1.2.0\">v1.2.0</a>. We strongly recommend updating your projects that depend on CIRCL to this version, so you can make sure that strict validation on SIKE is in place.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/26b8CdTJXYhPhyjflDrQE4/cfc7b0be7e876da8dfd4971092d59171/image14-2.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"250\" loading=\"lazy\"/>\n            \n            </figure><h3>Closing comments</h3><p>Hertzbleed shows that certain workloads can induce changes on the frequency scaling of the processor, making programs run faster or slower. In this setting, small differences on the bit pattern of data result in observable differences on execution time. This puts a spotlight on the state-of-the-art techniques we know so far used to protect against timing attacks, and makes us rethink the measures needed to produce constant-time code and secure implementations. Defending against features like DVFS seems to be something that programmers should start to consider too.</p><p>Although SIKE was the victim this time, it is possible that other cryptographic algorithms may expose similar symptoms that can be leveraged by Hertzbleed. An investigation of other targets with this brand-new tool in the attacker’s portfolio remains an open problem.</p><p>Hertzbleed allowed us to learn more about how the machines we have in front of us work and how the processor constantly monitors itself, optimizing the performance of the system. Hardware manufacturers have focused on performance of processors by providing many optimizations, however, further study of the security of computations is also needed.</p><p>If you are excited about this project, at Cloudflare we are working on raising the bar on the production of code for cryptography. <a href=\"https://research.cloudflare.com/contact/\">Reach out to us</a> if you are interested in high-assurance tools for developers, and don’t forget our <a href=\"https://research.cloudflare.com/outreach/academic-programs/\">outreach programs</a> whether you are a student, a faculty member, or an independent researcher.</p><h3>Watch on Cloudflare TV</h3><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/803802d76afc258a95cbfe75146e8155?preload=true&poster=https%3A%2F%2Fcloudflarestream.com%2F803802d76afc258a95cbfe75146e8155%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D1m15s%26height%3D600\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div><!--kg-card-end: html-->",
		"id": "4qV3kmsxGVLixoEWEm8jBR",
		"localeList": {
			"name": "Hertzbleed explained Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Hertzbleed is a brand-new family of side-channel attacks that monitors changes on CPU frequency.",
		"metadata": {
			"title": "Hertzbleed explained",
			"description": "Hertzbleed is a brand-new family of side-channel attacks that monitors changes on CPU frequency.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/HPnPVPT1dV7ExxFYuKwEx/91731e1f48a1a46848259c7cdd29df76/hertzbleed-explained-tJbOoe.png"
		},
		"primary_author": {},
		"published_at": "2022-06-28T13:57:06.000+01:00",
		"reading_time": 15,
		"slug": "hertzbleed-explained",
		"tags": [
			{
				"id": "2UVIYusJwlvsmPYl2AvSuR",
				"name": "Deep Dive",
				"slug": "deep-dive"
			},
			{
				"id": "61CC89sTciSCCJ3fQLZoQG",
				"name": "Hertzbleed",
				"slug": "hertzbleed"
			},
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			},
			{
				"id": "3vILtHLIQU7d8BaWzXAPv4",
				"name": "Internship Experience",
				"slug": "internship-experience"
			}
		],
		"title": "Hertzbleed explained",
		"updated_at": "2024-08-27T01:27:45.608Z",
		"url": "https://blog.cloudflare.com/hertzbleed-explained"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}