{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"ko-kr",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "André Cruz",
				"slug": "andre-cruz",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/44BhO6kzQz5IiGfDAqLlOe/f24b31b19f55ca957ef98812861146dc/andre-cruz.jpg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": "@edevil",
				"facebook": null
			},
			{
				"name": "Nelson Duarte",
				"slug": "nelson-duarte",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/zaB3FkPTtktRWr9Quh4N6/3debf2a6e1928ab6a3989216d0123a75/nelson-duarte.jpg",
				"location": "Portugal",
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "At Cloudflare, we use the Workers platform and our product stack to build new services. Read how we made the new DMARC Management solution entirely on top of our APIs.\n",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3C6SZLukZv7Q3bQYTvLYjF/063f638f5aa55dd9709c3b046e88aa89/how-we-built-dmarc-management.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3P7EqcZydcPUKVhQNdVwkr/5f9643103acaa16f43c0bdff9a600910/How-we-built-DMARC-Management.png\" alt=\"How we built DMARC Management\" class=\"kg-image\" width=\"1201\" height=\"676\" loading=\"lazy\"/>\n            \n            </figure><h3>What are DMARC reports</h3><p><a href=\"https://www.cloudflare.com/en-gb/learning/dns/dns-records/dns-dmarc-record/\">DMARC</a> stands for Domain-based Message Authentication, Reporting, and Conformance. It&#39;s an email authentication protocol that helps protect against email <a href=\"https://www.cloudflare.com/learning/access-management/phishing-attack/\">phishing</a> and <a href=\"https://www.cloudflare.com/learning/email-security/what-is-email-spoofing/\">spoofing</a>.</p><p>When an email is sent, DMARC allows the domain owner to set up a DNS record that specifies which authentication methods, such as <a href=\"https://www.cloudflare.com/learning/dns/dns-records/dns-spf-record/\">SPF</a> (Sender Policy Framework) and <a href=\"https://www.cloudflare.com/learning/dns/dns-records/dns-dkim-record/\">DKIM</a> (DomainKeys Identified Mail), are used to verify the email&#39;s authenticity. When the email fails these authentication checks DMARC instructs the recipient&#39;s email provider on how to handle the message, either by quarantining it or rejecting it outright.</p><p>DMARC has become increasingly important in today&#39;s Internet, where email phishing and spoofing attacks are becoming more sophisticated and prevalent. By implementing DMARC, domain owners can protect their brand and their customers from the negative impacts of these attacks, including loss of trust, reputation damage, and financial loss.</p><p>In addition to <a href=\"https://www.cloudflare.com/learning/dns/dns-records/protect-domains-without-email/\">protecting</a> against phishing and spoofing attacks, DMARC also provides <a href=\"https://www.rfc-editor.org/rfc/rfc7489\">reporting</a> capabilities. Domain owners can receive reports on email authentication activity, including which messages passed and failed DMARC checks, as well as where these messages originated from.</p><p>DMARC management involves the configuration and maintenance of DMARC policies for a domain. Effective DMARC management requires ongoing monitoring and analysis of email authentication activity, as well as the ability to make adjustments and updates to DMARC policies as needed.</p><p>Some key components of effective DMARC management include:</p><ul><li><p>Setting up DMARC policies: This involves configuring the domain&#39;s DMARC record to specify the appropriate authentication methods and policies for handling messages that fail authentication checks. Here’s what a DMARC DNS record looks like:</p></li></ul><p><code>v=DMARC1; p=reject; rua=mailto:dmarc@example.com</code></p><p>This specifies that we are going to use DMARC version 1, our policy is to reject emails if they fail the DMARC checks, and the email address to which providers should send DMARC reports.</p><ul><li><p>Monitoring email authentication activity: DMARC reports are an important tool for domain owners to ensure <a href=\"https://www.cloudflare.com/zero-trust/products/email-security/\">email security</a> and deliverability, as well as compliance with industry standards and regulations. By regularly monitoring and analyzing DMARC reports, domain owners can <a href=\"https://www.cloudflare.com/learning/email-security/how-to-prevent-phishing/\">identify email threats</a>, optimize email campaigns, and improve overall email authentication.</p></li><li><p>Making adjustments as needed: Based on analysis of DMARC reports, domain owners may need to make adjustments to DMARC policies or authentication methods to ensure that email messages are properly authenticated and protected from phishing and spoofing attacks.</p></li><li><p>Working with email providers and third-party vendors: Effective DMARC management may require collaboration with email providers and third-party vendors to ensure that DMARC policies are being properly implemented and enforced.</p></li></ul><p>Today we launched <a href=\"/dmarc-management\">DMARC management</a>. This is how we built it.</p><h3>How we built it</h3><p>As a leading provider of cloud-based security and performance solutions, we at Cloudflare take a specific approach to test our products. We &quot;dogfood&quot; our own tools and services, which means we use them to run our business. This helps us identify any issues or bugs before they affect our customers.</p><p>We use our own products internally, such as <a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a>, a serverless platform that allows developers to run their code on our global network. Since its launch in 2017, the Workers ecosystem has grown significantly. Today, there are thousands of developers building and deploying applications on the platform. The power of the Workers ecosystem lies in its ability to enable developers to build sophisticated applications that were previously impossible or impractical to run so close to clients. Workers can be used to build APIs, generate dynamic content, optimize images, perform real-time processing, and much more. The possibilities are virtually endless. We used Workers to power services like <a href=\"/technology-behind-radar2/\">Radar 2.0</a>, or software packages like <a href=\"/welcome-to-wildebeest-the-fediverse-on-cloudflare/\">Wildebeest</a>.</p><p>Recently our <a href=\"https://developers.cloudflare.com/email-routing/\">Email Routing</a> product joined forces with Workers, enabling <a href=\"/announcing-route-to-workers/\">processing incoming emails</a> via Workers scripts. As the <a href=\"https://developers.cloudflare.com/email-routing/email-workers/\">documentation</a> states: “With Email Workers you can leverage the power of Cloudflare Workers to implement any logic you need to <a href=\"https://www.cloudflare.com/learning/email-security/what-is-email-routing/\">process your emails</a> and create complex rules. These rules determine what happens when you receive an email.” Rules and verified addresses can all be configured via our <a href=\"https://developers.cloudflare.com/api/operations/email-routing-destination-addresses-list-destination-addresses\">API</a>.</p><p>Here’s how a simple Email Worker looks like:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">export default {\n  async email(message, env, ctx) {\n    const allowList = [\"friend@example.com\", \"coworker@example.com\"];\n    if (allowList.indexOf(message.headers.get(\"from\")) == -1) {\n      message.setReject(\"Address not allowed\");\n    } else {\n      await message.forward(\"inbox@corp\");\n    }\n  }\n}</pre></code>\n            <p>Pretty straightforward, right?</p><p>With the ability to programmatically process incoming emails in place, it seemed like the perfect way to handle incoming DMARC report emails in a scalable and efficient manner, letting Email Routing and Workers do the heavy lifting of receiving an unbound number of emails from across the globe. A high level description of what we needed is:</p><ol><li><p>Receive email and extract report</p></li><li><p>Publish relevant details to analytics platform</p></li><li><p>Store the raw report</p></li></ol><p>Email Workers enable us to do #1 easily. We just need to create a worker with an email() handler. This handler will receive the <a href=\"https://www.rfc-editor.org/rfc/rfc5321\">SMTP</a> envelope elements, a pre-parsed version of the email headers, and a stream to read the entire raw email.</p><p>For #2 we can also look into the Workers platform, and we will find the <a href=\"https://developers.cloudflare.com/analytics/analytics-engine/\">Workers Analytics Engine</a>. We just need to define an appropriate schema, which depends both on what’s present in the reports and the queries we plan to do later. Afterwards we can query the data using either the <a href=\"https://developers.cloudflare.com/analytics/graphql-api/\">GraphQL</a> or <a href=\"https://developers.cloudflare.com/analytics/analytics-engine/sql-api/\">SQL</a> API.</p><p>For #3 we don’t need to look further than our <a href=\"https://www.cloudflare.com/products/r2/\">R2</a> object storage. It is <a href=\"https://developers.cloudflare.com/r2/examples/demo-worker/\">trivial</a> to access R2 from a Worker. After extracting the reports from the email we will store them in R2 for posterity.</p><p>We built this as a managed service that you can enable on your zone, and added a dashboard interface for convenience, but in reality all the tools are available for you to deploy your own DMARC reports processor on top of Cloudflare Workers, in your own account, without having to worry about servers, scalability or performance.</p><h3>Architecture</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3d55aU3WlGrgQcuc1TKPAF/1b29dc8ee1a2e4fc26bc227d8b351444/Screenshot-2023-03-16-at-4.18.08-PM.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1146\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://developers.cloudflare.com/email-routing/email-workers/\">Email Workers</a> is a feature of our Email Routing product. The Email Routing component runs in all our nodes, so any one of them is able to process incoming mail, which is important because we announce the Email ingress BGP prefix from all our datacenters. Sending emails to an Email Worker is as easy as setting a rule in the Email Routing dashboard.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4tgjcPuXeJ3lJ9yLxQoPxz/0371e98e65cb08c8f103144dbb511c69/pasted-image-0--4--3.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"312\" loading=\"lazy\"/>\n            \n            </figure><p>When the Email Routing component receives an email that matches a rule to be delivered to a Worker, it will contact our internal version of the recently open-sourced <a href=\"https://github.com/cloudflare/workerd\">workerd</a> runtime, which also runs on all nodes. The RPC schema that governs this interaction is defined in a <a href=\"https://github.com/capnproto/capnproto\">Capnproto</a> schema, and allows the body of the email to be streamed to Edgeworker as it’s read. If the worker script decides to forward this email, Edgeworker will contact Email Routing using a capability sent in the original request.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">jsg::Promise<void> ForwardableEmailMessage::forward(kj::String rcptTo, jsg::Optional<jsg::Ref<Headers>> maybeHeaders) {\n  auto req = emailFwdr->forwardEmailRequest();\n  req.setRcptTo(rcptTo);\n\n  auto sendP = req.send().then(\n      [](capnp::Response<rpc::EmailMetadata::EmailFwdr::ForwardEmailResults> res) mutable {\n    auto result = res.getResponse().getResult();\n    JSG_REQUIRE(result.isOk(), Error, result.getError());\n  });\n  auto& context = IoContext::current();\n  return context.awaitIo(kj::mv(sendP));\n}\n</pre></code>\n            <p>In the context of DMARC reports this is how we handle the incoming emails:</p><ol><li><p>Fetch the recipient of the email being processed, this is the RUA that was used. RUA is a DMARC configuration parameter that indicates where aggregate DMARC processing feedback should be reported pertaining to a certain domain. This recipient can be found in the “to” attribute of the message.</p></li></ol>\n            <pre class=\"language-bash\"><code class=\"language-bash\">const ruaID = message.to</pre></code>\n            <ol><li><p>Since we handle DMARC reports for an unbounded number of domains, we use Workers KV to store some information about each one and key this information on the RUA. This also lets us know if we should be receiving these reports.</p></li></ol>\n            <pre class=\"language-bash\"><code class=\"language-bash\">const accountInfoRaw = await env.KV_DMARC_REPORTS.get(dmarc:${ruaID})</pre></code>\n            <ol><li><p>At this point, we want to read the entire email into an arrayBuffer in order to parse it. Depending on the size of the report we may run into the limits of the free Workers plan. If this happens, we recommend that you switch to the <a href=\"https://www.cloudflare.com/workers-unbound-beta/\">Workers Unbound</a> resource model which does not have this issue.</p></li></ol>\n            <pre class=\"language-bash\"><code class=\"language-bash\">const rawEmail = new Response(message.raw)\nconst arrayBuffer = await rawEmail.arrayBuffer()</pre></code>\n            <ol><li><p>Parsing the raw email involves, among other things, parsing its MIME parts. There are multiple libraries available that allow one to do this. For example, you could use <a href=\"https://www.npmjs.com/package/postal-mime\">postal-mime</a>:</p></li></ol>\n            <pre class=\"language-bash\"><code class=\"language-bash\">const parser = new PostalMime.default()\nconst email = await parser.parse(arrayBuffer)</pre></code>\n            <ol><li><p>Having parsed the email we now have access to its attachments. These attachments are the DMARC reports themselves and they can be compressed. The first thing we want to do is store them in their compressed form in <a href=\"https://developers.cloudflare.com/r2/data-access/workers-api/workers-api-usage/\">R2</a> for long-term storage. They can be useful later on for re-processing or investigating interesting reports. Doing this is as simple as calling put() on the R2 binding. In order to facilitate retrieval later we recommend that you spread the report files across directories based on the current time.</p></li></ol>\n            <pre class=\"language-bash\"><code class=\"language-bash\">await env.R2_DMARC_REPORTS.put(\n    `${date.getUTCFullYear()}/${date.getUTCMonth() + 1}/${attachment.filename}`,\n    attachment.content\n  )</pre></code>\n            <ol><li><p>We now need to look into the attachment mime type. The raw form of DMARC reports is XML, but they can be compressed. In this case we need to decompress them first. DMARC reporter files can use multiple compression algorithms. We use the MIME type to know which one to use. For <a href=\"https://en.wikipedia.org/wiki/Zlib\">Zlib</a> compressed reports <a href=\"https://www.npmjs.com/package/pako\">pako</a> can be used while for ZIP compressed reports <a href=\"https://www.npmjs.com/package/unzipit\">unzipit</a> is a good choice.</p></li><li><p>Having obtained the raw XML form of the report, <a href=\"https://www.npmjs.com/package/fast-xml-parser\">fast-xml-parser</a> has worked well for us in parsing them. Here’s how the DMARC report XML looks:</p></li></ol>\n            <pre class=\"language-bash\"><code class=\"language-bash\"><feedback>\n  <report_metadata>\n    <org_name>example.com</org_name>\n    <emaildmarc-reports@example.com</email>\n   <extra_contact_info>http://example.com/dmarc/support</extra_contact_info>\n    <report_id>9391651994964116463</report_id>\n    <date_range>\n      <begin>1335521200</begin>\n      <end>1335652599</end>\n    </date_range>\n  </report_metadata>\n  <policy_published>\n    <domain>business.example</domain>\n    <adkim>r</adkim>\n    <aspf>r</aspf>\n    <p>none</p>\n    <sp>none</sp>\n    <pct>100</pct>\n  </policy_published>\n  <record>\n    <row>\n      <source_ip>192.0.2.1</source_ip>\n      <count>2</count>\n      <policy_evaluated>\n        <disposition>none</disposition>\n        <dkim>fail</dkim>\n        <spf>pass</spf>\n      </policy_evaluated>\n    </row>\n    <identifiers>\n      <header_from>business.example</header_from>\n    </identifiers>\n    <auth_results>\n      <dkim>\n        <domain>business.example</domain>\n        <result>fail</result>\n        <human_result></human_result>\n      </dkim>\n      <spf>\n        <domain>business.example</domain>\n        <result>pass</result>\n      </spf>\n    </auth_results>\n  </record>\n</feedback></pre></code>\n            <ol><li><p>We now have all the data in the report at our fingertips. What we do from here on depends a lot on how we want to present the data. For us, the goal was to display meaningful data extracted from them in our Dashboard. Therefore we needed an Analytics platform where we could push the enriched data. Enter, <a href=\"https://developers.cloudflare.com/analytics/analytics-engine/\">Workers Analytics Engine</a>. The Analytics engine is perfect for this task since it allows us to <a href=\"https://developers.cloudflare.com/analytics/analytics-engine/get-started/#3-write-data-from-your-worker\">send</a> data to it from a worker, and exposes a <a href=\"https://developers.cloudflare.com/analytics/graphql-api/\">GraphQL API</a> to interact with the data afterwards. This is how we obtain the data to show in our dashboard.</p></li></ol><p>In the future, we are also considering integrating <a href=\"https://developers.cloudflare.com/queues/\">Queues</a> in the workflow to asynchronously process the report and avoid waiting for the client to complete it.</p><p>We managed to implement this project end-to-end relying only on the Workers infrastructure, proving that it’s possible, and advantageous, to build non-trivial apps without having to worry about scalability, performance, storage and security issues.</p><h3>Open sourcing</h3><p>As we mentioned before, we built a managed service that you can enable and use, and we will manage it for you. But, everything we did can also be deployed by you, in your account, so that you can manage your own DMARC reports. It’s easy, and free. To help you with that, we are releasing an open-source version of a Worker that processes DMARC reports in the way described above: <a href=\"https://github.com/cloudflare/dmarc-email-worker\">https://github.com/cloudflare/dmarc-email-worker</a></p><p>If you don’t have a dashboard where to show the data, you can also <a href=\"https://developers.cloudflare.com/analytics/analytics-engine/worker-querying/\">query</a> the Analytics Engine from a Worker. Or, if you want to store them in a relational database, then there’s <a href=\"https://developers.cloudflare.com/d1/platform/client-api/\">D1</a> to the rescue. The possibilities are endless and we are excited to find out what you’ll build with these tools.</p><p>Please contribute, make your own, we’ll be listening.</p><h3>Final words</h3><p>We hope that this post has furthered your understanding of the Workers platform. Today Cloudflare takes advantage of this platform to build most of our services, and we think you should too.</p><p>Feel free to contribute to our open-source version and show us what you can do with it.</p><p>The Email Routing is also working on expanding the Email Workers API more functionally, but that deserves another blog soon.</p>",
		"id": "HNhMxPSjzPXyTdtRLp51K",
		"localeList": {
			"name": "How we built DMARC Management using Cloudflare Workers Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"title": "How we built DMARC Management using Cloudflare Workers",
			"description": null,
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7I6uQTQLBMoAIJBUUs1oKq/f8fa954437a6554b3c1637c8f3cbe650/how-we-built-dmarc-management-4pOm70.png"
		},
		"primary_author": {},
		"published_at": "2023-03-17T13:00:00.000+00:00",
		"reading_time": 8,
		"slug": "how-we-built-dmarc-management",
		"tags": [
			{
				"id": "3DmitkNK6euuD5BlhuvOLW",
				"name": "Security Week",
				"slug": "security-week"
			},
			{
				"id": "2Kxh34kIQRA3gyymmhJpsR",
				"name": "Email Security",
				"slug": "email-security"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "PLBPLmi1zNLAXL1hGhGBR",
				"name": "DMARC",
				"slug": "dmarc"
			}
		],
		"title": "How we built DMARC Management using Cloudflare Workers",
		"updated_at": "2024-08-27T01:26:38.537Z",
		"url": "https://blog.cloudflare.com/how-we-built-dmarc-management"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}