{
	"initialReadingTime": "11",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Andrew Galloni",
				"slug": "andrew-galloni",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3hb1Z72NWYpZNoXvpFwMMb/cea7af1c522bfc132e9bc3d09fed0d42/andrew-galloni.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Ivan Nikulin",
				"slug": "ivan-nikulin",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3YNIwuAmPIbH9iMF69TwJQ/b50f5bdc4121f5f555ad4111a90e9c3e/ivan-nikulin.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "The second blog post in the series on HTML rewriters picks up the story in 2017 after the launch of the Cloudflare edge compute platform Cloudflare Workers. It became clear that the developers using workers wanted the same HTML rewriting capabilities that we used internally, ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/fnjHtNRJDV2knkrx4sBXo/60374ec9e0ce5346ee14320030aaa8cc/html-parsing-2.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2sfVCRtS6lSIai6MEJKe6d/7ab206962089ed45152afc04ba7088fd/HTML-rewrriter-GA_2x-1.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1025\" loading=\"lazy\"/>\n            \n            </figure><p>The second blog post in the series on HTML rewriters picks up the story in 2017 after the launch of the Cloudflare edge compute platform <a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a>. It became clear that the developers using workers wanted the same HTML rewriting capabilities that we used internally, but accessible via a JavaScript API.</p><p>This blog post describes the building of a streaming HTML rewriter/parser with a CSS-selector based API in Rust. It is used as the back-end for the Cloudflare Workers <a href=\"https://developers.cloudflare.com/workers/reference/apis/html-rewriter/\">HTMLRewriter</a>. We have open-sourced the library (<a href=\"https://github.com/cloudflare/lol-html\"><i>LOL HTML</i></a>) as it can also be used as a stand-alone HTML rewriting/parsing library.</p><p>The major change compared to <a href=\"https://github.com/cloudflare/lazyhtml\">LazyHTML</a>, the previous rewriter, is the dual-parser architecture required to overcome the additional performance overhead of wrapping/unwrapping each token when propagating tokens to the workers runtime. The remainder of the post describes a CSS selector matching engine inspired by a Virtual Machine approach to regular expression matching.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"v2-give-it-to-everyone-and-make-it-faster\">v2 : Give it to everyone and make it faster</h2>\n            <a href=\"#v2-give-it-to-everyone-and-make-it-faster\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>In 2017, Cloudflare introduced an edge compute platform - <a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a>. It was no surprise that customers quickly required the same HTML rewriting capabilities that we were using internally. Our team was impressed with the platform and decided to migrate some of our features to Workers. The goal was to improve our developer experience working with modern JavaScript rather than statically linked NGINX modules implemented in C with a Lua API.</p><p>It is possible to rewrite HTML in Workers, though for that you needed a third party JavaScript package (such as <a href=\"http://cheerio.js.org/\">Cheerio</a>). These packages are not designed for HTML rewriting on the edge due to the latency, speed and memory considerations described in the previous post.</p><p>JavaScript is really fast but it still can’t always produce performance comparable to native code for some tasks - parsing being one of those. Customers typically needed to buffer the whole content of the page to do the rewriting resulting in considerable output latency and memory consumption that often exceeded the memory limits enforced by the Workers runtime.</p><p>We started to think about how we could reuse the technology in Workers. LazyHTML was a perfect fit in terms of parsing performance, but it had two issues:</p><ol><li><p><b>API ergonomics</b>: LazyHTML produces a stream of HTML tokens. This is sufficient for our internal needs. However, for an average user, it is not as convenient as the jQuery-like API of Cheerio.</p></li><li><p><b>Performance</b>: Even though LazyHTML is tremendously fast, integration with the Workers runtime adds even more limitations. LazyHTML operates as a simple parse-modify-serialize pipeline, which means that it produces tokens for the whole content of the page. All of these tokens then have to be propagated to the Workers runtime and wrapped inside a JavaScript object and then unwrapped and fed back to LazyHTML for serialization. This is an extremely expensive operation which would nullify the performance benefit of LazyHTML.</p></li></ol>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4GmYB4iPMNqvDypCQbb2t/df8654ebb5eaf44a6c755220d2797458/image8-1.png\" alt=\"\" class=\"kg-image\" width=\"842\" height=\"511\" loading=\"lazy\"/>\n            \n            </figure><p>LazyHTML with V8</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"lol-html\">LOL HTML</h3>\n            <a href=\"#lol-html\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>We needed something new, designed with Workers requirements in mind, using a language with the native speed and safety guarantees (it’s incredibly easy to shoot yourself in the foot doing parsing). Rust was the obvious choice as it provides the native speed and the best guarantee of memory safety which minimises the attack surface of untrusted input. Wherever possible the Low Output Latency HTML rewriter (LOL HTML) uses all the previous optimizations developed for LazyHTML such as tag name hashing.</p><h4>Dual-parser architecture</h4><p>Most developers are familiar and prefer to use CSS selector-based APIs (as in Cheerio, jQuery or DOM itself) for HTML mutation tasks. We decided to base our API on CSS selectors as well. Although this meant additional implementation complexity, the decision created even more opportunities for parsing optimizations.</p><p>As selectors define the scope of the content that should be rewritten, we realised we can skip the content that is not in this scope and not produce tokens for it. This not only significantly speeds up the parsing itself, but also avoids the performance burden of the back and forth interactions with the JavaScript VM. As ever the best optimization is not to do something.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1bnIfLwJ1sYEYM34uXAleV/a76c7692dcb4bc557df147f4a148fe05/image7-2.png\" alt=\"\" class=\"kg-image\" width=\"912\" height=\"464\" loading=\"lazy\"/>\n            \n            </figure><p>Considering the tasks required, LOL HTML’s parser consists of two internal parsers:</p><ul><li><p><b>Lexer</b> - a regular full parser, that produces output for all types of content that it encounters;</p></li><li><p><b>Tag scanner</b> - looks for start and end tags and skips parsing the rest of the content. The tag scanner parses only the tag name and feeds it to the selector matcher. The matcher will switch parser to the lexer if there was a match or additional information about the tag (such as attributes) are required for matching.</p></li></ul><p>The parser switches back to the tag scanner as soon as input leaves the scope of all selector matches. The tag scanner may also sometimes switch the parser to the Lexer - if it requires additional tag information for the parsing feedback simulation.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1U4yaNQ6DOcGtl5JeUZfVS/181db092de709616de038235da7226f6/image1-3.png\" alt=\"\" class=\"kg-image\" width=\"832\" height=\"782\" loading=\"lazy\"/>\n            \n            </figure><p>LOL HTML architecture</p><p>Having two different parser implementations for the same grammar will increase development costs and is error-prone due to implementation inconsistencies. We minimize these risks by implementing a small Rust macro-based DSL which is similar in spirit to Ragel. The DSL program describes <a href=\"https://en.wikipedia.org/wiki/Nondeterministic_finite_automaton\">Nondeterministic finite automaton</a> states and actions associated with each state transition and matched input byte.</p><p>An example of a DSL state definition:</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\">tag_name_state {\n   whitespace =&gt; ( finish_tag_name?; --&gt; before_attribute_name_state )\n   b&#039;/&#039;       =&gt; ( finish_tag_name?; --&gt; self_closing_start_tag_state )\n   b&#039;&gt;&#039;       =&gt; ( finish_tag_name?; emit_tag?; --&gt; data_state )\n   eof        =&gt; ( emit_raw_without_token_and_eof?; )\n   _          =&gt; ( update_tag_name_hash; )\n}</pre></code>\n            <p>The DSL program gets expanded by the Rust compiler into not quite as beautiful, but extremely efficient Rust code.</p><p>We no longer need to reimplement the code that drives the parsing process for each of our parsers. All we need to do is to define different action implementations for each. In the case of the tag scanner, the majority of these actions are a no-op, so the Rust compiler does the NFA optimization job for us: it optimizes away state branches with no-op actions and even whole states if all of the branches have no-op actions. Now that’s cool.</p><h4>Byte slice processing optimisations</h4><p>Moving to a memory-safe language provided new challenges. Rust has great memory safety mechanisms, however sometimes they have a runtime performance cost.</p><p>The task of the parser is to scan through the input and find the boundaries of lexical units of the language - tokens and their internal parts. For example, an HTML start tag token consists of multiple parts: a byte slice of input that represents the tag name and multiple pairs of input slices that represent attributes and values:</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\">struct StartTagToken&lt;&#039;i&gt; {\n   name: &amp;&#039;i [u8],\n   attributes: Vec&lt;(&amp;&#039;i [u8], &amp;&#039;i [u8])&gt;,\n   self_closing: bool\n}</pre></code>\n            <p>As Rust uses bound checks on memory access, construction of a token might be a relatively expensive operation. We need to be capable of constructing thousands of them in a fraction of second, so every CPU instruction counts.</p><p>Following the principle of doing as little as possible to improve performance we use a “token outline” representation of tokens: instead of having memory slices for token parts we use numeric ranges which are lazily transformed into a byte slice when required.</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\">struct StartTagTokenOutline {\n   name: Range&lt;usize&gt;,\n   attributes: Vec&lt;(Range&lt;usize&gt;, Range&lt;usize&gt;)&gt;,\n   self_closing: bool\n}</pre></code>\n            <p>As you might have noticed, with this approach we are no longer bound to the lifetime of the input chunk which turns out to be very useful. If a start tag is spread across multiple input chunks we can easily update the token that is currently in construction, as new chunks of input arrive by just adjusting integer indices. This allows us to avoid constructing a new token with slices from the new input memory region (it could be the input chunk itself or the internal parser’s buffer).</p><p>This time we can’t get away with avoiding the conversion of input character encoding; we expose a user-facing API that operates on JavaScript strings and input HTML can be of any encoding. Luckily, as we can still parse without decoding and only encode and decode within token bounds by a request (though we still can’t do that for UTF-16 encoding).</p><p>So, when a user requests an element’s tag name in the API, internally it is still represented as a byte slice in the character encoding of the input, but when provided to the user it gets dynamically decoded. The opposite process happens when a user sets a new tag name.</p><p>For selector matching we can still operate on the original encoding representation - because we know the input encoding ahead of time we preemptively convert values in a selector to the page’s character encoding, so comparisons can be done without decoding fields of each token.</p><p>As you can see, the new parser architecture along with all these optimizations produced great performance results:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3e73RS0xEBDmg1jxWQGKsJ/c0bd91ac62fa8997de83e53348a3f314/image4-2.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"742\" loading=\"lazy\"/>\n            \n            </figure><p>Average parsing time depending on the input size - lower is better</p><p>LOL HTML’s tag scanner is typically twice as fast as LazyHTML and the lexer has comparable performance, outperforming LazyHTML on bigger inputs. Both are a few times faster than the tokenizer from <a href=\"https://github.com/servo/html5ever\">html5ever</a> - another parser implemented in Rust used in the Mozilla’s Servo browser engine.</p><h4>CSS selector matching VM</h4><p>With an impressively fast parser on our hands we had only one thing missing - the CSS selector matcher. Initially we thought we could just use Servo’s <a href=\"https://crates.io/crates/selectors\">CSS selector matching engine</a> for this purpose. After a couple of days of experimentation it turned out that it is not quite suitable for our task.</p><p>It did not work well with our dual parser architecture. We first need to to match just a tag name from the tag scanner, and then, if we fail, query the lexer for the attributes. The selectors library wasn’t designed with this architecture in mind so we needed ugly hacks to bail out from matching in case of insufficient information. It was inefficient as we needed to start matching again after the bailout doing twice the work. There were other problems, such as the integration of lazy character decoding and integration of tag name comparison using tag name hashes.</p><h5>Matching direction</h5><p>The main problem encountered was the need to backtrack all the open elements for matching. Browsers match selectors from right to left and traverse all ancestors of an element. This <a href=\"https://stackoverflow.com/a/5813672\">StackOverflow</a> has a good explanation of why they do it this way. We would need to store information about all open elements and their attributes - something that we can’t do while operating with tight memory constraints. This matching approach would be inefficient for our case - unlike browsers, we expect to have just a few selectors and a lot of elements. In this case it is much more efficient to match selectors from left to right.</p><p>And this is when we had a revelation. Consider the following CSS selector:</p>\n            <pre class=\"language-css\"><code class=\"language-css\">body &gt; div.foo  img[alt] &gt; div.foo ul</pre></code>\n            <p>It can be split into individual components attributed to a particular element with hierarchical combinators in between:</p>\n            <pre class=\"language-css\"><code class=\"language-css\">body &gt; div.foo img[alt] &gt; div.foo  ul\n---    ------- --------   -------  --</pre></code>\n            <p>Each component is easy to match having a start tag token - it’s just a matter of comparison of token fields with values in the component. Let’s dive into abstract thinking and imagine that each such component is a character in the infinite alphabet of all possible components:</p><!--kg-card-begin: html-->  <table>\n        <tr>\n            <th style='width:220px'>Selector  component</th>\n            <th style='width:120px'>Character</th>\n        </tr>\n        <tr>\n            <td>body</td>\n            <td>a</td>\n        </tr>\n        <tr>\n            <td>div.foo</td>\n            <td>b</td>\n        </tr>\n        <tr>\n            <td>img[alt]</td>\n            <td>c</td>\n        </tr>\n        <tr>\n            <td>ul</td>\n            <td>d</td>\n        </tr>\n    </table><!--kg-card-end: html--><p>Let’s rewrite our selector with selector components replaced by our imaginary characters:</p>\n            <pre class=\"language-css\"><code class=\"language-css\">a &gt; b c &gt; b d</pre></code>\n            <p>Does this remind you of something?</p><p>A   `&gt;` combinator can be considered a child element, or “immediately followed by”.</p><p>The ` ` (space) is a descendant element can be thought of as there might be zero or more elements in between.</p><p>There is a very well known abstraction to express these relations - regular expressions. The selector replacing combinators can be replaced with a regular expression syntax:</p>\n            <pre class=\"language-perl\"><code class=\"language-perl\">ab.*cb.*d</pre></code>\n            <p>We transformed our CSS selector into a regular expression that can be executed on the sequence of start tag tokens. Note that not all CSS selectors can be converted to such a regular grammar and the input on which we match has some specifics, which we’ll discuss later. However, it was a good starting point: it allowed us to express a significant subset of selectors.</p><h5>Implementing a Virtual Machine</h5><p>Next, we started looking at non-backtracking algorithms for regular expressions. The virtual machine approach seemed suitable for our task as it was possible to have a non-backtracking implementation that was flexible enough to work around differences between real regular expression matching on strings and our abstraction.</p><p>VM-based regular expression matching is implemented as one of the engines in many regular expression libraries such as regexp2 and Rust’s regex. The basic idea is that instead of building an NFA or DFA for a regular expression it is instead converted into DSL assembly language with instructions later executed by the virtual machine - regular expressions are treated as programs that accept strings for matching.</p><p>Since the VM program is just a representation of <a href=\"https://en.wikipedia.org/wiki/Nondeterministic_finite_automaton#NFA_with_%CE%B5-moves\">NFA with ε-transitions</a> it can exist in multiple states simultaneously during the execution, or, in other words, spawns multiple threads. The regular expression matches if one or more states succeed.</p><p>For example, consider the following VM instructions:</p><ul><li><p><i>expect c</i> - waits for next input character, aborts the thread if doesn’t equal to the instruction’s operand;</p></li><li><p><i>jmp L</i> - jump to label ‘L’;</p></li><li><p><i>thread L1, L2</i> - spawns threads for labels L1 and L2, effectively splitting the execution;</p></li><li><p><i>match</i> - succeed the thread with a match;</p></li></ul><p>For example, using this instructions set regular expression “<i>ab*c”</i> can be translated into_:_</p>\n            <pre class=\"language-assembler\"><code class=\"language-assembler\">    expect a\nL1: thread L2, L3\nL2: expect b\n    jmp L1\nL3: expect c\n    match</pre></code>\n            <p>Let’s try to translate the regular expression ab.*cb.*d from the selector we saw earlier:</p>\n            <pre class=\"language-assembler\"><code class=\"language-assembler\">    expect a\n    expect b\nL1: thread L2, L3\nL2: expect [any]\n    jmp L1\nL3: expect c\n    expect b\nL4: thread L5, L6\nL5: expect [any]\n    jmp L4\nL6: expect d\n    match</pre></code>\n            <p>That looks complex! Though this assembly language is designed for regular expressions in general, and regular expressions can be much more complex than our case. For us the only kind of repetition that matters is “<i>.*”</i>. So, instead of expressing it with multiple instructions we can use just one called <i>hereditary_jmp</i>:</p>\n            <pre class=\"language-assembler\"><code class=\"language-assembler\">    expect a\n    expect b\n    hereditary_jmp L1\nL1: expect c\n    expect b\n    hereditary_jmp L2\nL2: expect d\n    match</pre></code>\n            <p>The instruction tells VM to memoize instruction’s label operand and unconditionally spawn a thread with a jump to this label on each input character.</p><p>There is one significant distinction between the string input of regular expressions and the input provided to our VM. The input can shrink!</p><p>A regular string is just a contiguous sequence of characters, whereas we operate on a sequence of open elements. As new tokens arrive this sequence can grow as well as shrink. Assume we represent  as ‘a’ character in our imaginary language, so having <code>&lt;div&gt;&lt;div&gt;&lt;div&gt;</code> input we can represent it as <code>aaa</code>, if the next token in the input is <code>&lt;/div&gt;</code> then our “string” shrinks to <code>aa</code>.</p><p>You might think at this point that our abstraction doesn’t work and we should try something else. What we have as an input for our machine is a stack of open elements and we needed a stack-like structure to store our hereditrary_jmp instruction labels that VM had seen so far. So, why not store it on the open element stack? If we store the next instruction pointer on each of stack items on which the <code>expect</code> instruction was successfully executed, we’ll have a full snapshot of the VM state, so we can easily roll back to it if our stack shrinks.</p><p>With this implementation we don’t need to store anything except a tag name on the stack, and, considering that we can use the tag name hashing algorithm, it is just a 64-bit integer per open element. As an additional small optimization, to avoid traversing of the whole stack in search of active hereditary jumps on each new input we store an index of the first ancestor with a hereditary jump on each stack item.</p><p>For example, having the following selector “<i>body</i> &gt; <i>div span”</i> we’ll have the following VM program (let’s get rid of labels and just use instruction indices instead):</p>\n            <pre class=\"language-assembler\"><code class=\"language-assembler\">0| expect &lt;body&gt;\n1| expect &lt;div&gt;\n2| hereditary_jmp 3\n3| expect &lt;span&gt;\n4| match</pre></code>\n            <p>Having an input “” we’ll have the following stack:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/F9vqNHbnLYJDeg4qSjvbx/4219a5c3b6b3d2e2d770d4dd2c1f0e65/image2-3.png\" alt=\"\" class=\"kg-image\" width=\"389\" height=\"322\" loading=\"lazy\"/>\n            \n            </figure><p>Now, if the next token is a start tag  the VM will first try to execute the selectors program from the beginning and will fail on the first instruction. However, it will also look for any active hereditary jumps on the stack. We have one which jumps to the instructions at index 3. After jumping to this instruction the VM successfully produces a match. If we get yet another  start tag later it will much as well following the same steps which is exactly what we expect for the descendant selector.</p><p>If we then receive a sequence of “” end tags our stack will contain only one item:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2Y5I0Az6dXlOkEvQd239bI/3151124f2f2027aed5aa787dd9bbd25f/image5-2.png\" alt=\"\" class=\"kg-image\" width=\"362\" height=\"82\" loading=\"lazy\"/>\n            \n            </figure><p>which instructs VM to jump to instruction at index 1, effectively rolling back to matching the <i>div</i> component of the selector.</p><p>We mentioned earlier that we can bail out from the matching process if we only have a tag name from the tag scanner and we need to obtain more information by running the lexer? With a VM approach it is as easy as stopping the execution of the current instruction and resuming it later when we get the required information.</p><h5>Duplicate selectors</h5><p>As we need a separate program for each selector we need to match, how can we stop the same simple components doing the same job? The AST for our selector matching program is a <a href=\"https://en.wikipedia.org/wiki/Radix_tree\">radix tree</a>-like structure whose edge labels are simple selector components and nodes are hierarchical combinators.For example for the following selectors:</p>\n            <pre class=\"language-css\"><code class=\"language-css\">body &gt; div &gt; link[rel]\nbody &gt; span\nbody &gt; span a</pre></code>\n            <p>we’ll get the following AST:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3LczcYVznE4d44KCIO8JJw/245f18af12bb135b6cd2b051c847a118/image3-1.png\" alt=\"\" class=\"kg-image\" width=\"478\" height=\"241\" loading=\"lazy\"/>\n            \n            </figure><p>If selectors have common prefixes we can match them just once for all these selectors. In the compilation process, we flatten this structure into a vector of instructions.</p><h5>[not] JIT-compilation</h5><p>For performance reasons compiled instructions are macro-instructions - they incorporate multiple basic VM instruction calls. This way the VM can execute only one macro instruction per input token. Each of the macro instructions compiled using the so-called “<a href=\"/building-fast-interpreters-in-rust/#-not-jit-compilation\">[not] JIT-compilation</a>” (the same approach to the compilation is used in our other Rust project - wirefilter).</p><p>Internally the macro instruction contains <code>expect</code> and following <code>jmp</code>, <code>hereditary_jmp</code> and <code>match</code> basic instructions. In that sense macro-instructions resemble <a href=\"https://en.wikipedia.org/wiki/Microcode\">microcode</a> making it easy to suspend execution of a macro instruction if we need to request attributes information from the lexer.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"whats-next\">What’s next</h2>\n            <a href=\"#whats-next\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>It is obviously not the end of the road, but hopefully, we’ve got a bit closer to it. There are still multiple bits of functionality that need to be implemented and certainly, there is a space for more optimizations.</p><p>If you are interested in the topic don’t hesitate to join us in development of <a href=\"https://github.com/cloudflare/lazyhtml\">LazyHTML</a> and <a href=\"https://github.com/cloudflare/lol-html\">LOL HTML</a> at GitHub and, of course, we are always happy to see people passionate about technology here at Cloudflare, so don’t hesitate to <a href=\"https://www.cloudflare.com/careers\">contact us</a> if you are too :).</p>",
		"id": "3QbtvZ1bIRvLpb1lE9PPcD",
		"localeList": {
			"name": "A History of HTML Parsing at Cloudflare: Part 2 Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "This post describes a Rust streaming HTML rewriter/parser with a CSS-selector based API, being used as the back-end for the Cloudflare Workers HTMLRewriter.",
		"metadata": {
			"title": "Rust streaming HTML parser/rewriter",
			"description": "This post describes a Rust streaming HTML rewriter/parser with a CSS-selector based API, being used as the back-end for the Cloudflare Workers HTMLRewriter.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4d96OAQTOklHMJfn6jdrvD/b01283ffe7784cf24e506992d7aea4a6/html-parsing-2-OqpQiA.png"
		},
		"primary_author": {},
		"published_at": "2019-11-29T08:00:00.000+00:00",
		"slug": "html-parsing-2",
		"tags": [
			{
				"id": "w4e8pkoz9c8xNDVhy9eNe",
				"name": "Rust",
				"slug": "rust"
			},
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "5cye1Bh5KxFh3pKSnX8Dsy",
				"name": "Serverless",
				"slug": "serverless"
			},
			{
				"id": "7aYB1Ci6SHWaelke8YAibN",
				"name": "Workers Sites",
				"slug": "workers-sites"
			},
			{
				"id": "78aSAeMjGNmCuetQ7B4OgU",
				"name": "JavaScript",
				"slug": "javascript"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "2UVIYusJwlvsmPYl2AvSuR",
				"name": "Deep Dive",
				"slug": "deep-dive"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			}
		],
		"title": "A History of HTML Parsing at Cloudflare: Part 2",
		"updated_at": "2024-08-27T02:07:19.883Z",
		"url": "https://blog.cloudflare.com/html-parsing-2"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}