{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Patrick R. Donahue",
				"slug": "patrick",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1LQFonIW7hvlt7UKRMOzlk/1922ffdb4fc76d32f8d039753ad6eb16/patrick.png",
				"location": "San Francisco, CA",
				"website": "https://www.cloudflare.com",
				"twitter": "@prdonahue",
				"facebook": null
			}
		],
		"excerpt": "Google just announced that beginning in July 2018, with the release of Chrome 68, web pages loaded without HTTPS will be marked as “not secure”.  More than half of web visitors will soon see this warning when visiting unencrypted HTTP sites.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5QyDVDc9XXIORrcVqmVA9X/0a6d196da635984d97ba901d8168c86d/https-or-bust-chromes-plan-to-label-sites-as-not-secure.png",
		"featured": false,
		"html": "<p>Google <a href=\"https://security.googleblog.com/2018/02/a-secure-web-is-here-to-stay.html\">just announced</a> that beginning in July 2018, with the release of Chrome 68, web pages loaded without HTTPS will be marked as “not secure”.</p><p>More than half of web visitors will soon see this warning when browsing unencrypted HTTP sites, according to data from Cloudflare’s edge that shows 56.62% of desktop requests originate from Chrome. Users presented with this warning will be less likely to interact with these sites or trust their content, so it’s imperative that site operators not yet using HTTPS have a plan to do so by July.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5V9DjMCaycXsrWiaHH6Ayx/64edca46221a5faa840c5f3765cc21b4/chrome68.png\" alt=\"chrome68\" class=\"kg-image\" width=\"640\" height=\"231\" loading=\"lazy\"/>\n            \n            </figure><h3>How did we get here (and why)?</h3><p>To those who have followed the Chrome team’s public statements, this announcement comes as no surprise. Google has been gearing up for this change since 2014, as Chrome boss Parisa Tabriz <a href=\"https://twitter.com/laparisa/status/961925743121977346\">tweeted</a> and Chris Palmer <a href=\"https://groups.google.com/a/chromium.org/forum/#!topic/security-dev/DHQLv76QaEM%5B1-25%5D\">memorialized</a> in a widely distributed email. While this step is an important and potentially jarring one for users, it’s by no means the last step that Google will take to influence website administrator behavior for the better.</p><p>But why are they making this change (now)? Google’s primary motivation for driving HTTPS adoption is simple: a safe browsing experience is good for business. Users that feel safe on the web spend more time viewing and interacting with ads and other services that Google gets paid to deliver. (To be clear: these motivations do not in any way diminish the outstanding work of the Chrome team, whose members are passionate about protecting users for a myriad of non-business reasons. We applaud their efforts in making the web a safer place and are excited to see other browsers follow their lead.)</p><p>Google must feel the time is right to make the change thanks to HTTPS page loads continuing to climb steadily and minimal fallout from their <a href=\"#importantmilestonestowardshttpsubiquityalongsidepercentofpageloadsusinghttps\">previous, incremental steps</a>. Emily Schechter, the Chrome Security Product Manager who announced the change, <a href=\"https://twitter.com/emschec/status/961719363223957504\">writes</a>: “we believe https usage will be high enough by july [2018] that this will be OK”. Currently, the ratio of user interaction with secure origins to non-secure sits at 69.7%; five months ago it was just 62.5% and thus it’s easy to imagine Chris Palmer’s <a href=\"https://groups.google.com/a/chromium.org/forum/#!topic/security-dev/DHQLv76QaEM%5B1-25%5D\">suggested threshold of 75%</a> will have been met by July.</p><p>Such a change would have been far too disruptive just one year ago, but thanks to the efforts of Google and other participants in the webPKI ecosystem (including Cloudflare), a path has been paved towards 100% adoption. Today, HTTPS is <a href=\"https://istlsfastyet.com/#cdn-paas\">fast</a>, simple to deploy, and cost-effective if not free—and there’s no longer an excuse for not using SSL/TLS. Even static sites need encryption to prevent malicious third-parties from <a href=\"https://www.wired.com/2014/10/verizons-perma-cookie/\">tracking your users</a> or <a href=\"https://arstechnica.com/tech-policy/2014/09/why-comcasts-javascript-ad-injections-threaten-security-net-neutrality/\">injecting ads</a> into your site.</p><h4>Important milestones towards HTTPS ubiquity, alongside percent of page loads using HTTPS</h4><table class=\"table-with-last-column-right-aligned\">\n    <tbody>\n        <tr>\n            <th width=\"15%\">Date\n            </th><th width=\"70%\">Action\n            </th><th width=\"15%\">% HTTPS<sup>1</sup>\n        </th></tr>\n        <tr>\n            <td>2H 2013</td>\n            <td>NSA: Edward Snowden releases thousands of pages of classified documents, confirming that the NSA has been passively collecting plaintext communication. At the time, very few sites used HTTPS by default, including the traffic between Google's data centers, making it far easier for these communications to be monitored.</td>\n            <td>~25%</td>\n        </tr>\n        <tr>\n            <td>2014/08/06</td>\n            <td>Google publishes a <a href=\"https://security.googleblog.com/2014/08/https-as-ranking-signal_6.html\">blog post</a> disclosing that they're starting to use the availability of a site over HTTPS as a positive ranking signal for SEO purposes.</td>\n            <td>31.7%</td>\n        </tr>\n        <tr>\n            <td>2014/09/24</td>\n            <td>Cloudflare <a href=\"https://blog.cloudflare.com/introducing-universal-ssl\">announces</a> Universal SSL, which provides [free SSL certificates](https://www.cloudflare.com/application-services/products/ssl/) and SSL/TLS termination to the then-two million sites on our network.</td>\n            <td>31.8%</td>\n        </tr>\n        <tr>\n            <td>2014/12/12</td>\n            <td>Google's Chris Palmer <a href=\"https://groups.google.com/a/chromium.org/forum/%23!topic/blink-dev/DHQLv76QaEM%255B1-25%255D\">emails</a> blink-dev with \"Proposal: Marking HTTP As Non-Secure\". This original proposal has been memorialized <a href=\"https://www.chromium.org/Home/chromium-security/marking-http-as-non-secure\">here</a>.</td>\n            <td>32.3%</td>\n        </tr>\n        <tr>\n            <td>2015/02/26</td>\n            <td>Google's Joel Weinberger <a href=\"https://groups.google.com/a/chromium.org/forum/%23!msg/blink-dev/2LXKVWYkOus/gT-ZamfwAKsJ\">emails</a> the blink-dev mailing list with an \"Intent to deprecate\" for certain features unless used with secure origins (i.e., HTTPS). Initially this list includes: device motion/orientation, EME, fullscreen, geolocation, and getUserMedia.</td>\n            <td>33.7%</td>\n        </tr>\n        <tr>\n            <td>2015/04/30</td>\n            <td>Mozilla's Richard Barnes <a href=\"https://blog.mozilla.org/security/2015/04/30/deprecating-non-secure-http\">publishes</a> \"Deprecating Non-Secure HTTP\", announcing Mozilla's intent to eventually  \"phase out non-secure HTTP\" from Firefox.</td>\n            <td>35.4%</td>\n        </tr>\n        <tr>\n            <td>2015/10/19</td>\n            <td>ISRG's Josh Aas <a href=\"https://letsencrypt.org/2015/10/19/lets-encrypt-is-trusted.html\">announces</a> that Let's Encrypt, a new free CA, is now trusted by all major browsers, thanks to a cross-sign from IdenTrust.</td>\n            <td>37.9%</td>\n        </tr>\n        <tr>\n            <td>2015/12/03</td>\n            <td>Let's Encrypt <a href=\"https://letsencrypt.org/2015/12/03/entering-public-beta.html\">officially launches</a> into public beta.</td>\n            <td>39.5%</td>\n        </tr>\n        <tr>\n            <td>2016/06/14</td>\n            <td>Apple <a href=\"https://developer.apple.com/videos/play/wwdc2016/706\">announces</a> at WWDC16 that, by the end of 2016, the App Store will require that applications be built with App Transport Security (ATS) in order to be accepted. ATS prohibits the use of plaintext HTTP and thus helps drive the adoption of HTTPS.</td>\n            <td>45.0%</td>\n        </tr>\n        <tr>\n            <td>2016/06/22</td>\n            <td>Google's Adriana Porter Felt et al. present <a href=\"https://www.usenix.org/system/files/conference/soups2016/soups2016-paper-porter-felt.pdf\">Rethinking Connection Security Indicators</a> at USENIX's Twelfth Symposium On Usable Privacy and Security. In this paper Adriana and team \"select and propose three indicators\", which have already been adopted by Chrome (including the \"Not secure\" label).</td>\n            <td>45.1%</td>\n        </tr>\n        <tr>\n            <td>2016/09/08</td>\n            <td>Google's Emily Schechter publishes <a href=\"https://security.googleblog.com/2016/09/moving-towards-more-secure-web.html\">Moving towards a more secure web</a>, in which she writes that \"Beginning in January 2017 (Chrome 56), we'll mark HTTP pages that collect passwords or credit cards as non-secure, as part of a long-term plan to mark all HTTP sites as non-secure.\"\n<img src=\"https://blog.cloudflare.com/content/images/2018/02/chrome56.png\">\n<p>She also reiterates Google's plan to eventually \"label all HTTP pages as non-secure, and change the HTTP security indicator to the red triangle that we use for broken HTTPS.\"</p>\n<img src=\"https://blog.cloudflare.com/content/images/2018/02/chrome-eventual.png\">\n</td>\n<td>44.8%</td>\n</tr>\n<tr>\n<td>2017/01/20</td>\n<td>Mozilla: A <a href=\"https://blog.mozilla.org/security/2017/01/20/communicating-the-dangers-of-non-secure-http\">post</a> on the Mozilla Security Blog titled Communicating the Dangers of Non-Secure HTTP informs users that in upcoming releases, Firefox will show an in-context message when a user clicks into a username or password field on a page that doesn't use HTTPS\". Firefox's in-context warnings are even more prominent than those implemented by Chrome.\n<img src=\"https://blog.cloudflare.com/content/images/2018/02/firefox-inline.png\">\n</td>\n<td>50.78%</td>\n</tr>\n        <tr>\n            <td>2017/01/31</td>\n            <td>Google: As announced in September of 2016, Chrome 56 begins marking pages as \"Not secure\" if they i) contain a password field or ii) if a user interacts with a credit card field.</td>\n            <td>51.9%</td>\n        </tr>\n        <tr>\n            <td>2017/03/30</td>\n            <td>Cloudflare: To assist SaaS providers in driving HTTPS adoption for their customers' custom/vanity domains, Cloudflare announces our <a href=\"https://www.cloudflare.com/ssl-for-saas-providers/\">SSL for SaaS Provider</a> offering. Historically, it has been difficult and time consuming for SaaS providers to obtain (and renew) SSL certificates on behalf of their end-users, and thus very few offered free SSL for all customers.</td>\n            <td>55.1%</td>\n        </tr>\n        <tr>\n            <td>2017/04/27</td>\n            <td>Google's Emily Schecter <a href=\"https://blog.chromium.org/2017/04/next-steps-toward-more-connection.html\">announces</a> that \"Beginning in October 2017, Chrome will show the \"Not secure\" warning in two additional situations: when users enter data on an HTTP page, and on all HTTP pages visited in Incognito mode.\"\n<img src=\"https://blog.cloudflare.com/content/images/2018/02/chrome62.png\">\n</td>\n            <td>56.3%</td>\n        </tr>\n        <tr>\n            <td>2018/01/15</td>\n            <td>Mozilla's Anne van Kesteren <a href=\"https://blog.mozilla.org/security/2018/01/15/secure-contexts-everywhere\">publishes</a> a blog post \"Secure Contexts Everywhere\" in which he explains that \"effective immediately, all new features that are web-exposed are to be restricted to secure contexts\".</td>\n            <td>69.9%</td>\n        </tr>\n        <tr>\n            <td>2018/02/08</td>\n            <td>Google's Emily Schecter <a href=\"https://security.googleblog.com/2018/02/a-secure-web-is-here-to-stay.html\">writes</a> that \"Beginning in July 2018 with the release of Chrome 68, Chrome will mark all HTTP sites as \"not secure\".\n<img src=\"https://blog.cloudflare.com/content/images/2018/02/chrome68-1.png\">\n</td>\n            <td>69.7%</td>\n        </tr>\n    </tbody>\n</table><p><sup>1</sup> % of pages loaded over HTTPS by Firefox, 14-day moving average. Source: Firefox Telemetry <a href=\"https://docs.telemetry.mozilla.org/datasets/other/ssl/reference.html\">data</a> and <a href=\"https://letsencrypt.org/stats/\">Let&#39;s Encrypt</a>. Google also publishes figures on Chrome: <a href=\"https://transparencyreport.google.com/https/overview.\">https://transparencyreport.google.com/https/overview.</a></p><h3>What’s coming next? What should I expect after July 2018?</h3><p>The &quot;lock&quot; in the address bar was always about motivating sites to migrate to HTTPS, but along the way <a href=\"http://www.usablesecurity.org//emperor/emperor.pdf\">studies</a> <a href=\"https://www.usenix.org/system/files/conference/soups2016/soups2016-paper-porter-felt.pdf\">showed</a> that positive trust indicators don’t work. Google’s introduction of &quot;Not secure&quot; is one important step towards the ultimate goal of deprecating HTTP, but as mentioned earlier, will not be their last.</p><p>We expect Google’s assault on HTTP to continue throughout the year, culminating with an announcement that the lock will be removed entirely (and replaced by a negative indicator shown only when a site does not utilize HTTPS). Below is some additional detail on this expected next step, along with some additional predictions for the webPKI ecosystem.</p><h4>1. Google will announce the lock icon’s demise in 2018 and remove it in January 2019 with the release of Chrome 72</h4><p>Chris Palmer’s <a href=\"https://groups.google.com/a/chromium.org/forum/#!topic/blink-dev/DHQLv76QaEM%5B1-25%5D\">email to blink-dev</a> in 2014 included this &quot;strawman proposal&quot; for introducing negative indicators and phasing out the marking of secure origins entirely:</p><blockquote><p>Secure &gt; 65%: Non-secure origins marked as DubiousSecure &gt; 75%: Non-secure origins marked as Non-secureSecure &gt; 85%: Secure origins unmarked</p></blockquote><p>True to plan, Chrome 68 will go stable right around the time HTTPS page loads reach 75%. (Our initial forecast for this date, based on connections to our edge and telemetry data from Firefox, was 74.8%; however, we expect last week’s Chrome announcement to accelerate this ratio to &gt;75% before July 24.)</p><p>Looking forward, the <a href=\"https://www.chromium.org/developers/calendar\">estimated stable dates</a> for future Chrome releases are as follows:</p><ul><li><p>Chrome 69 – September 4, 2018</p></li><li><p>Chrome 70 – October 16, 2018</p></li><li><p>Chrome 71 – December 4, 2018</p></li></ul><p>At approximately 6-7 weeks between stable releases, Chrome 72 should hit sometime in late January 2019. By this time, we expect HTTPS page loads to be &gt;85%, a high enough ratio where Google can be confident the change won’t be too disruptive. Given the significance of this UI change we expect they’ll announce it sometime in mid 2018.</p><h4>2. Firefox will soon announce their own schedule for marking insecure origins</h4><p>Google is not the only major browser taking steps to drive the web to HTTPS only.</p><p>Back in April 2015, the Mozilla team <a href=\"https://blog.mozilla.org/security/2015/04/30/deprecating-non-secure-http/\">announced</a> their intent to (eventually) deprecate HTTP. Since then, Firefox has adopted <a href=\"https://blog.mozilla.org/security/2017/01/20/communicating-the-dangers-of-non-secure-http/\">similar UI indications</a> to Chrome for pages with passwords, <a href=\"https://blog.mozilla.org/security/2018/01/15/secure-contexts-everywhere/\">announced</a> that “all new features that are web-exposed are to be restricted to secure contexts”, and merged (default disabled) <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1310447\">code</a> to mark sites loaded over HTTP as “not secure”.</p><p>Beginning in Firefox 59, this “not secure” labeling can be manually enabled (instructions shown below), but no date has officially been set by Mozilla for when this will turned on by default. We expect them to announce a date shortly.</p><h4>3. Microsoft and Apple will continue to lag Google and Mozilla, but will start to enact similar changes</h4><p>Historically, Microsoft and Apple have moved slower in adopting new browser security policies due in part to the fact they release (and update) their browsers far less frequently than Google and Mozilla.</p><p>However, Apple in the past shown shown leadership in driving HTTPS adoption, as can be seen by their <a href=\"https://developer.apple.com/videos/play/wwdc2016/706\">WWDC2016 announcement</a> requiring iOS applications to use ATS and TLS 1.2. Our hope is that Microsoft and Apple follow Google and Mozilla’s lead as Edge, IE, and Safari collectively represent almost 20% of the desktop requests hitting Cloudflare’s edge.</p><h4>4. Browsers will start attempting connections over HTTPS before trying HTTP</h4><p>Analogous to how Apple <a href=\"https://www.ietf.org/mail-archive/web/v6ops/current/msg22455.html\">prioritizes IPv6 over IPv4</a>, major browsers will start to try addresses entered without a scheme over HTTPS before falling back to HTTP. The Google Chrome team has <a href=\"https://twitter.com/emschec/status/961748992051720192\">already indicated</a> they plan to do this, and we expect (hope!) they’ll announce a timeline for this change sometime in 2018.</p><h4>5. More CAs (including nascent ones) will follow Let’s Encrypt’s lead in issuing free certs using the ACME protocol</h4><p>One of the primary complaints from site operators as they react to Chrome and Firefox’s user-facing changes (with the potential to affect their traffic) is that “SSL certificates are expensive”. Even though Cloudflare began issuing free certificates for our reverse proxy users in late 2014 and Let’s Encrypt followed not too long after, there still aren’t many other easy, free options available.</p><p>We expect that additional CAs will begin to embrace the <a href=\"https://github.com/ietf-wg-acme/acme/blob/master/draft-ietf-acme-acme.md\">ACME protocol</a> for validation and issuance, helping to harden the protocol and increase its adoption. We further expect that new, free-of-charge CAs will enter the market and at least one will be operated by a large, well-funded incumbent such as Google.</p><h4>6. The CA/B Forum will vote in 2018 to further reduce certificate lifetimes from 27 months to 18 months or less, encouraging more automation</h4><p>The CA/Browser Forum is a group of CAs and browsers that collaborate on (among other things) a document known as the &quot;<a href=\"https://cabforum.org/baseline-requirements-documents/\">Baseline Requirements</a>&quot; or the &quot;BRs&quot;. These BRs dictate the minimum requirements that CAs are to adhere to, and a <a href=\"https://cabforum.org/2017/03/17/ballot-193-825-day-certificate-lifetimes/\">recent change</a> to them goes into affect March 1, 2018; as of that date, the maximum validity period for a certificate drops from 39 months to ~27 months (825 days).</p><p>The <a href=\"https://cabforum.org/pipermail/public/2017-January/009373.html\">initial proposal</a>, by Ryan Sleevi of Google, was to reduce the lifetime to 12 months, but this was met with strong opposition by the CAs (outside of Let&#39;s Encrypt which already caps lifetimes at 3 months and DigiCert who supported 13 months). A compromise was reached and goes into affect shortly, but we expect this topic to come to a vote again for either 18 or 13 months. CAs will again likely oppose this cap (with a few exceptions for the more automated ones), but browsers and root trust store operators may force the change anyway as it strengthens user security.</p><p>As site operators manually replace their expiring 3 year certificates, our hope and expectation is that they see the benefits and ease of automating the certificate lifecycle, encouraging them to deploy HTTPS more broadly across their organizations.</p><h3>OK, I understand what’s going to happen, but how can I tell now if my site is going to show a warning in July?</h3><p>The simplest way to tell if your site will soon show a &quot;Not secure&quot; label is by viewing it in a current version of Chrome or Firefox. If you do not see a lock, your site will soon have a more ominous warning. To get a preview of this warning, you can try browsing your site with a development version of either of these browsers by following the instructions below.</p><h4>Chrome</h4><ul><li><p>Use Chrome 65 or later.</p><ul><li><p>The easiest way to do this is to install Chrome Canary, which runs bleeding edge builds. Alternatively, you can install the <a href=\"https://www.chromium.org/getting-involved/dev-channel\">dev channel</a> alongside stable, but this can be confusing to launch as the applications look identical.</p></li></ul></li><li><p>Browse to chrome://flags/#enable-mark-http-as.</p></li><li><p>Change the setting from Default to Enabled and click the RELAUNCH NOW button.</p></li><li><p>Browse to a site that does not use HTTPS, such as neverssl.com.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3cOV0Q8QiU8jqO67Xup8Xx/81d84fd5e7527f6cc0145cfdac0cac6c/chrome-notsecure.png\" alt=\"chrome-notsecure\" class=\"kg-image\" width=\"686\" height=\"119\" loading=\"lazy\"/>\n            \n            </figure><h4>Firefox</h4><p><i>Firefox has not announced a date yet when this change will go into effect, but you can preview what it will look like when they do.</i></p><ul><li><p>Use Firefox 59 or later.</p><ul><li><p>You will need to download <a href=\"https://www.mozilla.org/en-US/firefox/channel/desktop/\">Firefox Nightly</a> to use this version.</p></li></ul></li><li><p>Enter &quot;about:config&quot; in the address bar.</p></li><li><p>Click &quot;I accept the risk!&quot; to view the advanced config.</p></li><li><p>Search for “security.insecure_connection” and flip all false values to true.</p></li><li><p>Browse to a site that does not use HTTPS, such as neverssl.com.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3bPwidy9MV9bCyAVA9B2sx/607ff28e273d6794fa0a00b448a7b196/firefox-notsecure.png\" alt=\"firefox-notsecure\" class=\"kg-image\" width=\"624\" height=\"128\" loading=\"lazy\"/>\n            \n            </figure><h3>What can I do to avoid this warning?</h3><p>Quite simply, all you need to do to avoid this warning is protect your site with HTTPS using a valid SSL certificate. Cloudflare makes it <a href=\"https://www.cloudflare.com/ssl\">incredibly simple</a> to do this.</p><p>If you sign up with us and point your nameservers to Cloudflare, we take care of the rest for free: validating your domain with one of our Certificate Authority partners, issuing a certificate that covers the apex of your domain and any subdomains (e.g., example.com and *.example.com), deploying that certificate to our 120+ data centers around the world for optimal performance, and renewing the certificate automatically when needed.</p><p>If you’re not able to sign up with us directly, for example you’re using a subdomain of a SaaS provider that has not yet deployed HTTPS for all users, you may want to suggest they look at our <a href=\"https://www.cloudflare.com/ssl-for-saas-providers/\">SSL for SaaS Providers</a> offering.</p><p>Lastly, if you want to help others avoid these warnings, we&#39;re hiring Software Engineers and Product Managers on the Security Engineering team at Cloudflare. Check out our open positions <a href=\"https://www.cloudflare.com/careers/departments/\">here</a> and come help us drive HTTPS adoption to 100%!</p>",
		"id": "4iFdDq3WAVTVzSMyt4x6QO",
		"localeList": {
			"name": "HTTPS or bust: Chrome’s plan to label sites as \"Not Secure\" Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2018-02-14T20:00:00.000+00:00",
		"slug": "https-or-bust-chromes-plan-to-label-sites-as-not-secure",
		"tags": [
			{
				"id": "5US4l4wdDysuDpZ4ktL3yP",
				"name": "HTTPS",
				"slug": "https"
			},
			{
				"id": "1HblPaFreDjetoJDJPjTAi",
				"name": "SSL",
				"slug": "ssl"
			},
			{
				"id": "3skwJ34K0c3CEY1cNogR4n",
				"name": "Chrome",
				"slug": "chrome"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			}
		],
		"title": "HTTPS or bust: Chrome’s plan to label sites as \"Not Secure\"",
		"updated_at": "2024-08-27T02:24:46.940Z",
		"url": "https://blog.cloudflare.com/https-or-bust-chromes-plan-to-label-sites-as-not-secure"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}