{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Rustam Lalkaka",
				"slug": "rustam",
				"bio": "In his role as Vice President of Product Management at Cloudflare, Rustam leads teams helping make the Internet safer, faster, more secure, and more private for all 4 billion Internet users. ",
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3LfyxlQxrrH8oXHQWznrU1/9f14ae8103e626744a3421d5a9e54f63/rustam.jpg",
				"location": null,
				"website": null,
				"twitter": "@lalkaka",
				"facebook": null
			}
		],
		"excerpt": "iCloud Private Relay is a new Internet privacy service from Apple that allows users to connect to the Internet and browse with Safari in a more secure and private way. Cloudflare is proud to work with Apple to operate portions of Private Relay infrastructure",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5B8sjglivWpmKJvaABJAWW/1ffaa0e4c83a78178aa2b1a7b03b7a5e/icloud-private-relay.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7avcuELKE6yv7dkTIUwrPV/c0e745d98211239172c040ea01b5a5f5/image3.png\" alt=\"iCloud Private Relay: information for Cloudflare customers\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>iCloud Private Relay is a new Internet privacy service from Apple that allows users with iOS 15, iPadOS 15, or macOS Monterey on their devices and an iCloud+ subscription, to connect to the Internet and browse with Safari in a more secure and private way. Cloudflare is proud to work with Apple to operate portions of Private Relay infrastructure.</p><p>In this post, we’ll explain how website operators can ensure the best possible experience for end users using iCloud Private Relay. Additional material is available from Apple, including “<a href=\"https://support.apple.com/guide/icloud/set-up-icloud-private-relay-mm7dc25cb68f/icloud\">Set up iCloud Private Relay on all your devices</a>”, and <a href=\"https://developer.apple.com/support/prepare-your-network-for-icloud-private-relay/\">“Prepare Your Network or Web Server for iCloud Private Relay”</a> which covers network operator scenarios in detail.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"how-browsing-works-using-icloud-private-relay\">How browsing works using iCloud Private Relay</h2>\n            <a href=\"#how-browsing-works-using-icloud-private-relay\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>The design of the iCloud Private Relay system ensures that no single party handling user data has complete information on both who the user is and what they are trying to access.</p><p>To do this, Private Relay uses modern encryption and transport mechanisms to relay traffic from user devices through Apple and partner infrastructure before sending traffic to the destination website.</p><p>Here’s a diagram depicting what connection metadata is available to who when <b><i>not</i></b> using Private Relay to browse the Internet:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3kTnsNE4HK74q8j50u276c/0418f9debaea6ad75f2122ac9b6681cf/image2.png\" alt=\"\" class=\"kg-image\" width=\"1818\" height=\"728\" loading=\"lazy\"/>\n            \n            </figure><p>Let’s look at what happens when we <b>add</b> Private Relay to the mix:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7FIwHsWOPoSYOFIXPsrFlc/9a58743abf2b8255c5e4b4c7492dd364/image1.png\" alt=\"\" class=\"kg-image\" width=\"1792\" height=\"728\" loading=\"lazy\"/>\n            \n            </figure><p>By adding <i>two</i> &quot;relays&quot; (labeled “Ingress Proxy” and “Egress Proxy” above), connection metadata is split:</p><ul><li><p>The user’s original IP address is visible to the access network (e.g. the coffee shop you’re sitting in, or your home ISP) and the first relay (operated by Apple), but the server or website name is encrypted and not visible to either.</p><p>The first relay hands encrypted data to a second relay (e.g. Cloudflare), but is unable to see “inside” the traffic to Cloudflare.</p></li><li><p>Cloudflare-operated relays know only that it is receiving traffic from a Private Relay user, but not specifically who or their client IP address. Cloudflare relays then forward traffic on to the destination server.</p></li></ul><p>Splitting connections in this way prevents websites from seeing user IP addresses and minimizes how much information entities “on path” can collect on user behavior.</p><p>Much more extensive information on how Private Relay works is available from Apple, including in the whitepaper “<a href=\"https://www.apple.com/privacy/docs/iCloud_Private_Relay_Overview_Dec2021.PDF\">iCloud Private Relay Overview</a>” (pdf).</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"cloudflares-role-as-a-second-relay\">Cloudflare’s role as a ‘second relay’</h2>\n            <a href=\"#cloudflares-role-as-a-second-relay\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>As mentioned above, Cloudflare functions as a second relay in the iCloud Private Relay system. We’re well suited to the task — Cloudflare operates one of the largest, fastest networks in the world. Our infrastructure makes sure traffic reaches every network in the world quickly and reliably, no matter where in the world a user is connecting from.</p><p>We’re also adept at building and working with modern encryption and transport protocols, including <a href=\"/rfc-8446-aka-tls-1-3/\">TLS 1.3</a> and <a href=\"/the-road-to-quic/\">QUIC</a>. QUIC, and closely related <a href=\"https://datatracker.ietf.org/wg/masque/about/\">MASQUE</a>, are the technologies that enable Private Relay to efficiently move data between multiple relay hops without incurring performance penalties.</p><p>The same building blocks that power Cloudflare products were used to build support for Private Relay: our <a href=\"https://www.cloudflare.com/network/\">network</a>, 1.1.1.1, <a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a>, and software like <a href=\"https://github.com/cloudflare/quiche\">quiche</a>, our <a href=\"/enjoy-a-slice-of-quic-and-rust/\">open-source</a> QUIC (and now MASQUE) protocol handling library, which now includes proxy support.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"im-a-website-operator-what-do-i-need-to-do-to-properly-handle-icloud-private-relay-traffic\">I’m a website operator. What do I need to do to properly handle iCloud Private Relay traffic?</h2>\n            <a href=\"#im-a-website-operator-what-do-i-need-to-do-to-properly-handle-icloud-private-relay-traffic\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>We’ve gone out of our way to ensure the use of iCloud Private Relay does not have any noticeable impact on your websites, APIs, and other content you serve on the web.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"ensuring-geolocation-accuracy\">Ensuring geolocation accuracy</h3>\n            <a href=\"#ensuring-geolocation-accuracy\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>IP addresses are often used by website operators to &quot;geolocate&quot; users, with user locations being used to show content specific to certain locations (e.g. search results) or to otherwise customize user experiences. Private Relay is designed to preserve IP address to geolocation mapping accuracy, even while preventing tracking and fingerprinting.</p><p>Preserving the ability to derive rough user location ensures that users with Private Relay enabled are able to:</p><ol><li><p>See place search and other locally relevant content when they interact with geography-specific content without precise location sharing enabled.</p></li><li><p>Consume content subject to licensing restrictions limiting which regions have access to it (e.g. live sports broadcasts and similar rights-restricted content).</p></li></ol><p>One of the key “acceptance tests” we think about when thinking about geolocating users is the “local pizza test”: with location services disabled, are the results returned for the search term “pizza near me” geographically relevant? Because of the geography preserving and IP address management systems we operate, they are!</p><p>At a high-level, here’s how it works:</p><ul><li><p>Apple relays geolocate user IP addresses and translate them into a “<a href=\"https://en.wikipedia.org/wiki/Geohash\">geohash</a>”. Geohashes are compact representations of latitude and longitude. The system includes protections to ensure geohashes cannot be spoofed by clients, and operates with reduced precision to ensure user privacy is maintained. Apple relays do not send user IP addresses onward.</p></li><li><p>Cloudflare relays maintain a pool of IP addresses for exclusive use by Private Relay. These IP addresses have been registered with geolocation database providers to correspond to specific cities around the world. When a Private Relay user connects and presents the previously determined geohash, the closest matching IP address is selected.</p></li><li><p>Servers see an IP address that corresponds to the original user IP address’s location, without obtaining information that may be used to identify the specific user.</p></li></ul><p>In most parts of the world, Private Relay supports geolocation to the nearest city by default. If users prefer to be located at more coarse location granularity, the option to locate based on country and timezone is available in Private Relay settings.</p><p>If your website relies on geolocation of client IP addresses to power or modify user experiences, <b>please ensure your geolocation database is kept up to date</b>. Apple and Cloudflare work directly with every major IP to geolocation provider to ensure they have an accurate mapping of Private Relay egress IP addresses (which present to your server as the client IP address) to geography. These mappings may change from time to time. Using the most up-to-date version of your provider’s database will ensure the most accurate geolocation results for all users, including those using Private Relay.</p><p>In addition to making sure your geolocation databases are up-to-date, even greater location accuracy and precision can be obtained by ensuring your origin is reachable via IPv6. Private Relay egress nodes prefer IPv6 whenever AAAA DNS records are available, and use IPv6 egress IP addresses that are geolocated with greater precision than their IPv4 equivalents. This means you can geolocate users to more specific locations (without compromising user privacy) and deliver more relevant content to users as a result.</p><p><b>If you’re a website operator using Cloudflare to protect and accelerate your site, no action is needed from you</b>. Our geolocation feeds used to enrich client requests with location metadata are kept up-to-date and include the information needed to geolocate users using iCloud Private Relay.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"delivering-high-performance-user-experiences\">Delivering high performance user experiences</h3>\n            <a href=\"#delivering-high-performance-user-experiences\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>One of the more counterintuitive things about performance on the Internet is that adding intermediate network “hops” between a user and a server can often <b><i>speed up</i></b> overall network performance, rather than slow it down, if those intermediate hops are well-connected and tuned for speed.</p><p>The networks that power iCloud Private Relay are exceptionally well-connected to other networks around the world, and we spend <a href=\"/tag/network-performance-update/\">considerable effort</a> squeezing every last ounce of performance out of our systems every day. We even have automated systems, like <a href=\"/argo/\">Argo Smart Routing</a>, that take data on how the Internet is performing and find the best paths across it to ensure consistent performance even in the face of Internet congestion and other “weather”.</p><p>Using Private Relay to reach websites instead of going directly to the origin server can result in significant, <b>measured decreases in page load time for clients using Private Relay vs those that are not</b>. That’s pretty neat: increased privacy does <b>not</b> come at the price of reduced page load and render performance when using Private Relay.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"limiting-reliance-on-ip-addresses-in-fraud-and-bot-management-systems\">Limiting reliance on IP addresses in fraud and bot management systems</h3>\n            <a href=\"#limiting-reliance-on-ip-addresses-in-fraud-and-bot-management-systems\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>To ensure that iCloud Private Relay users have good experiences interacting with your website, you should ensure that any systems that rely on IP address as a signal or way of indexing users properly accommodate many users originating from one or a handful of addresses.</p><p>Private Relay’s concentration of users behind a given IP address is similar to commonly deployed enterprise web gateways or carrier grade network address translation (CG-NAT) systems.</p><p>As explained in Apple <a href=\"https://www.apple.com/privacy/docs/iCloud_Private_Relay_Overview_Dec2021.PDF\">technical documentation</a>, “Private Relay is designed to ensure only valid Apple devices and accounts in good standing are allowed to use the service. Websites that use IP addresses to enforce fraud prevention and anti-abuse measures can trust that connections through Private Relay have been validated at the account and device level by Apple.” Because of these advanced device and user authorization steps, you might consider allowlisting Private Relay IP addresses explicitly. Should you wish to do so, Private Relay’s egress IP addresses are available in <a href=\"https://mask-api.icloud.com/egress-ip-ranges.csv\">CSV form here</a>.</p><p>If you as a server operator are interested in managing traffic from users using systems like iCloud Private Relay or similar NAT infrastructure, consider constructing rules using user level identifiers like cookies, and other metadata present including geography.</p><p>For Cloudflare customers, our rate limiting and bot management capabilities are well suited to handle traffic from systems like Private Relay. Cloudflare <a href=\"/multi-user-ip-address-detection/\">automatically detects</a> when IP addresses are likely to be used by multiple users, tuning our <a href=\"https://www.cloudflare.com/learning/ai/what-is-machine-learning/\">machine learning</a> and other security heuristics accordingly. Additionally, our WAF <a href=\"https://developers.cloudflare.com/waf/custom-rules/rate-limiting/parameters/\">includes functionality</a> specifically designed to manage traffic originating from shared IP addresses.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"understanding-traffic-flows\">Understanding traffic flows</h3>\n            <a href=\"#understanding-traffic-flows\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>As discussed above, IP addresses used by iCloud Private Relay are specific to the service. However, network and server operators (including Cloudflare customers) studying their traffic and logs may notice large amounts of user traffic arriving from Cloudflare’s network, AS13335. These traffic flows originating from AS13335 include forward proxied traffic from iCloud Private Relay, our enterprise web gateway products, and other products including WARP, our consumer VPN.</p><p>In the case of Cloudflare customers, traffic traversing our network to reach your Cloudflare proxied property is included in all usage and billing metrics as traffic from any Internet user would be.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"i-operate-a-corporate-or-school-network-and-id-like-to-know-more-about-icloud-private-relay\">I operate a corporate or school network and I’d like to know more about iCloud Private Relay</h2>\n            <a href=\"#i-operate-a-corporate-or-school-network-and-id-like-to-know-more-about-icloud-private-relay\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>CIOs and network administrators may have questions about how iCloud Private Relay interacts with their corporate networks, and how they might be able to use similar technologies to make their networks more secure. Apple&#39;s document, “<a href=\"https://developer.apple.com/support/prepare-your-network-for-icloud-private-relay/\">Prepare Your Network or Web Server for iCloud Private Relay</a>” covers network operator scenarios in detail.</p><p>Most <a href=\"https://www.cloudflare.com/learning/network-layer/enterprise-networking/\">enterprise networks</a> will not have to do anything to support Private Relay traffic. If the end-to-end encrypted nature of the system creates compliance challenges, local networks can block the use of Private Relay for devices connected to them.</p><p>Corporate customers of Cloudflare One services can put in place the name resolution blocks needed to disable Private Relay through their DNS filtering dashboard. Cloudflare One, Cloudflare’s <a href=\"https://www.cloudflare.com/network-security/\">corporate network security suite</a>, includes Gateway, built on the same network and codebase that powers iCloud Private Relay.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"icloud-private-relay-makes-browsing-the-internet-more-private-and-secure\">iCloud Private Relay makes browsing the Internet more private and secure</h2>\n            <a href=\"#icloud-private-relay-makes-browsing-the-internet-more-private-and-secure\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>iCloud Private Relay is an exciting step forward in preserving user privacy on the Internet, without forcing compromises in performance.</p><p>If you’re an iCloud+ subscriber you can <a href=\"https://support.apple.com/guide/icloud/set-up-icloud-private-relay-mm7dc25cb68f/icloud#:~:text=On%20your%20iPhone%2C%20iPad%2C%20or%20iPod%20touch%2C%20go%20to,or%20cellular%20plan%20(SIM).\">enable Private Relay in iCloud Settings</a> on your iPhone, iPad, or Mac on iOS15, iPadOS15, or macOS Monterey.</p>",
		"id": "6XAe2kJXqycDkf5kuqrE8",
		"localeList": {
			"name": "iCloud Private Relay: information for Cloudflare customers Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "iCloud Private Relay is a new Internet privacy service from Apple that allows users with iOS 15, iPadOS 15, or macOS Monterey on their devices and an iCloud+ subscription to connect to the Internet and browse with Safari in a more secure and private way. Cloudflare is proud to work with Apple to operate portions of Private Relay infrastructure.",
		"metadata": {
			"title": "iCloud Private Relay: information for Cloudflare customers",
			"description": "iCloud Private Relay is a new Internet privacy service from Apple that allows users with iOS 15, iPadOS 15, or macOS Monterey on their devices and an iCloud+ subscription to connect to the Internet and browse with Safari in a more secure and private way. Cloudflare is proud to work with Apple to operate portions of Private Relay infrastructure.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4CUXpKKHS5EQEeCgtg7Qf0/fbe89135472316a49f15c8ce7ea659a4/icloud-private-relay-GmvZ4O.png"
		},
		"primary_author": {},
		"published_at": "2022-03-02T13:59:09.000+00:00",
		"slug": "icloud-private-relay",
		"tags": [
			{
				"id": "4g3WhSYP2zgnFNMLFXj6uU",
				"name": "iCloud Private Relay",
				"slug": "icloud-private-relay"
			},
			{
				"id": "5FOVsloGWsLi2zVtDotTJj",
				"name": "Apple",
				"slug": "apple"
			}
		],
		"title": "iCloud Private Relay: information for Cloudflare customers",
		"updated_at": "2024-10-09T23:17:24.866Z",
		"url": "https://blog.cloudflare.com/icloud-private-relay"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}