{
	"initialReadingTime": "8",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Tom Arnfeld",
				"slug": "tom",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2vem1ftveRj5SiW3oSvE1F/708de7ec43d74a4ad200749ed42f0f39/tom.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Since joining Cloudflare I’ve always known that as we grew, incredible things would be possible. It’s been a long held ambition to work in an organisation with the scale to answer a very controversial and difficult question. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/fL7r5Tc0PMfdzJmKFv87H/2af59057bb6357ddb3e03ec08be37dc7/imdb-2017.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/VaVPOLboFesIdw7NDx6RI/1f06004ba33a05612fdaeab932cf0156/17286720_0940c73627_b.jpg\" alt=\"Mince Pies\" class=\"kg-image\" width=\"1024\" height=\"429\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://creativecommons.org/licenses/by-sa/2.0/\">CC-BY-SA 2.0</a> <a href=\"https://www.flickr.com/photos/phil_g/17286720/in/photolist-2wAJU-7nUeqG-7oG65d-dEy5Rh-5KWk2j-5KSzP9-dzFvTK-b2ckqV-9HE6Vm-5KS9Ke-vpPoo-7uBMs1-aWs82p-5KcJZ7-pwRhWC-px5PXD-qch6NS-pwRixY-7mcnHY-5KS8pz-5KS7JD-px5NEZ-pwRib5-5ncoYs-5NWed2-q77Jou-7oJvNq-5KWnDq-8zMUYN-5KS72T-94VR5d-t8aSZ-94SNDp-pYpMsh-b1kxJc-dBBGMy-7eTu9m-dHzhow-uirqrY-5KcJzE-5MyC93-qtMdRu-aLiqbt-pBoaV5-aJcKSe-b1bTnr-aJcLk2-aJcL92-aJcLe2-aJcKHc\">image</a> by <a href=\"https://www.flickr.com/photos/phil_g\">Phil! Gold</a></p><p>Since joining Cloudflare I’ve always known that as we grew, incredible things would be possible. It’s been a long held ambition to work in an organisation with the scale to answer a very controversial and difficult question. To do so would require a collection of individuals with a depth of experience, passion, dedication &amp; above all collaborative spirit.</p><p>As Cloudflare’s London office has grown in the last 4 years I believe 2017 is the year we reach the tipping point where this is possible. A paradigm-shift in the type of challenges Cloudflare is able to tackle. We could finally sample every commercially available mince pie in existence before the 1st of December. In doing so, we would know conclusively which mince pie we should all be buying over Christmas to share with our friends &amp; families.</p><h3>What is a mince pie?</h3><p>For the uninitiated, a Mince Pie is “a sweet pie of British origin, filled with a mixture of dried fruits and spices called mincemeat, that is traditionally served during the Christmas season in the English world.” - <a href=\"https://en.wikipedia.org/wiki/Mince_pie\">Wikipedia for Mince Pie</a></p><p>The original Mince Pie was typically filled with a mixture of minced meat, suet and a variety of fruits and spices like cinnamon, cloves and nutmeg. Today, many mince pies are vegetarian-friendly, containing no meat or suet. They are churned out by both <a href=\"https://www.theguardian.com/lifeandstyle/2016/dec/09/inside-worlds-largest-mince-pie-factory-mr-kipling-christmas\">large commercial operations</a> and <a href=\"http://www.dunns-bakery.co.uk/about-dunns/\">200 year-old, family-run bakeries</a> alike to feed hungry Brits at Christmas. Some factories peak at at more than 27pps (pies per second).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7GZ0kOUyGRbnTYX3xUCqVZ/9bfe6fd4d54356b84cbfeccb90109b01/mincepie-Sketch--Today-at-14.07.04.png\" alt=\"Mince Pie Sketch\" class=\"kg-image\" width=\"1848\" height=\"932\" loading=\"lazy\"/>\n            \n            </figure><h3>Review Methodology</h3><p>Early on we settled on 4 key metrics to score each pie on, on a scale from 1-10. When reviewing anything with a scientific approach, consistency is key. Much like a well made pastry case.</p><h5>What does and does not constitute a pie?</h5><p>Very quickly we realised that we needed some hard rules on what counted as a pie. For example, we had some &quot;Frangipane Mince Pies&quot; from Marks &amp; Spencer which caused a lot of controversy– these do not have a top, but instead cover the mince with a baked frangipane.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2RNz3yh97I6YzgdeQNnios/2ee3f3f7df95112b55e6fb04fd78d189/frangipane.png\" alt=\"\" class=\"kg-image\" width=\"2316\" height=\"1380\" loading=\"lazy\"/>\n            \n            </figure><p>Although these rule-breaking pies were not included in our leaderboard, they&#39;re definitely worth a try... one reviewer described the filling as “inoffensive” and another left these comments;</p><p>&quot;ZERO air gap! How do you solve the problem of an air gap in your pie? Fill it with some delicious tasty frangipane, that&#39;s how. The crunchy almonds on the top really cut through the softness with some texture, too. Most excellent.&quot;</p><p><i>Tom Arnfeld, Systems Engineer</i></p><p><b>Pastry / Filling Ratio</b>The ratio is really key to a good mince pie, but it is also possible for other aspects of the pie to be bad while the ratio itself is excellent. To be clear (there was confusion and debate internally) a score of 5/10 ratio would mean the ratio was average in quality. It does not directly measure the ratio itself. A 10/10 would have the perfect ratio of pastry to mince. Air gap was also a consideration, and the detailed comments each reviewer made on each pie often explain this.</p><p><b>Pastry</b>The right pastry needs to be not too thick, crispy but still have chew and be moist but not soggy. It should hold the filling without it spilling out.</p><p><b>Filling</b>The filling itself is probably the thing most pies were scored harshly on. A good filling has a variety of fruits and textures and possibly even some other flavours such as brandy.</p><p><b>Overall</b>We left it to each reviewer to add an overall score judging the entire pie.</p><h3>Results</h3><p><b>30</b> types of mince pie, <b>68</b> reviewers, <b>18</b> hungry Cloudflare staff.</p><h4>Top 5 Pies</h4><p>After collecting all of the reviews together, here’s our top 5 pies.</p><h5>1. <a href=\"https://www.waitrose.com/ecom/products/heston-from-waitrose-spiced-shortcrust-mince-pies-lemon/791825-525982-525983\">Heston from Waitrose Spiced Shortcrust Mince Pies Lemon</a></h5><p><i>£0.75p per pie</i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5vnfC4LWw7UAedJDSbxPfP/a7f5359843806888813ccee84a324d8c/heston.png\" alt=\"\" class=\"kg-image\" width=\"2292\" height=\"1102\" loading=\"lazy\"/>\n            \n            </figure><p>Look, I&#39;m going to get straight to it: if you are a mince pie traditionalist, these are not the mince pies for you. HOWEVER, for me they were a revelation. They push boundaries, break all the rules but somehow retain the essence of a great mince pie.</p><p><b>Pastry:</b> TWO DIFFERENT TYPES for the base and the topping. Some people have an issue with the pastry &#39;rubble&#39; on top. I found it DELIGHTFUL. 9/10</p><p><b>Filling:</b> Not only was there excellent standard mincemeat, but also there was a thin layer of lemon jelly in there as well. SPLENDID. Strong nutmeg and clove themes throughout.</p><p>Extra marks for the surreal box art. (&quot;Ceci n&#39;est pas une pie&quot;)</p><p><i>Sam Howson, Support Engineer</i></p><h5>2. <a href=\"http://www.dunns-bakery.co.uk/shop/christmas-shop/handmade-mince-pies/mince-pies-puff-113\">Dunns Traditional Deep-Fill Pastry Mince Pies</a></h5><p><i>£1.35p per pie</i></p><p><b>Pastry / Filling Ratio:</b> Absolutely no visible air gap. TFL could learn from this. Actually fulfilling the promise of deep filled for the first time ever. 10/10</p><p><b>Pastry:</b> Really great. Well constructed, cooked &amp; even all the way around. We&#39;ve said this a lot but probably &quot;needs more butter&quot; 8/10</p><p><b>Filling:</b> Ironically the reason I like this is also the reason why it&#39;s not getting a 10. The citrus - it&#39;s so good to have some citrus in there - sorely lacking in lots of other fillings. But it&#39;s just too much - it&#39;s really the only discernible flavour. Some booze wouldn&#39;t go amiss here. 8/10</p><p><b>Overall:</b> This competition might be Dunn Dunn Dunn. Spectacular. 8.5</p><p><i>Simon Moore, Lead Customer Support Engineer</i></p><h5>3. Fortnum &amp; Mason</h5><p><i>£1.83p per pie</i></p><p>These were by far the most controversial, from our reviewers&#39; point of view.</p><p><b>Pastry / Filling Ratio:</b> About right... a well filled pie with little air gap and a pastry that wasn&#39;t so thick that it would diminish the filling. 9/10</p><p><b>Pastry:</b> The weakest part, butter and soft, lovely all over... except that the base was also like this and needed to be a bit crisper and less soft. 7/10</p><p><b>Filling:</b> Subtle flavours, good spices, a hint of Christmas warmth. Could be improved with a little more aftertaste like the K&amp;C ones had, but this is a good filling and with lots of filling, very tasty. 8/10</p><p><b>Overall:</b> A pretty good pie, one of the best yet but the pastry not being crisp and solid underneath makes it fall apart in your hands a little. 8/10</p><p><i>David Kitchen, Engineering Manager</i></p><p><b>For contrast, one anomalous reviewer wrote;</b></p><p><b>Pastry / Filling Ratio:</b> EXCELLENT. The pie is deep, and with little air gap. Other reviews mention an air gap however, so QC is clearly not a priority in spite of its cost. 9/10</p><p><b>Pastry:</b> Just fine. Kind of dry, not very buttery. Sugar was nice on top, but really nothing to write home about. Structurally this pie was terrible as the lid lifted clean off when I tried to get it out of its tin. 4/10</p><p><b>Filling:</b> The worst part of this pie, by a massive margin. The mince was almost a pureé, with no discernable fruit textures. Very lightly spiced, again with no flavour components of it being distinguishable. Lack of texture here made it feel like a mince pie for the elderly or small children as after the pastry had disintegrated, there was nothing to chew. 3/10</p><p><b>Overall:</b> Decadently priced farce of a pie filled with a disappointment flavoured mincemeat. Might as well have been packaged in a Londis box. As my girlfriend said &quot;That sounds like it needs covering in cream and then putting in the bin&quot;. I wholeheartedly agree. 3/10</p><p><i>Bhavin Tailor, Support Engineer</i></p><h5>4. Marks &amp; Spencer Standard Mince Pies (red box)</h5><p><i>(price unknown)</i></p><p><b>Pastry / Filling Ratio:</b> Filled to the brim. Excellent! 9/10</p><p><b>Pastry:</b> Buttery, right thickness, just lovely. Although a bit too much on the sweet side. 7/10</p><p><b>Filling:</b> Great! Nice flavours, still some texture, nothing overwhelms the other flavours. Just wonderful. 8/10</p><p><b>Overall:</b> Great pastry, could eat it all day. 8/10</p><p><i>Tom Strickx, Network Automation Engineer</i></p><h5>5. Marks &amp; Spencer Extra Special Mince Pies</h5><p><i>£0.33p per pie</i></p><p><b>Pastry / Filling Ratio:</b> Massive air gap. Probably has more air than mince, which is very disappointing. 5/10</p><p><b>Pastry:</b> Buttery, but a bit too thick. Feels a bit heavy. 7/10</p><p><b>Filling:</b> Very noticeable brandy smell, luckily not as present in the taste. Subtle brandy flavour, but doesn&#39;t overwhelm the actual mince. A+ 9/10</p><p><b>Overall:</b> Great flavour, love the touch of brandy, unfortunately a bit let down by the filling ratio, and the heaviness of the crust. 7/10</p><p><i>Tom Strickx, Network Automation Engineer</i></p><h4>Other Entrants</h4><p>While on our quest to try every pie on the market, we encountered some great ones that are worth a mention. Of aldi mince pies we&#39;ve tried a single Marks &amp; Spencer pie asda best taste of all, but one had the lidlest per pie cost.</p><h5>Greggs</h5><p><i>£0.25p per pie</i></p><p><b>Pastry / Filling Ratio:</b> There&#39;s no easy way of saying this, there&#39;s more pastry here than there are Greggs branches in Coventry. The only way I would score this lower was if there was no mince at all and I was just eating a solid puck of pastry. 1/10</p><p><b>Pastry:</b> Overcooked, brittle and really just miserable. I&#39;m giving it a point only because it exists. 1/10</p><p><b>Filling:</b> Sweet &amp; Bland. 1/10</p><p><b>Overall:</b> Horrible. 1/10</p><p><i>Simon Moore, Lead Customer Support Engineer</i></p><p>Bigger than the standard supermarket ones, which is definitely nice.</p><p><b>Pastry / Filling Ratio:</b> I think kids these day call it &quot;dat gap&quot;. Unfortunately in this case, it&#39;s not a good thing.</p><p><b>Pastry:</b> Buttery, crumbly, good thickness, bit bland. 6/10</p><p><b>Filling:</b> Bit bland as well, no specific highlights or notes of flavour. 6/10</p><p><b>Overall:</b> Pretty bland, but not too shabby.</p><p><i>Tom Strickx, Network Automation Engineer</i></p><h5>Costco</h5><p><i>£0.44p per pie</i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5iZOxmH3UL0dkAVzynW1ck/85f5aff104577f7045236f43706f1708/costco.png\" alt=\"\" class=\"kg-image\" width=\"2130\" height=\"956\" loading=\"lazy\"/>\n            \n            </figure><p><b>Pastry/Filling Ratio:</b> 9/10 To solve the problem of the &#39;air gap&#39;, Costco decided to top the mince pie with sponge cake. This technically makes the pastry/filling ratio near-perfect since the tiny amount of pastry on the outside matches the tiny amount of filling. Well played, Costco.</p><p><b>Pastry:</b> 3/10 The pastry itself is acceptable but minimal - the majority of the cake is sponge. Yes, I said cake - this is no pie.</p><p><b>Filling:</b> 1/10 They decided to fill it one currant high. And not even like a currant standing proud like the California Raisins, this is a teensy portion. I&#39;m pretty sure the icing on top is thicker than the filling.</p><p><b>Overall:</b> 2/10 This is not a mince pie, it&#39;s clearly a sugar cake that has some regulation-mandated minimum amount of mincemeat content to call it a mince pie. Making the &#39;pies&#39; huge doesn&#39;t compensate for anything. Poor showing, Costco.</p><p><i>Chris Branch, Systems Engineer</i></p><h5>Mr Kipling</h5><p><i>£0.25p per pie (from Tesco)</i></p><p><b>Pastry / Filling Ratio:</b> 5/10</p><p><b>Pastry:</b> More salty than buttery. 4/10</p><p><b>Filling:</b> Drabness cloaked in excessive sweetness. 4/10</p><p>Mr Kipling purports his products to be &quot;exceedingly good&quot; in his television advertisements, but this pie did not lend support to that claim.</p><p><i>David Wragg, Systems Engineer</i></p><h5>Aldi (Cognac Steeped)</h5><p><i>£0.38p per pie</i></p><p><b>Pastry / Filling Ratio:</b> This pie has more air than Michael Jordan 4/10</p><p><b>Pastry:</b> Good but far too thick on the lid. 6/10</p><p><b>Filling:</b> I can detect the booze but it&#39;s just not really adding anything. There&#39;s nothing of distinction here. 5/10</p><p><b>Overall:</b> 4/10 The ratio and the lid spoil what would otherwise be a serviceable mince pie.</p><p><i>Simon Moore, Lead Customer Support Engineer</i></p><h5>Jimmy’s Home-made Pies</h5><p>With so many mince pies moving through the office on a daily basis, one of our resident staff bakers decided to bake some of his own to add into the mix. Jimmy Crutchfield (Systems Reliability Engineer) brought in 12 lovingly made pies for us all to try...</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/SIyPPFj992MI1z4SJFD0j/d78883de1606be863b84865d6e6bfbf9/jimmy.png\" alt=\"Jimmy Alpha\" class=\"kg-image\" width=\"2334\" height=\"1910\" loading=\"lazy\"/>\n            \n            </figure><p><b>Pastry / Filling Ratio:</b> Nice and deep, but a little too moist. Surprising given apparently the mincemeat was shop bought – you&#39;d think it would have the right consistency.</p><p><b>Pastry:</b> The pastry was pretty well cooked, and not too dry. I think it could do with a bit more butter though. 8/10</p><p><b>Filling:</b> The added apple bits introduced some delightful new texture. 6/10</p><p><b>Overall:</b> Little in the way of decoration on the top, though bonus points for the lovingly home-made look. Pretty excited about the next version. 9/10</p><p><i>Tom Arnfeld, Systems Engineer</i></p><p>A couple of weeks later, Jimmy had his hand at making a second batch, too!</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7kECfasRkvvlSCxRgUtiGV/2618f93133eca1edb7826c45bb6b3392/jimmy-kitchen.jpeg.jpeg\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1200\" loading=\"lazy\"/>\n            \n            </figure><p><b>Pastry / Filling Ratio:</b> Small air gap. 8/10</p><p><b>Pastry:</b> Buttery &amp; crumbly, very good. 9/10</p><p><b>Filling:</b> Just a little too tart. 8/10</p><p><b>Overall:</b> I&#39;d be happy if i&#39;d paid for a box of them. 9/10</p><p><i>Michael Daly, Systems Reliability Engineering Manager</i></p><h4>Falling by the wayside</h4><p>There are too many pies and reviews to mention in full detail, but here’s a full list of the other pies we haven’t mentioned, sorted by their rating.</p><ul><li><p>Sainsbury’s Bakery (fresh)</p></li><li><p>Carluccio’s</p></li><li><p>Coco di Mama Mini Mince Pies</p></li><li><p>Riverford Farm Shop Classic</p></li><li><p>Tesco Standard</p></li><li><p>Marks &amp; Spencer Lattice-top</p></li><li><p>Marks &amp; Spencer All Butter</p></li><li><p>Tesco Finest (with Cognac)</p></li><li><p>Aldi Sloe Gin Mince Tarts</p></li><li><p>Waitrose All Butter</p></li><li><p>Gail’s</p></li><li><p>LIDL Favorina</p></li><li><p>Co-op Irresistible</p></li><li><p>Sainsbury’s Deep Filled</p></li><li><p>LIDL Brandy Butter</p></li><li><p>Aldi Almond Mince Tarts</p></li></ul><p>With so many reviews from so many staff, we’d like to thank everyone that took part in our quest! <i>Alex Palaistras, Bhavin Tailor, Chris Branch, David Kitchen, David Wragg, Etienne Labaume, John Graham-Cumming, Jimmy Crutchfield, Lorenz Bauer, Matthew Bullock, Michael Daly, Sam Howson, Scott Pearson, Simon Moore, Sophie Bush, Tim Ruffles, Tom Arnfeld, Tom Strickx.</i></p><p><b>If you want to join a passionate, dedicated, talented and mince pie-filled team - </b><a href=\"https://www.cloudflare.com/careers/\"><b>we’re hiring</b></a><b>!</b></p>",
		"id": "6Z33N5AvUQoiCA5GIqezp6",
		"localeList": {
			"name": "Building a new IMDB: Internet Mince Pie Database Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Since joining Cloudflare I’ve always known that as we grew, incredible things would be possible.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-12-08T14:55:55.000+00:00",
		"slug": "imdb-2017",
		"tags": [
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			}
		],
		"title": "Building a new IMDB: Internet Mince Pie Database",
		"updated_at": "2024-08-27T02:26:14.304Z",
		"url": "https://blog.cloudflare.com/imdb-2017"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}