{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Guest Author",
				"slug": "guest-author",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/YJzTr2p8aLvtEX5J7CysP/8be54016d68bd43aa5b327f0382f5827/guest-author.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "This post provides a retrospective analysis of Mirai — the infamous Internet-of-Things botnet that took down major websites via massive distributed denial-of-service using hundreds of thousands of compromised Internet-Of-Things devices.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/BQmPHUwiobcC1JPPSbpON/b0a1ed73df0c101f0f20e21c5a094a8f/inside-mirai-the-infamous-iot-botnet-a-retrospective-analysis.gif",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2HwWQOG4cYB7I1ehUHOUSD/8141a1b28211c968e6c821ef371ae2ec/animation-iot-botnet.gif\" alt=\"\" class=\"kg-image\" width=\"3822\" height=\"2341\" loading=\"lazy\"/>\n            \n            </figure><p><i>This is a guest post by Elie Bursztein who writes about security and anti-abuse research. It was first published on </i><a href=\"https://elie.net/blog/security/inside-mirai-the-infamous-iot-botnet-a-retrospective-analysis\"><i>his blog</i></a><i> and has been lightly edited.</i></p><p>This post provides a retrospective analysis of Mirai — the infamous Internet-of-Things botnet that took down major websites via massive distributed denial-of-service using hundreds of thousands of compromised Internet-Of-Things devices. This research was conducted by a team of researchers from Cloudflare (Jaime Cochran, Nick Sullivan), Georgia Tech, Google, Akamai, the University of Illinois, the University of Michigan, and Merit Network and resulted in <a href=\"https://www.usenix.org/system/files/conference/usenixsecurity17/sec17-antonakakis.pdf\">a paper published at USENIX Security 2017</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/lLZbSL8SEkofCrJXVyrg2/208233718cbe2ac2cd67d99e7e624aec/the-guardian-mirai-largest-in-history.jpg\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"592\" loading=\"lazy\"/>\n            \n            </figure><p>At its peak in September 2016, Mirai temporarily crippled several high-profile services such as <a href=\"https://www.ovh.com/us/\">OVH</a>, <a href=\"https://dyn.com/\">Dyn</a>, and <a href=\"https://krebsonsecurity.com/\">Krebs on Security</a> via massive distributed <a href=\"https://en.wikipedia.org/wiki/Denial-of-service_attack#Distributed_DoS\">Denial of service attacks (DDoS)</a>. <a href=\"https://www.ovh.com/us/news/articles/a2367.the-ddos-that-didnt-break-the-camels-vac\">OVH reported</a> that these attacks exceeded 1 Tbps—the largest on public record.</p><p>What’s remarkable about these record-breaking attacks is they were carried out via small, innocuous Internet-of-Things (IoT) devices like home routers, air-quality monitors, and personal surveillance cameras. At its peak, Mirai infected over 600,000 vulnerable IoT devices, according to our measurements.</p>\n            <figure class=\"kg-card kg-image-card \">\n            <a href=/content/images/2017/12/mirai-major-events-timeline.png>\n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/Pf3BnahqRTCDrJRMNvGAw/afb296e859a0774987a3d305c5b2e557/mirai-major-events-timeline.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"677\" loading=\"lazy\"/>\n            </a>\n            </figure><ul><li><p><a href=\"#toc-1\">Mirai Genesis</a>: Discusses Mirai’s early days and provides a brief technical overview of how Mirai works and propagates.</p></li><li><p><a href=\"#toc-k\">Krebs on Security attack</a>: Recounts how Mirai briefly silenced Brian Krebs website.</p></li><li><p><a href=\"#toc-2\">OVH DDoS attack</a>: Examines the Mirai author’s attempt to take down one of the world’s largest hosting providers.</p></li><li><p><a href=\"#toc-c\">The rise of copycats</a>: Covers the Mirai code release and how multiple hacking groups end-up reusing the code. This section also describes the techniques we used to track down the many variants of Mirai that arose after the release. Finally, this section discusses the targets and the motive behind each major variants.</p></li><li><p><a href=\"#toc-3\">Mirai&#39;s takedown of the Internet</a>: Tells the insider story behind Dyn attacks including the fact that the major sites (e.g., Amazon) taken down were just massive collateral damage.</p></li><li><p><a href=\"#toc-4\">Mirai’s attempted takedown of an entire country</a>: Looks at the multiple attacks carried out against Lonestar, Liberia’s largest operator.</p></li><li><p><a href=\"#toc-d\">Deutsche Telekom goes dark</a>: Discusses how the addition of a router exploit to one of the Mirai variant brought a major German Internet provider to its knees.</p></li><li><p><a href=\"#toc-5\">Mirai original author outed?</a>: Details Brian Krebs’ in-depth investigation into uncovering Mirai’s author.</p></li><li><p><a href=\"#toc-6\">Deutsche Telekom attacker arrested</a>: Recounts the arrest of the hacker who took down Deutsche Telekom and what we learned from his trial.</p></li></ul><hr/><p>### Mirai Genesis</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4DTQat2LJQ8Y2JOJ3rY7T7/4a442722a0a38fd9677520aafe7fb340/mirai-intial-report.png\" alt=\"\" class=\"kg-image\" width=\"959\" height=\"509\" loading=\"lazy\"/>\n            \n            </figure><p>The first public report of Mirai late <a href=\"http://blog.malwaremustdie.org/2016/08/mmd-0056-2016-linuxmirai-just.html\">August 2016</a> generated little notice, and Mirai mostly remained in the shadows until mid-September. At that time, It was propelled in the spotlight when it was used to carry massive DDoS attacks against <a href=\"https://krebsonsecurity.com/2016/09/krebsonsecurity-hit-with-record-ddos/\">Krebs on Security</a> the blog of a famous security journalist and <a href=\"https://www.ovh.com/us/news/articles/a2367.the-ddos-that-didnt-break-the-camels-vac\">OVH</a>, one of the largest web hosting provider in the world.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7tutmPQu7lod0Q5CrfJgyl/f8d789a490d889a64baf9dee652dd310/mirai-initial-day-scanning-ips.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"750\" loading=\"lazy\"/>\n            \n            </figure><p>While the world did not learn about Mirai until at the end of August, our telemetry reveals that it became active August 1st when the infection started out from a single bulletproof hosting IP. From thereon, Mirai spread quickly, doubling its size every 76 minutes in those early hours.</p><p>By the end of its first day, Mirai had infected over 65,000 IoT devices. By its second day, Mirai already accounted for half of all Internet telnet scans observed by our collective set of honeypots, as shown in the figure above. At its peak in November 2016 Mirai had infected over 600,000 IoT devices.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1sA3idN9tsCnTEibksrFx1/e0dc1e3e2b27215546e5f5aec01d088f/mirai-devices-breakdown.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"720\" loading=\"lazy\"/>\n            \n            </figure><p>Retroactively looking at the infected device services banners using <a href=\"https://censys.io/\">Censys&#39;</a> Internet-wide scanning reveals that most of the devices appear to be routers and cameras as reported in the chart above. Each type of banner is represented separately as the identification process was different for each so it might be that a device is counted multiple times. Mirai was actively removing any banner identification which partially explains why we were unable to identify most of the devices.</p><p>Before delving further into Mirai’s story, let’s briefly look at how Mirai works, specifically how it propagates and its offensive capabilities.</p><h3>How Mirai works</h3><p>At its core, Mirai is a <a href=\"https://en.wikipedia.org/wiki/Computer_worm\">self-propagating worm</a>, that is, it’s a malicious program that replicates itself by finding, attacking and infecting vulnerable IoT devices. It is also considered a botnet because the infected devices are controlled via a central set of command and control (C&amp;C) servers. These servers tell the infected devices which sites to attack next. Overall, Mirai is made of two key components: a replication module and an attack module.</p><h2>Replication module</h2>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7MPhfLTL6E6WUAS4xdlaJK/6ea51167445a23ed060e919a575bf95f/mirai-infection-process.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"675\" loading=\"lazy\"/>\n            \n            </figure><p>The replication module is responsible for growing the botnet size by enslaving as many vulnerable IoT devices as possible. It accomplishes this by (randomly) scanning the entire Internet for viable targets and attacking. Once it compromises a vulnerable device, the module reports it to the C&amp;C servers so it can be infected with the latest Mirai payload, as the diagram above illustrates.</p><p>To compromise devices, the initial version of Mirai relied exclusively on a fixed set of 64 well-known default login/password combinations commonly used by IoT devices. While this attack was very low tech, it proved extremely effective and led to the compromise of over 600,000 devices. For more information about DDoS techniques, read this <a href=\"https://www.cloudflare.com/learning/ddos/what-is-a-ddos-attack/\">Cloudflare primer</a>.</p><h4>Attack module</h4>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1CXRDsQBru2mC2SRjMEKmA/2e03bbf186cc6552270acc710aac87a7/mirai-attack-module.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"675\" loading=\"lazy\"/>\n            \n            </figure><p>The attack module is responsible for carrying out DDoS attacks against the targets specified by the C&amp;C servers. This module implements most of the code DDoS techniques such as HTTP flooding, UDP flooding, and all TCP flooding options. This wide range of methods allowed Mirai to perform volumetric attacks, application-layer attacks, and TCP state-exhaustion attacks.</p><h3>Krebs on Security attack</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2QDBF6lY3eznSnre1Tllhn/c88811207125e285eb6d511387dc9a60/krebs-on-security-timeline.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"750\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://krebsonsecurity.com/\">Krebs on Security</a> is Brian Krebs’ blog. Krebs is a widely known independent journalist who specializes in cyber-crime. Given Brian’s line of work, his blog has been targeted, unsurprisingly, by many DDoS attacks launched by the cyber-criminals he exposes. According to his telemetry (thanks for sharing, Brian!), his blog suffered 269 DDOS attacks between July 2012 and September 2016. As seen in the chart above, the Mirai assault was by far the largest, topping out at 623 Gbps.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/Kh8i6bd0zsu6DiCbd2J13/1ab35c46d1a9c0c1b9d61a42e2e75597/mirai-top-countries.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"720\" loading=\"lazy\"/>\n            \n            </figure><p>Looking at the geolocation of the IPs that targeted Brian’s site reveals that a disproportionate number of the devices involved in the attack are coming from South American and South-east Asia. As reported in the chart above Brazil, Vietnam and Columbia appear to be the main sources of compromised devices.</p><p>One dire consequence of this massive attack against Krebs was that Akamai, the CDN service that provided Brian’s DDoS protection, had to withdraw its support. This forced <a href=\"https://www.csoonline.com/article/3123806/security/krebsonsecurity-moves-to-project-shield-for-protection-against-ddos-attack-censorship.html\">Brian to move his site to Project Shield</a>. As he discussed in depth in <a href=\"https://krebsonsecurity.com/2016/09/the-democratization-of-censorship/\">a blog post</a>, this incident highlights how DDoS attacks have become a common and cheap way to censor people.</p><h3>OVH attack</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5CQ1HTPbEW8L92x2rbvHXV/d86fd29ead46bf28289f6306934233be/ovh-record-breaking-ddos-attack-ars-technica.jpg\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"462\" loading=\"lazy\"/>\n            \n            </figure><p>Brian was not Mirai’s first high-profile victim. A few days before he was struck, Mirai attacked <a href=\"https://en.wikipedia.org/wiki/OVH\">OVH</a>, one of the largest European hosting providers. According to their <a href=\"https://www.ovh.com/us/news/articles/a2367.the-ddos-that-didnt-break-the-camels-vac\">official numbers</a>, OVH hosts roughly 18 million applications for over one million clients, <a href=\"https://wikileaks.org/\">Wikileaks</a> being one of their most famous and <a href=\"http://www.datacenterdynamics.com/content-tracks/security-risk/british-spies-monitored-ceo-of-ovh/97461.fullarticle\">controversial</a>.</p><p>We know little about that attack as OVH did not participate in our joint study. As a result, the best information about it comes from a blog post OVH released after the event. From this post, it seems that the attack lasted about a week and involved large, intermittent bursts of DDoS traffic that targeted one undisclosed OVH customer.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4EGBcm6AzLQYAbpOMIV9ty/3b8370ce3bd7aa3b25658408ac2e15ef/octave-klaba-ovh-ceo-tweet-about-mirai-attack.jpg\" alt=\"\" class=\"kg-image\" width=\"1024\" height=\"350\" loading=\"lazy\"/>\n            \n            </figure><p>Octave Klaba, OVH’s founder, reported on Twitter that the attacks were targeting Minecraft servers. As we will see through this post, Mirai has been extensively used in gamer wars and is likely the reason why it was created in the first place.</p><p>According to OVH telemetry, the attack peaked at 1TBs and was carried out using 145,000 IoT devices. While the number of IoT devices is consistent with what we observed, the volume of the attack reported is significantly higher than what we observed with other attacks. For example, as mentioned earlier, Brian’s one topped out at 623 Gbps.</p><p>Regardless of the exact size, the Mirai attacks are clearly the largest ever recorded. They dwarf the previous public record holder, an attack against Cloudflare that topped out at <a href=\"/technical-details-behind-a-400gbps-ntp-amplification-ddos-attack/\">~400Gpbs</a>.</p><h3>The rise of copycats</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/xH2mtNePk44v5s9FQA2Yq/8c703d75795f57369cb25b2d85170b72/mirai-code-leaked-on-blackmarket-forums.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"480\" loading=\"lazy\"/>\n            \n            </figure><p>In an unexpected development, on September 30, 2017, Anna-senpai, Mirai’s alleged author, <a href=\"https://krebsonsecurity.com/2016/10/source-code-for-iot-botnet-mirai-released/\">released the Mirai source code</a> via an infamous hacking forum. He also wrote a forum post, shown in the screenshot above, announcing his retirement.</p><p>This code release sparked a proliferation of copycat hackers who started to run their own Mirai botnets. From that point forward, the Mirai attacks were not tied to a single actor or infrastructure but to multiple groups, which made attributing the attacks and discerning the motive behind them significantly harder.</p><h4>Clustering Mirai infrastructure</h4><p>To keep up with the Mirai variants proliferation and track the various hacking groups behind them, we turned to infrastructure clustering. Reverse engineering all the Mirai versions we can find allowed us to extract the IP addresses and domains used as C&amp;C by the various hacking groups than ran their own Mirai variant. In total, we recovered two IP addresses and 66 distinct domains.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1faeNrvBOwlBs5NidT4BFN/b9fcd62a35e3fb115181a5570d0cd76c/mirai-botnet-graph-labels.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"675\" loading=\"lazy\"/>\n            \n            </figure><p>Applying DNS expansion on the extracted domains and clustering them led us to identify 33 independent C&amp;C clusters that had no shared infrastructure. The smallest of these clusters used a single IP as C&amp;C. The largest sported 112 domains and 92 IP address. The figure above depicts the six largest clusters we found.</p><p>These top clusters used very different naming schemes for their domain names: for example, “cluster 23” favors domains related to animals such as 33kitensspecial.pw, while “cluster 1” has many domains related to e-currencies such as walletzone.ru. The existence of many distinct infrastructures with different characteristics confirms that multiple groups ran Mirai independently after the source code was leaked.</p><h4>Clusters over time</h4><p>Looking at how many DNS lookups were made to their respective C&amp;C infrastructures allowed us to reconstruct the timeline of each individual cluster and estimate its relative size. This accounting is possible because each bot must regularly perform a DNS lookup to know which IP address its C&amp;C domains resolves to.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4SNKlCPLxxYJh5EDwXxp9f/1ab9786e5045b174a5f2e0ef30bac442/mirai-variants-dns-lookup-overtime-splitted-graph.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"750\" loading=\"lazy\"/>\n            \n            </figure><p>The chart above reports the number of DNS lookups over time for some of the largest clusters. It highlights the fact that many were active at the same time. Having multiple variants active simultaneously once again emphasizes that multiple actors with different motives were competing to infect vulnerable IoT devices to carry out their DDoS attacks.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7GU3BOCTyKr6zh8L1baXLn/10974bdef9909aad02bc26bb4e76e9df/mirai-variants-dns-lookup-overtime.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"768\" loading=\"lazy\"/>\n            \n            </figure><p>Plotting all the variants in the graph clearly shows that the ranges of IoT devices infect by each variant differ widely. As the graph above reveals, while there were many Mirai variants, very few succeeded at growing a botnet large enough to take down major websites.</p><h4>From cluster to motive</h4><p>th, td { padding: 10px; }Notable clusters</p><p>Cluster</p><p>Notes</p><p>6</p><p>Attacked Dyn and gaming related targets</p><p>1</p><p>Original botnet. Attacked Krebs and OVH</p><p>2</p><p>Attacked Lonestar Cell</p><p>Looking at which sites were targeted by the largest clusters illuminates the specific motives behind those variants. For instance, as reported in the table above, the original Mirai botnet (cluster 1) targeted OVH and Krebs, whereas Mirai’s largest instance (cluster 6) targeted DYN and other gaming-related sites. Mirai’s third largest variant (cluster 2), in contrast, went after African telecom operators, as recounted later in this post.</p><p>Target</p><p>Attacks</p><p>Clusters</p><p>Notes</p><p>Lonestar Cell</p><p>616</p><p>2</p><p>Liberian telecom targeted by 102 reflection attacks</p><p>Sky Network</p><p>318</p><p>15, 26, 6</p><p>Brazilian Minecraft servers hosted in Psychz Networks data centers</p><p>104.85.165.1</p><p>192</p><p>1, 2, 6, 8, 11, 15 ...</p><p>Unknown router in Akamai’s network</p><p>feseli.com</p><p>157</p><p>7</p><p>Russian cooking blog</p><p>Minomortaruolo.it</p><p>157</p><p>7</p><p>Italian politician site</p><p>Voxility hosted C2</p><p>106</p><p>1, 2, 6, 7, 15 ...</p><p>Known decoy target</p><p>Tuidang websites</p><p>100</p><p>--</p><p>HTTP attacks on two Chinese political dissidence sites</p><p>execrypt.com</p><p>96</p><p>-0-</p><p>Binary obfuscation service</p><p>Auktionshilfe.info</p><p>85</p><p>2, 13</p><p>Russian auction site</p><p>houtai.longqikeji.com</p><p>85</p><p>25</p><p>SYN attacks on a former game commerce site</p><p>Runescape</p><p>73</p><p>—</p><p>World 26th of a popular online game</p><p>184.84.240.54</p><p>72</p><p>1, 10, 11, 15 ...</p><p>Unknown target hosted at Akamai</p><p>antiddos.solutions</p><p>71</p><p>—</p><p>AntiDDoS service offered at react.su.</p><p>Looking at the most attacked services across all Mirai variants reveals the following:</p><ol><li><p><b>Booter services monetized Mirai</b>: The wide diversity of targets shows that booter services ran at least some of the largest clusters. A booter service is a service provided by cyber criminals that offers on-demand DDoS attack capabilities to paying customers.</p></li><li><p><b>There are fewer actors than clusters</b>: Some clusters have strong overlapping targets, which tends to indicate that they were run by the same actors. For example, clusters 15, 26, and 6 were used to target specific Minecraft servers.</p></li></ol><h1>Mirai’s takedown of the Internet</h1><p>On October 21, a <a href=\"http://money.cnn.com/2016/10/21/technology/ddos-attack-popular-sites/index.html\">Mirai attack</a> targeted the popular DNS provider DYN. This event prevented Internet users from <a href=\"https://en.wikipedia.org/wiki/2016_Dyn_cyberattack\">accessing many popular websites</a>, including AirBnB, Amazon, Github, HBO, Netflix, Paypal, Reddit, and Twitter, by disturbing the DYN name-resolution service.</p><p>We believe this attack was not meant to “take down the Internet,” as it was painted by the press, but rather was linked to a larger set of attacks against gaming platforms.</p><p>We reached this conclusion by looking at the other targets of the DYN variant (cluster 6). They are all gaming related. Additionally, this is also consistent with the OVH attack as it was also targeted because it hosted specific game servers as discussed earlier. As sad as it seems, all the prominent sites affected by the DYN attack were apparently just the spectacular collateral damage of a war between gamers.</p><h3>Mirai’s attempted takedown of an entire country&#39;s network? October 31</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/RuhwBi0AWQgL2q82OCE7s/50b2041269091b420368a68a79e0e0ed/mirai-shutdown-internet-in-liberia-hackernews.jpg\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"560\" loading=\"lazy\"/>\n            \n            </figure><p>Lonestar Cell, one of the largest Liberian telecom operators started to be targeted by Mirai on October 31. Over the next few months, it suffered 616 attacks, the most of any Mirai victim.</p><p>The fact that the Mirai cluster responsible for these attack has no common infrastructure with the original Mirai or the DYN variant indicate that they were orchestrated by a totally different actor than the original author.</p><p>A few weeks after our study was published, this assessment was confirmed when the author of one of the most aggressive Mirai variant <a href=\"https://www.bleepingcomputer.com/news/security/hacker-bestbuy-admits-to-hijacking-deutsche-telekom-routers-with-mirai-malware/\">confessed during his trial</a> that he was paid to takedown Lonestar. He acknowledged that an unnamed Liberia’s ISP paid him $10,000 to take out its competitors. This validated that our clustering approach is able to accurately track and attribute Mirai’s attacks.</p><h3>Deutsche Telekom going dark</h3><p>On November 26, 2016, one of the largest German Internet provider Deutsche Telekom suffered a <a href=\"https://www.csoonline.com/article/3144197/security/upgraded-mirai-botnet-disrupts-deutsche-telekom-by-infecting-routers.html\">massive outage</a> after 900,000 of its routers were compromised.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/56okNq2XipDTr1CAZ2oHjZ/0697ed6ca836fd29c85b12c9624f99ae/mira-german-outage-failed-attempt-reuters.jpg\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"634\" loading=\"lazy\"/>\n            \n            </figure><p>Ironically, this outage was not due to yet another Mirai DDoS attack but instead due to a particularly innovative and buggy version of Mirai that knocked these devices offline while attempting to compromise them. This variant also affected thousands of <a href=\"https://motherboard.vice.com/en_us/article/nz7ky7/hackers-say-knocking-thousands-of-brits-offline-was-an-accident-mirai\">TalkTalk routers</a>.</p><p>What allowed this variant to infect so many routers was the addition to its replication module of a router exploit targeting at the <a href=\"https://en.wikipedia.org/wiki/TR-069\">CPE WAN Management Protocol (CWMP)</a>. The CWMP protocol is an HTTP-based protocol used by many Internet providers to auto-configure and remotely manage home routers, modems, and other customer-on-premises (CPE) equipment.</p><p>Beside its scale, this incident is significant because it demonstrates how the weaponization of more complex IoT vulnerabilities by hackers can lead to very potent botnets. We hope the Deutsche Telekom event acts as a wake-up call and push toward making IoT auto-update mandatory. This is much needed to curb the significant risk posed by vulnerable IoT device given the poor track record of Internet users manually patching their IoT devices.</p><h3>Mirai original author outed?</h3><p>In the months following his website being taken offline, Brian Krebs devoted hundreds of hours to investigating Anna-Senpai, the infamous Mirai author. In early January 2017, Brian announced that he <a href=\"https://krebsonsecurity.com/2017/01/who-is-anna-senpai-the-mirai-worm-author/\">believes</a> Anna-senpai to be Paras Jha, a Rutgers student who apparently has been involved in previous game-hacking related schemes. Brian also identified Josia White as a person of interest. After being outed, Paras Jha and Josia White and another individual were questioned by authorities and <a href=\"https://krebsonsecurity.com/2017/12/mirai-iot-botnet-co-authors-plead-guilty/\">plead guilty</a> in federal court to a variety of charges, some including their activity related to Mirai.</p><h3>Deutsche Telekom attacker arrested</h3><p>In November 2016, Daniel Kaye (aka BestBuy) the author of the Mirai botnet variant that brought down Deutsche Telekom was arrested at the <a href=\"http://www.bbc.com/news/technology-37510502\">Luton airport</a>. Prior to Mirai, a 29-year-old British citizen was infamous for selling his hacking services on various dark web markets.</p><p>In July 2017 a few months after being extradited to Germany Daniel Kaye <a href=\"https://www.bleepingcomputer.com/news/security/hacker-bestbuy-admits-to-hijacking-deutsche-telekom-routers-with-mirai-malware/\">plead guilty</a> and was sentenced to a one year and a half imprisonment with suspension. During the trial, Daniel admitted that he never intended for the routers to cease functioning. He only wanted to silently control them so he can use them as part of a DDoS botnet to increase his botnet firepower. As discussed earlier he also confessed being paid by competitors to takedown Lonestar.</p><p>In Aug 2017 Daniel was <a href=\"https://www.theguardian.com/uk-news/2017/aug/30/alleged-mastermind-daniel-kaye-lloyds-bank-cyber-attacks-extradited-uk\">extradited back to the UK to face extortion charges</a> after attempting to blackmail Lloyds and Barclays banks. According to press reports, he asked the Lloyds to pay about £75,000 in bitcoins for the attack to be called off.</p><h3>Takeways</h3><p>The prevalence of insecure IoT devices on the Internet makes it very likely that, for the foreseeable future, they will be the main source of DDoS attacks.</p><p>Mirai and subsequent IoT botnets can be averted if IoT vendors start to follow basic security best practices. In particular, we recommend that the following should be required of all IoT device makers:</p><ul><li><p><b>Eliminate default credentials</b>: This will prevent hackers from constructing a credential main list that allows them to compromise a myriad of devices as MIRAI did.</p></li><li><p><b>Make auto-patching mandatory</b>: IoT devices are meant to be “set and forget,” which makes manual patching unlikely. Having them auto-patch is the only reasonable option to ensure that no widespread vulnerability like the Deutsche Telekom one can be exploited to take down a large chunk of the Internet.</p></li><li><p><b>Implement rate limiting</b>: Enforcing login rate limiting to prevent brute-force attack is a good way to mitigate the tendency of people to use weak passwords. Another alternative would be using a captcha or a proof or work.</p></li></ul><p>Thank you for reading this post until the end!</p>",
		"id": "6CJR6Rgp1guSO8oWPfPYOv",
		"localeList": {
			"name": "Inside the infamous Mirai IoT Botnet: A Retrospective Analysis Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "This post provides an analysis of Mirai, the Internet-of-Things botnet that took down major websites via massive DDoS using 100s of 1000s of IOT devices.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-12-14T19:41:49.000+00:00",
		"reading_time": 13,
		"slug": "inside-mirai-the-infamous-iot-botnet-a-retrospective-analysis",
		"tags": [
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "5kIxDMJCg3PXQxVINDL0Cw",
				"name": "Attacks",
				"slug": "attacks"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "2pFyOCtANFB5qS6nbtQbVp",
				"name": "Vulnerabilities",
				"slug": "vulnerabilities"
			},
			{
				"id": "4l3WDYLk6bXCyaRc9pRzXa",
				"name": "Bots",
				"slug": "bots"
			},
			{
				"id": "48r7QV00gLMWOIcM1CSDRy",
				"name": "Speed & Reliability",
				"slug": "speed-and-reliability"
			},
			{
				"id": "6p334JmCmVYR5iL5Mnohds",
				"name": "Mirai",
				"slug": "mirai"
			},
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			}
		],
		"title": "Inside the infamous Mirai IoT Botnet: A Retrospective Analysis",
		"updated_at": "2024-08-27T02:25:58.901Z",
		"url": "https://blog.cloudflare.com/inside-mirai-the-infamous-iot-botnet-a-retrospective-analysis"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}