{
	"initialReadingTime": "11",
	"locale": "en-us",
	"localesAvailable": [
		"ja-jp",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "David Belson",
				"slug": "david-belson",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/en7vkXf6rLBm4F8IcNHXT/b2a7716e786872139c873c8f5a2fc825/david-belson.jpeg",
				"location": null,
				"website": null,
				"twitter": "@dbelson",
				"facebook": null
			},
			{
				"name": "Carlos Rodrigues",
				"slug": "carlos-rodrigues",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/zkL0dQnH3FcqRYV7JkuSH/44a839552510182b33d759fd17eae42e/carlos-rodrigues.png",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "The new Internet Quality page on Cloudflare Radar provides both country and network (autonomous system) level insight into Internet connection performance (bandwidth) and quality (latency, jitter) over time based on benchmark test data as well as speed.cloudflare.com test results",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7CGo1txgRBavj2CTg30Ek4/e9b9660db8304969f80923ea718b4a34/introducing-radar-internet-quality-page.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1j9oLJBK7nXXluuX8PL5AS/2b5608ed44b2dab257c60bc43e370fc6/image6-8.png\" alt=\"Introducing the Cloudflare Radar Internet Quality Page\" class=\"kg-image\" width=\"1200\" height=\"679\" loading=\"lazy\"/>\n            \n            </figure><p>Internet connections are most often marketed and sold on the basis of &quot;speed&quot;, with providers touting the number of megabits or gigabits per second that their various service tiers are supposed to provide. This marketing has largely been successful, as most subscribers believe that &quot;more is better”. Furthermore, many national broadband plans in countries around the world include specific target connection speeds. However, even with a high speed connection, gamers may encounter sluggish performance, while video conference participants may experience frozen video or audio dropouts. Speeds alone don&#39;t tell the whole story when it comes to Internet connection quality.</p><p>Additional factors like latency, jitter, and packet loss can significantly impact end user experience, potentially leading to situations where higher speed connections actually deliver a worse user experience than lower speed connections. Connection performance and quality can also vary based on usage – measured average speed will differ from peak available capacity, and latency varies under loaded and idle conditions.</p><h2>The new Cloudflare Radar Internet Quality page</h2><p>A little more than three years ago, as residential Internet connections were strained because of the shift towards working and learning from home due to the COVID-19 pandemic, <a href=\"/test-your-home-network-performance/\">Cloudflare announced the speed.cloudflare.com speed test tool</a>, which enabled users to test the performance and quality of their Internet connection. Within the tool, users can download the results of their individual test as a CSV, or share the results on social media. However, there was no aggregated insight into Cloudflare speed test results at a network or country level to provide a perspective on connectivity characteristics across a larger population.</p><p>Today, we are launching these long-missing aggregated connection performance and quality insights on Cloudflare Radar. The new <a href=\"https://radar.cloudflare.com/quality\">Internet Quality page</a> provides both country and network (<a href=\"https://www.cloudflare.com/learning/network-layer/what-is-an-autonomous-system/\">autonomous system</a>) level insight into Internet connection performance (<a href=\"/aim-database-for-internet-quality/\">bandwidth</a>) and quality (<a href=\"https://www.cloudflare.com/learning/performance/glossary/what-is-latency/\">latency</a>, <a href=\"/aim-database-for-internet-quality/\">jitter</a>) over time. (Your Internet service provider is likely an autonomous system with its own autonomous system number (ASN), and many large companies, online platforms, and educational institutions also have their own autonomous systems and associated ASNs.) The insights we are providing are presented across two sections: the Internet Quality Index (IQI), which estimates average Internet quality based on aggregated <a href=\"/benchmarking-edge-network-performance/\">measurements against a set of Cloudflare &amp; third-party targets</a>, and Connection Quality, which presents peak/best case connection characteristics based on <a href=\"https://speed.cloudflare.com/\">speed.cloudflare.com</a> test results aggregated over the previous 90 days. (Details on our approach to the analysis of this data are presented below.)</p><p>Users may note that individual speed test results, as well as the aggregate speed test results presented on the Internet Quality page will likely differ from those presented by other speed test tools. <a href=\"https://cacm.acm.org/magazines/2020/12/248801-measuring-internet-speed/fulltext\">This can be due to a number of factors</a> including differences in test endpoint locations (considering both geographic and network distance), test content selection, the impact of “rate boosting” by some ISPs, and testing over a single connection vs. multiple parallel connections. Infrequent testing (on any speed test tool) by users seeking to confirm perceived poor performance or validate purchased speeds will also contribute to the differences seen in the results published by the various speed test platforms.</p><p>And as we announced in April, <a href=\"/aim-database-for-internet-quality/\">Cloudflare has partnered with Measurement Lab (M-Lab)</a> to create a <a href=\"https://colab.research.google.com/drive/1xgc-7L1Okr04MSjsYJfiFeUN0Gu05bpQ?usp=sharing\">publicly-available, queryable repository</a> for speed test results. M-Lab is a non-profit third-party organization dedicated to providing a representative picture of Internet quality around the world. M-Lab produces and hosts the <a href=\"https://www.measurementlab.net/tests/ndt/\">Network Diagnostic Tool</a>, which is a very popular network quality test that records millions of samples a day. Given their mission to provide a publicly viewable, representative picture of Internet quality, we chose to partner with them to provide an accurate view of your Internet experience and the experience of others around the world using openly available data.</p><h2>Connection speed &amp; quality data is important</h2><p>While most advertisements for fixed broadband and mobile connectivity tend to focus on download speeds (and peak speeds at that), there’s more to an Internet connection, and the user’s experience with that Internet connection, than that single metric. In addition to download speeds, users should also understand the upload speeds that their connection is capable of, as well as the quality of the connection, as expressed through metrics known as latency and jitter. Getting insight into all of these metrics provides a more well-rounded view of a given Internet connection, or in aggregate, the state of Internet connectivity across a geography or network.</p><p>The concept of download speeds are fairly well understood as a measure of performance. However, it is important to note that the average download speeds experienced by a user during common Web browsing activities, which often involves the parallel retrieval of multiple smaller files from multiple hosts, can differ significantly from peak download speeds, where the user is downloading a single large file (such as a video or software update), which allows the connection to reach maximum performance. The bandwidth (speed) available for upload is sometimes mentioned in ISP advertisements, but doesn’t receive much attention. (And depending on the type of Internet connection, there’s often a significant difference between the available upload and download speeds.) However, the importance of upload came to the forefront in 2020 as video conferencing tools saw a surge in usage as both work meetings and school classes shifted to the Internet during the COVID-19 pandemic. To share your audio and video with other participants, you need sufficient upload bandwidth, and this issue was often compounded by multiple people sharing a single residential Internet connection.</p><p><a href=\"https://www.cloudflare.com/learning/performance/glossary/what-is-latency/\">Latency</a> is the time it takes data to move through the Internet, and is measured in the number of milliseconds that it takes a packet of data to go from a client (such as your computer or mobile device) to a server, and then back to the client. In contrast to speed metrics, lower latency is preferable. This is especially true for use cases like online gaming where latency can make a difference between a character’s life and death in the game, as well as video conferencing, where higher latency can cause choppy audio and video experiences, but it also <a href=\"/making-home-internet-faster/\">impacts web page performance</a>. The latency metric can be further broken down into loaded and idle latency. The former measures latency on a loaded connection, where bandwidth is actively being consumed, while the latter measures latency on an “idle” connection, when there is no other network traffic present. (These specific loaded and idle definitions are from the device’s perspective, and more specifically, from the speed test application’s perspective. Unless the speed test is being performed directly from a router, the device/application doesn&#39;t have insight into traffic on the rest of the network.) <a href=\"/test-your-home-network-performance/\">Jitter</a> is the average variation found in consecutive latency measurements, and can be measured on both idle and loaded connections. A lower number means that the latency measurements are more consistent. As with latency, Internet connections should have minimal jitter, which helps provide more consistent performance.</p><h2>Our approach to data analysis</h2><p>The Internet Quality Index (IQI) and Connection Quality sections get their data from two different sources, providing two different (albeit related) perspectives. Under the hood they share some common principles, though.</p><p>IQI builds upon the <a href=\"/benchmarking-edge-network-performance/\">mechanism</a> we already use to regularly benchmark ourselves against other industry players. It is based on end user measurements against a set of Cloudflare and third-party targets, meant to represent a pattern that has become very common in the modern Internet, where most content is served from distribution networks with points of presence spread throughout the world. For this reason, and by design, IQI will show worse results for regions and Internet providers that rely on international (rather than peering) links for most content.</p><p>IQI is also designed to reflect the traffic load most commonly associated with web browsing, rather than more intensive use. This, and the chosen set of measurement targets, effectively biases the numbers towards what end users experience in practice (where latency plays an <a href=\"/making-home-internet-faster/\">important role</a> in how fast things can go).</p><p>For each metric covered by IQI, and for each ASN, we calculate the 25th percentile, median, and 75th percentile at 15 minute intervals. At the country level and above, the three calculated numbers for each ASN visible from that region are independently aggregated. This aggregation takes the <a href=\"https://stats.labs.apnic.net/aspop\">estimated user population of each ASN</a> into account, biasing the numbers away from networks that source a lot of automated traffic but have few end users.</p><p>The Connection Quality section gets its data from the <a href=\"https://speed.cloudflare.com\">Cloudflare Speed Test</a> tool, which exercises a user&#39;s connection in order to see how well it is able to perform. It measures against the closest Cloudflare location, providing a good balance of realistic results and network proximity to the end user. We have a presence in <a href=\"https://www.cloudflare.com/network/\">285 cities around the world</a>, allowing us to be pretty close to most users.</p><p>Similar to the IQI, we calculate the 25th percentile, median, and 75th percentile for each ASN. But here these three numbers are immediately combined using an operation called the <a href=\"https://en.wikipedia.org/wiki/Trimean\">trimean</a> — a single number meant to balance the best connection quality that most users have, with the best quality available from that ASN (users may not subscribe to the best available plan for a number of reasons).</p><p>Because users may choose to run a speed test for different motives at different times, and also because we take privacy very seriously and don’t record any personally identifiable information along with test results, we aggregate at 90-day intervals to capture as much variability as we can.</p><p>At the country level and above, the calculated trimean for each ASN in that region is aggregated. This, again, takes the estimated user population of each ASN into account, biasing the numbers away from networks that have few end users but which may still have technicians using the Cloudflare Speed Test to assess the performance of their network.</p><h2>Navigating the Internet Quality page</h2><p>The new <a href=\"https://radar.cloudflare.com/quality\">Internet Quality page</a> includes three views: Global, country-level, and autonomous system (AS). In line with the other pages on Cloudflare Radar, the country-level and AS pages show the same data sets, differing only in their level of aggregation. Below, we highlight the various components of the Internet Quality page.</p><h3>Global</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2cMIwMf2Eb3K7ijLgnZwJV/6ddd2f2380b66e08ebe6a5a729ac78a5/image10.png\" alt=\"\" class=\"kg-image\" width=\"1056\" height=\"1081\" loading=\"lazy\"/>\n            \n            </figure><p>The top section of the <a href=\"https://radar.cloudflare.com/quality\">global (worldwide) view</a> includes time series graphs of the Internet Quality Index metrics aggregated at a continent level. The time frame shown in the graphs is governed by the selection made in the time frame drop down at the upper right of the page, and at launch, data for only the last three months is available. For users interested in examining a specific continent, clicking on the other continent names in the legend removes them from the graph. Although continent-level aggregation is still rather coarse, it still provides some insight into regional Internet quality around the world.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3uw2wOQ826I1ZI4pSoIPTk/2b248fb8aaf15c88df819604db99643c/image2-32.png\" alt=\"\" class=\"kg-image\" width=\"1660\" height=\"1094\" loading=\"lazy\"/>\n            \n            </figure><p>Further down the page, the Connection Quality section presents a <a href=\"https://en.wikipedia.org/wiki/Choropleth_map\">choropleth map</a>, with countries shaded according to the values of the speed, latency, or jitter metric selected from the drop-down menu. Hovering over a country displays a label with the country’s name and metric value, and clicking on the country takes you to the country’s Internet Quality page. Note that in contrast to the IQI section, the Connection Quality section always displays data aggregated over the previous 90 days.</p><!--kg-card-begin: html--><h3 id=\"IQI\">Country-level</h2><!--kg-card-end: html--><p>Within the country-level page (using <a href=\"https://radar.cloudflare.com/quality/ca\">Canada</a> as an example in the figures below), the country’s IQI metrics over the selected time frame are displayed. These time series graphs show the median bandwidth, latency, and DNS response time within a shaded band bounded at the 25th and 75th percentile and represent the average expected user experience across the country, as discussed in the <i>Our approach to data analysis</i> section above.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2hk4e79T8ZLr0CN9qOkVsg/bb8200076173b23c704625c1e6ccbbaa/image3-25.png\" alt=\"\" class=\"kg-image\" width=\"772\" height=\"382\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7iMlQAaL6UNZAHWlNKqm6R/91f90d121ffaab890c267889ba429007/image7-7.png\" alt=\"\" class=\"kg-image\" width=\"772\" height=\"310\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4hnrODy4OgChr7Fy27enNp/c0e25bb7070c73e94a7f1f9e58f69c68/image12-1.png\" alt=\"\" class=\"kg-image\" width=\"772\" height=\"310\" loading=\"lazy\"/>\n            \n            </figure><!--kg-card-begin: html--><p id=\"connectionquality\">Below that is the Connection Quality section, which provides a summary view of the country’s measured upload and download speeds, as well as latency and jitter, over the previous 90 days. The colored wedges in the Performance Summary graph are intended to illustrate aggregate connection quality at a glance, with an “ideal” connection having larger upload and download wedges and smaller latency and jitter wedges. Hovering over the wedges displays the metric’s value, which is also shown in the table to the right of the graph.</p><!--kg-card-end: html-->\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7h0DIEi3JxWQlljgXCxASm/dc99d3307ec3ba8b014ca01ec235f244/image4-21.png\" alt=\"\" class=\"kg-image\" width=\"830\" height=\"458\" loading=\"lazy\"/>\n            \n            </figure><p>Below that, the Bandwidth and Latency/Jitter histograms illustrate the bucketed distribution of upload and download speeds, and latency and jitter measurements. In some cases, the speed histograms may show a noticeable bar at 1 Gbps, or 1000 ms (1 second) on the latency/jitter histograms. The presence of such a bar indicates that there is a set of measurements with values greater than the 1 Gbps/1000 ms maximum histogram values.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/QL7897X8IVsuAOzjxKr8u/df8e384441f9c59548965f4c86e7e182/image11-3.png\" alt=\"\" class=\"kg-image\" width=\"830\" height=\"663\" loading=\"lazy\"/>\n            \n            </figure><h3>Autonomous system level</h3><p>Within the upper-right section of the country-level page, a list of the <a href=\"/asn-on-radar/\">top five autonomous systems</a> within the country is shown. Clicking on an ASN takes you to the Performance page for that autonomous system. For others not displayed in the top five list, you can use the search bar at the top of the page to search by autonomous system name or number. The graphs shown within the AS level view are identical to those shown at a country level, but obviously at a different level of aggregation. You can find the ASN that you are connected to from the <a href=\"https://radar.cloudflare.com/ip\">My Connection page</a> on Cloudflare Radar.</p><h2>Exploring connection performance &amp; quality data</h2><p>Digging into the IQI and Connection Quality visualizations can surface some interesting observations, including characterizing Internet connections, and the impact of Internet disruptions, including shutdowns and network issues. We explore some examples below.</p><h3>Characterizing Internet connections</h3><p><a href=\"https://www.verizon.com/home/fios/\">Verizon FiOS</a> is a residential fiber-based Internet service available to customers in the United States. Fiber-based Internet services (as opposed to cable-based, DSL, dial-up, or satellite) will generally offer symmetric upload and download speeds, and the FiOS <a href=\"https://www.verizon.com/home/fios-fastest-internet/\">plans page</a> shows this to be the case, offering 300 Mbps (upload &amp; download), 500 Mbps (upload &amp; download), and “1 Gig” (Verizon claims average wired speeds between 750-940 Mbps download / 750-880 Mbps upload) plans. Verizon carries FiOS traffic on <a href=\"https://radar.cloudflare.com/quality/as701\">AS701</a> (labeled <a href=\"https://en.wikipedia.org/wiki/UUNET\">UUNET</a> due to a historical acquisition), and in looking at the bandwidth histogram for AS701, several things stand out. The first is a rough symmetry in upload and download speeds. (A cable-based Internet service provider, in contrast, would generally show a wide spread of download speeds, but have upload speeds clustered at the lower end of the range.) Another is the peaks around 300 Mbps and 750 Mbps, suggesting that the 300 Mbps and “1 Gig” plans may be more popular than the 500 Mbps plan. It is also clear that there are a significant number of test results with speeds below 300 Mbps. This is due to several factors: one is that Verizon also carries lower speed non-FiOS traffic on AS701, while another is that erratic nature of in-home WiFi often means that the speeds achieved on a test will be lower than the purchased service level.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6wjsM0gTtzNBqeU7n8npg6/54ab4ad6c76f0f1f308d0d0c79f2b801/image13.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><h3>Traffic shifts drive latency shifts</h3><p>On May 9, 2023, the government of <a href=\"https://radar.cloudflare.com/pk\">Pakistan</a> ordered the shutdown of mobile network services in the wake of protests following the arrest of former Prime Minister Imran Khan. Our blog post covering this <a href=\"/cloudflares-view-of-internet-disruptions-in-pakistan/\">shutdown</a> looked at the impact from a traffic perspective. Within the post, we noted that autonomous systems associated with fixed broadband networks saw significant increases in traffic when the mobile networks were shut down – that is, some users shifted to using fixed networks (home broadband) when mobile networks were unavailable.</p><p>Examining IQI data after the blog post was published, we found that the impact of this traffic shift was also visible in our latency data. As can be seen in the shaded area of the graph below, the shutdown of the mobile networks resulted in the median latency dropping about 25% as usage shifted from higher latency mobile networks to lower latency fixed broadband networks. An increase in latency is visible in the graph when mobile connectivity was restored on May 12.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5bMBKpVtEY49leTuopoTHf/05d27c3a3a0bac0640ec1f6f4219f6eb/image8-3.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><h3>Bandwidth shifts as a potential early warning sign</h3><p>On April 4, UK mobile operator <a href=\"https://twitter.com/CloudflareRadar/status/1643070260130504704\">Virgin Media suffered several brief outages</a>. In examining the IQI bandwidth graph for <a href=\"https://radar.cloudflare.com/quality/as5089\">AS5089</a>, the ASN used by Virgin Media (formerly branded as <a href=\"https://en.wikipedia.org/wiki/NTL_Incorporated\">NTL</a>), indications of a potential problem are visible several days before the outages occurred, as median bandwidth dropped by about a third, from around 35 Mbps to around 23 Mbps. The outages are visible in the circled area in the graph below. <a href=\"https://www.ispreview.co.uk/index.php/2023/04/major-network-outage-strikes-broadband-isp-virgin-media-uk.html\">Published reports</a> indicate that the problems lasted into April 5, in line with the lower median bandwidth measured through mid-day.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7iJ8Kk0I1TyLMf0r3edCjw/de380b619d9f30f8763fc3b9f4ac3dcb/image1-34.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><h3>Submarine cable issues cause slower browsing</h3><p>On June 5, Philippine Internet provider <a href=\"https://pldt.com/\">PLDT</a> <a href=\"https://twitter.com/pldt/status/1665670783388254208\">Tweeted</a> an advisory that noted “One of our submarine cable partners confirms a loss in some of its internet bandwidth capacity, and thus causing slower Internet browsing.” IQI latency and bandwidth graphs for <a href=\"https://radar.cloudflare.com/quality/as9299\">AS9299</a>, a primary ASN used by PLDT, shows clear shifts starting around 06:45 UTC (14:45 local time). Median bandwidth dropped by half, from 17 Mbps to 8 Mbps, while median latency increased by 75% from 37 ms to around 65 ms. 75th percentile latency also saw a significant increase, nearly tripling from 63 ms to 180 ms coincident with the reported submarine cable issue.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/lAnA7kxm6DSC7bKYxN2Oo/fed2512048460b017230eef7da1b54d8/June-5---Philippines---PLDT---bandwidth---shaded.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"900\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2wSAez7ZOMj6rnH2h4xnfv/55fefa6ab37f404bebde65afea7ff30f/image9.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><h2>Conclusion</h2><p>Making network performance and quality insights available on Cloudflare Radar supports Cloudflare’s mission to help build a better Internet. However, we’re not done yet – we have more enhancements planned. These include making data available at a more granular geographical level (such as state and possibly city), incorporating <a href=\"/aim-database-for-internet-quality/\">AIM scores</a> to help assess Internet quality for specific types of use cases, and embedding the Cloudflare speed test directly on Radar using the <a href=\"https://github.com/cloudflare/speedtest?ref=blog.cloudflare.com\">open source JavaScript module</a>.</p><p>In the meantime, we invite you to use <a href=\"https://speed.cloudflare.com/\">speed.cloudflare.com</a> to test the performance and quality of your Internet connection, share any country or AS-level insights you discover on social media (tag <a href=\"https://twitter.com/cloudflareradar\">@CloudflareRadar</a> on Twitter or <a href=\"https://noc.social/@cloudflareradar\">https://noc.social/@cloudflareradar</a> on Mastodon), and explore the underlying data through the <a href=\"https://colab.research.google.com/drive/1xgc-7L1Okr04MSjsYJfiFeUN0Gu05bpQ?usp=sharing\">M-Lab repository</a> or the <a href=\"https://developers.cloudflare.com/api/\">Radar API</a>.</p><h3>Watch on Cloudflare TV</h3><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://customer-rhnwzxvb3mg4wz3v.cloudflarestream.com/debcbed2114d086c870059ac604eca49/iframe?preload=true&poster=https%3A%2F%2Fcustomer-rhnwzxvb3mg4wz3v.cloudflarestream.com%2Fdebcbed2114d086c870059ac604eca49%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D1s%26height%3D600\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div><!--kg-card-end: html--><p></p>",
		"id": "6T1IGaRvIoNpdBuOKcixG8",
		"localeList": {
			"name": "Introducing the Cloudflare Radar Internet Quality Page Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "The new Performance page on Cloudflare Radar provides both country and network (autonomous system) level insight into Internet connection performance (bandwidth) and quality (latency, jitter) over time based on benchmark test data as well as speed.cloudflare.com test results.",
		"metadata": {
			"title": "Introducing the Cloudflare Radar Internet Quality Page",
			"description": "The new Performance page on Cloudflare Radar provides both country and network (autonomous system) level insight into Internet connection performance (bandwidth) and quality (latency, jitter) over time based on benchmark test data as well as speed.cloudflare.com test results.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4Fva3BkIo1sZFQBJBTCf4S/c0e639315d27ed4b0811bace9d2c2fa6/introducing-radar-internet-quality-page-cdTZTa.png"
		},
		"primary_author": {},
		"published_at": "2023-06-23T14:00:09.000+01:00",
		"slug": "introducing-radar-internet-quality-page",
		"tags": [
			{
				"id": "7a1NuQRjeZo9DhGt97wDwe",
				"name": "Speed Week",
				"slug": "speed-week"
			},
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "5DD7GZ0oxjP3NGOaJMwyWq",
				"name": "Internet Quality",
				"slug": "internet-quality"
			},
			{
				"id": "4gN0ARax0fHxjtZL07THOe",
				"name": "Performance",
				"slug": "performance"
			},
			{
				"id": "1OAcGRrbAS8T2hKb2tqB7N",
				"name": "Speed",
				"slug": "speed"
			}
		],
		"title": "Introducing the Cloudflare Radar Internet Quality Page",
		"updated_at": "2024-08-27T01:08:53.602Z",
		"url": "https://blog.cloudflare.com/introducing-radar-internet-quality-page"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}