{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Nick Sullivan",
				"slug": "nick-sullivan",
				"bio": "Nick Sullivan was Head of Research (& Cryptography) at Cloudflare until 2023. He is passionate about improving security and privacy through cutting-edge research and the development of open standards.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1awsFzXodRY6h5BEcWKcCE/85e0d04bb0360398b832e6476173945e/nick-sullivan.jpg",
				"location": "San Francisco",
				"website": "https://crypto.dance",
				"twitter": "@grittygrease",
				"facebook": null
			}
		],
		"excerpt": "Cloudflare’s mission is to help build a faster and more secure Internet. Over the last several years, the Internet Engineering Task Force (IETF) has been working on a new version of TLS, the protocol that powers the secure web.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/01zugo4vFijAmQS86pVIrN/8bcaffc640fcbaf10cccc1e09060d7bc/introducing-0-rtt.jpg",
		"featured": false,
		"html": "<p><sub><i></i></sub></p><blockquote><p><sub><i>NOTE: This post has been updated to reflect that the feature is no longer enabled by default. Further details </i></sub><a href=\"https://developers.cloudflare.com/speed/optimization/protocol/0-rtt-connection-resumption/\"><sub><i>outlined here</i></sub></a><sub><i>.</i></sub></p></blockquote><p>Cloudflare’s mission is to help build a faster and more secure Internet. Over the last several years, the Internet Engineering Task Force (IETF) has been working on a new version of TLS, the protocol that powers the secure web. <a href=\"/introducing-tls-1-3/\">Last September</a>, Cloudflare was the first service provider to enable people to use this new version of the protocol, <a href=\"/tag/tls%201.3/\">TLS 1.3</a>, improving security and performance for millions of customers.</p><p>Today we are introducing another performance-enhancing feature: zero <a href=\"https://www.cloudflare.com/learning/cdn/glossary/round-trip-time-rtt/\">round trip</a> time resumption, abbreviated as <i>0-RTT</i>. About 60% of the connections we see are from people who are visiting a site for the first time or revisiting after an extended period of time. TLS 1.3 speeds up these connections significantly. The remaining 40% of connections are from visitors who have recently visited a site and are resuming a previous connection. For these resumed connections, standard TLS 1.3 is safer but no faster than any previous version of TLS. 0-RTT changes this. It dramatically speeds up resumed connections, leading to a faster and smoother web experience for web sites that you visit regularly. This speed boost is especially noticeable on mobile networks.</p><p>We’re happy to announce that 0-RTT is <b>NOT</b> enabled by default for all sites on Cloudflare’s free service. For paid customers, it can be enabled in the Crypto app in the Cloudflare dashboard. </p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7jnAtBFcCo19Qvyjxa2aVI/7825e8ad85adc280704bd1d5ae710e68/image05.jpg\" alt=\"\" class=\"kg-image\" width=\"1960\" height=\"342\" loading=\"lazy\"/>\n            \n            </figure><p>This is an experimental feature, and therefore subject to change.</p><p>If you&#39;re just looking for a live demo, click <a href=\"#demo\">here</a>.</p><h3>The cost of latency</h3><p>A big component of web performance is transmission latency. Simply put, transmission latency is the amount of time it takes for a message to get from one party to another over a network. Lower latency means snappier web pages and more responsive APIs; when it comes to responsiveness, every millisecond counts.</p><p>The diagram below comes from a recent latency test of Cloudflare’s network using the RIPE Atlas project. In the experiment, hundreds of probes from around the world sent a single <a href=\"https://en.wikipedia.org/wiki/Ping_(networking_utility)\">“ping”</a> message to Cloudflare and measured the time it took to get an answer in reply. This time is a good approximation of how long it takes for data to make the round trip from the probe to the server and back, so-called <i>round-trip latency</i>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            <a href=https://atlas.ripe.net/measurements/7883648/>\n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3eiU71K5ZPEX2slK1J1mYb/67a6e307c1d1833029ac378d4f2d36dd/image03.png\" alt=\"https://atlas.ripe.net/measurements/7883648/\" class=\"kg-image\" width=\"895\" height=\"525\" loading=\"lazy\"/>\n            </a>\n            </figure><p>Latency is usually measured in milliseconds or thousandths of a second. A thousandth of a second may not seem like a long time, but they can add up quickly. It’s <a href=\"https://www.nngroup.com/articles/response-times-3-important-limits/\">generally accepted</a> that the threshold over which humans no longer perceive something as instantaneous is 100ms. Anything above 100ms will seem fast, but not immediate. For example, Usain Bolt’s reaction time out of the starting blocks in the hundred meter sprint is around <a href=\"https://www.nytimes.com/interactive/2016/08/13/sports/olympics/can-you-beat-usain-bolt-out-of-the-blocks.html\">155ms</a>, a good reference point for thinking about latency. Let’s use 155ms, a fast but human perceptible amount of time, as a unit of time measurement. Call 155ms “one Bolt.”</p><p>The map above shows that most probes have very low round-trip latency (&lt;20ms) to Cloudflare’s global network. However, for a percentage of probes, the time it takes to reach the nearest Cloudflare data center is much longer, in some cases exceeding 300ms (or two bolts!).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/59Z9OOkEOcRLQzaJM6A2ZB/7ead82fdc425276acbc830856754962a/image01.jpg\" alt=\"200ms into the 200m\" class=\"kg-image\" width=\"1280\" height=\"850\" loading=\"lazy\"/>\n            \n            </figure><p><sub>Creative Commons Attribution 2.0 Generic [</sub><a href=\"https://commons.wikimedia.org/wiki/File:London\\_2012\\_200m\\_heat\\_1\\_start.jpg\"><sub>Nick J. Webb</sub></a><sub>]</sub></p><p>Connections that travel over longer distances have higher latency. Data travel speed is limited by the speed of light. When Cloudflare opens a new datacenter in a <a href=\"/panama-expands-cloudflare-network-to-50-countries/\">new city</a>, latency is reduced for people in the surrounding areas when visiting sites that use Cloudflare. This improvement is often simply because data has a shorter distance to travel.</p><p>Geographic proximity is not the only contributor to latency. WiFi and cellular networks can add <a href=\"https://hpbn.co/wifi/#measuring-your-wifi-first-hop-latency\">tens</a> or even <a href=\"https://opensignal.com/blog/2014/03/10/lte-latency-how-does-it-compare-to-other-technologies/\">hundreds</a> of milliseconds to transmission latency. For example, using a 3G cellular network adds around 1.5 bolts to every transmission. Satellite Internet connections are even worse, adding up to <a href=\"https://arstechnica.com/information-technology/2013/02/satellite-internet-faster-than-advertised-but-latency-still-awful/\">4 bolts to every transmission</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1wIWoXVW0V1AugzJb4lVoh/8ae080446e11564326ce509cd923821a/boltchart.jpg\" alt=\"\" class=\"kg-image\" width=\"1028\" height=\"612\" loading=\"lazy\"/>\n            \n            </figure><p>Round-trip latency makes an especially big difference for HTTPS. When making a secure connection to a server, there is an additional set-up phase that can require up to three messages to make the round trip between the client and the server before the first request can even be sent. For a visitor 250ms away, this can result in an excruciating one second (1000ms) delay before a site starts loading. During this time Usain Bolt has run 10 meters and you’re still waiting for a web page. TLS 1.3 and 0-RTT can’t reduce the round trip latency of a transmission, but it can reduce the number of round trips required for setting up an HTTPS connection.</p><h3>HTTPS round trips</h3><p>For a browser to download a web page over HTTPS, there is a some setup that goes on behind the scenes. Here are the 4 phases that need to happen the first time your browser tries to access a site.</p><h4>Phase 1: DNS Lookup</h4><p>Your browser needs to convert the hostname of the website (say blog.cloudflare.com) into an Internet IP address (like 2400:cb00:2048:1::6813:c166 or 104.19.193.102) before it can connect to it. DNS resolvers operated by your ISP usually cache the IP address for popular domains, and latency to your ISP is fairly low, so this step often takes a negligible amount of time.</p><h4>Phase 2: TCP Handshake (1 round trip)</h4><p>The next step is to establish a TCP connection to the server. This phase consists of the client sending a SYN packet to the server, and the server responding with an ACK pack. The details don’t matter as much as the fact that this requires data to be sent from client to server and back. This takes one round trip.</p><h4>Phase 3: TLS Handshake (2 round trips)</h4><p>In this phase, the client and server exchange cryptographic key material and set up an encrypted connection. For TLS 1.2 and earlier, this takes <a href=\"/keyless-ssl-the-nitty-gritty-technical-details/\">two round trips</a>.</p><h4>Phase 4: HTTP (1 round trip)</h4><p>Once the TLS connection has been established, your browser can send an encrypted HTTP request using it. This can be a GET request for a specific URL such as /, for example. The server will respond with an HTTP response containing the webpage’s HTML and the browser will start displaying the page.</p><p>Assuming DNS is instantaneous, this leaves 4 round trips before the browser can start showing the page. If you’re visiting a site you’ve recently connected to, the TLS handshake phase can be shortened from two round trips to one with <a href=\"/tls-session-resumption-full-speed-and-secure/\">TLS session resumption</a>.</p><p>This leaves the following minimum wait times:</p><ul><li><p>New Connection: 4 RTT + DNS</p></li><li><p>Resumed Connection: 3 RTT + DNS</p></li></ul><h3>How do TLS 1.3 and 0-RTT improve connection times?</h3><p>One of the biggest advantages of TLS 1.3 over earlier versions is that it only requires one round trip to set up the connection, resumed or not. This provides a significant speed up for new connections, but none for resumed connections. Our measurements show that around 40% of HTTPS connections are resumptions (either via session IDs or session tickets). With 0-RTT, a round trip can be eliminated for most of that 40%.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/53zGSmQOGgFg0ARVyqQu0B/b1b7381254cee1b02ef8391b13df3b7e/image04.jpg\" alt=\"TLS connection reuse by time of day\" class=\"kg-image\" width=\"1999\" height=\"1045\" loading=\"lazy\"/>\n            \n            </figure><p>TLS connection reuse by time of day.</p><p>To summarize the performance differences:</p><p><i>TLS 1.2 (and earlier)</i></p><ul><li><p>New Connection: 4 RTT + DNS</p></li><li><p>Resumed Connection: 3 RTT + DNS</p></li></ul><p><i>TLS 1.3</i></p><ul><li><p>New Connection: 3 RTT + DNS</p></li><li><p>Resumed Connection: 3 RTT + DNS</p></li></ul><p><i>TLS 1.3 + 0-RTT</i></p><ul><li><p>New Connection: 3 RTT + DNS</p></li><li><p>Resumed Connection: 2 RTT + DNS</p></li></ul><p>The performance gains are huge.</p><h3>0-RTT in action</h3><p>Both <a href=\"https://www.mozilla.org/en-US/firefox/channel/desktop/\">Firefox Beta</a> and <a href=\"https://www.google.com/chrome/browser/beta.html\">Chrome Beta</a> have TLS 1.3 enabled by default. The stable versions of Chrome and Firefox also ship with TLS 1.3 support, but it has to be enabled manually for now. The only browsers which supports 0-RTT as of March 2017 are Firefox Nightly and Aurora. To enable it, do the following:</p><ul><li><p>Enter <code>about:config</code> in the address bar</p></li><li><p>Ensure <code>security.tls.version.max</code> is 4 (this enables TLS 1.3)</p></li><li><p>Set <code>security.tls.enable_0rtt_data</code> to true</p></li></ul><p>This demo loads an image from a server that runs the Cloudflare TLS 1.3 0-RTT proxy. In order to emphasize the latency differences, we used Cloudflare&#39;s new <a href=\"https://www.cloudflare.com/load-balancing/\">DNS Load Balancer</a> to direct you to a far away server. If the image is loaded over 0-RTT it will be served orange, otherwise black, based on the <code>CF-0RTT-Unique</code> header.</p><p>The image is loaded twice: with and without a query string. 0-RTT is disabled transparently when a query string is used to prevent replays.</p><p>The connection is pre-warmed, Keep-Alives are off and caching is disabled to simulate the first request of a resumed connection.</p><hr/><p>Preparing the live demo to run (requires Javascript)...</p><p>Click here to start the live demo.</p><p>Live demo unavailable: your browser doesn&#39;t support TLS 1.3, or the connection failed.</p><p>Live demo unavailable: your browser doesn&#39;t support 0-RTT.</p><p>0-RTT took: ...ms</p><p>1-RTT took: ...ms</p><p>.demo { text-align: center; } .demo a { font-weight: bold; text-decoration: none; color: inherit; } .demo p { margin-top: 1.5em; } .images { max-width: 440px; margin: 0 auto; } .images &gt; div { width: 200px; float: left; margin: 0 10px; } .images &gt; div.clear { float: none; clear: both; } .images img { width: 100%; } var currentStatus = &quot;preparing&quot;; function demoStatus(s) { document.querySelector(&quot;.demo .message.&quot;+currentStatus).style.display = &quot;none&quot;; document.querySelector(&quot;.demo .message.&quot;+s).style.display = &quot;&quot;; currentStatus = s; } function demoLaunch() { var startTime, startTime0; var img = document.querySelector(&quot;.demo .images img.nozrtt&quot;); img.onloadstart = function() { startTime = new Date().getTime(); }; img.onload = function() { var loadtime = new Date().getTime() - startTime; document.querySelector(&quot;.demo .images .time.nozrtt&quot;).innerText = loadtime; }; var img0 = document.querySelector(&quot;.demo .images img.zrtt&quot;); img0.onloadstart = function() { startTime0 = new Date().getTime(); }; img0.onload = function() { var loadtime = new Date().getTime() - startTime0; document.querySelector(&quot;.demo .images .time.zrtt&quot;).innerText = loadtime; window.setTimeout(function() { img.src = &quot;<a href=\"https://0rtt.tls13.com/img.png?no0rtt\">https://0rtt.tls13.com/img.png?no0rtt</a>&quot;; }, 2000); }; img0.src = &quot;<a href=\"https://0rtt.tls13.com/img.png\">https://0rtt.tls13.com/img.png</a>&quot;; document.querySelector(&quot;.demo .message.ready&quot;).style.display = &quot;none&quot;; document.querySelector(&quot;.demo .images&quot;).style.display = &quot;&quot;; }; document.querySelector(&quot;.demo .message.ready a&quot;).onclick = function() { // var r = new XMLHttpRequest(); // r.addEventListener(&quot;load&quot;, demoLaunch); // r.open(&quot;GET&quot;, &quot;<a href=\"https://0rtt.tls13.com/img.png?warm\">https://0rtt.tls13.com/img.png?warm</a>&quot;); // r.send(); demoLaunch(); return false; }; var r = new XMLHttpRequest(); r.addEventListener(&quot;error&quot;, function() { demoStatus(&quot;no13&quot;); document.querySelector(&quot;.demo .fallback&quot;).style.display = &quot;&quot;; }); r.addEventListener(&quot;loadend&quot;, function() { var r = new XMLHttpRequest(); r.addEventListener(&quot;error&quot;, function() { demoStatus(&quot;no13&quot;); document.querySelector(&quot;.demo .fallback&quot;).style.display = &quot;&quot;; }); r.addEventListener(&quot;load&quot;, function() { console.log(this.getResponseHeader(&quot;X-0rtt&quot;)); if (this.getResponseHeader(&quot;X-0rtt&quot;) == &quot;1&quot;) { demoStatus(&quot;ready&quot;); } else { demoStatus(&quot;no0rtt&quot;); document.querySelector(&quot;.demo .fallback&quot;).style.display = &quot;&quot;; } }); window.setTimeout(function() { r.open(&quot;GET&quot;, &quot;<a href=\"https://0rtt.tls13.com/img.png\">https://0rtt.tls13.com/img.png</a>&quot;); r.send(); }, 10000); }); r.open(&quot;GET&quot;, &quot;<a href=\"https://0rtt.tls13.com/img.png\">https://0rtt.tls13.com/img.png</a>&quot;); r.send();</p><hr/><p>To see what’s going on under the hood, take a look in Firefox’s Developer Tools. We’ve taken a screenshot of a version of this demo as run by a user in San Francisco. In the first screenshot, the image is served with TLS 1.3, in the second with TLS 1.3 and 0-RTT.</p>\n            <figure class=\"kg-card kg-image-card \">\n            <a href=/content/images/2017/03/image02.jpg>\n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4IFlqIKCZ4NeVGJv3uuidK/4ccb9306a821644b0757b9d7790e7fbe/image02.jpg\" alt=\"0-RTT\" class=\"kg-image\" width=\"1999\" height=\"266\" loading=\"lazy\"/>\n            </a>\n            </figure><p>In the top image, you can see that the blue “Waiting” bar is around 250ms shorter than it is for the second image. This 250ms represents the time it took for the extra round trip between the browser and the server. If you’re in San Francisco, 0-RTT enables the image to load 1.5 bolts faster than it would have otherwise.</p><h3>What’s the catch?</h3><p>0-RTT is cutting edge protocol technology. With it, encrypted HTTPS requests become just as fast as an unencrypted HTTP requests. This sort of breakthrough comes at a cost. This cost is that the security properties that TLS provides to 0-RTT request are slightly weaker than those it provides to regular requests. However, this weakness is manageable, and applications and websites that follow HTTP semantics shouldn’t have anything to worry about. The weakness has to do with replays.</p><p>Unlike any other requests sent over TLS, requests sent as part of 0-RTT resumption are vulnerable to what’s called a replay attack. If an attacker has access to your encrypted connection, they can take a copy of the encrypted 0-RTT data (containing your first request) and send it to the server again pretending to be you. This can result in the server seeing repeated requests from you when you only sent one.</p><p>This doesn’t sound like a big deal until you consider that HTTP requests are used for more than just downloading web pages. For example, HTTP requests can trigger transfers of money. If someone makes a request to their bank to “pay $1000 to Craig” and that request is replayed, it could cause Craig to be paid multiple times. A good deal if you’re Craig.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6npVssOtArI92M8EEGPgvM/d1c7bf7f1bb1b02861fb6d504f72e97b/image00.jpg\" alt=\"\" class=\"kg-image\" width=\"1604\" height=\"1052\" loading=\"lazy\"/>\n            \n            </figure><p>Luckily, the example above is somewhat contrived. Applications need to be replay safe to work with modern browsers, whether they support 0-RTT or not. Browsers replay data all the time due to normal network glitches, and researchers from Google have even shown that attackers can <a href=\"https://vnhacker.blogspot.com/2015/12/bad-life-advice-never-give-up-replay.html\">trick the browser into to replaying requests</a> in almost any circumstance by triggering a particular type of network error. In order to be resilient against this reality, well-designed web applications that handle sensitive requests use application-layer mechanisms to prevent replayed requests from affecting them.</p><p>Although web applications should be replay resilient, that’s not always the reality. To protect these applications from malicious replays, Cloudflare took an extremely conservative approach to choosing which 0-RTT requests would be answered. Specifically, only <b>GET requests with no query parameters</b> are answered over 0-RTT. According to the HTTP specification, GET requests are supposed to be <a href=\"https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html\">idempotent</a>, meaning that they don’t change the state on the server and shouldn’t be used for things like funds transfer. We also implement a maximum size of 0-RTT requests, and limit how long they can be replayed.</p><p>Furthermore, Cloudflare can uniquely identify connection resumption attempts, so we relay this information to the origin by adding an extra header to 0-RTT requests. This header uniquely identifies the request, so if one gets repeated, the origin will know it&#39;s a replay attack.</p><p>Here’s what the header looks like:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Cf-0rtt-Unique: 37033bcb6b42d2bcf08af3b8dbae305a</pre></code>\n            <p>The hexadecimal value is derived from a piece of data called a <a href=\"https://tlswg.github.io/tls13-spec/#pre-shared-key-extension\">PSK binder</a>, which is unique per 0-RTT request.</p><p>Generally speaking, 0-RTT is safe for most web sites and applications. If your web application does strange things and you’re concerned about its replay safety, consider not using 0-RTT until you can be certain that there are no negative effects.</p><h3>Conclusion</h3><p>TLS 1.3 is a big step forward for web performance and security. By combining TLS 1.3 with 0-RTT, the performance gains are even more dramatic. Combine this with HTTP/2 and the encrypted web has never been faster, especially on mobile networks. Cloudflare is happy to be the first to introduce this feature on a wide scale.</p>",
		"id": "7hwYueM2wLGedpCkezUfnw",
		"localeList": {
			"name": "Introducing Zero Round Trip Time Resumption (0-RTT) Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Cloudflare’s mission is to help build a faster and more secure Internet. Over the last several years, the Internet Engineering Task Force (IETF) has been working on a new version of TLS, the protocol that powers the secure web.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-03-15T14:00:41.000+00:00",
		"reading_time": 9,
		"slug": "introducing-0-rtt",
		"tags": [
			{
				"id": "56vA0Z6hqev6QaJBQmO2J8",
				"name": "TLS",
				"slug": "tls"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "14zCAfc7F9ROKtNbSxs2Pe",
				"name": "TLS 1.3",
				"slug": "tls-1-3"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			}
		],
		"title": "Introducing Zero Round Trip Time Resumption (0-RTT)",
		"updated_at": "2024-09-24T20:55:57.178Z",
		"url": "https://blog.cloudflare.com/introducing-0-rtt"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}