{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [
		"ja-jp"
	],
	"post": {
		"authors": [
			{
				"name": "Kenton Varda",
				"slug": "kenton-varda",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1FFs4T2j1RyvxasKOkkdtP/15df5db7be969ea8a89e68491f6f67f6/kenton-varda.jpg",
				"location": null,
				"website": null,
				"twitter": "@kentonvarda",
				"facebook": null
			}
		],
		"excerpt": "You see this everywhere, but as a lifelong gamer, my personal favorite example is probably graphics cards. In the '90s, graphics hardware generally provided a fixed set of functionality. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3M90YJViZrPRKniCppfsdP/4795d51b6004d0848d8f283cf570799c/introducing-cloudflare-workers.png",
		"featured": false,
		"html": "<p><b>UPDATE 2018/3/13:</b> <a href=\"/cloudflare-workers-unleashed/\">Cloudflare Workers is now available to everyone.</a></p><p><b>TL;DR:</b> You&#39;ll soon be able to deploy JavaScript to Cloudflare&#39;s edge, written against an API similar to Service Workers.</p><p><a href=\"https://cloudflareworkers.com\">Try writing a Worker in the playground »</a></p><h3>Introduction</h3><p>Every technology, when sufficiently complicated, becomes programmable.</p><p>You see this everywhere, but as a lifelong gamer, my personal favorite example is probably graphics cards. In the &#39;90s, graphics hardware generally provided a fixed set of functionality. The OpenGL standard specified that the geometry pipeline would project points from 3D space onto your viewport, then the raster pipeline would draw triangles between them, with gradient shading and perhaps a texture applied. You could only use one texture at a time. There was only one lighting algorithm, which more or less made every surface look like plastic. If you wanted to do anything else, you often had to give up the hardware entirely and drop back to software.</p><p>Of course, new algorithms and techniques were being developed all the time. So, hardware vendors would add the best ideas to their hardware as &quot;extensions&quot;. OpenGL ended up with hundreds of vendor-specific extensions to support things like multi-texturing, bump maps, reflections, dynamic shadows, and more.</p><p>Then, in 2001, everything changed. The first GPU with a programmable shading pipeline was released. Now you could write little programs that ran directly on the hardware, processing each vertex or pixel in arbitrary ways. Now people could experiment with algorithms for rendering realistic skin, or cartoon shading, or so much else, without waiting for hardware vendors to implement their ideas for them.</p><p>Cloudflare is about to go through a similar transition. At its most basic level, Cloudflare is an HTTP cache that runs in 117 locations worldwide (and growing). The HTTP standard defines a fixed feature set for HTTP caches. Cloudflare, of course, does much more, such as providing <a href=\"https://www.cloudflare.com/dns/\">DNS</a> and <a href=\"https://www.cloudflare.com/ssl/\">SSL</a>, shielding your site against attacks, load balancing across your origin servers, and so much else.</p><p>But, these are all fixed functions. What if you want to load balance with a custom affinity algorithm? What if standard HTTP caching rules aren&#39;t quite right, and you need some custom logic to boost your cache hit rate? What if you want to write custom <a href=\"https://www.cloudflare.com/learning/ddos/glossary/web-application-firewall-waf/\">WAF</a> rules tailored for your application?</p><h4>You want to write code</h4><p>We can keep adding features forever, but we&#39;ll never cover every possible use case this way. Instead, we&#39;re making <a href=\"https://www.cloudflare.com/network/\">Cloudflare&#39;s edge network</a> programmable. We provide servers in 117+ locations around the world -- you decide how to use them.</p><p>Of course, when you have hundreds of locations and millions of customers, traditional means of hosting software don&#39;t quite work. We can&#39;t very well give every customer their own virtual machine in each location -- or even their own container. We need something both more scalable and easier for developers to manage. Of course, security is also a concern: we must ensure that code deployed to Cloudflare cannot damage our network nor harm other customers.</p><p>After looking at many possibilities, we settled on the most ubiquitous language on the web today: JavaScript.</p><p>We run JavaScript using V8, the JavaScript engine developed for Google Chrome. That means we can securely run scripts from multiple customers on our servers in much the same way Chrome runs scripts from multiple web sites -- using technology that has had nearly a decade of scrutiny. (Of course, we add a few sandboxing layers of our own on top of this.)</p><p>But what API is this JavaScript written against? For this, we looked to web standards -- specifically, the Service Worker API. Service Workers are a feature implemented by modern browsers which allow you to load a script which intercepts web requests destined for your server before they hit the network, allowing you a chance to rewrite them, redirect them, or even respond directly. Service Workers were designed to run in browsers, but it turns out that the Service Worker API is a perfect fit for what we wanted to support on the edge. If you&#39;ve ever written a Service Worker, then you already know how to write a Cloudflare Service Worker.</p><h4>What it looks like</h4><p>Here are some examples of Service Workers you might run on Cloudflare.</p><p>Remember: these are written against the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Service_Worker_API\">standard Service Workers API</a>. The only difference is that they run on Cloudflare&#39;s edge rather than in the browser.</p><p>Here is a worker which skips the cache for requests that have a <code>Cookie</code> header (e.g. because the user is logged in). Of course, a real-life site would probably have more complicated conditions for caching, but this is code, so you can do anything.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">// A Service Worker which skips cache if the request contains\n// a cookie.\naddEventListener(&#039;fetch&#039;, event =&gt; {\n  let request = event.request\n  if (request.headers.has(&#039;Cookie&#039;)) {\n    // Cookie present. Add Cache-Control: no-cache.\n    let newHeaders = new Headers(request.headers)\n    newHeaders.set(&#039;Cache-Control&#039;, &#039;no-cache&#039;)\n    event.respondWith(fetch(request, {headers: newHeaders}))\n  }\n\n  // Use default behavior.\n  return\n})</pre></code>\n            <p>Here is a worker which performs a site-wide search-and-replace, replacing the word &quot;Worker&quot; with &quot;Minion&quot;. <a href=\"https://cloudflareworkers.com/#c62c6c0002cb236166b794c440870cca:https://blog.cloudflare.com/introducing-cloudflare-workers\">Try it out on this blog post.</a></p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">// A Service Worker which replaces the word &quot;Worker&quot; with\n// &quot;Minion&quot; in all site content.\naddEventListener(&quot;fetch&quot;, event =&gt; {\n  event.respondWith(fetchAndReplace(event.request))\n})\n\nasync function fetchAndReplace(request) {\n  // Fetch from origin server.\n  let response = await fetch(request)\n\n  // Make sure we only modify text, not images.\n  let type = response.headers.get(&quot;Content-Type&quot;) || &quot;&quot;\n  if (!type.startsWith(&quot;text/&quot;)) {\n    // Not text. Don&#039;t modify.\n    return response\n  }\n\n  // Read response body.\n  let text = await response.text()\n\n  // Modify it.\n  let modified = text.replace(\n      /Worker/g, &quot;Minion&quot;)\n\n  // Return modified response.\n  return new Response(modified, {\n    status: response.status,\n    statusText: response.statusText,\n    headers: response.headers\n  })\n}</pre></code>\n            <p>Here is a worker which searches the page content for URLs wrapped in double-curly-brackets, fetches those URLs, and then substitutes them into the page. This implements a sort of primitive template engine supporting something like &quot;Edge Side Includes&quot;.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">// A Service Worker which replaces {{URL}} with the contents of\n// the URL. (A simplified version of &quot;Edge Side Includes&quot;.)\naddEventListener(&quot;fetch&quot;, event =&gt; {\n  event.respondWith(fetchAndInclude(event.request))\n})\n\nasync function fetchAndInclude(request) {\n  // Fetch from origin server.\n  let response = await fetch(request)\n\n  // Make sure we only modify text, not images.\n  let type = response.headers.get(&quot;Content-Type&quot;) || &quot;&quot;\n  if (!type.startsWith(&quot;text/&quot;)) {\n    // Not text. Don&#039;t modify.\n    return response\n  }\n\n  // Read response body.\n  let text = await response.text()\n\n  // Search for instances of {{URL}}.\n  let regexp = /{{([^}]*)}}/g\n  let parts = []\n  let pos = 0\n  let match\n  while (match = regexp.exec(text)) {\n    let url = new URL(match[1], request.url)\n    parts.push({\n      before: text.slice(pos, match.index),\n      // Start asynchronous fetch of this URL.\n      promise: fetch(url.toString())\n          .then((response) =&gt; response.text())\n    })\n    pos = regexp.lastIndex\n  }\n\n  // Now that we&#039;ve started all the subrequests,\n  // wait for each and collect the text.\n  let chunks = []\n  for (let part of parts) {\n    chunks.push(part.before)\n    // Wait for the async fetch from earlier to complete.\n    chunks.push(await part.promise)\n  }\n  chunks.push(text.slice(pos))\n  // Concatenate all text and return.\n  return new Response(chunks.join(&quot;&quot;), {\n    status: response.status,\n    statusText: response.statusText,\n    headers: response.headers\n  })\n}</pre></code>\n            <h4>Play with it yourself!</h4><p>We&#39;ve created the Cloudflare Workers playground at <a href=\"https://cloudflareworkers.com\">cloudflareworkers.com</a> where you can try writing your own script and applying it to your site.</p><p><a href=\"https://cloudflareworkers.com\">Try it out now »</a></p><h3>Questions and Answers</h3><h4>Is it &quot;Cloudflare Workers&quot; or &quot;Cloudflare Service Workers&quot;?</h4><p>A &quot;Cloudflare Worker&quot; is JavaScript you write that runs on Cloudflare&#39;s edge. A &quot;Cloudflare Service Worker&quot; is specifically a worker which handles HTTP traffic and is written against the Service Worker API. Currently, this is the only kind of worker we&#39;ve implemented, but in the future we may introduce other worker types for certain specialized tasks.</p><h4>What can I do with Service Workers on the edge?</h4><p>Anything and everything. You&#39;re writing code, so the possibilities are infinite. Your Service Worker will intercept all HTTP requests destined for your domain, and can return any valid HTTP response. Your worker can make outgoing HTTP requests to any server on the public internet.</p><p>Here are just a few ideas how to use Service Workers on Cloudflare:</p><p><b>Improve performance</b></p><ul><li><p>Use custom logic to decide which requests are cacheable at the edge, and canonicalize them to improve cache hit rate.</p></li><li><p>Expand HTML templates directly on the edge, fetching only dynamic content from your server.</p></li><li><p>Respond to stateless requests directly from the edge without contacting your origin server at all.</p></li><li><p>Split one request into multiple parallel requests to different servers, then combine the responses.</p></li></ul><p><b>Enhance security</b></p><ul><li><p>Implement custom security rules and filters.</p></li><li><p>Implement custom authentication and authorization mechanisms.</p></li></ul><p><b>Increase reliability</b></p><ul><li><p>Deploy fast fixes to your site in seconds, without having to update your own servers.</p></li><li><p>Implement custom load balancing and failover logic.</p></li><li><p>Respond dynamically when your origin server is unreachable.</p></li></ul><p>But these are just examples. The whole point of Cloudflare Workers is that you can do things we haven&#39;t thought of!</p><h4>Why JavaScript?</h4><p>Cloudflare Workers are written in JavaScript, executed using the V8 JavaScript engine (from Google Chrome). We chose JavaScript and V8 for two main reasons:</p><ul><li><p><b>Security:</b> The V8 JavaScript engine is arguably the most scrutinized code sandbox in the history of computing, and the Chrome security team is one of the best in the world. Moreover, Google pays <a href=\"https://www.google.com/about/appsecurity/chrome-rewards/index.html\">massive bug bounties</a> to anyone who can find a vulnerability. (That said, we have added additional layers of our own sandboxing on top of V8.)</p></li><li><p><b>Ubiquity:</b> JavaScript is everywhere. Anyone building a web application already needs to know it: whereas their server could be written in a variety of languages, the client has to be JavaScript, because that&#39;s what browsers run.</p></li></ul><p>We did consider several other possibilities:</p><ul><li><p><b>Lua:</b> Lua is already deeply integrated into nginx, providing exactly the kind of scripting hooks that we need -- indeed, much of our own business logic running at the edge today is written in Lua. Moreover, Lua already provides facilities for sandboxing. However, in practice, Lua&#39;s security as a sandbox has received limited scrutiny, as, historically, there has not been much value in finding a Lua sandbox breakout -- this would change rapidly if we chose it, probably leading to trouble. Moreover, Lua is not very widely known among web developers today.</p></li><li><p><b>Virtual machines:</b> Virtual machines are, of course, widely used and scrutinized as sandboxes, and most web service back-end developers are familiar with them already. However, virtual machines are heavy: each one must be allocated hundreds of megabytes of RAM and typically takes tens of seconds to boot. We need a solution that allows us to deploy every customer&#39;s code to every one of our hundreds of locations. That means we need each one&#39;s RAM overhead to be as low as possible, and we need startup to be fast enough that we can do it on-demand, so that we can safely shut down workers that aren&#39;t receiving traffic. Virtual machines do not scale to these needs.</p></li><li><p><b>Containers:</b> My personal background is in container-based sandboxing. With careful use of Linux &quot;namespaces&quot; paired with a strong seccomp-bpf filter and other <a href=\"https://www.cloudflare.com/learning/security/what-is-an-attack-surface/\">attack surface reduction techniques</a>, it&#39;s possible to set up a pretty secure sandbox which can run native Linux binaries. This would have the advantage that we could allow developers to deploy native code, or code written in any language that runs on Linux. However, even though containers are much more efficient than virtual machines, they still aren&#39;t efficient enough. Each worker would have to run in its own OS-level process, consuming RAM and inducing context-switching overhead. And while native code can load quickly, many server-oriented language environments are not optimized for startup time. Finally, container security is still immature: although a properly-configured container can be pretty secure, we still see container breakout bugs being found in the Linux kernel every now and then.</p></li><li><p><b>Vx32:</b> We considered a fascinating little sandbox known as Vx32, which uses &quot;software fault isolation&quot; to be able to run native-code binaries in a sandboxed way with multiple sandboxes per process. While this approach was tantalizing in its elegance, it had the down side that developers would need to cross-compile their code to a different platform, meaning we&#39;d have to spend a great deal of time on tooling for a smooth experience. Moreover, while it would mitigate some of the context switching overhead compared to multiple processes, RAM usage would still likely be high as very little of the software stack could be shared between sandboxes.</p></li></ul><p>Ultimately, it became clear to us that V8 was the best choice. The final nail in the coffin was the realization that V8 includes WebAssembly out-of-the-box, meaning that people who really need to deploy code written in other languages can still do so.</p><h4>Why not Node.js?</h4><p>Node.js is a server-oriented JavaScript runtime that also uses V8. At first glance, it would seem to make a lot of sense to reuse Node.js rather than build on V8 directly.</p><p>However, as it turns out, despite being built on V8, Node is not designed to be a sandbox. Yes, we know about the <a href=\"https://nodejs.org/api/vm.html\">vm module</a>, but if you look closely, it says right there on the page: &quot;Note: The vm module is not a security mechanism. <b>Do not use it to run untrusted code.</b>&quot;</p><p>As such, if we were to build on Node, we&#39;d lose the benefits of V8&#39;s sandbox. We&#39;d instead have to do process-level (a.k.a. container-based) sandboxing, which, as discussed above, is less secure and less efficient.</p><h4>Why the Service Worker API?</h4><p>Early on in the design process, we nearly made a big mistake.</p><p>Nearly everyone who has spent a lot of time scripting nginx or otherwise working with HTTP proxy services (so, basically everyone at Cloudflare) tends to have a very specific idea of what the API should look like. We all start from the assumption that we&#39;d provide two main &quot;hooks&quot; where the developer could insert a callback: a request hook and a response hook. The request hook callback could modify the request, and the response hook callback modify the response. Then we think about the cache, and we say: ah, some hooks should run pre-cache and some post-cache. So now we have four hooks. Generally, it was assumed these hooks would be pure, non-blocking functions.</p><p>Then, between design meetings at our London office, I had lunch with Ingvar Stepanyan, who among other things had been doing work with Service Workers in the browser. Ingvar pointed out the obvious: This is exactly the use case for which the W3C Service Workers API was designed. Service Workers implement proxies and control caching, traditionally in the browser.</p><p>But the Service Worker API is not based on a request hook and a response hook. Instead, a Service Worker implements an <i>endpoint</i>: it registers <i>one</i> event handler which receives requests and <i>responds</i> to those requests. That handler, though, is asynchronous, meaning it can do other I/O before producing a response. Among other things, it can make its own HTTP requests (which we call &quot;subrequests&quot;). So, a simple service worker can modify the original request, forward it to the origin as a subrequest, receive a response, modify that, and then return it: everything the hooks model can do.</p><p>But a Service Worker is much more powerful. It can make multiple subrequests, in series or in parallel, and combine the results. It can respond directly without making a subrequest at all. It can even make an asynchronous subrequest after it has already responded to the original request. A Service Worker can also directly manipulate the cache through the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Cache\">Cache API</a>. So, there&#39;s no need for &quot;pre cache&quot; and &quot;post cache&quot; hooks. You just stick the cache lookup into your code where you want it.</p><p>To add icing to the cake, the Service Worker API, and related modern web APIs like Fetch and Streams, have been designed very carefully by some incredibly smart people. It uses modern JavaScript idioms like Promises, and it is well-documented by MDN and others. Had we designed our own API, it would surely have been worse on all counts.</p><p>It quickly became obvious to us that the Service Worker API was the correct API for our use case.</p><h4>When can I use it?</h4><p><a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a> are a big change to Cloudflare and we&#39;re rolling it out slowly. If you&#39;d like to get early access -- or just want to be notified when it&#39;s ready:</p><p><a href=\"https://dash.cloudflare.com/sign-up/workers\">Sign up for the Beta »</a></p>",
		"id": "6XJ1JVc9iPipjdNSuJdUS7",
		"localeList": {
			"name": "Introducing Cloudflare Workers: Run JavaScript Service Workers at the Edge Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "You'll soon be able to deploy JavaScript to Cloudflare's edge, written against an API similar to Service Workers.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-09-29T14:00:00.000+01:00",
		"slug": "introducing-cloudflare-workers",
		"tags": [
			{
				"id": "1Cv5JjXzKWKEA10JdYbXu1",
				"name": "Birthday Week",
				"slug": "birthday-week"
			},
			{
				"id": "78aSAeMjGNmCuetQ7B4OgU",
				"name": "JavaScript",
				"slug": "javascript"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "5cye1Bh5KxFh3pKSnX8Dsy",
				"name": "Serverless",
				"slug": "serverless"
			},
			{
				"id": "6lhzEBz2B56RKa4nUEAGYJ",
				"name": "Programming",
				"slug": "programming"
			}
		],
		"title": "Introducing Cloudflare Workers: Run JavaScript Service Workers at the Edge",
		"updated_at": "2024-08-27T02:27:35.712Z",
		"url": "https://blog.cloudflare.com/introducing-cloudflare-workers"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}