{
	"initialReadingTime": "6",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Ivan Nikulin",
				"slug": "ivan-nikulin",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3YNIwuAmPIbH9iMF69TwJQ/b50f5bdc4121f5f555ad4111a90e9c3e/ivan-nikulin.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Foundations is a foundational Rust library, designed to help scale programs for distributed, production-grade systems",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6LK2SgBru4gS1rh2VRmMEy/54559d991224116dc97542f50cf32602/introducing-foundations-our-open-source-rust-service-foundation-library.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2yQdeNHftkPvZAq7tcEYN9/e2ee11c07c067194d717e6060231faf9/image1-4.png\" alt=\"Introducing Foundations - our open source Rust service foundation library\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>In this blog post, we&#39;re excited to present Foundations, our foundational library for Rust services, now released as <a href=\"https://github.com/cloudflare/foundations\">open source on GitHub</a>. Foundations is a foundational Rust library, designed to help scale programs for distributed, production-grade systems. It enables engineers to concentrate on the core business logic of their services, rather than the intricacies of production operation setups.</p><p>Originally developed as part of our <a href=\"/introducing-oxy/\">Oxy proxy framework</a>, Foundations has evolved to serve a wider range of applications. For those interested in exploring its technical capabilities, we recommend consulting the library’s <a href=\"https://docs.rs/foundations/latest/foundations/\">API documentation</a>. Additionally, this post will cover the motivations behind Foundations&#39; creation and provide a concise summary of its key features. Stay with us to learn more about how Foundations can support your Rust projects.</p><h2>What is Foundations?</h2><p>In software development, seemingly minor tasks can become complex when scaled up. This complexity is particularly evident when comparing the deployment of services on server hardware globally to running a program on a personal laptop.</p><p>The key question is: what fundamentally changes when transitioning from a simple laptop-based prototype to a full-fledged service in a production environment? Through our experience in developing numerous services, we&#39;ve identified several critical differences:</p><ul><li><p><b>Observability</b>: locally, developers have access to various tools for monitoring and debugging. However, these tools are not as accessible or practical when dealing with thousands of software instances running on remote servers.</p></li><li><p><b>Configuration</b>: local prototypes often use basic, sometimes hardcoded, configurations. This approach is impractical in production, where changes require a more flexible and dynamic configuration system. Hardcoded settings are cumbersome, and command-line options, while common, don&#39;t always suit complex hierarchical configurations or align with the &quot;Configuration as Code&quot; paradigm.</p></li><li><p><b>Security</b>: services in production face a myriad of security challenges, exposed to diverse threats from external sources. Basic security hardening becomes a necessity.</p></li></ul><p>Addressing these distinctions, Foundations emerges as a comprehensive library, offering solutions to these challenges. Derived from our Oxy proxy framework, Foundations brings the tried-and-tested functionality of Oxy to a broader range of Rust-based applications at Cloudflare.</p><p>Foundations was developed with these guiding principles:</p><ul><li><p><b>High modularity</b>: recognizing that many services predate Foundations, we designed it to be modular. Teams can adopt individual components at their own pace, facilitating a smooth transition.</p></li><li><p><b>API ergonomics</b>: a top priority for us is user-friendly library interaction. Foundations leverages Rust&#39;s procedural macros to offer an intuitive, well-documented API, aiming for minimal friction in usage.</p></li><li><p><b>Simplified setup and configuration</b>: our goal is for engineers to spend minimal time on setup. Foundations is designed to be &#39;plug and play&#39;, with essential functions working immediately and adjustable settings for fine-tuning. We understand that this focus on ease of setup over extreme flexibility might be debatable, as it implies a trade-off. Unlike other libraries that cater to a wide range of environments with potentially verbose setup requirements, Foundations is tailored for specific, production-tested environments and workflows. This doesn&#39;t restrict Foundations’ adaptability to other settings, but we approach this with compile-time features to manage setup workflows, rather than a complex setup API.</p></li></ul><p>Next, let&#39;s delve into the components Foundations offers. To better illustrate the functionality that Foundations provides we will refer to the <a href=\"https://github.com/cloudflare/foundations/tree/main/examples/http_server\">example web server</a> from Foundations’ source code repository.</p><h3>Telemetry</h3><p>In any production system, observability, which we refer to as telemetry, plays an essential role. Generally, three primary types of telemetry are adequate for most service needs:</p><ul><li><p><b>Logging</b>: this involves recording arbitrary textual information, which can be enhanced with tags or structured fields. It&#39;s particularly useful for documenting operational errors that aren&#39;t critical to the service.</p></li><li><p><b>Tracing</b>: this method offers a detailed timing breakdown of various service components. It&#39;s invaluable for identifying performance bottlenecks and investigating issues related to timing.</p></li><li><p><b>Metrics</b>: these are quantitative data points about the service, crucial for monitoring the overall health and performance of the system.</p></li></ul><p>Foundations integrates an API that encompasses all these telemetry aspects, consolidating them into a unified package for ease of use.</p><h3>Tracing</h3><p>Foundations’ tracing API shares similarities with <a href=\"https://github.com/tokio-rs/tracing\">tokio/tracing</a>, employing a comparable approach with implicit context propagation, instrumentation macros, and futures wrapping:</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\">#[tracing::span_fn(&quot;respond to request&quot;)]\nasync fn respond(\n    endpoint_name: Arc&lt;String&gt;,\n    req: Request&lt;Body&gt;,\n    routes: Arc&lt;Map&lt;String, ResponseSettings&gt;&gt;,\n) -&gt; Result&lt;Response&lt;Body&gt;, Infallible&gt; {\n    …\n}</pre></code>\n            <p>Refer to the <a href=\"https://github.com/cloudflare/foundations/blob/347548000cab0ac549f8f23e2a0ce9e1147b7640/examples/http_server/main.rs#L154\">example web server</a> and <a href=\"https://docs.rs/foundations/latest/foundations/telemetry/tracing/index.html\">documentation</a> for more comprehensive examples.</p><p>However, Foundations distinguishes itself in a few key ways:</p><ul><li><p><b>Simplified API</b>: we&#39;ve streamlined the setup process for tracing, aiming for a more minimalistic approach compared to tokio/tracing.</p></li><li><p><b>Enhanced trace sampling flexibility</b>: Foundations allows for selective override of the sampling ratio in specific code branches. This feature is particularly useful for detailed performance bug investigations, enabling a balance between global trace sampling for overall <a href=\"https://www.cloudflare.com/application-services/solutions/app-performance-monitoring/\">performance monitoring</a> and targeted sampling for specific accounts, connections, or requests.</p></li><li><p><b>Distributed trace stitching</b>: our API supports the integration of trace data from multiple services, contributing to a comprehensive view of the entire pipeline. This functionality includes fine-tuned control over sampling ratios, allowing upstream services to dictate the sampling of specific traffic flows in downstream services.</p></li><li><p><b>Trace forking capability</b>: addressing the challenge of long-lasting connections with numerous multiplexed requests, Foundations introduces trace forking. This feature enables each request within a connection to have its own trace, linked to the parent connection trace. This method significantly simplifies the analysis and improves performance, particularly for connections handling thousands of requests.</p></li></ul><p>We regard telemetry as a vital component of our software, not merely an optional add-on. As such, we believe in rigorous testing of this feature, considering it our primary tool for monitoring software operations. Consequently, Foundations includes an API and user-friendly macros to facilitate the collection and analysis of tracing data within tests, presenting it in a format conducive to assertions.</p><h3>Logging</h3><p>Foundations’ logging API shares its foundation with tokio/tracing and <a href=\"https://github.com/slog-rs/slog\">slog</a>, but introduces several notable enhancements.</p><p>During our work on various services, we recognized the hierarchical nature of logging contextual information. For instance, in a scenario involving a connection, we might want to tag each log record with the connection ID and HTTP protocol version. Additionally, for requests served over this connection, it would be useful to attach the request URL to each log record, while still including connection-specific information.</p><p>Typically, achieving this would involve creating a new logger for each request, copying tags from the connection’s logger, and then manually passing this new logger throughout the relevant code. This method, however, is cumbersome, requiring explicit handling and storage of the logger object.</p><p>To streamline this process and prevent telemetry from obstructing business logic, we adopted a technique similar to tokio/tracing&#39;s approach for tracing, applying it to logging. This method relies on future instrumentation machinery (<a href=\"https://docs.rs/tracing/latest/tracing/struct.Span.html#in-asynchronous-code\">tracing-rs documentation</a> has a good explanation of the concept), allowing for implicit passing of the current logger. This enables us to &quot;fork&quot; logs for each request and use this forked log seamlessly within the current code scope, automatically propagating it down the call stack, including through asynchronous function calls:</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\"> let conn_tele_ctx = TelemetryContext::current();\n\n let on_request = service_fn({\n        let endpoint_name = Arc::clone(&amp;endpoint_name);\n\n        move |req| {\n            let routes = Arc::clone(&amp;routes);\n            let endpoint_name = Arc::clone(&amp;endpoint_name);\n\n            // Each request gets independent log inherited from the connection log and separate\n            // trace linked to the connection trace.\n            conn_tele_ctx\n                .with_forked_log()\n                .with_forked_trace(&quot;request&quot;)\n                .apply(async move { respond(endpoint_name, req, routes).await })\n        }\n});</pre></code>\n            <p>Refer to <a href=\"https://github.com/cloudflare/foundations/blob/347548000cab0ac549f8f23e2a0ce9e1147b7640/examples/http_server/main.rs#L155-L198\">example web server</a> and <a href=\"https://docs.rs/foundations/latest/foundations/telemetry/log/index.html\">documentation</a> for more comprehensive examples.</p><p>In an effort to simplify the user experience, we merged all APIs related to context management into a single, implicitly available in each code scope, TelemetryContext object. This integration not only simplifies the process but also lays the groundwork for future advanced features. These features could blend tracing and logging information into a cohesive narrative by cross-referencing each other.</p><p>Like tracing, Foundations also offers a user-friendly API for testing service’s logging.</p><h3>Metrics</h3><p>Foundations incorporates the official <a href=\"https://github.com/prometheus/client_rust\">Prometheus Rust client library</a> for its metrics functionality, with a few enhancements for ease of use. One key addition is a procedural macro provided by Foundations, which simplifies the definition of new metrics with typed labels, reducing boilerplate code:</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\">use foundations::telemetry::metrics::{metrics, Counter, Gauge};\nuse std::sync::Arc;\n\n#[metrics]\npub(crate) mod http_server {\n    /// Number of active client connections.\n    pub fn active_connections(endpoint_name: &amp;Arc&lt;String&gt;) -&gt; Gauge;\n\n    /// Number of failed client connections.\n    pub fn failed_connections_total(endpoint_name: &amp;Arc&lt;String&gt;) -&gt; Counter;\n\n    /// Number of HTTP requests.\n    pub fn requests_total(endpoint_name: &amp;Arc&lt;String&gt;) -&gt; Counter;\n\n    /// Number of failed requests.\n    pub fn requests_failed_total(endpoint_name: &amp;Arc&lt;String&gt;, status_code: u16) -&gt; Counter;\n}</pre></code>\n            <p>Refer to the <a href=\"https://github.com/cloudflare/foundations/blob/347548000cab0ac549f8f23e2a0ce9e1147b7640/examples/http_server/metrics.rs\">example web server</a> and <a href=\"https://docs.rs/foundations/latest/foundations/telemetry/metrics/index.html\">documentation</a> for more information of how metrics can be defined and used.</p><p>In addition to this, we have refined the approach to metrics collection and structuring. Foundations offers a streamlined, user-friendly API for both these tasks, focusing on simplicity and minimalism.</p><h3>Memory profiling</h3><p>Recognizing the <a href=\"https://mjeanroy.dev/2021/04/19/Java-in-K8s-how-weve-reduced-memory-usage-without-changing-any-code.html\">efficiency</a> of <a href=\"https://jemalloc.net/\">jemalloc</a> for long-lived services, Foundations includes a feature for enabling jemalloc memory allocation. A notable aspect of jemalloc is its memory profiling capability. Foundations packages this functionality into a straightforward and safe Rust API, making it accessible and easy to integrate.</p><h3>Telemetry server</h3><p>Foundations comes equipped with a built-in, customizable telemetry server endpoint. This server automatically handles a range of functions including health checks, metric collection, and memory profiling requests.</p><h2>Security</h2><p>A vital component of Foundations is its robust and ergonomic API for <a href=\"https://en.wikipedia.org/wiki/Seccomp\">seccomp</a>, a Linux kernel feature for syscall sandboxing. This feature enables the setting up of hooks for syscalls used by an application, allowing actions like blocking or logging. Seccomp acts as a formidable line of defense, offering an additional layer of security against threats like arbitrary code execution.</p><p>Foundations provides a simple way to define lists of all allowed syscalls, also allowing a composition of multiple lists (in addition, Foundations ships predefined lists for common use cases):</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\">  use foundations::security::common_syscall_allow_lists::{ASYNC, NET_SOCKET_API, SERVICE_BASICS};\n    use foundations::security::{allow_list, enable_syscall_sandboxing, ViolationAction};\n\n    allow_list! {\n        static ALLOWED = [\n            ..SERVICE_BASICS,\n            ..ASYNC,\n            ..NET_SOCKET_API\n        ]\n    }\n\n    enable_syscall_sandboxing(ViolationAction::KillProcess, &amp;ALLOWED)\n </pre></code>\n            <p>Refer to the <a href=\"https://github.com/cloudflare/foundations/blob/347548000cab0ac549f8f23e2a0ce9e1147b7640/examples/http_server/main.rs#L239-L254\">web server example</a> and <a href=\"https://docs.rs/foundations/latest/foundations/security/index.html\">documentation</a> for more comprehensive examples of this functionality.</p><h2>Settings and CLI</h2><p>Foundations simplifies the management of service settings and command-line argument parsing. Services built on Foundations typically use YAML files for configuration. We advocate for a design where every service comes with a default configuration that&#39;s functional right off the bat. This philosophy is embedded in Foundations’ settings functionality.</p><p>In practice, applications define their settings and defaults using Rust structures and enums. Foundations then transforms Rust documentation comments into configuration annotations. This integration allows the CLI interface to generate a default, fully annotated YAML configuration files. As a result, service users can quickly and easily understand the service settings:</p>\n            <pre class=\"language-rust\"><code class=\"language-rust\">use foundations::settings::collections::Map;\nuse foundations::settings::net::SocketAddr;\nuse foundations::settings::settings;\nuse foundations::telemetry::settings::TelemetrySettings;\n\n#[settings]\npub(crate) struct HttpServerSettings {\n    /// Telemetry settings.\n    pub(crate) telemetry: TelemetrySettings,\n    /// HTTP endpoints configuration.\n    #[serde(default = &quot;HttpServerSettings::default_endpoints&quot;)]\n    pub(crate) endpoints: Map&lt;String, EndpointSettings&gt;,\n}\n\nimpl HttpServerSettings {\n    fn default_endpoints() -&gt; Map&lt;String, EndpointSettings&gt; {\n        let mut endpoint = EndpointSettings::default();\n\n        endpoint.routes.insert(\n            &quot;/hello&quot;.into(),\n            ResponseSettings {\n                status_code: 200,\n                response: &quot;World&quot;.into(),\n            },\n        );\n\n        endpoint.routes.insert(\n            &quot;/foo&quot;.into(),\n            ResponseSettings {\n                status_code: 403,\n                response: &quot;bar&quot;.into(),\n            },\n        );\n\n        [(&quot;Example endpoint&quot;.into(), endpoint)]\n            .into_iter()\n            .collect()\n    }\n}\n\n#[settings]\npub(crate) struct EndpointSettings {\n    /// Address of the endpoint.\n    pub(crate) addr: SocketAddr,\n    /// Endoint&#039;s URL path routes.\n    pub(crate) routes: Map&lt;String, ResponseSettings&gt;,\n}\n\n#[settings]\npub(crate) struct ResponseSettings {\n    /// Status code of the route&#039;s response.\n    pub(crate) status_code: u16,\n    /// Content of the route&#039;s response.\n    pub(crate) response: String,\n}</pre></code>\n            <p>The settings definition above automatically generates the following default configuration YAML file:</p>\n            <pre class=\"language-yaml\"><code class=\"language-yaml\">---\n# Telemetry settings.\ntelemetry:\n  # Distributed tracing settings\n  tracing:\n    # Enables tracing.\n    enabled: true\n    # The address of the Jaeger Thrift (UDP) agent.\n    jaeger_tracing_server_addr: &quot;127.0.0.1:6831&quot;\n    # Overrides the bind address for the reporter API.\n    # By default, the reporter API is only exposed on the loopback\n    # interface. This won&#039;t work in environments where the\n    # Jaeger agent is on another host (for example, Docker).\n    # Must have the same address family as `jaeger_tracing_server_addr`.\n    jaeger_reporter_bind_addr: ~\n    # Sampling ratio.\n    #\n    # This can be any fractional value between `0.0` and `1.0`.\n    # Where `1.0` means &quot;sample everything&quot;, and `0.0` means &quot;don&#039;t sample anything&quot;.\n    sampling_ratio: 1.0\n  # Logging settings.\n  logging:\n    # Specifies log output.\n    output: terminal\n    # The format to use for log messages.\n    format: text\n    # Set the logging verbosity level.\n    verbosity: INFO\n    # A list of field keys to redact when emitting logs.\n    #\n    # This might be useful to hide certain fields in production logs as they may\n    # contain sensitive information, but allow them in testing environment.\n    redact_keys: []\n  # Metrics settings.\n  metrics:\n    # How the metrics service identifier defined in `ServiceInfo` is used\n    # for this service.\n    service_name_format: metric_prefix\n    # Whether to report optional metrics in the telemetry server.\n    report_optional: false\n  # Server settings.\n  server:\n    # Enables telemetry server\n    enabled: true\n    # Telemetry server address.\n    addr: &quot;127.0.0.1:0&quot;\n# HTTP endpoints configuration.\nendpoints:\n  Example endpoint:\n    # Address of the endpoint.\n    addr: &quot;127.0.0.1:0&quot;\n    # Endoint&#039;s URL path routes.\n    routes:\n      /hello:\n        # Status code of the route&#039;s response.\n        status_code: 200\n        # Content of the route&#039;s response.\n        response: World\n      /foo:\n        # Status code of the route&#039;s response.\n        status_code: 403\n        # Content of the route&#039;s response.\n        response: bar</pre></code>\n            <p>Refer to the <a href=\"https://github.com/cloudflare/foundations/blob/347548000cab0ac549f8f23e2a0ce9e1147b7640/examples/http_server/settings.rs\">example web server</a> and documentation for <a href=\"https://docs.rs/foundations/latest/foundations/settings/index.html\">settings</a> and <a href=\"https://docs.rs/foundations/latest/foundations/cli/index.html\">CLI API</a> for more comprehensive examples of how settings can be defined and used with Foundations-provided CLI API.</p><h2>Wrapping Up</h2><p>At Cloudflare, we greatly value the contributions of the open source community and are eager to reciprocate by sharing our work. Foundations has been instrumental in reducing our development friction, and we hope it can do the same for others. We welcome external contributions to Foundations, aiming to integrate diverse experiences into the project for the benefit of all.</p><p>If you&#39;re interested in working on projects like Foundations, consider joining our team — <a href=\"https://www.cloudflare.com/en-gb/careers/\">we&#39;re hiring</a>!</p>",
		"id": "5R4Wv17SBVwevN7lzcL2GW",
		"localeList": {
			"name": "Introducing Foundations - our open source Rust service foundation library Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Foundations is a foundational Rust library, designed to help scale programs for distributed, production-grade systems.",
		"metadata": {
			"title": "Introducing Foundations - our open source Rust service foundation library",
			"description": "Foundations is a foundational Rust library, designed to help scale programs for distributed, production-grade systems.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/71NWXlFqkzGpECA5vVEFu2/561617b68801147ddffecc029ad9cab2/introducing-foundations-our-open-source-rust-service-foundation-library-kZ6qow.png"
		},
		"primary_author": {},
		"published_at": "2024-01-24T14:00:17.000+00:00",
		"slug": "introducing-foundations-our-open-source-rust-service-foundation-library",
		"tags": [
			{
				"id": "3txfsA7N73yBL9g3VPBLL0",
				"name": "Open Source",
				"slug": "open-source"
			},
			{
				"id": "w4e8pkoz9c8xNDVhy9eNe",
				"name": "Rust",
				"slug": "rust"
			},
			{
				"id": "4wT3L4bOFuElnUMa5pXS2G",
				"name": "Observability",
				"slug": "observability"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "598WMMI93tgNRoyjnSrZ2M",
				"name": "Oxy",
				"slug": "oxy"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			}
		],
		"title": "Introducing Foundations - our open source Rust service foundation library",
		"updated_at": "2024-08-27T01:01:28.958Z",
		"url": "https://blog.cloudflare.com/introducing-foundations-our-open-source-rust-service-foundation-library"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}