{
	"initialReadingTime": "15",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"ko-kr",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Matthew Prince",
				"slug": "matthew-prince",
				"bio": "A little bit geek, wonk, and nerd. Repeat entrepreneur, recovering lawyer, and former ski instructor. Co-founder & CEO of Cloudflare (NYSE: NET).",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VD9WePJ1jvjFwuSRF0IfQ/4867307860761eb8209f67f2a9dd771f/matthew-prince.jpeg",
				"location": "San Francisco, CA",
				"website": null,
				"twitter": "@eastdakota",
				"facebook": null
			}
		],
		"excerpt": "Ten years ago, when Cloudflare was created, the Internet was a place that people visited. People still talked about ‘surfing the web’ and the iPhone was less than two years old, but on July 4, 2009 large scale DDoS attacks were launched against websites in the US and South Korea.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7qvHxNjKZTLRp1TyYBbOO2/b62b73cfcc4e92dfaeec85e235f06a4b/introducing-cloudflare-for-teams.png",
		"featured": false,
		"html": "<p>Ten years ago, when Cloudflare was created, the Internet was a place that people visited. People still talked about ‘surfing the web’ and the iPhone was less than two years old, but on July 4, 2009 <a href=\"https://en.wikipedia.org/wiki/July_2009_cyberattacks\">large scale DDoS attacks were launched against websites in the US and South Korea</a>.</p><p>Those attacks highlighted how fragile the Internet was and how all of us were becoming dependent on access to the web as part of our daily lives.</p><p>Fast forward ten years and the speed, reliability and safety of the Internet is paramount as our private and work lives depend on it.</p><p>We started Cloudflare to solve one half of every IT organization&#39;s challenge: how do you ensure the resources and infrastructure that you expose to the Internet are safe from attack, fast, and reliable. We saw that the world was moving away from hardware and software to solve these problems and instead wanted a scalable service that would work around the world.</p><p>To deliver that, we built one of the world&#39;s largest networks. Today our network spans more than 200 cities worldwide and is within milliseconds of nearly everyone connected to the Internet. We have built the capacity to stand up to nation-state scale cyberattacks and a threat intelligence system powered by the immense amount of Internet traffic that we see.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/29NT6mgxYSHDrBtJSRljO8/9380180397afab7d6c1ec120fd32cf26/image5-2.png\" alt=\"\" class=\"kg-image\" width=\"656\" height=\"102\" loading=\"lazy\"/>\n            \n            </figure><p>Today we&#39;re <a href=\"https://teams.cloudflare.com/\">expanding</a> Cloudflare&#39;s product offerings to solve the other half of every IT organization&#39;s challenge: ensuring the people and teams within an organization can access the tools they need to do their job and are safe from malware and other online threats.</p><p>The speed, reliability, and protection we’ve brought to public infrastructure is extended today to everything your team does on the Internet.</p><p>In addition to protecting an organization&#39;s infrastructure, IT organizations are charged with ensuring that employees of an organization can access the tools they need safely. Traditionally, these problems would be solved by hardware products like VPNs and Firewalls. VPNs let authorized users access the tools they needed and Firewalls kept malware out.</p><h2>Castle and Moat</h2>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2RZULB97tfS61r6e7EiXfD/070d1716d943047e25d55761c22142ef/image8-1.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1269\" loading=\"lazy\"/>\n            \n            </figure><p>The dominant model was the idea of a castle and a moat. You put all your valuable assets inside the castle. Your Firewall created the moat around the castle to keep anything malicious out. When you needed to let someone in, a VPN acted as the drawbridge over the moat.</p><p>This is still the model most businesses use today, but it&#39;s showing its age. The first challenge is that if an attacker is able to find its way over the moat and into the castle then it can cause significant damage. Unfortunately, few weeks go by without reading a news story about how an organization had significant data compromised because an employee fell for a phishing email, or a contractor was compromised, or someone was able to sneak into an office and plug in a rogue device.</p><p>The second challenge of the model is the rise of cloud and SaaS. Increasingly an organization&#39;s resources aren&#39;t in the just one castle anymore, but instead in different public cloud and SaaS vendors.</p><p>Services like Box, for instance, provide better storage and collaboration tools than most organizations could ever hope to build and manage themselves. But there&#39;s literally nowhere you can ship a hardware box to Box in order to build your own moat around their SaaS castle. Box provides some great security tools themselves, but they are different from the tools provided by every other SaaS and public cloud vendor. Where IT organizations used to try to have a single pane of glass with a complex mess of hardware to see who was getting stopped by their moats and who was crossing their drawbridges, SaaS and cloud make that visibility increasingly difficult.</p><p>The third challenge to the traditional castle and moat strategy of IT is the rise of mobile. Where once upon a time your employees would all show up to work in your castle, now people are working around the world. Requiring everyone to login to a limited number of central VPNs becomes obviously absurd when you picture it as villagers having to sprint back from wherever they are across a drawbridge whenever they want to get work done. It&#39;s no wonder VPN support is one of the top IT organization tickets and likely always will be for organizations that maintain a castle and moat approach.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4ACMBi5NvKMLBiuvA4swh0/902c3091a6c702592d930d3b6e462c4c/image2-5.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"853\" loading=\"lazy\"/>\n            \n            </figure><p>But it&#39;s worse than that. Mobile has also introduced a culture where employees bring their own devices to work. Or, even if on a company-managed device, work from the road or home — beyond the protected walls of the castle and without the security provided by a moat.</p><p>If you&#39;d looked at how we managed our own IT systems at Cloudflare four years ago, you&#39;d have seen us following this same model. We used firewalls to keep threats out and required every employee to login through our VPN to get their work done. Personally, as someone who travels extensively for my job, it was especially painful.</p><p>Regularly, someone would send me a link to an internal wiki article asking for my input. I&#39;d almost certainly be working from my mobile phone in the back of a cab running between meetings. I&#39;d try and access the link and be prompted to login to our VPN in San Francisco. That&#39;s when the frustration would start.</p><p>Corporate mobile VPN clients, in my experience, all seem to be powered by some 100-sided die that only will allow you to connect if the number of miles you are from your home office is less than 25 times whatever number is rolled. Much frustration and several IT tickets later, with a little luck I may be able to connect. And, even then, the experience was horribly slow and unreliable.</p><p>When we audited our own system, we found that the frustration with the process had caused multiple teams to create workarounds that were, effectively, unauthorized drawbridges over our carefully constructed moat. And, as we increasingly adopted SaaS tools like Salesforce and Workday, we lost much visibility into how these tools were being used.</p><p>Around the same time we were realizing the traditional approach to IT security was untenable for an organization like Cloudflare, Google published their paper titled &quot;<a href=\"https://research.google/pubs/pub43231/\">BeyondCorp: A New Approach to Enterprise Security</a>.&quot; The core idea was that a company&#39;s intranet should be no more trusted than the Internet. And, rather than the <a href=\"https://www.cloudflare.com/learning/access-management/what-is-the-network-perimeter/\">perimeter</a> being enforced by a singular moat, instead each application and data source should authenticate the individual and device each time it is accessed.</p><p>The BeyondCorp idea, which has come to be known as a <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust model</a> for IT security, was influential for how we thought about our own systems. Powerfully, because Cloudflare had a flexible global network, we were able to use it both to enforce policies as our team accessed tools as well as to protect ourselves from malware as we did our jobs.</p><h2>Cloudflare for Teams</h2><p>Today, we&#39;re excited to announce <a href=\"https://teams.cloudflare.com/\">Cloudflare for Teams</a>™: the suite of tools we built to protect ourselves, now available to help any IT organization, from the smallest to the largest.</p><p>Cloudflare for Teams is built around two complementary products: Access and Gateway. <a href=\"https://teams.cloudflare.com/access/\">Cloudflare Access</a>™ is the modern VPN — a way to ensure your team members get fast access to the resources they need to do their job while keeping threats out. <a href=\"https://teams.cloudflare.com/gateway/\">Cloudflare Gateway</a>™ is the modern <a href=\"https://www.cloudflare.com/learning/security/what-is-next-generation-firewall-ngfw/\">Next Generation Firewall</a> — a way to ensure that your team members are protected from malware and follow your organization&#39;s policies wherever they go online.</p><p>Powerfully, both Cloudflare Access and Cloudflare Gateway are built atop the existing Cloudflare network. That means they are fast, reliable, scalable to the largest organizations, DDoS resistant, and located everywhere your team members are today and wherever they may travel. Have a senior executive going on a photo safari to see giraffes in Kenya, gorillas in Rwanda, and lemurs in Madagascar — don&#39;t worry, we have <a href=\"https://www.cloudflare.com/network/\">Cloudflare data centers</a> in all those countries (and many more) and they all support Cloudflare for Teams.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6H15vMsCPp8cGkoczT7dEg/cbba51161647d992df08f8e846a2d0a2/image4-3.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1451\" loading=\"lazy\"/>\n            \n            </figure><p>All Cloudflare for Teams products are informed by the threat intelligence we see across all of Cloudflare&#39;s products. We see such a large diversity of Internet traffic that we often see new threats and malware before anyone else. We&#39;ve supplemented our own proprietary data with additional data sources from leading security vendors, ensuring Cloudflare for Teams provides a broad set of <a href=\"https://www.cloudflare.com/products/zero-trust/threat-defense/\">protections against malware and other online threats</a>.</p><p>Moreover, because Cloudflare for Teams runs atop the same network we built for our infrastructure protection products, we can deliver them very efficiently. That means that we can offer these products to our customers at extremely competitive prices. Our goal is to make the return on investment (ROI) for all Cloudflare for Teams customers nothing short of a no brainer. If you’re considering another solution, <a href=\"https://teams.cloudflare.com/gateway/index.html#get-notified\">contact us before you decide</a>.</p><p>Both Cloudflare Access and Cloudflare Gateway also build off products we&#39;ve launched and battle tested already. For example, Gateway builds, in part, off our <a href=\"https://one.one.one.one/\">1.1.1.1 Public DNS resolver</a>. Today, more than 40 million people trust 1.1.1.1 as the fastest public DNS resolver globally. By adding malware scanning, we were able to create our entry-level Cloudflare Gateway product.</p><p>Cloudflare Access and Cloudflare Gateway build off our WARP and WARP+ products. We intentionally built a consumer mobile VPN service because we knew it would be hard. The millions of WARP and WARP+ users who have put the product through its paces have ensured that it&#39;s ready for the enterprise. That we have 4.5 stars across more than 200,000 ratings, just on iOS, is a testament of how reliable the underlying WARP and WARP+ engines have become. Compare that with the ratings of any corporate mobile VPN client, which are unsurprisingly abysmal.</p><p>We’ve partnered with some incredible organizations to create the ecosystem around Cloudflare for Teams. These include endpoint security solutions including VMWare Carbon Black, Malwarebytes, and Tanium. SEIM and analytics solutions including Datadog, Sumo Logic, and Splunk. Identity platforms including Okta, OneLogin, and Ping Identity. Feedback from these partners and more is at the end of this post.</p><p>If you’re curious about more of the <a href=\"/cloudflare-for-teams-products/\">technical details about Cloudflare for Teams, I encourage you to read Sam Rhea’s post</a>.</p><h2>Serving Everyone</h2><p>Cloudflare has always believed in the power of serving everyone. That’s why we’ve offered a free version of Cloudflare for Infrastructure since we launched in 2010. That belief doesn’t change with our launch of Cloudflare for Teams. For both Cloudflare Access and Cloudflare Gateway, there will be free versions to protect individuals, home networks, and small businesses. We remember what it was like to be a startup and believe that everyone deserves to be safe online, regardless of their budget.</p><p>With both Cloudflare Access and Gateway, the products are segmented along a Good, Better, Best framework. That breaks out into Access Basic, Access Pro, and Access Enterprise. You can see the features available with each tier in the table below, including Access Enterprise features that will roll out over the coming months.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1nMYnIZxACcGXUn5k8nTb7/e5e272d1f7a1a609b6282544ff41a1a1/access-features-2.png\" alt=\"\" class=\"kg-image\" width=\"1726\" height=\"1056\" loading=\"lazy\"/>\n            \n            </figure><p>We wanted a similar Good, Better, Best framework for Cloudflare Gateway. Gateway Basic can be provisioned in minutes through a simple change to your network’s recursive DNS settings. Once in place, network administrators can set rules on what domains should be allowed and filtered on the network. Cloudflare Gateway is informed both by the malware data gathered from our global sensor network as well as a rich corpus of domain categorization, allowing network operators to set whatever policy makes sense for them. Gateway Basic leverages the speed of 1.1.1.1 with granular network controls.</p><p>Gateway Pro, which we’re announcing today and you can <a href=\"https://teams.cloudflare.com/gateway/\">sign up to beta test</a> as its features roll out over the coming months, extends the DNS-provisioned protection to a full proxy. Gateway Pro can be provisioned via the WARP client — which we are extending beyond iOS and Android mobile devices to also support Windows, MacOS, and Linux — or network policies including MDM-provisioned proxy settings or GRE tunnels from office routers. This allows a network operator to filter on policies not merely by the domain but by the specific URL.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2Dcd8KHZDz2MEvjJKQ7jHO/e2d21bd1789f56147a5cf1eeedf50b27/gateway-features-1.png\" alt=\"\" class=\"kg-image\" width=\"1726\" height=\"1056\" loading=\"lazy\"/>\n            \n            </figure><h2>Building the Best-in-Class Network Gateway</h2><p>While Gateway Basic (provisioned via <a href=\"https://www.cloudflare.com/learning/dns/what-is-dns/\">DNS</a>) and Gateway Pro (provisioned as a proxy) made sense, we wanted to imagine what the best-in-class network gateway would be for Enterprises that valued the highest level of performance and <a href=\"https://www.cloudflare.com/learning/network-layer/network-security/\">security</a>. As we talked to these organizations we heard an ever-present concern: just surfing the Internet created risk of unauthorized code compromising devices. With every page that every user visited, third party code (JavaScript, etc.) was being downloaded and executed on their devices.</p><p>The solution, they suggested, was to isolate the local browser from third party code and have websites render in the network. This technology is known as <a href=\"https://www.cloudflare.com/learning/access-management/what-is-browser-isolation/\">browser isolation</a>. And, in theory, it’s a great idea. Unfortunately, in practice with current technology, it doesn’t perform well. The most common way the browser isolation technology works is to render the page on a server and then push a bitmap of the page down to the browser. This is known as pixel pushing. The challenge is that can be slow, bandwidth intensive, and it breaks many sophisticated web applications.</p><p>We were hopeful that we could solve some of these problems by moving the rendering of the pages to Cloudflare’s network, which would be closer to end users. So we talked with many of the leading browser isolation companies about potentially partnering. Unfortunately, as we experimented with their technologies, even with our vast network, we couldn’t overcome the sluggish feel that plagues existing browser isolation solutions.</p><h2>Enter S2 Systems</h2>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1j8dv8moDJzcw5qgLhvjI6/61b8d2c0b31f52080caab8d9ac346b5b/image7-1.png\" alt=\"\" class=\"kg-image\" width=\"666\" height=\"528\" loading=\"lazy\"/>\n            \n            </figure><p>That’s when we were introduced to S2 Systems. I clearly remember first trying the S2 demo because my first reaction was: “This can’t be working correctly, it’s too fast.” The S2 team had taken a different approach to browser isolation. Rather than trying to push down a bitmap of what the screen looked like, instead they pushed down the vectors to draw what’s on the screen. The result was an experience that was typically at least as fast as browsing locally and without broken pages.</p><p>The best, albeit imperfect, analogy I’ve come up with to describe the difference between S2’s technology and other browser isolation companies is the difference between WindowsXP and MacOS X when they were both launched in 2001. WindowsXP’s original graphics were based on bitmapped images. MacOS X were based on vectors. Remember the magic of watching an application “genie” in and out the MacOS X doc? Check it out in a video from the launch…</p><!--kg-card-begin: html--><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/2GkoAa5718Y?start=83&end=199\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><!--kg-card-end: html--><p>At the time watching a window slide in and out of the dock seemed like magic compared with what you could do with bitmapped user interfaces. You can hear the awe in the reaction from the audience. That awe that we’ve all gotten used to in UIs today comes from the power of vector images. And, if you’ve been underwhelmed by the pixel-pushed bitmaps of existing browser isolation technologies, just wait until you see what is possible with S2’s technology.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5Q7xlinXbjgxCT4Orr0reA/4e050f9376ffaff8b3ce0e094afdaf1c/image6-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"990\" loading=\"lazy\"/>\n            \n            </figure><p>We were so impressed with the team and the technology that we acquired the company. We will be integrating the S2 technology into Cloudflare Gateway Enterprise. The browser isolation technology will run across Cloudflare’s entire global network, bringing it within milliseconds of virtually every Internet user. You can learn more about this approach in Darren Remington&#39;s <a href=\"/cloudflare-and-remote-browser-isolation\">blog post</a>.</p><p>Once the rollout is complete in the second half of 2020 we expect we will be able to offer the first full browser isolation technology that doesn’t force you to sacrifice performance. In the meantime, if you’d like a demo of the S2 technology in action, <a href=\"https://teams.cloudflare.com/gateway/\">let us know</a>.</p><h2>The Promise of a Faster Internet for Everyone</h2><p>Cloudflare’s mission is to help build a better Internet. With Cloudflare for Teams, we’ve extended that network to protect the people and organizations that use the Internet to do their jobs. We’re excited to help a more modern, mobile, and cloud-enabled Internet be safer and faster than it ever was with traditional hardware appliances.</p><p>But the same technology we’re deploying now to <a href=\"https://www.cloudflare.com/network-services/solutions/enterprise-network-security/\">improve enterprise security</a> holds further promise. The most interesting Internet applications keep getting more complicated and, in turn, requiring more bandwidth and processing power to use.</p><p>For those of us fortunate enough to be able to afford the latest iPhone, we continue to reap the benefits of an increasingly powerful set of Internet-enabled tools. But try and use the Internet on a mobile phone from a few generations back, and you can see how quickly the latest Internet applications leaves legacy devices behind. That’s a problem if we want to bring the next 4 billion Internet users online.</p><p>We need a paradigm shift if the sophistication of applications and complexity of interfaces continues to keep pace with the latest generation of devices. To make the best of the Internet available to everyone, we may need to shift the work of the Internet off the end devices we all carry around in our pockets and let the network — where power, bandwidth, and CPU are relatively plentiful — carry more of the load.</p><p>That’s the long term promise of what S2’s technology combined with Cloudflare’s network may someday power. If we can make it so a less expensive device can run the latest Internet applications — using less battery, bandwidth, and CPU than ever before possible — then we can make the Internet more affordable and accessible for everyone.</p><p>We started with Cloudflare for Infrastructure. Today we’re announcing Cloudflare for Teams. But our ambition is nothing short of Cloudflare for Everyone.</p><h2>Early Feedback on Cloudflare for Teams from Customers and Partners</h2>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/35Ri79dQywu4XOnKywLmvX/3d41fe63889d411dd57c631d78e34c7f/Screen-Shot-2020-01-10-at-9.17.54-AM.png\" alt=\"\" class=\"kg-image\" width=\"2244\" height=\"1244\" loading=\"lazy\"/>\n            \n            </figure><p><i>&quot;Cloudflare Access has enabled Ziff Media Group to seamlessly and securely deliver our suite of internal tools to employees around the world on any device, without the need for complicated network configurations,” said </i><b><i>Josh Butts, SVP Product &amp; Technology, Ziff Media Group</i></b><i>.</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1pQMNPhCQq9S4DIHFbXBdX/2c4dcb5ba48303a6584cca05e10d3464/udaan.png\" alt=\"\" class=\"kg-image\" width=\"256\" height=\"255\" loading=\"lazy\"/>\n            \n            </figure><p><i>“VPNs are frustrating and lead to countless wasted cycles for employees and the IT staff supporting them,” said </i><b><i>Amod Malviya, Cofounder and CTO, Udaan</i></b><i>. “Furthermore, conventional VPNs can lull people into a false sense of security. With Cloudflare Access, we have a far more reliable, intuitive, secure solution that operates on a per user, per access basis. I think of it as Authentication 2.0 — even 3.0”</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6wBjJBRZEag7VjBBCeDQxw/0f39580054f535b4278d9d8eb1ccb775/roman.jpg\" alt=\"\" class=\"kg-image\" width=\"320\" height=\"320\" loading=\"lazy\"/>\n            \n            </figure><p><i>“Roman makes healthcare accessible and convenient,” said </i><b><i>Ricky Lindenhovius, Engineering Director, Roman Health</i></b><i>. “Part of that mission includes connecting patients to physicians, and Cloudflare helps Roman securely and conveniently connect doctors to internally managed tools. With Cloudflare, Roman can evaluate every request made to internal applications for permission and identity, while also improving speed and user experience.”</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/AWCF1huBkikdFLf3etDce/e25285190bea52588d426cdb4dfacc59/VMware-Carbon-Black_-Logo_black.png\" alt=\"\" class=\"kg-image\" width=\"1781\" height=\"304\" loading=\"lazy\"/>\n            \n            </figure><p><i>“We’re excited to partner with Cloudflare to provide our customers an innovative approach to enterprise security that combines the benefits of endpoint protection and network security,&quot; said </i><b><i>Tom Barsi, VP Business Development, VMware</i></b><i>. &quot;VMware Carbon Black is a leading endpoint protection platform (EPP) and offers visibility and control of laptops, servers, virtual machines, and cloud infrastructure at scale. In partnering with Cloudflare, customers will have the ability to use VMware Carbon Black’s device health as a signal in enforcing granular authentication to a team’s internally managed application via Access, Cloudflare’s Zero Trust solution. Our joint solution combines the benefits of endpoint protection and a zero trust authentication solution to keep teams working on the Internet more secure.&quot;</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3N6QIr5hSdaoqVXwgmwsQG/20a7c9ae9a053534dda28d8095b38501/Rackspace_Wordmark_Black--black-version-vs-red--chose-what-works-better-.png\" alt=\"\" class=\"kg-image\" width=\"3147\" height=\"630\" loading=\"lazy\"/>\n            \n            </figure><p><i>“Rackspace is a leading global technology services company accelerating the value of the cloud during every phase of our customers’ digital transformation,” said </i><b><i>Lisa McLin, vice president of alliances and channel chief at Rackspace</i></b><i>. “Our partnership with Cloudflare enables us to deliver cutting edge networking performance to our customers and helps them leverage a software defined networking architecture in their journey to the cloud.”</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/JLJmRL7MbWHOtO5o6Kixt/1c6453a995c5e107ae2c0067a360e63d/IMC-landscape.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"263\" loading=\"lazy\"/>\n            \n            </figure><p><i>“Employees are increasingly working outside of the traditional corporate headquarters. Distributed and remote users need to connect to the Internet, but today’s security solutions often require they backhaul those connections through headquarters to have the same level of security,” said </i><b><i>Michael Kenney, head of strategy and business development for Ingram Micro Cloud</i></b><i>. “We’re excited to work with Cloudflare whose global network helps teams of any size reach internally managed applications and securely use the Internet, protecting the data, devices, and team members that power a business.”</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/25LoZN22bBHHWOO5enD5lR/1867e24285e9c375737a36cf31f9bcfb/Okta_Logo_BrightBlue_Medium.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"540\" loading=\"lazy\"/>\n            \n            </figure><p><i>&quot;At Okta, we’re on a mission to enable any organization to securely use any technology. As a leading provider of identity for the enterprise, Okta helps organizations remove the friction of managing their corporate identity for every connection and request that their users make to applications. We’re excited about our partnership with Cloudflare and bringing seamless authentication and connection to teams of any size,” said </i><b><i>Chuck Fontana, VP, Corporate &amp; Business Development, Okta</i></b><i>.</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7anUBMhnvjE8SMl6PK4Ud7/0b177881303ec4ad45df589fee057b30/Tanium_logo.png\" alt=\"\" class=\"kg-image\" width=\"1723\" height=\"555\" loading=\"lazy\"/>\n            \n            </figure><p><i>&quot;Organizations need one unified place to see, secure, and manage their endpoints,” said </i><b><i>Matt Hastings, Senior Director of Product Management at Tanium</i></b><i>. “We are excited to partner with Cloudflare to help teams secure their data, off-network devices, and applications. Tanium’s platform provides customers with a risk-based approach to operations and security with instant visibility and control into their endpoints. Cloudflare helps extend that protection by incorporating device data to enforce security for every connection made to protected resources.”</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1G8rBE3rzCwaAL5Up0vHr2/dfa8a1f5baff26cd7511b718f915e2ef/Onelogin_Logotype_black_RGB.png\" alt=\"\" class=\"kg-image\" width=\"2329\" height=\"575\" loading=\"lazy\"/>\n            \n            </figure><p><i>“OneLogin is happy to partner with Cloudflare to advance security teams&#39; identity control in any environment, whether on-premise or in the cloud, without compromising user performance,&quot; said </i><b><i>Gary Gwin, Senior Director of Product at OneLogin</i></b><i>. &quot;OneLogin’s identity and access management platform securely connects people and technology for every user, every app, and every device. The OneLogin and Cloudflare for Teams integration provides a comprehensive identity and network control solution for teams of all sizes.”</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3rzDIOUS0zTujL3gLU2rbW/2d07dc44439ec800d57a751444c16643/PING-WEB-logo_20190918.png\" alt=\"\" class=\"kg-image\" width=\"1920\" height=\"1080\" loading=\"lazy\"/>\n            \n            </figure><p><i>“Ping Identity helps enterprises improve security and user experience across their digital businesses,” said </i><b><i>Loren Russon, Vice President of Product Management, Ping Identity</i></b><i>. “Cloudflare for Teams integrates with Ping Identity to provide a comprehensive identity and network control solution to teams of any size, and ensures that only the right people get the right access to applications, seamlessly and securely.&quot;</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4X5sCeeJ405hfzeMqp0zOR/eb78df598bd301c9a4e61ed381a365c6/dd_logo_h_rgb.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"407\" loading=\"lazy\"/>\n            \n            </figure><p><i>&quot;Our customers increasingly leverage deep observability data to address both operational and security use cases, which is why we launched Datadog Security Monitoring,&quot; said </i><b><i>Marc Tremsal, Director of Product Management at Datadog</i></b><i>. &quot;Our integration with Cloudflare already provides our customers with visibility into their web and DNS traffic; we&#39;re excited to work together as Cloudflare for Teams expands this visibility to corporate environments.&quot;</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1Tospn8rS8zZxhGBTII1VF/b7866b6ae4dae78c9fe03b4ba6f0ae27/SumoLogic_Logo_SumoBlue_RGB__3x.png\" alt=\"\" class=\"kg-image\" width=\"1731\" height=\"324\" loading=\"lazy\"/>\n            \n            </figure><p><i>“As more companies support employees who work on corporate applications from outside of the office, it is vital that they understand each request users are making. They need real-time insights and intelligence to react to incidents and audit secure connections,&quot; said </i><b><i>John Coyle, VP of Business Development, Sumo Logic</i></b><i>. &quot;With our partnership with Cloudflare, customers can now log every request made to internal applications and automatically push them directly to Sumo Logic for retention and analysis.&quot;</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6x2dNLTEyJ6v68tVPm53X1/5ffba84fc8febd15b55ba4148b40fad8/CloudGenix_GRD_CLR_RGB-800.png\" alt=\"\" class=\"kg-image\" width=\"800\" height=\"102\" loading=\"lazy\"/>\n            \n            </figure><p><i>“Cloudgenix is excited to partner with Cloudflare to provide an end-to-end security solution from the branch to the cloud. As enterprises move off of expensive legacy MPLS networks and adopt branch to internet breakout policies, the CloudGenix CloudBlade platform and Cloudflare for Teams together can make this transition seamless and secure. We’re looking forward to Cloudflare’s roadmap with this announcement and partnership opportunities in the near term.” said </i><b><i>Aaron Edwards, Field CTO, Cloudgenix</i></b><i>.</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3RotYCvz7olpGESN3i1KmJ/e659ff506fc2f3e23aec2194befab7f1/Malwarebytes---logotype_0D3ECC_Nov18_PNG.png\" alt=\"\" class=\"kg-image\" width=\"3838\" height=\"619\" loading=\"lazy\"/>\n            \n            </figure><p><i>“In the face of limited cybersecurity resources, organizations are looking for highly automated solutions that work together to reduce the likelihood and impact of today’s cyber risks,” said </i><b><i>Akshay Bhargava, Chief Product Officer, Malwarebytes</i></b><i>. “With Malwarebytes and Cloudflare together, organizations are deploying more than twenty layers of security defense-in-depth. Using just two solutions, teams can secure their entire enterprise from device, to the network, to their internal and external applications.”</i></p><hr/>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1H0Z1ZcIPeX1mIeX8nyaOj/277ee66ff2bbca95c825bddff3807726/CC-Logo_V1.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"326\" loading=\"lazy\"/>\n            \n            </figure><p><i>&quot;Organizations&#39; sensitive data is vulnerable in-transit over the Internet and when it&#39;s stored at its destination in public cloud, SaaS applications and endpoints,” said </i><b><i>Pravin Kothari, CEO of CipherCloud</i></b><i>. “CipherCloud is excited to partner with Cloudflare to secure data in all stages, wherever it goes. Cloudflare’s global network secures data in-transit without slowing down performance. CipherCloud CASB+ provides a powerful cloud security platform with end-to-end data protection and adaptive controls for cloud environments, SaaS applications and BYOD endpoints. Working together, teams can rely on integrated Cloudflare and CipherCloud solution to keep data always protected without compromising user experience.”</i></p><hr/><p></p>",
		"id": "63bNlczJwVxsoQKOm4iUtF",
		"localeList": {
			"name": "Introducing Cloudflare for Teams Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"title": "Introducing Cloudflare for Teams",
			"description": null,
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2w8FULfxozPeLWSwtoijvp/02a0ad145aff7260796d57614e5b99cd/introducing-cloudflare-for-teams-0RWFzd.png"
		},
		"primary_author": {},
		"published_at": "2020-01-07T14:00:24.000+00:00",
		"slug": "introducing-cloudflare-for-teams",
		"tags": [
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "6c9EM6c5poinGKIR6xldFo",
				"name": "Cloudflare Access",
				"slug": "cloudflare-access"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "3ZEx7HXKLHG0LIUpQQmNEe",
				"name": "VPN",
				"slug": "vpn"
			},
			{
				"id": "3QNaVNNpUXrfZYUGDJkXwA",
				"name": "Cloudflare Zero Trust",
				"slug": "cloudflare-zero-trust"
			},
			{
				"id": "15qx2Nvwrm4X8zknw3vXgC",
				"name": "Cloudflare Gateway",
				"slug": "gateway"
			}
		],
		"title": "Introducing Cloudflare for Teams",
		"updated_at": "2024-08-27T02:06:24.436Z",
		"url": "https://blog.cloudflare.com/introducing-cloudflare-for-teams"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}