{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Albert Strasheim",
				"slug": "albert-strasheim",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4dX2VxyGBJJSIQmrhQa5Nf/ac6cb81dc63f315acc003ba87e92a987/albert-strasheim.jpg",
				"location": "San Francisco",
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Some interesting changes related to timekeeping in the upcoming Go 1.3 release inspired us to take a closer look at how Go programs keep time with the help of the Linux kernel. Timekeeping is a complex topic and determining the current time isn’t as simple as it might seem at first glance.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1zj4axdOysNvGVx6XqYuIP/4c7f0279f6f40889f9dc12b11ffc6ead/its-go-time-on-linux.jpg",
		"featured": false,
		"html": "<p>Some interesting changes related to timekeeping in the upcoming Go 1.3 release inspired us to take a closer look at how Go programs keep time with the help of the Linux kernel. Timekeeping is a complex topic and determining the current time isn’t as simple as it might seem at first glance.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4VWH2QXVaqkSnUkzLetIdn/faf2ce75cc81865da49a270bea59efab/The_Persistence_of_Memory.jpg\" alt=\"Time\" class=\"kg-image\" width=\"368\" height=\"271\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"http://golang.org/\">Go</a> running on the Linux kernel has been used to build <a href=\"/go-at-cloudflare/\">many</a> <a href=\"/red-october-cloudflares-open-source-implementation-of-the-two-man-rule/\">important</a> <a href=\"/what-weve-been-doing-with-go/\">systems</a> like RRDNS (our DNS server) at CloudFlare. Accurately, precisely and efficiently determining the time is an important part of many of the these systems.</p><p>To see why time is important, consider that humans have had some trouble convincing computers to keep time for them in the recent past. It been a bit more than a decade since we had to dust off our best COBOL programmers to tackle <a href=\"https://en.wikipedia.org/wiki/Year_2000_problem\">Y2K</a>.</p><p>More recently, a bug in the handling of a leap second propagated through the Network Time Protocol (NTP) also took many systems off-line. As we&#39;ve seen in recent days, NTP is very useful for synchronizing computer clocks and/or <a href=\"/technical-details-behind-a-400gbps-ntp-amplification-ddos-attack\">DDoSing them</a>. The leap second bug <a href=\"http://www.somebits.com/weblog/tech/bad/leap-second-2012.html\">received</a> <a href=\"http://www.datastax.com/dev/blog/linux-cassandra-and-saturdays-leap-second-problem\">extensive</a> <a href=\"http://arstechnica.com/business/2012/07/one-day-later-the-leap-second-v-the-internet-scorecard/\">coverage</a>. <a href=\"http://googleblog.blogspot.com/2011/09/time-technology-and-leaping-seconds.html\">Google was ready</a> but many other popular sites were taken offline.</p><p>We also have the <a href=\"https://en.wikipedia.org/wiki/Year_2038_problem\">Year 2038 problem</a> to look forward to. Hopefully there will still be a few engineers around then that remember what this 32-bit thing was all about.</p><h2>Time in Go</h2><p>Everything starts with the <a href=\"http://golang.org/pkg/time/\">time</a> package that is part of Go’s standard library. The time package provides types for <a href=\"http://golang.org/pkg/time/#Time\">Time</a>, <a href=\"http://golang.org/pkg/time/#Duration\">Duration</a>, <a href=\"http://golang.org/pkg/time/#Ticker\">Ticker</a>, <a href=\"http://golang.org/pkg/time/#Timer\">Timer</a> and various utility functions for manipulating these types.</p><p>The most commonly used function in this package is probably the <a href=\"http://golang.org/pkg/time/#Now\">time.Now</a> function, which returns the current time as a Time struct. The Time struct has 3 fields:</p>\n            <pre class=\"language-go\"><code class=\"language-go\">type Time struct {\n    sec int64\n\tnsec uintptr\n\tloc *Location\n}</pre></code>\n            <p><a href=\"http://golang.org/pkg/time/#Location\">Location</a> contains the timezone information for the time.</p><p><a href=\"http://golang.org/pkg/time/#Duration\">Duration</a> is used to express the difference between two Times and to configure timers and tickers.</p><p><a href=\"http://golang.org/pkg/time/#Timer\">Timer</a> is useful for implementing a timeout, typically as part of a <a href=\"http://golang.org/ref/spec#Select_statements\">select</a> statement. <a href=\"http://golang.org/pkg/time/#Ticker\">Ticker</a> can be used to wake up periodically, usually when you are using select in a for loop.</p><p>Go’s time package is used in many other places in the Go standard library. When dealing with socket connections that may go slow or stop sending data completely, one uses the SetDeadline functions that are part of the <a href=\"http://golang.org/pkg/net/#Conn\">net.Conn</a> interface.</p><p>We love writing tests at CloudFlare, and having unit tests that include some kind of random component can turn up interesting issues. You can use the current time to seed random number generators in tests, using:</p>\n            <pre class=\"language-go\"><code class=\"language-go\">rand.New(rand.NewSource(time.Now().UnixNano()))</pre></code>\n            <p>If you’re generating random numbers for a secure application, you really want to be using the <a href=\"http://golang.org/pkg/crypto/rand/\">crypto/rand</a> package. Interestingly, even the initialization of <a href=\"http://golang.org/pkg/crypto/rand/#pkg-variables\">crypto/rand.Reader</a> <a href=\"http://golang.org/src/pkg/crypto/rand/rand_unix.go#L114\">incorporates</a> the current time.</p><p>The current time also features when one <a href=\"http://golang.org/src/pkg/log/log.go#L131\">logs</a> something using the <a href=\"http://golang.org/pkg/log\">log</a> package.</p><p>A very useful service called <a href=\"https://sourcegraph.com/code.google.com/p/go/symbols/go/code.google.com/p/go/src/pkg/time/Now\">Sourcegraph</a> turns up more than 6000 examples where time.Now is used. For example, the <a href=\"http://camlistore.org/\">Camlistore</a> code base calls time.Now in about 130 different places.</p><p>With time.Now being as pervasive as it is, have you ever wondered how it works? Time to dive deeper.</p><h2>System calls</h2><p>The most important changes to the way in which Go programs keep time on Linux was committed on 8 November 2012 in <a href=\"https://code.google.com/p/go/source/detail?r=42c8d3aadc40\">changeset 42c8d3aadc40</a> Let’s analyse the commit message and the code for some clues:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">runtime: use vDSO clock_gettime for time.now & runtime.nanotime\non Linux/amd64. Performance improvement aside, time.Now() now \ngets real nanosecond resolution on supported systems.</pre></code>\n            <p>To understand this commit message better, we first need to review the system calls available on Linux for obtaining the value of the clock.</p><p>In the beginning, there was <a href=\"http://man7.org/linux/man-pages/man2/time.2.html\">time</a> and <a href=\"http://man7.org/linux/man-pages/man2/settimeofday.2.html\">gettimeofday</a>, which existed in SVr4, 4.3BSD and was described in POSIX.1-2001. time returns the number of seconds since the <a href=\"https://en.wikipedia.org/wiki/Unix_time\">Unix epoch</a>, 1970-01-01 00:00:00 UTC and is defined in C as:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">time_t time(time_t *t)</pre></code>\n            <p>time_t is 4 bytes on 32-bit platforms and 8 bytes on 64-bit platforms, hence the Y2038 problem mentioned above.</p><p>gettimeofday returns the number of seconds and microseconds since the epoch and is defined in C as:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">int gettimeofday(struct timeval *tv, struct timezone *tz)</pre></code>\n            <p>gettimeofday populates a <code>struct timeval</code>, which has the following fields:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">struct timeval {\n\ttime_t tv_sec; /* seconds */\n\tsuseconds_t tv_usec; /* microseconds */\n}</pre></code>\n            <p>gettimeofday yields timestamps that only have microsecond precision. POSIX.1-2008 marks gettimeofday as obsolete, recommending the use of <a href=\"http://man7.org/linux/man-pages/man2/clock_gettime.2.html\">clock_gettime</a> instead, which is defined in C as:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">int clock_gettime(clockid_t clk_id, struct timespec *tp)</pre></code>\n            <p>clock_gettime populates a <code>struct timespec</code>, which has the following fields:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">struct timespec {\n\ttime_t tv_sec; /* seconds */\n\tlong tv_nsec; /* nanoseconds */\n}</pre></code>\n            <p>clock_gettime can yield timestamps that have nanosecond precision. The clock ID parameter determines the type of clock to use. Of interest to us are:</p><ul><li><p><code>CLOCK_REALTIME</code>: a system-wide clock that measures real time. This clock is affected by discontinuous jumps in the system time and by incremental adjustments by made using the <a href=\"http://man7.org/linux/man-pages/man3/adjtime.3.html\">adjtime</a> function or NTP.</p></li><li><p><code>CLOCK_MONOTONIC</code>: a clock that represents monotonic time since some unspecified starting point. This clock is not affected by discontinous jumps in the system time, but is affected by adjtime and NTP.</p></li><li><p><code>CLOCK_MONOTONIC_RAW</code>: similar to <code>CLOCK_MONOTONIC</code>, but not subject to adjustment by adjtime or NTP.</p></li></ul><h2>time.Now</h2><p>With this background we can look at the code for time.Now. (Hint: click on the <a href=\"http://golang.org/pkg/time/#Now\">function name</a> in godoc to look at the code yourself.)</p><p>The time.Now function is implemented using a function called now that is internal to package time, but is actually provided by the Go runtime. In other words, there is no code for the function in package time itself.</p><p>Let’s take a closer look at the Linux implementations for the <a href=\"http://golang.org/src/pkg/runtime/sys_linux_386.s#L107\">386</a> and <a href=\"http://golang.org/src/pkg/runtime/sys_linux_amd64.s#L104\">amd64</a> platforms. We see that these functions are implemented in assembler and call a function to retrieve the current time. You might have been expecting to see a system call, i.e. an <code>INT 0x80</code> instruction on 386 or the <code>SYSCALL</code> instruction on amd64, to the kernel at this point, but Go does something much more interesting on Linux.</p><p>The Linux kernel provides Virtual Dynamically linked Shared Objects (vDSO) as a way for user space applications to make low-overhead calls to functions that would normally involve a system call to the kernel.</p><p>If you’re writing your application in a language that uses glibc, you are probably already getting your time via vDSO. Go doesn’t use glibc, so it has to implement this functionality in its runtime. The relevant code is in <a href=\"http://golang.org/src/pkg/runtime/vdso_linux_amd64.c\">vdso_linux_amd64.c</a> in the <a href=\"http://golang.org/pkg/runtime/\">runtime package</a>.</p><p>Finally, if you’re the kind of person that likes to stare into the bowels of your operating system, here’s the <a href=\"http://lxr.free-electrons.com/source/arch/x86/vdso/vclock_gettime.c\">kernel side of the vDSO</a>.</p><p>vDSO support for time functions is currently 64-bit only, but a <a href=\"http://lwn.net/Articles/583963/\">kernel patch</a> is in the works to add them on 32-bit platforms. When this happens, the Go runtime code will have to be updated to take advantage of this.</p><h2>Benchmarks</h2><p>When frequently calling a function to determine the time, you may be interested to know how long it takes to return. In other words, how now is “now” really? For benchmarking purposes, you can make these system calls directly from Go code. We have prepared <a href=\"https://github.com/cloudflare/autobench/commit/7d1effaf1fe0669ac28ee7ebe67216ee95f8a1b5\">a patch</a> to Dave Cheney’s excellent <a href=\"https://github.com/cloudflare/autobench\">autobench</a> project so that you may benchmark these system calls and other time-related functions yourself.</p><p>Benchmarks can also help us measure the time saved by calling gettimeofday and clock_gettime via the vDSO mechanism instead of the traditional system call path.</p><p>We’ll also use autobench to compare the performance of different versions of Go for the same set of time functions.</p><p>All benchmarks numbers below were obtained on an Intel Core i7-3540M CPU running at its maximum clock speed of 3 GHz. The CPU frequency scaling governor was set to performance mode to ensure reliable benchmark results.</p><p>We’ll use the Go 1.2 stable release as a baseline.</p><p>BenchmarkSyscallTime and BenchmarkVDSOTime measure the time it takes to make a time system call and vDSO call, respectively:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">BenchmarkSyscallTime 38.2 ns/op\nBenchmarkVDSOTime    3.85 ns/op</pre></code>\n            <p>BenchmarkSyscallGettimeofday and BenchmarkVDSOGettimeofday measure the time it takes make to call a gettimeofday system call and vDSO call, respectively:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">BenchmarkSyscallGettimeofday 59.3 ns/op\nBenchmarkVDSOGettimeofday    23.4 ns/op</pre></code>\n            <p>BenchmarkTimeNow measures the time it takes to call time.Now, which makes an underlying vDSO call to <code>clock_gettime(CLOCK_REALTIME)</code> and converts the returned value to a time.Time struct:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">BenchmarkTimeNow 23.6 ns/op</pre></code>\n            <p>Using autobench, we can also compare different Go versions against each other. To see how far we&#39;ve come in the last few years, we also compared Go 1.2 to Go 1.0.3, which was released on Sep 27, 2012. The major difference was in the benchmark for time.Now:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">benchmark        old ns/op  new ns/op  delta\nBenchmarkTimeNow 406        23         -94.19%</pre></code>\n            <p>To repeat this test with Go 1.0.3, you&#39;ll need the fix in <a href=\"https://code.google.com/p/go/source/detail?r=419dcca62a3d\">changeset 419dcca62a3d</a> to compile if you are using a recent version of GCC.</p><h2>Clock Sources</h2><p>The speed at which you can tell time also depending on the clock source being used by your kernel. To see which clock sources you have available, run the following command:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ cat /sys/devices/system/clocksource/clocksource0/available_clocksource\ntsc hpet acpi_pm</pre></code>\n            <p>To see which clock source is currently in use, run this command:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ cat /sys/devices/system/clocksource/clocksource0/current_clocksource\ntsc</pre></code>\n            <p><a href=\"https://en.wikipedia.org/wiki/Time_Stamp_Counter\">Time Stamp Counter (TSC)</a> is a 64-bit register that can be read by the RDTSC instruction. It is faster to read than the <a href=\"https://en.wikipedia.org/wiki/High_Precision_Event_Timer\">High Precision Event Timer (HPET)</a>. The ACPI Power Management Timer (APCI PMT) is another timer that is found on many motherboards.</p><p>We can also use the same benchmarks above to compare the TSC clock source and a HPET clock source. Doing so requires booting Linux with the <code>clocksource=hpet</code> kernel command line parameter. Here are the results:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">benchmark                              tsc ns/op   hpet ns/op  delta\nBenchmarkSyscallGettimeofday              59          645      +987.69%\nBenchmarkVDSOGettimeofday                 23          598      +2455.56%\nBenchmarkSyscallClockGettimeRealtime      58          642      +995.56%\nBenchmarkSyscallClockGettimeMonotonic     57          641      +1012.85%\nBenchmarkTimeNow                          23          598      +2433.90%</pre></code>\n            <p>As you can see, querying the HPET clock source takes significantly longer.</p><p>Not all CPUs are created equal. To see which TSC features your CPU supports, run the following command:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ cat /proc/cpuinfo | grep tsc</pre></code>\n            <p>You will see some or all of the following CPU flags related to the TSC:</p><ul><li><p>tsc</p></li><li><p>rdtscp</p></li><li><p>constant_tsc</p></li><li><p>nonstop_tsc</p></li></ul><p>The <i>tsc</i> flag indicates that your CPU has the 64-bit TSC register, which has been present since the Pentium.</p><p>The <i>rdtscp</i> flag indicates that your CPU supports the newer RDTSCP instruction, in addition to the RDTSC instruction. Intel has an interesting whitepaper on <a href=\"http://www.intel.com/content/www/us/en/intelligent-systems/embedded-systems-training/ia-32-ia-64-benchmark-code-execution-paper.html\">How to Benchmark Code Execution Times on Intel IA-32 and IA-64 Instruction Set Architectures</a> with more details about the differences.</p><p>The <i>constant_tsc</i> flag indicates that the TSC runs at constant frequency irrespective of the current frequency, voltage or throttling state of the CPU, commonly referred to as its P- and T-state.</p><p>The <i>nonstop_tsc</i> flag indicates that TSC does not stop, irrespective of the CPU’s power saving mode, referred to as its C-state.</p><p>These features work in conjunction to provide an invariant TSC. There is more discussion over at the <a href=\"http://software.intel.com/en-us/forums/topic/280440\">Intel Software forums</a> if you’re interested.</p><h2>Coming up in Go 1.3</h2><p>There has also been some interesting work on the time front in the upcoming Go 1.3 release. The time.Sleep function, Ticker, and Timer now use <code>clock_gettime(CLOCK_MONOTONIC)</code> on Linux and other platforms. This work has been a good example of the broader community contributing to improve the core of Go, as can be seen in <a href=\"https://code.google.com/p/go/issues/detail?id=6007\">issue 6007</a>, <a href=\"https://codereview.appspot.com/53010043/\">CL 53010043</a> and <a href=\"https://groups.google.com/d/topic/golang-dev/gVFa7DC8UI0/discussion\">discussion on golang-dev</a>.</p><h2>Further Reading</h2><p>That’s it for today. If kernels and clocks excite you, CloudFlare is always looking to hire great Go and Linux kernel engineers. See our <a href=\"https://www.cloudflare.com/join-our-team\">Careers</a> page.</p><p>It would not have been possible to write this article without the help from some other sources. If you want to know more, here’s some recommended reading:</p><p>The book <a href=\"http://www.amazon.com/Understanding-Linux-Kernel-Third-Edition/dp/0596005652\">Understanding the Linux Kernel</a> by Daniel Bovet and Marco Cesati has an entire chapter on the timekeeping architecture in the kernel.</p><p>More about timers <a href=\"http://stackoverflow.com/questions/10921210/cpu-tsc-fetch-operation-especially-in-multicore-multi-processor-environment\">on StackOverflow</a></p><p>Read more about <a href=\"http://www.linuxjournal.com/content/creating-vdso-colonels-other-chicken\">vDSOs</a>.</p><p>Read more about <a href=\"http://juliusdavies.ca/posix_clocks/clock_realtime_linux_faq.html\">clock_gettime</a>.</p><p>Sometimes bug reports can be a great source of information on details of the kernel and your CPU. <a href=\"https://bugzilla.redhat.com/bugzilla/show_bug.cgi?id=474091\">Red Hat Bugzilla #474091</a> was a gold mine of information on the CPU flags for the TSC.</p><p>More at Quora on the the benefits of <a href=\"http://www.quora.com/Linux/What-are-the-advantages-and-disadvantages-of-TSC-and-HPET-as-a-clocksource\">TSC vs HPET</a>.</p><p>StackOverflow also had some information on the <a href=\"https://stackoverflow.com/questions/7987671/what-is-the-acpi-pm-linux-clocksource-used-for-what-hardware-implements-it\">ACPI PM clock source</a>.</p><p>Finally, some discussion of the <a href=\"https://twistedmatrix.com/trac/ticket/2424#comment:23\">differences between CLOCK_MONOTONIC and CLOCK_MONOTONIC_RAW</a> as used in the Twisted framework for Python.</p>",
		"id": "7xktWOfH0yiQAj7YiLjfh1",
		"localeList": {
			"name": "It's Go Time on Linux Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2014-03-05T00:00:00.000+00:00",
		"reading_time": 8,
		"slug": "its-go-time-on-linux",
		"tags": [
			{
				"id": "383iv0UQ6Lp0GZwOAxGq2p",
				"name": "Linux",
				"slug": "linux"
			},
			{
				"id": "KDI5hQcs301H8vxpGKXO0",
				"name": "Go",
				"slug": "go"
			},
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "683doBhQG1RNA5TdzbpraJ",
				"name": "Google",
				"slug": "google"
			},
			{
				"id": "5kIxDMJCg3PXQxVINDL0Cw",
				"name": "Attacks",
				"slug": "attacks"
			}
		],
		"title": "It's Go Time on Linux",
		"updated_at": "2024-08-27T02:43:36.243Z",
		"url": "https://blog.cloudflare.com/its-go-time-on-linux"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}