{
	"initialReadingTime": "14",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Kristian Freeman",
				"slug": "kristian",
				"bio": "Manager, Developer Advocacy team at Cloudflare. We help developers build amazing apps on Cloudflare, with tools like Workers, Pages, and more!",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3VUYoHwDSenpoOr2qQ5rQe/f6c20c05395cf1e49aa28d708c396a4e/kristian.jpg",
				"location": "Austin, TX",
				"website": "https://www.signalnerve.com",
				"twitter": "@kristianf_",
				"facebook": null
			}
		],
		"excerpt": "I'm extremely stoked to announce Built with Workers today – it's an awesome resource for exploring what you can build with Cloudflare Workers. As Adam explained in our launch post, showcasing developers building incredible projects with tools like Workers KV ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5cIhr4n65BFcEhP5C4Ic8J/467cd810242860cc5da401a8b8a8777b/jamstack-at-the-edge-how-we-built-built-with-workers-on-workers.png",
		"featured": false,
		"html": "<p>I&#39;m extremely stoked to announce <a href=\"https://workers.cloudflare.com/built-with\">Built with Workers</a> today – it&#39;s an awesome resource for exploring what you can build with <a href=\"https://workers.cloudflare.com/\">Cloudflare Workers</a>. As Adam explained in <a href=\"/built-with-workers/\">our launch post</a>, showcasing developers building incredible projects with tools like Workers KV or our <a href=\"https://developers.cloudflare.com/workers/reference/apis/html-rewriter/\">streaming HTML rewriter</a> is a great way to celebrate users of our platform. It also helps encourage developers to try building their dream app on top of Workers. In this post, I’ll explore some of the architectural and implementation designs we made while building the site.</p><p>When we first started planning Built with Workers, we wanted to use the site as an opportunity to build a new greenfield application, showcasing the strength of the Workers platform. The Workers Developer Experience team is cross-functional: while we might spend most of our time improving our docs, or developing features for our command-line interface <a href=\"https://github.com/cloudflare/wrangler\">Wrangler,</a> most of us have spent years developing on the web. The prospect of starting a new application is always fun, but in this instance, it was a prime chance to ask (and answer) the question, <i>&quot;If I could build this site on Workers with whatever tools I want, what would I choose?&quot;</i></p><p>A guiding principle for the Workers platform is ease-of-use. The programming model is simple: it&#39;s just JavaScript (or, via WASM, Rust, C, and C++), and you have complete control over the requests coming in and the requests going out from your Workers script. In the same way, while building Built with Workers, it was <b>crucial</b> to find a set of tools that could enable something like this throughout the process of building the entire application. To enable this, we&#39;ve embraced <b>JAMstack</b> – a software stack comprised of JavaScript, <a href=\"https://www.cloudflare.com/learning/security/api/what-is-an-api/\">APIs</a>, and markup – with Built with Workers, deploying always up-to-date static builds of the site <i>directly to the edge</i>, using <a href=\"https://workers.cloudflare.com/sites\">Workers Sites</a>. Our framework of choice, <a href=\"https://www.gatsbyjs.org/\">Gatsby.js</a>), provides a set of sane defaults to build a modern web application. To manage content and the layout of the site, we&#39;ve chosen <a href=\"https://www.sanity.io/\">Sanity.io</a>, a powerful <a href=\"https://en.wikipedia.org/wiki/Headless_content_management_system\">headless CMS</a> that allows us to model the entire website without needing to deploy any databases or spin up any additional infrastructure.</p><p>Personally, I&#39;m excited about JAMstack as a methodology for building web applications <i>because</i> of this emphasis on reducing infrastructure: it&#39;s incredibly similar to the motivations behind deploying serverless applications using Cloudflare Workers, and as we developed Built with Workers, we discovered a number of these philosophical similarities in JAMstack and Cloudflare Workers – exciting! To help encourage developers to explore building their own JAMstack applications on Workers, I&#39;m also announcing today that we&#39;ve made the Built with Workers codebase open-source on GitHub – you can check out how the application is developed, built and deployed from start to finish.</p><p>In this post, we&#39;ll dig into Built with Workers, exploring how it works, the technical decisions we&#39;ve made, and some of the most fascinating aspects of what it means to build applications on the edge.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1umidSCuFOnPav3ZdYthdC/2b77849ae4814f0a22b0317564bf28b4/bww.png\" alt=\"\" class=\"kg-image\" width=\"3338\" height=\"2003\" loading=\"lazy\"/>\n            \n            </figure><p>A screenshot of the Built with Workers homepage</p><h2>Exploring the JAMstack</h2><p>My first encounter with tooling that would ultimately become part of &quot;JAMstack&quot; was in 2013. I noticed the huge proliferation of developers building personal &quot;static&quot; sites – taking blog posts written primarily in Markdown, and pushing them through frameworks like Jekyll to build full websites that could easily be deployed to a number of <a href=\"https://www.cloudflare.com/learning/cdn/what-is-a-cdn/\">CDNs</a> and file hosting platforms. These static sites were <b>fast</b> – they are just HTML, CSS, and JavaScript – and <b>easy to update</b>. The average developer spends their days maintaining large and complex software systems, so it was relaxing to just write Markdown, plug in some re-usable HTML and CSS, and deploy your website. The advent of static sites, of course, isn&#39;t new – but after years of increasingly complex full-stack technology, the return to simplicity was a promising development for many kinds of websites that didn&#39;t need databases, or any dynamic content.</p><p>In the last couple years, JAMstack has built upon that resurgence, and represents an approach to building complete, complex applications using the same tooling that has become the first choice for developers building their simple personal sites. JAMstack is comprised of three conceptual pieces – <i>JavaScript</i>, <i>APIs</i>, and <i>Markup</i> – each of which is a crucial aspect of simplifying our web applications and making them easy to write, build, and deploy.</p><h3>J is for JavaScript</h3><p>The JAMstack architecture relies heavily on the ubiquity of JavaScript as the language of the web. Many modern web applications use powerful, dynamic front-end frameworks like <i>React</i> and <i>Vue</i> to render user interfaces and process state on the client for users. On the backend, or in Workers&#39; case, on the edge, any dynamic functionality in your JAMstack application should be built on top of JavaScript, often working in the request-response model that full-stack developers are accustomed to.</p><p>The Workers platform is <b>perfectly</b> suited to this requirement! As a developer building on Workers, you have total control of incoming requests and outgoing responses, using the JavaScript Service Worker APIs you know and love. We built <a href=\"https://workers.cloudflare.com/sites\">Workers Sites</a> as an extension of the Workers platform (and Workers KV as a storage mechanism at the edge), making it possible to deploy your site assets using a single command in Wrangler: <code>wrangler publish</code>.</p><p>When your Workers Site receives a new request, we&#39;ll execute JavaScript at the edge to look up a piece of content from Workers KV, and serve it back to the client at lightning speed. Remarkably, you can deploy JAMstack applications on Workers with no additional configuration besides <a href=\"https://developers.cloudflare.com/workers/sites/start-from-existing\">generating your Workers Site</a> – <b>by design, Workers Sites is built to serve as an exceptional JAMstack deployment platform</b>.</p><h3>A is for APIs</h3><p>The advent of static site tooling for personal sites makes sense: your site is a few pages: a few blog posts, for instance, and the classic &quot;About&quot; or &quot;Contact&quot; page. When it&#39;s compiled to HTML, the footprint is quite small! This small footprint is what makes static sites easy to reason about: they&#39;re trivial to host in terms of bandwidth and storage costs, and they rarely change, so they&#39;re easily cacheable.</p><p>While that works for personal sites, complex applications actually have data requirements! We need to talk to the user data in our databases, and analytics information in our data warehouses. JAMstack apps tackle this by definitively stating that these data sources should be accessible via HTTPS APIs, consumable by the application as a way to provide dynamic information to clients.</p><p>Workers is a <b>fascinating</b> platform in regards to JAMstack APIs. It can serve as a gateway to your data, or as a place to persist and return data itself. I can, for instance, expose an API endpoint via my Workers script without giving clients access to my origin. I can also use tooling like <a href=\"https://www.cloudflare.com/products/workers-kv/\">Workers KV</a> to persist data directly on the edge, and when a user requests that data, I can resolve the data by returning JSON directly from my application.</p><p>This flexibility has been an unexpected part of the experience of developing Built with Workers. In a later section of this post, I&#39;ll talk about how we developed an integral feature of the site based on the unique strengths of Workers as a way to host static assets <i>and</i> as a dynamic JavaScript execution platform. This has remarkable implications that blur the lines between classic static sites and dynamic applications, and I&#39;m <b>really</b> excited about it.</p><h3>M is for Markup</h3><p>A breakthrough moment in my understanding of JAMstack came at the beginning of this year. I was working on a job board for frontend developers, using the static site framework Gatsby.js and Sanity.io, a headless CMS tool that allows developers to model content without maintaining a database or any infrastructure. (As a reminder – this set of tools is <i>identical</i> to what we ultimately used to develop Built with Workers. It&#39;s a very good stack!)</p><p>SEO is crucial to a job board, and as I began to explore how to drive more traffic to my job board, I landed on the idea of generating a huge amount of search-oriented content automatically from the job data I already had. For instance, if I had job posts with the keywords <i>&quot;React&quot;</i>, <i>&quot;Europe&quot;</i>, and <i>&quot;Senior&quot;</i> (as in <i>&quot;senior developer&quot;</i>), what if I created pages with titles like <i>&quot;Senior React developer jobs in Europe&quot;</i>, or <i>&quot;Remote Angular jobs&quot;</i>? This approach would allow the site to begin ranking for a variety of job positions, locations, and experience levels, and as more jobs were posted on the site, each of these pages would be enriched with more useful information and relevant content, helping it rank higher in search.</p><p><i>&quot;But static sites are... static!&quot;</i>, I told myself. Would I need to build an entire dynamic API on top of my static site, just to be able to serve these search-engine optimized pages? This led me to a &quot;eureka&quot; moment with Gatsby – I could define markup (the <i>&quot;M&quot;</i> in JAMstack), and when I&#39;m building my site, I could look at all the available job data I had, cycling through every available keyword combination and inserting it into my markup to generate thousands of these pages. As I later learned, this idea is not necessarily unique to Gatsby – it is possible, for instance, to automate getting data from your API and writing it to data files in earlier static site frameworks like <a href=\"https://gohugo.io/\">Hugo</a> – but it is a first-class citizen in Gatsby. There are a <i>ton</i> of data sources available via Gatsby plugins, and because they&#39;re all exposed via HTTPS, the workflow is standardized inside of the framework.</p><p>In Built with Workers, we connect to the Sanity.io CMS instance at <i>build-time</i>: crucially, by the time that the site has been deployed to Workers, the application effectively has <i>no idea</i> what Sanity even is! Our Gatsby application connects to Sanity.io via an HTTPS API, and using GraphQL, we look at all the data that we have in our CMS, and make decisions about what pages to generate and how to render the site&#39;s interface, ultimately resulting in a statically-built application that is derived from dynamic data.</p><p>This emphasis on the <i>build</i> step in JAMstack is quite different than the classic web application. In the past, a user requested data, a web server looked at what the user was requesting, and then the user <i>waits</i>, as the server gets that data, returns JSON, or interpolates it into templates written in tools like <a href=\"https://pugjs.org/\">Pug</a> or <a href=\"https://en.wikipedia.org/wiki/ERuby\">ERB</a>. With JAMstack, the pages are already built, and the deployed application is just a collection of plain HTML, CSS, and JavaScript.</p><h3>Why Cloudflare Workers?</h3><p>Cloudflare&#39;s network is a fascinating place to deploy JAMstack applications. Yes, Cloudflare&#39;s edge network can act as a CDN for your static assets, like your CSS stylesheets, or your client-side JavaScript code. But with Workers, we now have the ability to run JavaScript side-by-side with our static assets. In most JAMstack applications, the CDN is simply a bucket where your application ends up. Usually, the CDN is the most boring part of the stack! <b>With Cloudflare Workers, we don&#39;t just have a CDN: we also have access to an extremely low-latency, fully-featured JavaScript runtime.</b></p><p>The implications of this on the standard JAMstack workflow are, frankly, <i>mind-boggling</i>, and as part of developing Built with Workers, we&#39;ve been exploring what it means to have this runtime available side-by-side with our statically-built JAMstack application.</p><p>To demonstrate this, we’ve implemented a bookmarking feature, which allows users of Built with Workers to bookmark projects. If you look at a project&#39;s usage of our streaming HTML rewriter and say <i>&quot;Wow, that&#39;s cool!&quot;</i>, you can also bookmark for the project to show your support. This feature, rendered as a <code>button</code> tag is deceptively simple: it&#39;s a single piece of the user interface that makes use of the entirety of the Workers platform, to provide user-specific dynamic functionality. We&#39;ll explore this in greater detail later in the post – see <i>&quot;Enhancing static sites at the edge&quot;</i>.</p><blockquote><p>i&#39;m super excited about this and spent some time this morning re-writing my first take at this to be something that i think is super compelling</p><p>??<a href=\"https://t.co/LJltC6j20S\">https://t.co/LJltC6j20S</a></p><p>— ً (@signalnerve) <a href=\"https://twitter.com/signalnerve/status/1199379423608344576?ref_src=twsrc%5Etfw\">November 26, 2019</a></p></blockquote><h2>A modern development and content workflow</h2><p>In the <a href=\"/workers-sites/\">announcement post</a> for Workers Sites, Rita outlined the motivations behind launching Workers Sites as a modern way to deploy sites:</p><p><i>&quot;Born on the edge, Workers Sites is what we think modern development on the web should look like, natively secure, fast, and massively scalable. Less of your time is spent on configuration, and more of your time is spent on your code, and content itself.&quot;</i></p><p>A few months later, I can say definitively that Workers Sites has enabled us to develop Built with Workers and spend almost no time on configuration. Using <a href=\"https://github.com/cloudflare/wrangler-action\">our GitHub Action</a> for deploying Workers applications with Wrangler, the site has been continuously deploying to a staging environment for the past couple weeks. The simplicity around this continuous deployment workflow has allowed us to focus on the important aspects of the project: development and content.</p><p>The static site framework ecosystem is fairly competitive, but as we considered our options for this site, I advocated strongly for Gatsby.js. It&#39;s an incredible tool for building JAMstack applications, with a great set of default for performant applications. It&#39;s common to see Gatsby sites with <a href=\"https://developers.google.com/web/tools/lighthouse/\">Lighthouse</a> scores in the upper 90s, and the decision to use React for implementing the UI makes it straightforward to onboard new developers if they&#39;re familiar with React.</p><p>As I mentioned in a previous section, Gatsby shines at <i>build-time</i>. Gatsby&#39;s APIs for creating pages during the build process based on API data are incredibly powerful, allowing developers to concretely define every statically-generated page on their web application, as well as any relevant data that needs to be passed in.</p><p>With Gatsby decided upon as our static site framework, we needed to evaluate where our content would live. Built with Workers has two primary data models, used to generate the UI:</p><ul><li><p><b>Projects</b>: websites, applications, and APIs created by developers using Cloudflare Workers. For instance, Built with Workers!</p></li><li><p><b>Features</b>: features available on the Workers platform used to build applications. For instance, Workers KV, or our streaming HTML rewriter/parser.</p></li></ul><p>Given these requirements, there were a number of potential approaches to take to store this data, and make it accessible. Keeping in line with JAMstack, we know that we probably should expose it via an HTTPS API, but from where? In what format?</p><p>As a full-stack developer who&#39;s comfortable with databases, it&#39;s easy to envision a world where we spin up a PostgreSQL instance, write a REST API, and write all kinds of <code>fetch(&#39;/api/projects&#39;)</code> to get the information we need. This method works, but we can do better! In the same way we built Workers Sites to simplify the deployment process, it was worthwhile to explore the JAMstack ecosystem and see what solutions exist for modeling data without being on the hook for more infrastructure.</p><p>Of the different tools in the ecosystem – databases, whether SQL or NoSQL, key-value stores (such as our own, Workers KV), etc. – the growth of &quot;headless CMS&quot; tools has made the largest impact on my development workflow.</p><p>On CSS Tricks, Chris Coyier wrote about the rise of headless CMS tools back in March 2016, and <a href=\"https://css-tricks.com/what-is-a-headless-cms/\">summarizes their function</a> well:</p><p><i>[Headless CMSes are] very related to The Big Conversation™ on the web the last many years. How are we going to handle bringing Our Stuff™ all these different devices/screens/inputs.</i><i>Responsive design says &quot;let&#39;s let our design and media accommodate as much variation in screens as possible.&quot;</i><i>Progressive enhancement says &quot;let&#39;s make the functionality of this site work no matter what.&quot;</i><i>Designing for accessibility says &quot;let&#39;s ensure everyone can use this regardless of their capabilities as a person.&quot;</i><i>A headless CMS says &quot;let&#39;s not tie our data to any one way of doing things.&quot;</i></p><p>Using our headless CMS, Sanity.io, we can get every project inside our dataset, and call Gatsby&#39;s <code>createPage</code> function to create a new page for each project, using a pre-defined project template file:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// gatsby-node.js\n\nexports.createPages = async ({ graphql, actions }) =&gt; {\n  const { createPage } = actions;\n\n  const result = await graphql(`\n    {\n      allSanityProject {\n        edges {\n          node {\n            slug\n          }\n        }\n      }\n    }\n  `);\n\n  if (result.errors) {\n    throw result.errors;\n  }\n\n  const {\n    data: { allSanityProject }\n  } = result;\n\n  const projects = allSanityProject.edges.map(({ node }) =&gt; node);\n  projects.forEach((node, _index) =&gt; {\n    const path = `/built-with/projects/${node.slug}`;\n\n    createPage({\n      path,\n      component: require.resolve(&quot;./src/templates/project.js&quot;),\n      context: { slug: node.slug }\n    });\n  });\n};</pre></code>\n            <p>Using Sanity to drive the content for Built with Workers has been a <i>huge</i> win for our team. We&#39;re no longer constrained by code deploys to make changes to content on the site – we don&#39;t need to make a pull request to create a new project, and edits to a project&#39;s name or description aren&#39;t constrained by someone with the ability to deploy the project. Instead, we can empower members of our team to log in directly to the CMS and make changes, and be confident that once the corresponding deploy has completed (see <i>&quot;The CDN is the deployment platform&quot;</i> below), their changes will be live on the site.</p><h3>Dynamic JAMstack layouts</h3><p>As our team got up and running with Sanity.io, we found that the flexibility of a headless CMS platform was useful not just for creating our original data requirements – projects and features – but in rethinking and innovating on how we actually format the application itself.</p><p>With our previous objective of empowering non-technical folks to make changes to the site without deploying any code in consideration, we&#39;ve also taken the entire homepage of Built with Workers and defined it as an instance of the &quot;layout&quot; data model in Sanity.io. By doing this, we can define corresponding &quot;collections&quot;, which are sets of projects. When a layout has many collections defined inside of the CMS, we can rapidly re-order, re-arrange, and experiment with new collections on the homepage, seeing the updated version of the site reflected immediately, and live on the production site within only a few minutes, after our continuous deployment process has finished.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1x7v7SMVVKcuM48wKvz22T/2df48a11b117913892d6b096347f69e3/bww-demo.gif\" alt=\"\" class=\"kg-image\" width=\"3360\" height=\"2100\" loading=\"lazy\"/>\n            \n            </figure><p>Updating the layout of Built with Workers live from Sanity&#39;s studio</p><p>With this work implemented, it&#39;s easy to envision a world where our React code is purely concerned with rendering each individual aspect of the application&#39;s interface – for instance, the project title component, or the &quot;card&quot; for an individual project – and the CMS drives the entire layout of the site. In the future, I&#39;d like to continue exploring this idea in other pages in Built with Workers, including the project pages and any other future content we put on the site.</p><h2>Enhancing static sites at the edge</h2><p>Much of what we&#39;ve discussed so far can be thought of as features and workflows that have great DX (developer experience), but not specific to Workers. Gatsby and Sanity.io are great, and although Workers Sites is a great platform for deploying JAMstack applications due to the Workers platform&#39;s low-latency and performance characteristics, you could deploy the site to a number of different providers with no real differentiating features.</p><p>As we began building a JAMstack application on top of Built with Workers, we also wanted to explore how the Workers platform could allow developers to combine the simplicity of static site deployments with the dynamism of having a JavaScript runtime immediately available.</p><p>In particular, our recently-released streaming HTML rewriter seems like a perfect fit for &quot;enhancing&quot; our static sites. Our application is being served by Workers Sites, which itself is a Workers template that can be customized. By passing each HTML page through the HTML rewriter on its way to the client, we had an opportunity to customize the content without any negative performance implications.</p><p>As I mentioned previously, we landed on a first exploration of this platform advantage via the &quot;bookmark&quot; button. Users of Built with Workers can &quot;bookmark&quot; for a project – this action sends a request back up to the Workers application, storing the bookmark data as JSON in Workers KV.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// User-specific data stored in Workers KV, representing\n// per-project bookmark information\n\n{\n  &quot;bytesized_scraper_bookmarked&quot;: false,\n  &quot;web_scraper_bookmarked&quot;: true\n}</pre></code>\n            <p>When a user returns to Built with Workers, we can make a request to Workers KV, looking for corresponding data for that user and the project they&#39;re currently viewing. If that data exists, we can embed the &quot;edge state&quot; directly into the HTML using the streaming HTML rewriter.</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// workers-site/index.js\n\nimport { getAssetFromKV } from &quot;@cloudflare/kv-asset-handler&quot;\n\naddEventListener(&quot;fetch&quot;, event =&gt; { \n  event.respondWith(handleEvent(event)) \n})\n\nclass EdgeStateEmbed {\n  constructor(state) {\n    this._state = state\n  }\n  \n  element(element) {\n    const edgeStateElement = `\n      &lt;script id=&#039;edge_state&#039; type=&#039;application/json&#039;&gt;\n        ${JSON.stringify(this._state)}\n      &lt;/script&gt;\n    `\n    element.prepend(edgeStateElement, { html: true })\n  }\n}\n\nconst hydrateEdgeState = async ({ state, response }) =&gt; {\n  const rewriter = new HTMLRewriter().on(\n    &quot;body&quot;,\n    new EdgeStateEmbed(await state)\n  )\n  return rewriter.transform(await response)\n}\n\nasync function handleEvent(event) {\n  return hydrateEdgeState({\n    response: getAssetFromKV(event, options),\n    // Get associated state for a request, based on the user and URL\n    state: transformBookmark(event.request),\n  })\n}</pre></code>\n            <p>When the React application is rendered on the client, it can then check for that embedded edge state, which influences how the &quot;bookmark&quot; icon is rendered - either as &quot;bookmarked&quot;, or &quot;bookmarked&quot;. To support this, we&#39;ve leaned on React&#39;s <code>useContext</code>, which allows any component inside of the application component tree to pull out the edge state and use it inside of the component:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">// edge_state.js\n\nimport React from &quot;react&quot;\nimport { useSSR } from &quot;../utils&quot;\n\nconst parseDocumentState = () =&gt; {\n  const edgeStateElement = document.querySelector(&quot;#edge_state&quot;)\n  return edgeStateElement ? JSON.parse(edgeStateElement.innerText) : {}\n}\n\nexport const EdgeStateContext = React.createContext([{}, () =&gt; {}])\nexport const EdgeStateProvider = ({ children }) =&gt; {\n  const { isBrowser } = useSSR()\n  if (!isBrowser) {\n    return &lt;&gt;{children}&lt;/&gt;\n  }\n  \n  const edgeState = parseDocumentState()\n  const [state, setState] = React.useState(edgeState)\n  const updateState = (newState, options = { immutable: true }) =&gt; options.immutable\n    ? setState(Object.assign({}, state, newState))\n    : setState(newState)\n  \n  return (\n    &lt;EdgeStateContext.Provider value={[state, updateState]}&gt;\n      {children}\n    &lt;/EdgeStateContext.Provider&gt;\n  )\n}\n\n// Inside of a React component\nconst Bookmark = ({ bookmarked, project, setBookmarked, setLoaded }) =&gt; {\nconst [state, setState] = React.useContext(EdgeStateContext)\n// `bookmarked` value is a simplification of actual code\nreturn &lt;BookmarkButton bookmarked={state[project.id]} /&gt;\n}</pre></code>\n            <p>The combination of a straightforward JAMstack deployment platform with dynamic key-value object storage and a streaming HTML rewriter is really, really cool. This is an initial exploration into what I consider to be <i>a platform-defining feature</i>, and if you&#39;re interested in this stuff and want to continue to explore how this will influence how we write web applications, <a href=\"https://twitter.com/signalnerve\">get in touch with me on Twitter</a>!</p><h2>The CDN is the deployment platform</h2><p>While it doesn&#39;t appear in the acronym, an unsung hero of the JAMstack architecture is <b>deployment</b>. In my local terminal, when I run <code>gatsby build</code> inside of the Built with Workers project, the result is a folder of static HTML, CSS, and JavaScript. <i>It should be easy to deploy!</i></p><p>The recent release of <a href=\"https://github.com/features/actions\">GitHub Actions</a> has proven to be a great companion to building JAMstack applications with Cloudflare Workers – we&#39;ve open-sourced our own <a href=\"https://github.com/cloudflare/wrangler-action\">wrangler-action</a>, which allows developers to build their Workers applications and deploy directly from GitHub.</p><p>The standard workflows in the continuous deployment world – deploy every hour, deploy on new changes to the <code>master</code> branch, etc – are possible and already being used by many developers who make use of our <code>wrangler-action</code> workflow in their projects. Particular to JAMstack and to headless CMS tools is the idea of &quot;build-on-change&quot;: namely, when someone publishes a change in Sanity.io, we want to do a new deploy of the site to immediately reflect our new content in production.</p><p>The versatility of Workers as a place to deploy JavaScript code comes to the rescue, again! By telling Sanity.io to make a GET request to a deployed Workers webhook, we can trigger a <code>repository_event</code> on GitHub Actions for our repository, allowing new deploys to happen immediately after a change is detected in the CMS:</p>\n            <pre class=\"language-js\"><code class=\"language-js\">const headers = {\n  Accept: &#039;application/vnd.github.everest-preview+json&#039;,\n  Authorization: &#039;Bearer $token&#039;,\n}\n\nconst body = JSON.stringify({ event_type: &#039;repository_dispatch&#039; })\n\nconst url = `https://api.github.com/repos/cloudflare/built-with-workers/dispatches`\n\nconst handleRequest = async evt =&gt; {\n  await fetch(url, { method: &#039;POST&#039;, headers, body })\n  return new Response(&#039;OK&#039;)\n}\n\naddEventListener(&#039;fetch&#039;, handleRequest)</pre></code>\n            <p>In doing this, we&#39;ve made it possible to completely abstract away <i>every</i> deployment task around the Built with Workers project. Not only does the site deploy on a schedule, and on new commits to <code>master</code>, but it can also do additional deploys as the content changes, so that the site is always reflective of the current content in our CMS.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2CR3w7eC9bk2QZXFlirn1o/d28f5a8eada1c3f8bda045098e6378b4/i6sG6fa_qL9h3uHrSQWI5adnC41xFKaS3vwBIKqk_WqqjSzQ_qZhT5VGnMo8DTMyfyqc8YiPUgTiw77EzopT9cyVWUn1HSrVxsFbKCPHkI-MVtbzTxLJZH8KbYrw.png\" alt=\"\" class=\"kg-image\" width=\"1456\" height=\"896\" loading=\"lazy\"/>\n            \n            </figure><p>The GitHub Actions deployment workflow for Built with Workers</p><h2>Conclusion</h2><p>We&#39;re <b>super</b> excited about Built with Workers, not only because it will serve as a great place to showcase the incredible things people are building with the Cloudflare Workers platform, but because it also has allowed us to explore what the future of web development may look like. I&#39;ve been advocating for what I&#39;ve seen referred to as <a href=\"https://www.bytesized.xyz/full-stack-serverless\">&quot;full-stack serverless&quot;</a> development throughout 2019, and I couldn&#39;t be happier to start 2020 with launching a project like Built with Workers. The full-stack serverless stack feels like the future, and it&#39;s actually fun to build with on a daily basis!</p><p>If you&#39;re building something awesome with Cloudflare Workers, we&#39;re looking for submissions to the site! Get in touch with us via <a href=\"https://forms.gle/k6fZaXJbrUygvZhp6\">this form</a> – we&#39;re excited to speak with you!</p><p>Finally, if topics like JAMstack on Cloudflare Workers, &quot;edge state&quot; and dynamic static site hydration, or continuous deployment interest you, the Built with Workers repository is open-source! <a href=\"https://github.com/cloudflare/built-with-workers\">Check it out</a>, and if you&#39;re inspired to build something cool with Workers after checking out the code, make sure to let us know!</p>",
		"id": "6tUTWYaVjn742TLZMm1TXo",
		"localeList": {
			"name": "JAMstack at the Edge: How we built Built with Workers… on Workers Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"title": "JAMstack at the Edge: How we built Built with Workers… on Workers",
			"description": "We're showcasing developers building incredible projects with tools like Workers KV or our streaming HTML rewriter.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/462M2vF15mVdBDA5gWHS7q/109f6c3390bebb82f766ce2a6b6ef60b/jamstack-at-the-edge-how-we-built-built-with-workers-on-workers-EiRsNZ.png"
		},
		"primary_author": {},
		"published_at": "2020-01-29T13:00:00.000+00:00",
		"slug": "jamstack-at-the-edge-how-we-built-built-with-workers-on-workers",
		"tags": [
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "78aSAeMjGNmCuetQ7B4OgU",
				"name": "JavaScript",
				"slug": "javascript"
			},
			{
				"id": "2ygSA2qzYxKxdUCTBo79pW",
				"name": "JAMstack",
				"slug": "jamstack"
			},
			{
				"id": "5cye1Bh5KxFh3pKSnX8Dsy",
				"name": "Serverless",
				"slug": "serverless"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			}
		],
		"title": "JAMstack at the Edge: How we built Built with Workers… on Workers",
		"updated_at": "2024-08-27T02:05:57.137Z",
		"url": "https://blog.cloudflare.com/jamstack-at-the-edge-how-we-built-built-with-workers-on-workers"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}