{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "14",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Andrew Fitch",
				"slug": "andrew-fitch",
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3rqJ3G9jaSryZquSGJlhWW/719d5d6f39539620de040356c89bd65b/AJF-Headshot.avif"
			}
		],
		"excerpt": "JAMstack Radio is a show all about the JAMstack, a new way to build fast & secure apps or websites. In the most recent episode, the host, Brian Douglas, met with our own Kenton Varda to discuss some of the infinite uses for running code at the edge.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6zhdpbVuVx9zz81lBQxo9h/46cebe97882dfcc7829580ffafc403ac/kenton-interview-hero.jpg",
		"featured": false,
		"html": "<p><a href=\"https://www.heavybit.com/library/podcasts/jamstack-radio/\">JAMstack Radio</a> is a show all about the JAMstack, a new way to build fast &amp; secure apps or websites. In the most recent episode, the host, <a href=\"https://twitter.com/bdougieyo\">Brian Douglas</a>, met with <a href=\"https://twitter.com/KentonVarda\">Kenton Varda</a>, tech lead for <a href=\"https://developers.cloudflare.com/workers/\">Cloudflare Workers</a> and author of <a href=\"https://sandstorm.io/\">Sandstorm.io</a> to discuss some of the infinite uses for running code at the edge.</p><p>Listen to what Kenton had to say about serverless technology in this twenty two minute <a href=\"https://www.heavybit.com/library/podcasts/jamstack-radio/ep-31-originless-code-with-cloudflares-kenton-varda/\">podcast here</a>.</p><p>Here&#39;s the transcript of the podcast as well:</p><p><b>Brian Douglas: </b>Welcome to another installment of JAMstack Radio. In the room I&#39;ve got Kenton Varda from Cloudflare.</p><p><b>Kenton Varda: </b>Thanks for having me.</p><p><b>Brian: </b>Thanks for coming all the way across San Francisco to chat with me in person. I&#39;m curious who Kenton is, but I&#39;m also curious what Cloudflare is. Can you answer both questions? Let&#39;s start with, &quot;Who is Kenton?&quot;</p><p><b>Kenton: </b>I&#39;m an engineer. I&#39;m the architect of Cloudflare Workers. In a past life I worked for Google for several years. I was once known as the &quot;protocol buffers person,&quot; I was the one who open sourced that. And I founded a company called Sandstorm that was later acquired by Cloudflare.</p><p><b>Brian: </b>I&#39;m familiar. I remember Sandstorm. Well, I remember the name and I vaguely remember that the acquisition happened. Interesting. You founded Sandstorm, you said?</p><p><b>Kenton: </b>Yep. Jade Wang and I.</p><p><b>Brian: </b>OK, yeah. I know Jade. I met Jade not too long ago. But that&#39;s a lot of inside baseball. How about Cloudflare? Now you&#39;re a part of Cloudflare. What is that thing?</p><p><b>Kenton: </b>We have computers in 151 locations today and rapidly expanding, thousands of locations in the future. And we let you take that and put that network in front of your website in order to provide a few things. One is it&#39;s a large HTTP cache. We can cache your static content at the &quot;edge.&quot; We call it the edge. The locations close to the end user, so that they can receive that content quickly.</p><p>We have a web application firewall which blocks malicious traffic, we have DDoS protection. We have absorbed the largest DDoS attacks in the world without any trouble and a whole bunch of other features. There&#39;s a long list of things that are implemented as a proxy in these locations before the requests go to your &quot;origin server,&quot; as we call it.</p><p><b>Brian: </b>OK, cool. And you folks have all these locations, do you own servers? Are you building these things out?</p><p><b>Kenton: </b>Yes. We build the hardware and we send them to a variety of different types of locations. Sometimes it&#39;s ISPs that want to have our machines there, so they can serve their customers faster and use less bandwidth upstream. Sometimes it&#39;s data centers. It&#39;s a variety.</p><p><b>Brian: </b>Cool. So, I&#39;m curious. Your background is in a lot of infrastructure, too? Coming from Sandstorm, and now Cloudflare?</p><p><b>Kenton: </b>Yep. And at Google. I&#39;ve always done a little infrastructure. Search infrastructure at Google, access control infrastructure, key management. Lots of things.</p><p><b>Brian: </b>Which makes sense on why you mentioned you&#39;re now &quot;principal architect.&quot;</p><p><b>Kenton: </b>We don&#39;t have titles.</p><p><b>Brian: </b>You don&#39;t have titles? OK. I was going to ask if there is a Vice Principal Architect at all.</p><p><b>Kenton: </b>I&#39;ve taken to calling myself the architect of Cloudflare Workers, descriptively. When Sandstorm was acquired by Cloudflare in March of 2017, we came in and I was told, &quot;We&#39;d like to find a way to let people run code on our servers securely and quickly. But we don&#39;t know how to do it. What do you think?&quot; And so I started that project, and built it out, and exactly a year after I joined we launched it on March 13 of this year.</p><p><b>Brian: </b>Nice! Congratulations. This is the exact reason why I had you come on. Because Cloudflare Workers is something that I was aware of in the alpha or beta phase when it first was mentioned. I played around with the trial.</p><p>I want you to explain Cloudflare Workers, but also before you do that I want to explain what I did. Which is very trivial. Workers sit on the edge, and I made a Worker to change the word &quot;cloud&quot; to &quot;butt.&quot;</p><p><b>Kenton: </b>Classic.</p><p><b>Brian: </b>It&#39;s very classic because the site that I was testing it on was Cloudflare.com. Whatever it replaced was pretty hilarious. I showed everybody in Slack, and then I moved on and never thought of it, until recently. Could you explain what Cloudflare Workers are?</p><p><b>Kenton: </b>While you were working with the preview, which lets you see what your Worker would do to any random site. But normally you&#39;d run these on your own site. Cloudflare Worker is a piece of JavaScript that you write that can receive HTTP requests that are destined for your domain, but receives them on Cloudflare servers at the edge, close to the end user.</p><p>It can run arbitrary code there. It can forward the request on to your origin, or it can decide to respond directly, or you can even make a variety of outbound requests to third-party APIs and do whatever you want.</p><blockquote><p>HTTP in, HTTP out, arbitrary code in between.</p></blockquote><p><b>Brian: </b>Are there limitations to the JavaScript? Because when you say you could run JavaScript on the edge or on Cloudflare servers, this sounds dangerous. But you also prefaced this too, as well as the security aspect of it. People want to have that. How do you solve that problem?</p><p><b>Kenton: </b>Right. This is the reason why it is JavaScript. We have a lot of customers and they all want to run their code in every location of ours. We need to make sure that we can run lots and lots of different scripts but not allow them to interfere with each other. Each one has to be securely sandboxed.</p><p>There&#39;s a lot of technologies out there for doing that. But the one that has received by far the most scrutiny, and the most real-world battle testing over the years, would be the <a href=\"https://developers.google.com/v8/\">V8 JavaScript engine</a> from Google Chrome. We took that and embedded it in a new server environment written in C++ from scratch.</p><p>We didn&#39;t use Node.js because Node.js is not a sandbox. Not intended for this scenario. So we built something new. The JavaScript runs in a normal JavaScript sandbox and it is limited to an API that only lets it receive HTTP requests, and send HTTP requests to the internet. It does not allow it to see the local file system or interfere with anything else that might be running on that machine.</p><p><b>Brian: </b>OK. Can we talk about use cases for Cloudflare Workers? What would somebody besides somebody like myself who spent all that time writing a joke app. Or Worker, rather. What are use cases you can do on the edge and write JavaScript in?</p><p><b>Kenton: </b>Well, it&#39;s arbitrary code. There is infinite use cases. But I can tell you some common ones.</p><blockquote><p>Some people just need to do some silly rewrite of some headers because it&#39;s easier to push something to Cloudflare than it is to update their own origin servers.</p></blockquote><p>When you write the script and you submit it through the Cloudflare UI, it is deployed globally in 30 seconds. That&#39;s it. Boom, it&#39;s done. So that&#39;s an easy way to get things done, but it&#39;s the less interesting use case.</p><p>More interesting is you can do things like route requests to say, you&#39;re hosting your website out of S3 or Google cloud storage. You can write a Worker that fetches the content from there and then serves it as your website, and not actually have an origin server.</p><p>Other things people like is to optimize their usage of Cloudflare&#39;s cache. Historically an HTTP cache is a very fixed-function thing. You can&#39;t serve cache content but also have it be personalized. So say you&#39;re on a news site, and people have to log in because it&#39;s paid content, and then you want to display the site to them but at the top you want to say, &quot;Hi. You&#39;re logged in as...&quot; whoever.</p><p>Your content on a news site is very cacheable. But all of a sudden it can&#39;t be cached anymore because you&#39;re personalizing it. Well, you can do that personalization in a Worker after it&#39;s already come out of cache at the edge, and therefore serve your site much faster and use much less bandwidth.</p><p>But going beyond that, we&#39;ve had people do HTML template rendering darkly at the edge based on API requests. That will save a lot of bandwidth.</p><p><b>Brian: </b>That&#39;s a common use case for Apache servers where you&#39;d take the JavaScript cookie and check to see who you are, where you came from and maybe even your location. And then be able to decide what to render based on the user. It sounds like something super complicated that was used very heavily with servers, and now you can just do it on Cloudflare&#39;s site.</p><p><b>Kenton: </b>Or A/B testing. That&#39;s another thing that doesn&#39;t play well with caches, because you&#39;re serving different people different content for the same URL. You can implement that in a Worker now and you can take advantage of the cache.</p><p><b>Brian: </b>Before we started recording I mentioned I had seen a talk at Apollo from the product manager for the team, which I escaped the name--</p><p><b>Kenton: </b>Jonathan Bruce.</p><p><b>Brian: </b>Jonathan, yes. He explained and he went through a couple of use case examples, and I saw A/B testing is one of them as well. It&#39;s nice to see a lot of this work move away from the servers. Not that they&#39;re trivial, but it sounds like it&#39;s an easier approach to do.</p><p><b>Kenton: </b>Yes. Speaking of Apollo, over time we&#39;re seeing these use cases get more and more complicated. People started out doing very simple things. But Apollo is a great case. They&#39;ve taken the Apollo GraphQL, they call it Apollo Server, it&#39;s a gateway for GraphQL.</p><blockquote><p>Your GraphQL queries go in, and then it federates out to your Rest endpoints behind that.</p></blockquote><p>They&#39;ve managed to run the whole thing in a Worker. Which means now that can run on Cloudflare&#39;s &quot;edge&quot; and take advantage of the cache, which previously GraphQL queries generally aren&#39;t cacheable. Because they&#39;re all post requests and often each one&#39;s a little bit different and not canonicalized. And now you can fix that with code running at the edge.</p><p><b>Brian: </b>Sorry to zoom back, because I have a lot of experience with Apollo and GraphQL as well. Is that what Apollo is doing personally? Or is this the preferred way for them to cache GraphQL queries when they&#39;re using Apollo Server?</p><p><b>Kenton: </b>They are working on a version of Apollo Server that runs at the edge.</p><p><b>Brian: </b>OK.</p><p><b>Kenton: </b>It&#39;s not released yet. But soon.</p><p><b>Brian: </b>I need to have them on for a follow-up conversation. They&#39;ve been on this podcast quite a few episodes ago, so I definitely want to have them talk more about what they&#39;re doing on the server side, which is really cool.</p><p>You mentioned Google and you mentioned your experience, so it sounds like you&#39;ve been working on the web and within servers for a while. I&#39;m curious if we could take time to zoom out. You&#39;re working on Cloudflare Workers. What&#39;s your thought on where the web&#39;s going moving forward?</p><p>The reason we do this podcast, JAMstack Radio which is JavaScript APIs and markup, is because I personally think there&#39;s a shift of a lot of the processing and a lot of the work moving towards front end.</p><p>I would consider having Cloudflare own Workers as part of something I don&#39;t have to worry about, so I don&#39;t have to deal with it, it&#39;s an API. Do you see a shift of a lot of major companies using something like a Worker instead of running their own servers going forward?</p><p><b>Kenton: </b>Serverless has been a popular term lately.</p><p><b>Brian: </b>Very popular.</p><p><b>Kenton: </b>People have realized that it&#39;s a lot of effort to maintain a server that&#39;s not really going to anything useful. You would prefer it to be just writing your code that&#39;s specific to your application, and not thinking about, &quot;How do I initialize my server?&quot; or, &quot;What dependencies do I need to build in here?&quot; And there has been this shift towards something called serverless.</p><p>My colleague at Cloudflare, Zack Bloom, likes to talk about going a step beyond that to what we call &quot;originless.&quot; In serverless, like with Amazon Lambda, you still choose a location in the world where you or your function is running.</p><p>You&#39;re no longer managing individual servers, but you still have an origin. Typically US East one in Virginia. What I would like to see is, you don&#39;t think about where your code runs at all.</p><blockquote><p>You write code and it just runs everywhere. That&#39;s what we call &quot;originless,&quot; and that&#39;s what Cloudflare does.</p></blockquote><p>Because when you deploy code to Cloudflare you do not choose which of our 151 locations it runs in, it is deployed to all of them and we&#39;ll run in whichever one receives the request from the users. Whichever one is closest to the user.</p><p>And it&#39;s not just about being close to the user, but also if you have code that interacts heavily with a particular API. Say the Stripe API, or the Twilio API. It would be great if that code could automatically run next to the servers that are implementing that API without you having to think about that.</p><p>I should not decide that my servers are going to run in Virginia, when my servers are talking to people who I don&#39;t even know where they are. So that&#39;s where I&#39;d like to see it. People have been talking a lot about &quot;edge&quot; compute lately. We consider Workers to be an &quot;edge&quot; compute platform.</p><p>But it&#39;s funny, because Peter Levine at Andreessen Horowitz said, &quot;The cloud is dead. The new thing is edge compute.&quot; But it seems to me that this idea that your code just runs everywhere is what the cloud was always supposed to be in the first place. That&#39;s what the metaphor meant. It&#39;s not in a specific place, it&#39;s everywhere. To me, we&#39;re finally getting there.</p><p><b>Brian: </b>&quot;Originless.&quot; I&#39;m not sure if it&#39;s going to pick up as much steam as serverless. I think that one&#39;s got really good feet inside the marketing jaws of tech. But I like &quot;originless,&quot; I like the fact that you can ship code and not have to worry about it. Me personally, I&#39;m a tinkerer.</p><p>I ship a lot of JavaScript as of late, in the last couple years. I don&#39;t want to have to deal with the problems and the headaches of trying to manage my own thing. Just for example, I just cloned a project that happened to my SQL as a dependency. I had the &#39;brew install that thing and for whatever reason it still didn&#39;t work. Dependencies just weren&#39;t jiving together. It was a Ruby project, so they weren&#39;t jiving together.</p><blockquote><p>But I shouldn&#39;t have to think about this as someone coming in four years later down the road trying to commit to this project. I just want to ship code.</p></blockquote><p>I like the fact that I don&#39;t have to worry about things like caching and managing my headers and stuff like that. If I can tap into all that tech talent at Cloudflare, and people who are building these cool projects to complete that for me, and pay a small fee, hopefully.Actually, that&#39;s a good question. Cloudflare Workers, is it an add-on feature once I have a Cloudflare account. How do I get access to this?</p><p><b>Kenton: </b>It&#39;s available to all Cloudflare accounts. The pricing is 50 cents per million requests handled with a minimum of 5 per month. You pay 5, you get your first 10 million, then 50 cents per million after that.</p><p><b>Brian: </b>OK. I&#39;m really excited about the idea of Cloudflare Workers. There&#39;s a lot of ideas that can be done. Is there any getting started guides, or tutorials people can get their feet wet with? With Cloudflare Workers?</p><p><b>Kenton: </b>If you go to Developers.Cloudflare.com, or if you just go to CloudflareWorkers.com there&#39;s the preview service. The &quot;fiddle,&quot; we call it. It&#39;s kind of like JSFiddle. You write some code, that&#39;s a Worker, and then you see in real time its effect on any web page that you choose. You can go there and try it out. You don&#39;t need a Cloudflare account and you don&#39;t need to sign in.</p><p><b>Brian: </b>Oh, very cool. Awesome. I&#39;m going to hopefully tinker with that again and build something a little nicer than what I already touched with the Workers. Excited to try that out. Curious, is there anything else Cloudflare is working on in the upcoming future? I know you&#39;re probably super focused on Cloudflare Workers so you don&#39;t really have the whole roadmap.</p><p><b>Kenton: </b>Well, we&#39;re working on lots of things. My next goal with Workers is to introduce some storage. There&#39;s not a whole lot specific that I can say about that yet, but the challenge is interesting because we have a network of, as I said, over 150 locations today. In the next few years we expect to exponentially grow that.We expect to have machines in every cell tower, more or less. And we want a storage system that can actually take advantage of that. A storage system where each user&#39;s data, if you&#39;ve built a service on Cloudflare and you store data for users that they interact with, each user&#39;s data should live at the Cloudflare location that&#39;s closest to that user so that they can interact with it with minimal latency.But there aren&#39;t a lot of storage technology out there that can scale to hundreds of nodes, much less thousands of nodes automatically today. It&#39;s a new and interesting challenge that I&#39;m working on.</p><p><b>Brian: </b>Cool. Exciting. I&#39;m probably going to keep an eye out on the cloud for a blog, hopefully you&#39;re keeping that up to date. I look forward to whenever that gets launched or previewed. I&#39;m going to transition us to JAM picks. I think we had a really awesome conversation about Cloudflare Workers.</p><p>These are going to be JAM picks, anything that keeps you jamming, keeps you going. Music picks, we&#39;ve had a lot of those in the past. Food and tech picks as well. But I will go first.</p><p>My pick is Pinterest. Which sounds very weird to say this out loud. We had Zach on here talking about Pinterest and how they&#39;re trying to shift towards more of a male demographic, which listeners, if you didn&#39;t know I identify as male. I&#39;ve been using Pinterest mainly because I&#39;m expecting a child.</p><p>I&#39;m not picking a bunch of baby stuff and putting on a board. I&#39;m picking a lot of recipes. I find that on Pinterest, if I type in something I have in my cabinet I can get a bunch of recipes for one ingredient, and it&#39;s been super useful. Because I&#39;m going to have some leave that I&#39;m going to be taking off.</p><p>So I want to be Mr. Mom, hopefully. I&#39;m going to try to achieve that status and do a lot of cooking. I&#39;ve been setting myself up to do a lot of Pinterest boarding. I&#39;m not even sure if that&#39;s a thing, if that&#39;s what they call it.</p><p>My other pick is going to be meal planning. I really like cooking. I work from home a lot. I really like leveraging the idea of cooking. On top of that, I&#39;m going to wrap in one more pick. I&#39;m definitely going to be trying out Cloudflare Workers. I&#39;ve been using a Dropbox Paper, so I have a list of all the ideas I want to ship of side projects. I have some coding goals that I have during that time.</p><p>So those are my three picks. Kenton, hopefully I stalled long enough that you have decided the things that you are jamming on.</p><p><b>Kenton: </b>I commute up here from Palo Alto on Caltrain every day, which means I get a lot of time to play video games on my Nintendo Switch.</p><p><b>Brian: </b>Oh, nice.</p><p><b>Kenton: </b>And one of my favorites lately is an indie game called Celeste. It&#39;s what I would call an agility platformer. Lots of jumping off walls, boosting and 2D side scrolling. It is a lot of fun.</p><p><b>Brian: </b>I have follow up questions about that. How long have you had your Switch?</p><p><b>Kenton: </b>Since sometime last year. Probably about a year ago.</p><p><b>Brian: </b>OK. So you&#39;re earlier on the bandwagon. No, actually you were probably a year into it. I&#39;m curious, how do you enjoy the controller? Do you always play it connected? Or do you separate the controller?</p><p><b>Kenton: </b>Yeah, I play it connected because I&#39;m on the on the train, so I have to hold it.</p><p><b>Brian: </b>I just think those little things that come off, those little joypad joystick things are just a little too small for my taste.</p><p><b>Kenton: </b>I do have that problem. My hands get sore, especially from this game Celeste. I had a callus on my thumb when I finished playing it.</p><p><b>Brian: </b>That&#39;s hard core.</p><p><b>Kenton: </b>It&#39;s intense.</p><p><b>Brian: </b>Either it&#39;s hard core or you have a super long commute.</p><p><b>Kenton: </b>It&#39;s about 45 minutes. And then I&#39;m going to say I just got back from vacation last week, where I flew to my hometown of Minneapolis, and I just have to talk up the amazing park system and bike trail system there. Because all I did all week was just bike around. There&#39;s hundreds of miles of paved, dedicated, bike trails. You don&#39;t have to go on streets, and it&#39;s just amazing and beautiful in the summer.</p><p><b>Brian: </b>Nice. I didn&#39;t know that about Minneapolis. I know the whole, is it like, &quot;10,000 lakes?&quot;</p><p><b>Kenton: </b>&quot;Land of 10,000 Lakes&quot; is Minnesota. It&#39;s probably more like 100,000 lakes. There&#39;s a lot of lakes.</p><p><b>Brian: </b>And at least a few bike trails.</p><p><b>Kenton: </b>Yes.</p><p><b>Brian: </b>Awesome. Well, Kenton, thanks for coming on to talk about Cloudflare Workers and the awesome city of Minneapolis. Listeners, keep spreading the jam.</p><p>\n</p>",
		"id": "6nJumRlMvx0MCvkmEtU3Xa",
		"localeList": {
			"name": "blog-english-only",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2018-09-15T06:00-07:00",
		"slug": "jamstack-podcast-with-kenton-varda",
		"tags": [
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "5cye1Bh5KxFh3pKSnX8Dsy",
				"name": "Serverless",
				"slug": "serverless"
			},
			{
				"id": "78aSAeMjGNmCuetQ7B4OgU",
				"name": "JavaScript",
				"slug": "javascript"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			}
		],
		"title": "JAMstack podcast episode: Listen to Cloudflare's Kenton Varda speak about originless code",
		"updated_at": "2024-10-10T00:36:50.411Z",
		"url": "https://blog.cloudflare.com/jamstack-podcast-with-kenton-varda"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}