{
	"initialReadingTime": "6",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"ja-jp"
	],
	"post": {
		"authors": [
			{
				"name": "Matthew Prince",
				"slug": "matthew-prince",
				"bio": "A little bit geek, wonk, and nerd. Repeat entrepreneur, recovering lawyer, and former ski instructor. Co-founder & CEO of Cloudflare (NYSE: NET).",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VD9WePJ1jvjFwuSRF0IfQ/4867307860761eb8209f67f2a9dd771f/matthew-prince.jpeg",
				"location": "San Francisco, CA",
				"website": null,
				"twitter": "@eastdakota",
				"facebook": null
			}
		],
		"excerpt": "I'm excited to announce the upcoming launch of Cloudflare TV. A 24x7 live television broadcast, streamed globally via the Cloudflare network. You can tune in to the pre-broadcast station and check out the upcoming schedule at: cloudflare.tv",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5naH6ZEAnqt7jexjAlCVJk/7f60f0d878584250731d070489e9544b/ladies-and-gentlemen-cloudflare-tv.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7qYERbtyNmdhMHbTl7nvXu/1884880d4c18eeb03b9ff3e80d1cb47a/blog-banner-graphic-alt-tune-4.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>I&#39;m excited to announce the upcoming launch of Cloudflare TV. A 24x7 live television broadcast, streamed globally via the Cloudflare network. You can tune in to the pre-broadcast station and check out the upcoming schedule at: <a href=\"https://cloudflare.tv/\">cloudflare.tv</a></p><p>I&#39;m kicking off the first live broadcast starting at 12:00pm Pacific (1900 UTC) on Monday, June 8 with a conversation with Chris Young (<a href=\"https://cloudflare.tv/schedule/7ADOoIIKxFMhvG89to4VQn\">add to calendar</a>). Chris was most recently the CEO of McAfee and has had a career defining the cyber security industry, from his own startup Cyveillance in the 1990s, to leadership positions at AOL, RSA, VMWare, Cisco, and Intel. I hope you&#39;ll tune in and then stay tuned for all the content our team has in store.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/rDQMP06ItjF4ByF8XlIyb/1cf49a87169fe840972e3a800b1a3e8f/Chris_Young_Matthew_Princee.png\" alt=\"\" class=\"kg-image\" width=\"1381\" height=\"725\" loading=\"lazy\"/>\n            \n            </figure><p>Which leaves the question: why on earth is Cloudflare launching a 24x7 television station?</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"the-uniting-power-of-television-and-tech-conferences\">The Uniting Power of Television and Tech Conferences</h3>\n            <a href=\"#the-uniting-power-of-television-and-tech-conferences\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>I was born in the 70&#39;s, am a child of the 80&#39;s, and got started in my career in the 90&#39;s. In the background, throughout much of it, was linear television we watched together. Over the last few months I&#39;ve learned that Michelle Zatlyn, my co-founder and Cloudflare&#39;s COO, and I shared a love of Children&#39;s Television Network&#39;s education program &quot;<a href=\"https://www.youtube.com/watch?v=s2-LEBc2sO8\">3-2-1 Contact</a>.&quot; John Graham-Cumming, Cloudflare&#39;s CTO, and I spent much of the late-90&#39;s and early-00’s watching programs like &quot;<a href=\"https://www.youtube.com/watch?v=4Rp6BcRK9Z4\">Call for Help</a>&quot; and &quot;<a href=\"https://www.youtube.com/watch?v=JbTFF3NNCdM\">The Screensavers</a>&quot; on TechTV. Talking to many people across the Cloudflare team, we all shared common touchstones in our lives geeking out on nerdy programming about technical topics.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3G7uKNeGt9Usd6wrY0LLkc/c26d1ee402f463ed5905bcf69f7dca74/image-4.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"650\" loading=\"lazy\"/>\n            \n            </figure><p>In some ways, a bit of that shared experience has been replaced by the modern tech conference. Tech conferences have four key features that keep people coming back in, I think, the following order of importance (from least to most): 1. Keynotes from interesting people; 2. Product and new feature demos; 3. Conversations with technical experts; and 4. Social interactions with peers.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"rsa-and-ces-aint-workin-but-thats-the-way-you-do-it\">RSA and CES Ain’t Workin… But That’s the Way You Do It?</h3>\n            <a href=\"#rsa-and-ces-aint-workin-but-thats-the-way-you-do-it\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Tech conferences have a lot of downsides too. Everyone complains about going to the Consumer Electronic Show or RSA because, in a lot of ways, spending a lot of money to be away from families, stay in difficult to book hotels, eat unhealthy food, and get herded around like cattle is awful. And yet, the value of the four things above is enough that we all continue to attend.</p><p>Or… we did. But, given the current pandemic, it feels like a long time before we&#39;re going to be attending tech conferences again. So, at Cloudflare, we started to wonder, is there a way to replicate their best features (and not suffer their worst) in a COVID-19 world?</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"covid-changes-everything\">COVID Changes Everything</h3>\n            <a href=\"#covid-changes-everything\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Cloudflare has offices in Asia, and we source the hardware for our equipment from the region, and so, since the virus hit those parts of the world first, we were aware of its impacts early. We adjusted our work and travel policies in our Asian offices early. Then we did something else: call around to companies in the impacted regions to ask them what they were doing that was still working even when everyone was working from home.</p><p>The answer that stood out from multiple companies was empowering more of their team to experiment with new ideas to reach customers. I remember a conversation with a cosmetics company that, prior to the conference, had used in-person events to sell most of their products. They were forced to invent new strategies as soon as the pandemic hit. They didn&#39;t know what would work — no one did. So they empowered everyone on their sales team to run experiments. &quot;Some of them proved so successful,&quot; the head of marketing for this firm told me, &quot;that I don&#39;t think we&#39;ll ever go back to in-person events even after this time of the virus has passed.&quot;</p><p>So, as we shut down conferences and travel, and transitioned to remote work globally, I went to Jake Anderson, who runs Cloudflare&#39;s marketing team, and asked him to pivot to empower everyone on our sales and marketing team to be able to run experiments. That&#39;s the sort of thing that makes a ton of sense to a founder-CEO like me. It&#39;s the sort of thing that strikes abject terror in the mind of any experienced marketing professional like Jake.</p><p>Jake took a deep breath and explained the danger of that strategy. Hundreds of different people on our team each running their own experiments may result in some good things, but also potentially a lot of chaos along the way. &quot;Your last company was an anti-spam company, right?&quot; he asked, rhetorically. &quot;Do you really want the risk of everyone on the team thinking sending out mass emails is a good idea?&quot; And now you understand why Jake runs our marketing team.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"tv-as-the-new-tech-conference\">TV as the New Tech Conference</h3>\n            <a href=\"#tv-as-the-new-tech-conference\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>But he was a good sport and didn&#39;t fully nix the idea. Instead we started brainstorming whether there could be a way to let our team run experiments — let them even be zany, crazy ideas — but do it in a way that had some structure and a framework and where any missteps could be contained. And that’s how the idea for Cloudflare TV was born.</p><p>If you read the history, it&#39;s actually not that different from how MTV was born. It was an experiment. No one knew if the format would work. Early hosts were given a lot of leeway to try new things. And, out of it, many incredible things emerged. In the process, it brought a community and a generation together.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"introducing-cloudflare-tv-a-platform-to-experiment\">Introducing Cloudflare TV: A Platform to Experiment</h3>\n            <a href=\"#introducing-cloudflare-tv-a-platform-to-experiment\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Cloudflare is unlikely to morph into a television network. But I am excited to give our team a place to experiment and connect with the Cloudflare community, even while we&#39;re locked down. And that community shares common interests in topics like web performance, Internet security, edge computing, and network reliability. And, with more than 2.8 million Cloudflare customers as part of our community, that&#39;s more than 4 times MTV&#39;s 2018 viewership. So who knows!</p><p>What can you expect? We&#39;ll have some regular weekly programs. I plan on hosting a show featuring conversations with fellow entrepreneurs and business leaders I admire (<a href=\"https://cloudflare.tv/schedule/7ADOoIIKxFMhvG89to4VQn\">add to calendar</a>). Michelle Zatlyn, Cloudflare co-founder and COO, is doing a weekly series called “Yes We Can” highlighting women entrepreneurs and debunking the myth that there are no women in tech (<a href=\"https://cloudflare.tv/schedule/3njLPPP5d7ps8JwblJnT7n\">add to calendar</a>). John Graham-Cumming, our CTO, is doing a program called &quot;This Week in Net&quot; — looking at interesting trends we&#39;re seeing from traffic patterns across Cloudflare&#39;s network (<a href=\"https://cloudflare.tv/schedule/3YHy9urHKa78A4o7RnjL6d\">add to calendar</a>).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/662sHyjeHMW7AEeFpAXk6S/3a166210073a3ae29751d37be362a807/image-5.png\" alt=\"\" class=\"kg-image\" width=\"1910\" height=\"1090\" loading=\"lazy\"/>\n            \n            </figure><p>Nick Sullivan, who leads our research team, is planning a fireside chat format with heavyweights in computer science research in areas such as cryptography, artificial intelligence, databases, and more (<a href=\"https://cloudflare.tv/schedule/6qtBhHtpDpisU17oS8ev8o\">add to calendar</a>). Chris Scharff, on our Solutions Engineering team, will be our own Alex Trebek hosting weekly “Online Team Trivia” (<a href=\"https://cloudflare.tv/schedule/CDxhLoXo3ym4z9wNKiNCu\">add to calendar</a>). Chaat Butsunturn on our sales team and Watson Ladd on our crypto team are hosting &quot;Cooking with Cloudflare,&quot; combining their favorite technical and edible recipes (<a href=\"https://cloudflare.tv/schedule/4Z25FAryayNC86urv0EcBd\">add to calendar</a>). And Dan Hollinger on our partnerships team hosting &quot;Silicon Valley Squares,&quot; a send up of the old game show &quot;Hollywood Squares&quot; (<a href=\"https://cloudflare.tv/schedule/5OGa585usFPJqixCNnazhC\">add to calendar</a>).</p><p>We&#39;ll also host some special programming. This week, Rita Kozlov, who is a Product Manager on our Workers team, is interviewing the people behind the COVID-19 response program Mask a Hero NY (<a href=\"https://cloudflare.tv/schedule/2tGlq0ue3jrGuAegeq60fD\">add to calendar</a>). Junade Ali, on our technical support operations team, is talking about the privacy-ensuring design of Pwned Passwords (<a href=\"https://cloudflare.tv/schedule/2HahmV0JZRJE5sjSCjOIf\">add to calendar</a>). And Bethany Sonefeld, on our Product Design team, is doing a program on dark patterns, bottomless feeds, and other manipulative software (<a href=\"https://cloudflare.tv/schedule/4PdCBupf0PBnI4vgw3OS7Z\">add to calendar</a>). And much, much more!</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"highlighting-diverse-voices-in-tech\">Highlighting Diverse Voices in Tech</h3>\n            <a href=\"#highlighting-diverse-voices-in-tech\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>We were originally scheduled to launch Cloudflare TV last week. Given the horrific violence targeting Black communities in the United States, we decided to delay the launch by a week. We&#39;ve been inspired by the peaceful protests around the world, but we&#39;re under no illusion that the systemic problems that inspired them have been fixed. We all have a lot of work to do.</p><p>What we have done over the course of the last week was add more content to Cloudflare TV highlighting the importance of diversity on our team. We&#39;ve always believed that diverse teams with people who have different perspectives are more likely to find the best and most creative solutions to fulfill our mission of helping build a better Internet. I&#39;m looking forward to sessions like those led by Cloudflare&#39;s Black community, <a href=\"/black-elephant-in-the-room/\">Afroflare</a>, discussing their career paths and experiences (<a href=\"https://cloudflare.tv/schedule/5NsqairEWFhsdgARkMsf2z\">add to calendar</a>), &quot;Spotlight on Latino Excellence&quot; interviewing Latino members of Cloudflare&#39;s team (<a href=\"https://cloudflare.tv/schedule/5pAsFA2GXR02c6UyKeCg8r\">add to calendar</a>), and &quot;Everyone at the Table&quot; looking at the topics of the day from a diverse set of perspectives (<a href=\"https://cloudflare.tv/schedule/3cVrzWMRO7yhnuHbJvRvTW\">add to calendar</a>).</p><p>We as a company, and the tech community overall, have a lot of work to do in order to bring in more diversity. I&#39;m hopeful that Cloudflare TV can provide one forum to highlight the incredible professionals from communities that have been underrepresented in tech on our team and at other organizations we admire. I&#39;m looking forward to kicking off that conversation with Chris Young on Monday (<a href=\"https://cloudflare.tv/schedule/7ADOoIIKxFMhvG89to4VQn\">add to calendar</a>).</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"tune-in-geek-out\">Tune In, Geek Out</h3>\n            <a href=\"#tune-in-geek-out\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>We&#39;re aiming to make as much of the content interactive as possible. We&#39;ll be interviewing existing customers and partners. We’re hosting as much of the content live so that the hosts of many programs will respond to questions from the audience. If you tune in, you&#39;ll get to hear from the product managers and engineers that are building Cloudflare, ask them questions, and get responses live.</p><p>There will be lots of snafus. None of us have ever been television producers before. In MTV&#39;s early days, they regularly failed to a blank screen. The production quality was low. And some experiments didn&#39;t work. If we&#39;re lucky, this won&#39;t be any different. But, if we&#39;re really lucky, hopefully some great things will also come out of it. I keep reminding our team that if we&#39;re trying to follow in the footsteps of MTV — and its greatest success was &quot;Jersey Shore&quot; — then the bar is pretty low.</p><p>So hope you&#39;ll tune in, geek out, feel part of our community, and learn more about Cloudflare and the people who are building it. And, if it works, maybe none of us will ever need to go to RSA again.</p><p>Check out the Cloudflare TV Guide: <a href=\"https://cloudflare.tv/schedule\">cloudflare.tv/schedule</a></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2YSSNKRZmLOhHtcM3HDAKV/96f84b82e8d4c902ebe3fe893a59e2e6/twitter-1-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1600\" loading=\"lazy\"/>\n            \n            </figure>",
		"id": "7xWjn8Tmh6NeAcWwBv1AZ1",
		"localeList": {
			"name": "Ladies and Gentlemen…Cloudflare TV! Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"title": "Ladies and Gentlemen…Cloudflare TV!",
			"description": null,
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/14WzNqNhSPz291TkxMGTij/89d8a81a85064a1781db0e0ab106b511/ladies-and-gentlemen-cloudflare-tv-djpND4.png"
		},
		"primary_author": {},
		"published_at": "2020-06-07T21:55:33.000+01:00",
		"slug": "ladies-and-gentlemen-cloudflare-tv",
		"tags": [
			{
				"id": "5bflRzis7L2XZC0Rx1y1Sl",
				"name": "Cloudflare TV",
				"slug": "cloudflare-tv"
			},
			{
				"id": "4m0TnPrRHWtb7J6Ht4M4oj",
				"name": "Video",
				"slug": "video"
			},
			{
				"id": "7qrmHspTZnIVIRl7tmvg6k",
				"name": "Events",
				"slug": "events"
			},
			{
				"id": "7mVMfcxp4tMqKil9jj8BJa",
				"name": "Cloudflare Stream",
				"slug": "cloudflare-stream"
			}
		],
		"title": "Ladies and Gentlemen…Cloudflare TV!",
		"updated_at": "2024-08-27T02:01:40.411Z",
		"url": "https://blog.cloudflare.com/ladies-and-gentlemen-cloudflare-tv"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}