{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Daniele Molteni",
				"slug": "daniele",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3Zh7G3qA4Y20jQXIMgwzOq/f78ff151e28078a87df95a684e0d31c4/daniele.jpg",
				"location": "London, UK",
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "More than 50% of all traffic processed by Cloudflare is API-based, and it’s growing twice as fast as traditional web traffic. This huge growth is driven by a few industries, and it calls for the development of dedicated security solutions",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4QDfCOXjcKO49CecEV9YsP/a3c0315e045c3d41741646d837ac99f3/landscape-of-api-traffic.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/uBrikBaI31mZRuCQKdRP2/94974cb72a798185a0d056f5721bde8f/image6-18.png\" alt=\"Hero image for the blog post representing graphics\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>In recent years we have witnessed an explosion of Internet-connected applications. Whether it is a new mobile app to find your soulmate, the latest wearable to monitor your vitals, or an industrial solution to detect corrosion, our life is becoming packed with connected systems.</p><p>How is the Internet changing because of this shift? This blog provides an overview of how Internet traffic is evolving as <a href=\"https://www.cloudflare.com/learning/security/api/what-is-an-api/\">Application Programming Interfaces (APIs)</a> have taken the centre stage among the communication technologies. With help from the <a href=\"https://radar.cloudflare.com/\">Cloudflare Radar</a> team, we have harnessed the data from our global network to provide this snapshot of global APIs in 2021.</p><p>The huge growth in API traffic comes at a time when Cloudflare has been introducing new technologies that protect applications from nascent threats and vulnerabilities. The release of <a href=\"/introducing-api-shield/\">API Shield</a> with <a href=\"https://developers.cloudflare.com/api-shield/products/api-discovery\">API Discovery</a>, <a href=\"/protecting-apis-from-abuse-and-data-exfiltration/\">Schema Validation</a>, <a href=\"/protecting-apis-from-abuse-and-data-exfiltration/\">mTLS</a> and <a href=\"/api-abuse-detection/\">API Abuse Detection</a> has provided customers with a set of tools designed to protect their applications and data based on how APIs work and their challenges.</p><p>We are also witnessing increased adoption of new protocols. Among encryption protocols, for example, TLS v1.3 has become the most used protocol for APIs on Cloudflare while, for transport protocols, we saw an uptake of QUIC and gRPC (Cloudflare support announced in <a href=\"/the-quicening/\">2018</a> and <a href=\"/announcing-grpc/\">2020</a> respectively).</p><p>In the following sections we will quantify the growth of APIs and identify key industries affected by this shift. We will also look at the data to better understand the source and type of traffic we see on our network including how much malicious traffic our security systems block.</p><h2>Why is API use exploding?</h2><p>By working closely with our customers and observing the broader trends and data across our network in application security, we have identified three main trends behind API adoption: how applications are built is changing, API-first businesses are thriving, and finally machine-to-machine and human-to-machine communication is evolving.</p><p>During the last decade, APIs became popular because they allowed developers to separate backend and frontend, thus creating applications with better user experience. The <a href=\"https://www.cloudflare.com/learning/performance/what-is-jamstack/\">Jamstack architecture</a> is the most recent trend highlighting this movement, where technologies such as JavaScript, APIs and markup are being used to create responsive and high-performance applications. The growth of microservices and serverless architectures are other drivers behind using efficient HTTP-powered application interfaces.</p><p>APIs are also enabling companies to innovate their business models. Across many industries there is a trend of modularizing complex processes by integrating self-contained workflows and operations. The product has become the service delivered via APIs, allowing companies to scale and monetize their new capabilities. Financial Services is a prime example where a monolithic industry with vertically integrated service providers is giving way to a more fragmented landscape. The new Open Banking standard (<a href=\"https://ec.europa.eu/info/law/payment-services-psd-2-directive-eu-2015-2366_en\">PSD2</a>) is an example of how small companies can provide modular financial services that can be easily integrated into larger applications. Companies like <a href=\"https://truelayer.com/\">TrueLayer</a> have productized APIs, allowing <a href=\"https://www.cloudflare.com/ecommerce/\">e-commerce organizations</a> to onboard new sellers to a marketplace within seconds or to <a href=\"https://www.cloudflare.com/solutions/ecommerce/optimization/\">deliver more efficient payment options</a> for their customers. A similar shift is happening in the logistics industry as well, where <a href=\"https://goshippo.com/\">Shippo</a> allows the same e-commerce companies to integrate with services to initiate deliveries, print labels, track goods and streamline the returns process. And of course, everything is powered by APIs.</p><p>Finally, the increase of connected devices such as wearables, sensors and robots are driving more APIs, but another aspect of this is the way manual and repetitive tasks are being automated. Infrastructure-as-Code is an example of relying on APIs to replace manual processes that have been used to manage Internet Infrastructure in the past. Cloudflare is itself a product of this trend as our solutions allow customers to <a href=\"https://developers.cloudflare.com/terraform/\">use services like Terraform</a> to configure how their infrastructure should work with our products.</p><h2>Labelling traffic</h2><p>The data presented in the following paragraphs is based on the total traffic proxied by Cloudflare and traffic is classified according to the Content-Type header generated in the response phase. Only requests returning a 200 response were included in the analysis except for the analysis in the ‘Security’ section where other error codes were included. Traffic generated by identified bots is not included.</p><p>When looking at trends, we compare data from the first week of February 2021 to the first week of December 2021. We chose these dates to compare how traffic changed over the year but excluding January which is affected by the holiday season.</p><p>Specifically, API traffic is labelled based on responses with types equal <code>application/json</code>, <code>application/xml</code>, and <code>text/xml</code>, while Web accounts for <code>text/html</code>, <code>application/x-javascript</code>, <code>application/javascript</code>, <code>text/css</code>, and <code>text/javascript</code>. Requests categorised as Text are <code>text/plain</code>; Binary are <code>application/octet-stream</code>; Media includes all image types, video and audio.</p><p>Finally, <code>Other</code> catches everything that doesn’t clearly fall into the labels above, which includes <code>empty</code> and <code>unknown</code>. Part of this traffic might be API and the categorisation might be missing due to the client or server not adding a Content-Type header.</p><h2>API use in 2021</h2><p>We begin by examining the current state of API traffic at our global network and the types of content served. During the first week of December 2021, API calls represented 54% of total requests, up from 52% during the first week of February 2021.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/37yKfwWqrPzDZe9NQEocFZ/ef69c42d62985c7bcd8e71349baf262c/image8-20.png\" alt=\"Diagram showing composition of traffic by data type in early and late 2021.\" class=\"kg-image\" width=\"1542\" height=\"652\" loading=\"lazy\"/>\n            \n            </figure><p>When looking at individual data types, API was by far the fastest growing data type (+21%) while Web only grew by 10%. Media (such as images and videos) grew just shy of 15% while binary was the only traffic that in aggregate experienced a reduction of 6%.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4i6Hv8Nmwm3kGHZC5Vgx4t/6b2647cda0c6640986a875826b8cb77f/image4-16.png\" alt=\"Growth of different data types from February to December 2021.\" class=\"kg-image\" width=\"1542\" height=\"788\" loading=\"lazy\"/>\n            \n            </figure><p>In summary, APIs have been one of the drivers of the traffic growth experienced by the Cloudflare network in 2021. APIs account for more than half of the total traffic generated by end users and connected devices, and they’re growing twice as fast as traditional web traffic.</p><h3>New industries are contributing to this increase</h3><p>We analysed where this growth comes from in terms of industry and application types. When looking at the total volume of API traffic, unsurprisingly the general Internet and Software industry accounts for almost 40% of total API traffic in 2021. The second-largest industry in terms of size is Cryptocurrency (7% of API traffic) followed by Banking and Retail (6% and 5% of API traffic respectively).</p><p>The following chart orders industries according to their API traffic growth. Banking, Retail and Financial Services have experienced the largest year-on-year growth with 70%, 51% and 50% increases since February 2021, respectively.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/684xjXwbWwQRrUag1ndbAm/9f8269596db14a74b8388c303221c267/image9-12.png\" alt=\"Growth of API traffic by industry. Top three industries with the largest growth were: Banking, Retail and Financial Services.\" class=\"kg-image\" width=\"1616\" height=\"728\" loading=\"lazy\"/>\n            \n            </figure><p>The growth of Banking and Financial Services traffic is aligned with the trends we have observed anecdotally in the sector. The industry has seen the entrance of a number of new platforms that aggregate accounts from different providers, streamline transactions, or allow investing directly from apps, all of which rely heavily on APIs. The new “challenger banks” movement is an example where newer startups are offering captivating mobile services based on APIs while putting pressure on larger institutions to modernise their infrastructure and applications.</p><h2>A closer look at the API characteristics</h2><p>Generally speaking, a RESTful API request is a call to invoke a function. It includes the address of a specific resource (the endpoint) and the action you want to perform on that resource (method). A payload might be present to carry additional data and HTTP headers might be populated to add information about the origin of the call, what software is requesting data, requisite authentication credentials, etc. The method (or verb) expresses the action you want to perform, such as retrieve information (GET) or update information (POST).</p><p>It’s useful to understand the composition and origin of API traffic, such as the most commonly used methods, the most common protocol used to encode the payload, or what service generates traffic (like Web, mobile apps, or IoT). This information will help us identify the macro source of vulnerabilities and design and deploy the best tools to protect traffic.</p><h3>Methods</h3><p>The vast majority of API traffic is the result of POST or GET requests (98% of all requests). POST itself accounts for 53.4% of all requests and GET 44.4%. Generally speaking, GET tends to transfer sensitive data in the HTTP request header, query and in the response body, while POST typically transfers data in the <a href=\"https://cheatsheetseries.owasp.org/cheatsheets/REST_Security_Cheat_Sheet.html\">request header and body</a>. While many security tools apply to both of these types of calls, this distinction can be useful when deploying tools such as API Schema Validation (request and response) or Data Loss Prevention/Sensitive Data Detection (response), both <a href=\"/protecting-apis-from-abuse-and-data-exfiltration/\">launched by Cloudflare</a> in March 2021.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3oIzN0rtru4RbDjA8gLPgL/3260a538b2ec3a0bb3f4125a1bf50004/image10-10.png\" alt=\"Percentage of requests with the different API methods. POST and GET requests make up for 97.5% of API traffic.\" class=\"kg-image\" width=\"1438\" height=\"426\" loading=\"lazy\"/>\n            \n            </figure><h3>Payload encoding review</h3><p>API payloads encode data using different rules and languages that are commonly referred to as transport protocols. When looking at the breakdown between two of the most common protocols, JSON has by far the largest number of requests (~97%) while XML has a smaller share of requests as it still carries the heaviest traffic. In the following figure, JSON and XML are compared in terms of response sizes. XML is the most verbose protocol and the one handling the largest payloads while JSON is more compact and results in smaller payloads.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6SctBpazDhVqH8lvt90IYb/1686e221e2e2a7d2e224f97251830aee/image2-24.png\" alt=\"Distribution of response sizes for JSON and XML. JSON is commonly used for smaller payloads than XML.\" class=\"kg-image\" width=\"1482\" height=\"778\" loading=\"lazy\"/>\n            \n            </figure><p>Since we have started supporting gRPC (September 2020), we have seen a steady increase in gRPC traffic and many customers we speak with are in the planning stages of migrating from JSON to gRPC, or designing translation layers at the edge from external JSON callers to internal gRPC services.</p><h3>Source of API traffic</h3><p>We can look at the HTTP request headers to better understand the origin and intended use of the API. The User-Agent header allows us to identify what type of client made the call, and we can divide it into three broader groups: “browser”, “non-browser” and “unknown” (which indicates that the User-Agent header was not set).</p><p>About 38% of API calls are made by browsers as part of a web application built on top of backend APIs. Here, the browser loads an HTML page and populates dynamic fields by generating AJAX API calls against the backend service. This paradigm has become the de-facto standard as it provides an effective way to build dynamic yet flexible Web applications.</p><p>The next 56% comes from non-browsers, including mobile apps and IoT devices with a long tail of different types (wearables, connected sport equipment, gaming platforms and more). Finally, approximately 6% are “unknown” and since well-behaving browsers and tools like <a href=\"https://curl.se/\">curl</a> send a User-Agent by default, one could attribute much of this unknown to programmatic or automated tools, some of which could be malicious.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7qeqIrgnMNxhYKb3ekZFhf/7e027ea8e7ab595a5aa4aca76f0c2b1d/image7-14.png\" alt=\"Distribution of User-Agent headers for API traffic. ‘Non-browser’ makes up for more than half of the traffic.\" class=\"kg-image\" width=\"1438\" height=\"426\" loading=\"lazy\"/>\n            \n            </figure><h3>Encryption</h3><p>A key aspect of <a href=\"https://www.cloudflare.com/application-services/solutions/api-security/\">securing APIs against snooping and tampering</a> is encrypting the session. Clients use SSL/TLS to authenticate the server they are connecting with, for example, by making sure it is truly their cryptocurrency vendor. The benefit of transport layer encryption is that after handshaking, all application protocol bytes are encrypted, providing both confidentiality and integrity assurances.</p><p>Cloudflare <a href=\"/introducing-tls-1-3/\">launched the latest version of TLS (v1.3)</a> in September 2016, and it was <a href=\"/you-get-tls-1-3-you-get-tls-1-3-everyone-gets-tls-1-3/\">enabled by default on some properties</a> in May 2018. When looking at API traffic today, TLS v1.3 is the most adopted protocol with 55.9% of traffic using it. The vulnerable v1.0  and v1.1 were <a href=\"https://datatracker.ietf.org/doc/html/rfc8996\">deprecated in March 2021</a> and their use has virtually disappeared.</p><p>Transport security protocol</p><p>December 2021</p><p>TLS 1.3</p><p>55.9%</p><p>TLS 1.2</p><p>32.7%</p><p>QUIC</p><p>8.4%</p><p>None</p><p>2.8%</p><p>TLS 1.0</p><p>0.3%</p><p>The protocol that is growing fastest is QUIC. While QUIC can be used to carry many types of application protocols, Cloudflare has so far focused on <a href=\"https://www.cloudflare.com/learning/performance/what-is-http3/\">HTTP/3</a>, the mapping of HTTP over IETF QUIC. We <a href=\"/the-quicening/\">started supporting</a> draft versions of QUIC in 2018 and when QUIC version 1 was published as RFC 9000 in May 2021, we <a href=\"/quic-version-1-is-live-on-cloudflare/\">enabled it for everyone</a> the next day. QUIC uses the TLS 1.3 handshake but has its own mechanism for protecting and securing packets. Looking at HTTP-based API traffic, we see HTTP/3 going from less than 3% in early February 2021 to more than 8% in December 2021. This growth broadly aligns RFC 9000 being published and during the periodHTTP/3 support being stabilized and enabled in a range of client implementations.</p><p>Mutual TLS, which is often used for mobile or IoT devices, accounts for 0.3% of total API traffic. Since we <a href=\"/introducing-tls-client-auth/\">released the first version of mTLS</a> in 2017 we’ve seen a growing number of inquiries from users across all Cloudflare plans, as we have recently made it easier for customers to start using mTLS with Cloudflare <a href=\"/introducing-api-shield/\">API Shield</a>. Customers can now use Cloudflare dashboard to issue and manage certificates with one-click avoiding all the complexity of having to manage a Private Key Infrastructure and root certificates themselves.</p><p>Finally, unencrypted traffic can provide a great opportunity for attackers to access plain communications. The total unencrypted API traffic dropped from 4.6% of total requests in early 2021 to 2.6% in December 2021. This represents a significant step forward in establishing basic security for all API connections.</p><h2>Security</h2><p>Given the huge amount of traffic that Cloudflare handles every second, we can look for trends in blocked traffic and identify common patterns in threats or attacks.</p><p>When looking at the Cloudflare security systems, an HTML request is twice as likely to be blocked than an API request. Successful response codes (200, 201, 301 and 302) account for 91% of HTML and 97% of API requests, while 4XX error codes (like 400, 403, 404) are generated for 2.8% of API calls as opposed to 7% of HTML. Calls returning 5XXs codes (such as Internal Server Error, Bad Gateway, Service Unavailable) are almost nonexistent for APIs (less than 0.2% of calls) while are almost 2% of requests for HTML.</p><p>The relatively larger volume of unmitigated API requests can be explained by the automated nature of APIs, for example more API calls are generated in order to render a page that would require a single HTML request. Malicious or malformed requests are therefore diluted in a larger volume of calls generated by well-behaving automated systems.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7EU8nQUjXvKSj3S72nO66X/c0f0d011ade27be01d830c8209c4e569/image1-20.png\" alt=\"Breakdown of response codes as percentage of total traffic (JSON vs HTML).\" class=\"kg-image\" width=\"1548\" height=\"756\" loading=\"lazy\"/>\n            \n            </figure><p>We can further analyse the frequency of specific error codes to get a sense of what the most frequent malformed (and possibly malicious) requests are. In the following figure, we plot the share of a particular error code when compared to all 4XXs.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2IKN7Mb3ALR2tAveQm2S3n/120f8e83ea39226a0400b5a70c902207/image5-16.png\" alt=\"Most common error codes for API traffic.\" class=\"kg-image\" width=\"1200\" height=\"742\" loading=\"lazy\"/>\n            \n            </figure><p>We can identify three groups of issues all equally likely (excluding the more obvious “404 Not Found” case): “400 Bad Request” (like malformed, invalid request), “429 Too Many Requests” (“Rate Limiting”), and the combination of Authentication and Authorization issues (“403 Forbidden” and “401 Unauthorized”). Those codes are followed by a long tail of other errors, including “422 Unprocessable Entity”, “409 Conflict”, and “402 Payment Required”.</p><p>This analysis confirms that the most common attacks rely on sending non-compliant requests, brute force efforts (24% of generated 4XXs are related to rate limiting), and accessing resources with invalid authentication or permission.</p><p>We can further analyse the reason why calls were blocked (especially relative to the 400s codes) by looking at what triggered the <a href=\"https://www.cloudflare.com/waf/\">Cloudflare WAF</a>. The OWASP and the Cloudflare Managed Ruleset are tools that scan incoming traffic looking for fingerprints of known vulnerabilities (such as SQLi, <a href=\"https://www.cloudflare.com/learning/security/how-to-prevent-xss-attacks/\">XSS</a>, etc.) and they can provide context on what attack was detected.</p><p>A portion of the blocked traffic has triggered a managed rule for which we can identify the threat category. Although a malicious request can match multiple categories, the <a href=\"https://www.cloudflare.com/learning/ddos/glossary/web-application-firewall-waf/\">WAF</a> assigns it to the first threat that is identified. User-Agent anomaly is the most common reason why traffic is blocked. This is usually triggered by the lack of or by a malformed User-Agent header, capturing requests that do not provide enough credible information on what type of client has sent the request. The next most common threat is cross-site scripting. After these two categories, there is a long tail of other anomalies that were identified.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/22mNr1Cl33LwwoqsCj9NNi/e78f4d32e45e0c754d0a82b68a56d5df/image3-28.png\" alt=\"Top attack types as identified by Cloudflare Managed Rulesets.\" class=\"kg-image\" width=\"1664\" height=\"908\" loading=\"lazy\"/>\n            \n            </figure><h2>Conclusions</h2><p>More than one out of two requests we process is an API call, and industries such as Banking, Retail and Financial Services are leading in terms of adoption and growth.</p><p>Furthermore, API calls are growing twice as fast as HTML traffic, making it an ideal candidate for new <a href=\"https://www.cloudflare.com/security/\">security solutions</a> aimed at protecting customer data.</p>",
		"id": "1AcNLro5cn6HroXvQ5bGnt",
		"localeList": {
			"name": "Landscape of API Traffic Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "More than 50% of all traffic processed by Cloudflare is API-based, and it’s growing twice as fast as traditional web traffic. This huge growth is driven by a few industries, and it calls for the development of dedicated security solutions",
		"metadata": {
			"title": "Landscape of API Traffic",
			"description": "More than 50% of all traffic processed by Cloudflare is API-based, and it’s growing twice as fast as traditional web traffic. This huge growth is driven by a few industries, and it calls for the development of dedicated security solutions",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7hoyDwtgtZl3PotwvoEhF3/2da3d28373a487d62433a11dbd3f1614/landscape-of-api-traffic-yIqSE9.png"
		},
		"primary_author": {},
		"published_at": "2022-01-26T13:59:09.000+00:00",
		"reading_time": 11,
		"slug": "landscape-of-api-traffic",
		"tags": [
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "5x72ei67SoD11VQ0uqFtpF",
				"name": "API",
				"slug": "api"
			},
			{
				"id": "6GvYnn2MD0ye88h10BplGd",
				"name": "API Shield",
				"slug": "api-shield"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			}
		],
		"title": "Landscape of API Traffic",
		"updated_at": "2024-08-27T01:37:17.956Z",
		"url": "https://blog.cloudflare.com/landscape-of-api-traffic"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}