{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "8",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Ricky Robinett",
				"slug": "ricky",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5d1AMI6khbMIgxXlI6DHs/fe3cc35c641d971c6e0fec7c5449c94a/ricky.jpeg",
				"location": null,
				"website": null,
				"twitter": "@rickyrobinett",
				"facebook": null
			}
		],
		"excerpt": "We are incredibly stoked that our friends at LangChain have announced LangChainJS Support for Cloudflare Workers! In this post we'll show you how to build a sample application.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2AjY5oQ73wbBbBeZ0insTa/eb9a8ebf6075cbebfbe59b5ef04b6d11/langchain-and-cloudflare.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4OKS7gP02sJrPO41nAuyky/bb4c194f72b152bcf5dc4720e59995f3/LangChain-Workers-1.png\" alt=\"Using LangChainJS and Cloudflare Workers together\" class=\"kg-image\" width=\"1801\" height=\"1014\" loading=\"lazy\"/>\n            \n            </figure><p>We are incredibly stoked that our friends at LangChain have announced <a href=\"https://blog.langchain.dev/js-envs/\">LangChainJS Support for Multiple JavaScript Environments (including Cloudflare Workers)</a>. During Developer Week 2023 we wanted to celebrate this launch and our future collaborations with LangChain.</p><blockquote><p><i>“Our goal for LangChain is to empower developers around the world to build with AI. We want LangChain to work wherever developers are building, and to spark their creativity to build new and innovative applications. With this new launch, we can&#39;t wait to see what developers build with LangChainJS and Cloudflare Workers. And we&#39;re excited to put more of Cloudflare&#39;s developer tools in the hands of our community in the coming months.” - </i><b><i>Harrison Chase</i></b><i>, Co-Founder and CEO, LangChain</i></p></blockquote><p>In this post, we’ll share why we’re so excited about LangChain and walk you through how to build your first LangChainJS + Cloudflare Workers application.</p><p>For the uninitiated, <a href=\"https://docs.langchain.com/docs/\">LangChain</a> is a framework for building applications powered by <a href=\"https://www.cloudflare.com/learning/ai/what-is-large-language-model/\">large language models (LLMs)</a>. It not only lets you fairly seamlessly switch between different LLMs, but also gives you the ability to chain prompts together. This allows you to build more sophisticated applications across multiple LLMs, something that would be way more complicated without the help of LangChain.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"building-your-first-langchainjs-cloudflare-workers-application\">Building your first LangChainJS + Cloudflare Workers application</h3>\n            <a href=\"#building-your-first-langchainjs-cloudflare-workers-application\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>There are a few prerequisites you have to set up in order to build this application:</p><ol><li><p>An OpenAI account: If you don’t already have one, you can <a href=\"https://platform.openai.com/signup\">sign up for free</a>.</p></li><li><p>A paid Cloudflare Workers account: If you don’t already have an account, you can <a href=\"https://dash.cloudflare.com/sign-up\">sign up here</a> and upgrade your Workers for $5 per month.</p></li><li><p>Node &amp; npm: If this is your first time working with node, you can <a href=\"https://nodejs.org/en/\">get it here</a>.</p></li></ol><p>Next create a new folder called <code>langchain-workers</code>, navigate into that folder and then within that folder run <code>npm create cloudflare@latest</code>.</p><p>When you run <code>npm create cloudflare@latest</code> you’ll select the following options:</p><ul><li><p><b>Where do you want to create your application?</b> <i>langchain-worker</i></p></li><li><p><b><b><b>What type of application do you want to create?</b></b></b><b><b> </b></b><i><b><b>&quot;Hello World&quot; script</b></b></i></p></li><li><p><b><b><b>Do you want to use TypeScript</b></b></b><b><b> </b></b><i><b><b>No</b></b></i></p></li></ul><p><b>Do you want to deploy your application?</b> _No_With our Worker created, we’ll need to set up the environment variable for our OpenAI API Key. You can <a href=\"https://platform.openai.com/account/api-keys\">create an API key in your OpenAI dashboard</a>. Save your new API key someplace safe, then we’ll use wrangler to safely and securely store our API key in an environment variable that our Worker can access:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">npx wrangler secret put OPENAI_API_KEY</pre></code>\n            <p>Then we’ll install LangChainjs using npm:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">npm install langchain</pre></code>\n            <p>Before we start writing code we can make sure everything is working properly by running <code>wrangler dev</code>. With <code>wrangler dev</code> running you can press <code>b</code> to open a browser. When you do, you&#39;ll see “Hello World!” in your browser.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"a-sample-application\">A sample application</h3>\n            <a href=\"#a-sample-application\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>One common way you may want to use a language model is to combine it with your own text. LangChain is a great tool to accomplish this goal and that’s what we’ll be doing today in our sample application. We’re going to build an application that lets us use the OpenAI language model to ask a question about an article on Wikipedia. Because I live in (and love) Brooklyn, we’ll be using the <a href=\"https://en.wikipedia.org/wiki/Brooklyn\">Wikipedia article about Brooklyn</a>. But you can use this code for any Wikipedia article, or website, you’d like.</p><p>Because language models only know about the data that they were trained on, if we want to use a language model with new or specific information we need a way to pass a model that information. In LangChain we can accomplish this using a <a href=\"https://js.langchain.com/docs/modules/schema/document\">”document”</a>. If you’re like me, when you hear “document” you often think of a specific file format but in LangChain a document is an object that consists of some text and optionally some metadata. The text in a document object is what will be used when interacting with a language model and the metadata is a way that you can track information about your document.</p><p>Most often you’ll want to create documents from a source of pre-existing text. LangChain helpfully provides us with different <a href=\"https://js.langchain.com/docs/modules/indexes/document_loaders/\">document loaders</a> to make loading text from many different sources easy. There are document loaders for different types of text formats (for example: CSV, PDFs, HTML, unstructured text) and that content can be loaded locally or from the web. A document loader will both retrieve the text for you and load that text into a document object. For our application, we’ll be using the <a href=\"https://js.langchain.com/docs/modules/indexes/document_loaders/examples/web_loaders/web_cheerio\">webpages with Cheerio</a> document loader. <a href=\"https://cheerio.js.org/\">Cheerio</a> is a lightweight library that will let us read the content of a webpage. We can install it using <code>npm install cheerio</code>.</p><p>After we’ve installed cheerio we’ll import the CheerioWebBaseLoader at the top of our <code>src/index.js</code> file:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">import { CheerioWebBaseLoader } from &quot;langchain/document_loaders/web/cheerio&quot;;</pre></code>\n            <p>With CheerioWebBaseLoader imported, we can start using it within our fetch function:.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">    async fetch(request, env, ctx) {\n        const loader = new CheerioWebBaseLoader(\n          “https://en.wikipedia.org/wiki/Brooklyn&quot;\n        );\n        const docs = await loader.load();\n        console.log(docs);\n\n        return new Response(&quot;Hello World!&quot;);\n  },</pre></code>\n            <p>In this code, we’re configuring our loader with the Wikipedia URL for the article about Brooklyn, run the <code>load()</code> function and log the result to the console. Like I mentioned earlier, if you want to try this with a different Wikipedia article or website, LangChain makes it very easy. All we have to do is change the URL we’re passing to our CheerioWebBaseLoader.</p><p>Let’s run <code>npx wrangler dev</code>, load up our page locally and watch the output in our console. You should see:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Loaded page\nArray(1) [ Document ]</pre></code>\n            <p>Our document loader retrieved the content of the webpage, put that content in a document object and loaded it into an array.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6eUEj1m3fLXaX22XfWzZc1/9b080aef6c13b4bd4db31c740b2998f1/image7-8.png\" alt=\"\" class=\"kg-image\" width=\"1480\" height=\"440\" loading=\"lazy\"/>\n            \n            </figure><p>This is great, but there’s one more improvement we can make to this code before we move on – splitting our text into multiple documents.</p><p>Many language models have limits on the amount of text you can pass to them. As well, some LLM APIs charge based on the amount of text you send in your request. For both of these reasons, it’s helpful to only pass the text you need in a request to a language model.</p><p>Currently, we’ve loaded the entire content of the Wikipedia page about Brooklyn into one document object and would send the entirety of that text with every request to our language model. It would be more efficient if we could only send the relevant text to our language model when we have a question. The first step in doing this is to split our text into smaller chunks that are stored in multiple document objects. To assist with this LangChain gives us the very aptly named <a href=\"https://js.langchain.com/docs/modules/indexes/text_splitters/\">Text Splitters</a>.</p><p>We can use a text splitter by updating our loader to use the <code>loadAndSplit()</code> function instead of <code>load()</code>. Update the line where we assign docs to this:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">const docs = await loader.loadAndSplit();</pre></code>\n            <p>Now start the application again with <code>npx wrangler dev</code> and load our page. This time in our console you’ll see something like this:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Loaded page\nArray(227) [ Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document, Document... ]</pre></code>\n            <p>Instead of an array with one document object, our document loader has now split the text it retrieved into multiple document objects. It’s still a single Wikipedia article, LangChain just split that text into chunks that would be more appropriately sized for working with a language model.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7qjMlbP8yfVegK2PT9BPm/31015f843d9a5dd7ad1d80f100da91f7/image3-18.png\" alt=\"\" class=\"kg-image\" width=\"1736\" height=\"472\" loading=\"lazy\"/>\n            \n            </figure><p>Even though our text is split into multiple documents, we still need to be able to understand what text is relevant to our question and should be sent to our language model. To do this, we’re going to introduce two new concepts – <a href=\"https://www.cloudflare.com/learning/ai/what-are-embeddings/\">embeddings</a> and <a href=\"https://www.cloudflare.com/learning/ai/what-is-vector-database/\">vector stores</a>.</p><p>Embeddings are a way of representing text with numerical data. For our application we’ll be using <a href=\"https://platform.openai.com/docs/guides/embeddings\">OpenAI Embeddings</a> to generate our embeddings based on the document objects we just created. When you generate embeddings the result is a vector of floating point numbers. This makes it easier for computers to understand the relatedness of the strings of text to each other. For each document object we pass the embedding API, a vector will be created.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6WDcDosuQet5YbgNuU1ZQG/657e7684615f81785e69a4cb5fc03be9/image2-28.png\" alt=\"\" class=\"kg-image\" width=\"1988\" height=\"454\" loading=\"lazy\"/>\n            \n            </figure><p>When we compare vectors, the closer numbers are to each other the more related the strings are. Inversely, the further apart the numbers are then the less related the strings are. It can be helpful to visualize how these numbers would allow us to place each document in a virtual space:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2bngW4Ms4zz7PZIAZxnR2F/31f66eabc1b8b6b7630fe8bff4ce80f7/image1-47.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1608\" loading=\"lazy\"/>\n            \n            </figure><p>In this illustration, you could imagine how the text in the document objects that are bunched together would be more similar than the document object further off. The grouped documents could be text pulled from the article’s section on the history of Brooklyn. It’s a longer section that would have been split into multiple documents by our text splitter. But even though the text was split the embeddings would allow us to know this content is closely related to each other. Meanwhile, the document further away could be the text on the climate of Brooklyn. This section was smaller, not split into multiple documents, and the current climate is not as related to the history of Brooklyn, so it’s placed further away.</p><p>Embeddings are a pretty fascinating and complicated topic. If you’re interested in understanding more, here&#39;s a <a href=\"https://www.youtube.com/watch?v=5MaWmXwxFNQ\">great explainer video</a> that takes an in-depth look at the embeddings.</p><p>Once you’ve generated your documents and embeddings, you need to store them someplace for future querying. Vector stores are a kind of database optimized for storing &amp; querying documents and their embeddings. For our vector store, we’ll be using <a href=\"https://js.langchain.com/docs/modules/indexes/vector_stores/integrations/memory\">MemoryVectorStore</a> which is an ephemeral in-memory vector store. LangChain also has support for many of your favorite vector databases like <a href=\"https://js.langchain.com/docs/modules/indexes/vector_stores/integrations/chroma\">Chroma</a> and <a href=\"https://js.langchain.com/docs/modules/indexes/vector_stores/integrations/pinecone\">Pinecone</a>.</p><p>We’ll start by adding imports for OpenAIEmbeddings and MemoryVectorStore at the top of our file:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">import { OpenAIEmbeddings } from &quot;langchain/embeddings/openai&quot;;\nimport { MemoryVectorStore } from &quot;langchain/vectorstores/memory&quot;;</pre></code>\n            <p>Then we can remove the <code>console.log()</code> function we had in place to show how our loader worked and replace them with the code to create our Embeddings and Vector store:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">const store = await MemoryVectorStore.fromDocuments(docs, new OpenAIEmbeddings({ openAIApiKey: env.OPENAI_API_KEY}));</pre></code>\n            <p>With our text loaded into documents, our embeddings created and both stored in a vector store we can now query our text with our language model. To do that we’re going to introduce the last two concepts that are core to building this application – <a href=\"https://js.langchain.com/docs/modules/models/\">models</a> and <a href=\"https://js.langchain.com/docs/modules/chains/\">chains</a>.</p><p>When you see models in LangChain, it’s not about generating or creating models. Instead, LangChain provides a standard interface that lets you access many different language models. In this app, we’ll be using the <a href=\"https://js.langchain.com/docs/modules/models/llms/integrations#openai\">OpenAI model</a>.</p><p>Chains enable you to combine a language model with other sources of information, APIs, or even other language models. In our case, we’ll be using the <a href=\"https://js.langchain.com/docs/modules/chains/index_related_chains/retrieval_qa\">RetreivalQAChain</a>. This chain retrieves the documents from our vector store related to a question and then uses our model to answer the question using that information.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/17hBMkJMZe5P3UHUfdCmCl/db5da651d7f7c204a31d0729fe9f6c5d/image4-18.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"409\" loading=\"lazy\"/>\n            \n            </figure><p>To start, we’ll add these two imports to the top of our file:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">import { OpenAI } from &quot;langchain/llms/openai&quot;;\nimport { RetrievalQAChain } from &quot;langchain/chains&quot;;</pre></code>\n            <p>Then we can put this all into action by adding the following code after we create our vector store:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">        const model = new OpenAI({ openAIApiKey: env.OPENAI_API_KEY});\n        const chain = RetrievalQAChain.fromLLM(model, store.asRetriever());\n\n        const question = &quot;What is this article about? Can you give me 3 facts about it?&quot;;\n\n        const res = await chain.call({\n            query: question,\n        });\n\n        return new Response(res.text); </pre></code>\n            <p>In this code the first line is where we instantiate our model interface and pass it our API key. Next we create a chain passing it our model and our vector store. As mentioned earlier, we’re using a RetrievalQAChain which will look in our vector store for documents related to our query and then use those documents to get an answer for our query from our model.</p><p>With our chain created, we can call the chain by passing in the query we want to ask. Finally, we send the response text we got from our chain as the response to the request our Worker received. This will allow us to see the response in our browser.</p><p>With all our code in place, let’s test it again by running <code>npx wrangler dev</code>. This time when you open your browser you will see a few facts about Brooklyn:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3Eb3EUM6vGAZVPf1nlkxs/8169139105040b3ac58fa7171791775b/image6-9.png\" alt=\"\" class=\"kg-image\" width=\"1468\" height=\"170\" loading=\"lazy\"/>\n            \n            </figure><p>Right now, the question we’re asking is hard coded. Our goal was to be able to use LangChain to ask any question we want about this article. Let’s update our code to allow us to pass the question we want to ask in our request. In this case, we’ll pass a question as an argument in the query string (e.g. <i>?question=When was Brooklyn founded</i>). To do this we’ll replace the line we’re currently assigning our question with the code needed to pull a question from our query string:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">        const { searchParams } = new URL(request.url);\n        const question = searchParams.get(&#039;question&#039;) ?? &quot;What is this article about? Can you give me 3 facts about it?&quot;;</pre></code>\n            <p>This code pulls all the query parameters from our URL using a JavaScript URL’s native <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/URL/searchParams\">searchParams property</a>, and gets the value passed in for the “question” parameter. If a value isn’t present for the “question” parameter, we’ll use the default question text we were using previously thanks to <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Nullish_coalescing\">JavaScripts’s nullish coalescing operator</a>.</p><p>With this update, run <code>npx wrangler dev</code> and this time visit your <a href=\"http://127.0.0.1:8787/?question=When%20was%20Brooklyn%20founded?\">local url with a question query string added</a>. Now instead of giving us a few fun facts about Brooklyn, we get the answer of when Brooklyn was founded. You can try this with any question you may have about Brooklyn. Or you can switch out the URL in our document loader and try asking similar questions about different Wikipedia articles.</p><p>With our code working locally, we can deploy it with <code>npx wrangler publish</code>. After this command completes you’ll receive a Workers URL that runs your code.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"you-langchain-cloudflare-workers\">You + LangChain + Cloudflare Workers</h3>\n            <a href=\"#you-langchain-cloudflare-workers\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>You can find our full LangChain example application on <a href=\"https://github.com/rickyrobinett/langchainjs-workers\">GitHub</a>. We can’t wait to see what you all build with LangChain and Cloudflare Workers. Join us on <a href=\"https://discord.com/invite/cloudflaredev\">Discord</a> or tag us on <a href=\"https://www.twitter.com/cloudflaredev\">Twitter</a> as you’re building. And if you’re ever having any trouble or questions, you can ask on <a href=\"https://community.cloudflare.com/\">community.cloudflare.com</a>.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"watch-on-cloudflare-tv\">Watch on Cloudflare TV</h3>\n            <a href=\"#watch-on-cloudflare-tv\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://customer-rhnwzxvb3mg4wz3v.cloudflarestream.com/550f605b9d626ca3efef2f4884217f53/iframe?preload=true&poster=https%3A%2F%2Fcustomer-rhnwzxvb3mg4wz3v.cloudflarestream.com%2F550f605b9d626ca3efef2f4884217f53%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D1s%26height%3D600\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div><!--kg-card-end: html-->",
		"id": "3PgqHl1LP0y4eOryCewoYN",
		"localeList": {
			"name": "Using LangChainJS and Cloudflare Workers together Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "We are incredibly stoked that our friends at LangChain have announced LangChainJS Support for Cloudflare Workers! In this post we'll show you how to build a sample application.",
		"metadata": {
			"title": "Using LangChainJS and Cloudflare Workers together",
			"description": "We are incredibly stoked that our friends at LangChain have announced LangChainJS Support for Cloudflare Workers! In this post we'll show you how to build a sample application.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3y4h0NP0VFzR3r1wHkwmNO/f91ca4d1e7a39dcd4f29e7a6b024f5f2/langchain-and-cloudflare-m0leEf.png"
		},
		"primary_author": {},
		"published_at": "2023-05-18T14:00:18.000+01:00",
		"slug": "langchain-and-cloudflare",
		"tags": [
			{
				"id": "2xCnBweKwOI3VXdYsGVbMe",
				"name": "Developer Week",
				"slug": "developer-week"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "5cye1Bh5KxFh3pKSnX8Dsy",
				"name": "Serverless",
				"slug": "serverless"
			}
		],
		"title": "Using LangChainJS and Cloudflare Workers together",
		"updated_at": "2024-10-09T23:24:16.506Z",
		"url": "https://blog.cloudflare.com/langchain-and-cloudflare"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}