{
	"locale": "en-us",
	"post": {
		"id": "65e86cb7a5fcdf000a08a125",
		"uuid": "2d92e96b-f283-4d61-b9fd-79163ec4cac8",
		"title": "Linux kernel security tunables everyone should consider adopting",
		"slug": "linux-kernel-hardening",
		"html": "<figure class=\"kg-card kg-image-card\"><img src=\"http://blog.cloudflare.com/content/images/2024/03/Technical-deep-dive-for-Security-week.png\" class=\"kg-image\" alt=\"Linux kernel security tunables everyone should consider adopting\" loading=\"lazy\" width=\"1800\" height=\"1013\"></figure><!--kg-card-begin: markdown--><p>The Linux kernel is the heart of many modern production systems. It decides when any code is allowed to run and which programs/users can access which resources. It manages memory, mediates access to hardware, and does a bulk of work under the hood on behalf of programs running on top. Since the kernel is always involved in any code execution, it is in the best position to protect the system from malicious programs, enforce the desired system security policy, and provide security features for safer production environments.</p>\n<p>In this post, we will review some Linux kernel security configurations we use at Cloudflare and how they help to block or minimize a potential system compromise.</p>\n<h2 id=\"secure-boot\">Secure boot</h2>\n<p>When a machine (either a laptop or a server) boots, it goes through several boot stages:</p>\n<p><img src=\"http://blog.cloudflare.com/content/images/2024/03/image3-17.png\" alt=\"image3-17\" loading=\"lazy\"></p>\n<p>Within a secure boot architecture each stage from the above diagram verifies the integrity of the next stage before passing execution to it, thus forming a so-called secure boot chain. This way “trustworthiness” is extended to every component in the boot chain, because if we verified the code integrity of a particular stage, we can trust this code to verify the integrity of the next stage.</p>\n<p>We <a href=\"http://blog.cloudflare.com/anchoring-trust-a-hardware-secure-boot-story\">have previously covered</a> how Cloudflare implements secure boot in the initial stages of the boot process. In this post, we will focus on the Linux kernel.</p>\n<p>Secure boot is the cornerstone of any operating system security mechanism. The Linux kernel is the primary enforcer of the operating system security configuration and policy, so we have to be sure that the Linux kernel itself has not been tampered with. In our previous <a href=\"http://blog.cloudflare.com/anchoring-trust-a-hardware-secure-boot-story\">post about secure boot</a> we showed how we use UEFI Secure Boot to ensure the integrity of the Linux kernel.</p>\n<p>But what happens next? After the kernel gets executed, it may try to load additional drivers, or as they are called in the Linux world, kernel modules. And kernel module loading is not confined just to the boot process. A module can be loaded at any time during runtime — a new device being plugged in and a driver is needed, some additional extensions in the networking stack are required (for example, for fine-grained firewall rules), or just manually by the system administrator.</p>\n<p>However, uncontrolled kernel module loading might pose a significant risk to system integrity. Unlike regular programs, which get executed as user space processes, kernel modules are pieces of code which get injected and executed directly in the Linux kernel address space. There is no separation between the code and data in different kernel modules and core kernel subsystems, so everything can access everything. This means that a rogue kernel module can completely nullify the trustworthiness of the operating system and make secure boot useless. As an example, consider a simple Debian 12 (Bookworm installation), but with <a href=\"https://selinuxproject.org/\">SELinux</a> configured and enforced:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ lsb_release --all\nNo LSB modules are available.\nDistributor ID:\tDebian\nDescription:\tDebian GNU/Linux 12 (bookworm)\nRelease:\t12\nCodename:\tbookworm\nignat@dev:~$ uname -a\nLinux dev 6.1.0-18-cloud-amd64 #1 SMP PREEMPT_DYNAMIC Debian 6.1.76-1 (2024-02-01) x86_64 GNU/Linux\nignat@dev:~$ sudo getenforce\nEnforcing\n</code></pre>\n<p>Now we need to do some research. First, we see that we’re running 6.1.76 Linux Kernel. If we explore the source code, we would see that <a href=\"https://elixir.bootlin.com/linux/v6.1.76/source/security/selinux/hooks.c#L107\">inside the kernel, the SELinux configuration is stored in a singleton structure</a>, which <a href=\"https://elixir.bootlin.com/linux/v6.1.76/source/security/selinux/include/security.h#L92\">is defined</a> as follows:</p>\n<pre><code class=\"language-c\">struct selinux_state {\n#ifdef CONFIG_SECURITY_SELINUX_DISABLE\n\tbool disabled;\n#endif\n#ifdef CONFIG_SECURITY_SELINUX_DEVELOP\n\tbool enforcing;\n#endif\n\tbool checkreqprot;\n\tbool initialized;\n\tbool policycap[__POLICYDB_CAP_MAX];\n\n\tstruct page *status_page;\n\tstruct mutex status_lock;\n\n\tstruct selinux_avc *avc;\n\tstruct selinux_policy __rcu *policy;\n\tstruct mutex policy_mutex;\n} __randomize_layout;\n</code></pre>\n<p>From the above, we can see that if the kernel configuration has <code>CONFIG_SECURITY_SELINUX_DEVELOP</code> enabled, the structure would have a boolean variable <code>enforcing</code>, which controls the enforcement status of SELinux at runtime. This is exactly what the above <code>$ sudo getenforce</code> command returns. We can double check that the Debian kernel indeed has the configuration option enabled:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep CONFIG_SECURITY_SELINUX_DEVELOP /boot/config-`uname -r`\nCONFIG_SECURITY_SELINUX_DEVELOP=y\n</code></pre>\n<p>Good! Now that we have a variable in the kernel, which is responsible for some security enforcement, we can try to attack it. One problem though is the <code>__randomize_layout</code> attribute: since <code>CONFIG_SECURITY_SELINUX_DISABLE</code> is actually not set for our Debian kernel, normally <code>enforcing</code> would be the first member of the struct. Thus if we know where the struct is, we immediately know the position of the <code>enforcing</code> flag. With <code>__randomize_layout</code>, during kernel compilation the compiler might place members at arbitrary positions within the struct, so it is harder to create generic exploits. But arbitrary struct randomization within the kernel <a href=\"https://elixir.bootlin.com/linux/v6.1.76/source/security/Kconfig.hardening#L301\">may introduce performance impact</a>, so is often disabled and it is disabled for the Debian kernel:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep RANDSTRUCT /boot/config-`uname -r`\nCONFIG_RANDSTRUCT_NONE=y\n</code></pre>\n<p>We can also confirm the compiled position of the <code>enforcing</code> flag using the <a href=\"https://git.kernel.org/pub/scm/devel/pahole/pahole.git/\">pahole tool</a> and either kernel debug symbols, if available, or (on modern kernels, if enabled) in-kernel <a href=\"https://www.kernel.org/doc/html/next/bpf/btf.html\">BTF</a> information. We will use the latter:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ pahole -C selinux_state /sys/kernel/btf/vmlinux\nstruct selinux_state {\n\tbool                       enforcing;            /*     0     1 */\n\tbool                       checkreqprot;         /*     1     1 */\n\tbool                       initialized;          /*     2     1 */\n\tbool                       policycap[8];         /*     3     8 */\n\n\t/* XXX 5 bytes hole, try to pack */\n\n\tstruct page *              status_page;          /*    16     8 */\n\tstruct mutex               status_lock;          /*    24    32 */\n\tstruct selinux_avc *       avc;                  /*    56     8 */\n\t/* --- cacheline 1 boundary (64 bytes) --- */\n\tstruct selinux_policy *    policy;               /*    64     8 */\n\tstruct mutex               policy_mutex;         /*    72    32 */\n\n\t/* size: 104, cachelines: 2, members: 9 */\n\t/* sum members: 99, holes: 1, sum holes: 5 */\n\t/* last cacheline: 40 bytes */\n};\n</code></pre>\n<p>So <code>enforcing</code> is indeed located at the start of the structure and we don’t even have to be a privileged user to confirm this.</p>\n<p>Great! All we need is the runtime address of the <code>selinux_state</code> variable inside the kernel:<br>\n(shell/bash)</p>\n<pre><code>ignat@dev:~$ sudo grep selinux_state /proc/kallsyms\nffffffffbc3bcae0 B selinux_state\n</code></pre>\n<p>With all the information, we can write an almost textbook simple kernel module to manipulate the SELinux state:</p>\n<p>Mymod.c:</p>\n<pre><code class=\"language-c\">#include &lt;linux/module.h&gt;\n\nstatic int __init mod_init(void)\n{\n\tbool *selinux_enforce = (bool *)0xffffffffbc3bcae0;\n\t*selinux_enforce = false;\n\treturn 0;\n}\n\nstatic void mod_fini(void)\n{\n}\n\nmodule_init(mod_init);\nmodule_exit(mod_fini);\n\nMODULE_DESCRIPTION(&quot;A somewhat malicious module&quot;);\nMODULE_AUTHOR(&quot;Ignat Korchagin &lt;ignat@cloudflare.com&gt;&quot;);\nMODULE_LICENSE(&quot;GPL&quot;);\n</code></pre>\n<p>And the respective <code>Kbuild</code> file:</p>\n<pre><code>obj-m := mymod.o\n</code></pre>\n<p>With these two files we can build a full fledged kernel module according to <a href=\"https://docs.kernel.org/kbuild/modules.html\">the official kernel docs</a>:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ cd mymod/\nignat@dev:~/mymod$ ls\nKbuild  mymod.c\nignat@dev:~/mymod$ make -C /lib/modules/`uname -r`/build M=$PWD\nmake: Entering directory '/usr/src/linux-headers-6.1.0-18-cloud-amd64'\n  CC [M]  /home/ignat/mymod/mymod.o\n  MODPOST /home/ignat/mymod/Module.symvers\n  CC [M]  /home/ignat/mymod/mymod.mod.o\n  LD [M]  /home/ignat/mymod/mymod.ko\n  BTF [M] /home/ignat/mymod/mymod.ko\nSkipping BTF generation for /home/ignat/mymod/mymod.ko due to unavailability of vmlinux\nmake: Leaving directory '/usr/src/linux-headers-6.1.0-18-cloud-amd64'\n</code></pre>\n<p>If we try to load this module now, the system may not allow it due to the SELinux policy:</p>\n<pre><code class=\"language-bash\">ignat@dev:~/mymod$ sudo insmod mymod.ko\ninsmod: ERROR: could not load module mymod.ko: Permission denied\n</code></pre>\n<p>We can workaround it by copying the module into the standard module path somewhere:</p>\n<pre><code class=\"language-bash\">ignat@dev:~/mymod$ sudo cp mymod.ko /lib/modules/`uname -r`/kernel/crypto/\n</code></pre>\n<p>Now let’s try it out:</p>\n<pre><code class=\"language-bash\">ignat@dev:~/mymod$ sudo getenforce\nEnforcing\nignat@dev:~/mymod$ sudo insmod /lib/modules/`uname -r`/kernel/crypto/mymod.ko\nignat@dev:~/mymod$ sudo getenforce\nPermissive\n</code></pre>\n<p>Not only did we disable the SELinux protection via a malicious kernel module, we did it quietly. Normal <code>sudo setenforce 0</code>, even if allowed, would go through the official <a href=\"https://elixir.bootlin.com/linux/v6.1.76/source/security/selinux/selinuxfs.c#L173\">selinuxfs interface and would emit an audit message</a>. Our code manipulated the kernel memory directly, so no one was alerted. This illustrates why uncontrolled kernel module loading is very dangerous and that is why most security standards and commercial security monitoring products advocate for close monitoring of kernel module loading.</p>\n<p>But we don’t need to monitor kernel modules at Cloudflare. Let’s repeat the exercise on a Cloudflare production kernel (module recompilation skipped for brevity):</p>\n<pre><code class=\"language-bash\">ignat@dev:~/mymod$ uname -a\nLinux dev 6.6.17-cloudflare-2024.2.9 #1 SMP PREEMPT_DYNAMIC Mon Sep 27 00:00:00 UTC 2010 x86_64 GNU/Linux\nignat@dev:~/mymod$ sudo insmod /lib/modules/`uname -r`/kernel/crypto/mymod.ko\ninsmod: ERROR: could not insert module /lib/modules/6.6.17-cloudflare-2024.2.9/kernel/crypto/mymod.ko: Key was rejected by service\n</code></pre>\n<p>We get a <code>Key was rejected by service</code> error when trying to load a module, and the kernel log will have the following message:</p>\n<pre><code class=\"language-bash\">ignat@dev:~/mymod$ sudo dmesg | tail -n 1\n[41515.037031] Loading of unsigned module is rejected\n</code></pre>\n<p>This is because the Cloudflare kernel <a href=\"https://elixir.bootlin.com/linux/v6.6.17/source/kernel/module/Kconfig#L211\">requires all the kernel modules to have a valid signature</a>, so we don’t even have to worry about a malicious module being loaded at some point:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep MODULE_SIG_FORCE /boot/config-`uname -r`\nCONFIG_MODULE_SIG_FORCE=y\n</code></pre>\n<p>For completeness it is worth noting that the Debian stock kernel also supports module signatures, but does not enforce it:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep MODULE_SIG /boot/config-6.1.0-18-cloud-amd64\nCONFIG_MODULE_SIG_FORMAT=y\nCONFIG_MODULE_SIG=y\n# CONFIG_MODULE_SIG_FORCE is not set\n…\n</code></pre>\n<p>The above configuration means that the kernel will validate a module signature, if available. But if not - the module will be loaded anyway with a warning message emitted and the <a href=\"https://docs.kernel.org/admin-guide/tainted-kernels.html\">kernel will be tainted</a>.</p>\n<h3 id=\"key-management-for-kernel-module-signing\">Key management for kernel module signing</h3>\n<p>Signed kernel modules are great, but it creates a key management problem: to sign a module we need a signing keypair that is trusted by the kernel. The public key of the keypair is usually directly embedded into the kernel binary, so the kernel can easily use it to verify module signatures. The private key of the pair needs to be protected and secure, because if it is leaked, anyone could compile and sign a potentially malicious kernel module which would be accepted by our kernel.</p>\n<p>But what is the best way to eliminate the risk of losing something? Not to have it in the first place! Luckily the kernel build system <a href=\"https://elixir.bootlin.com/linux/v6.6.17/source/certs/Makefile#L36\">will generate a random keypair</a> for module signing, if none is provided. At Cloudflare, we use that feature to sign all the kernel modules during the kernel compilation stage. When the compilation and signing is done though, instead of storing the key in a secure place, we just destroy the private key:</p>\n<p><img src=\"http://blog.cloudflare.com/content/images/2024/03/image1-19.png\" alt=\"image1-19\" loading=\"lazy\"></p>\n<p>So with the above process:</p>\n<ol>\n<li>The kernel build system generated a random keypair, compiles the kernel and modules</li>\n<li>The public key is embedded into the kernel image, the private key is used to sign all the modules</li>\n<li>The private key is destroyed</li>\n</ol>\n<p>With this scheme not only do we not have to worry about module signing key management, we also use a different key for each kernel we release to production. So even if a particular build process is hijacked and the signing key is not destroyed and potentially leaked, the key will no longer be valid when a kernel update is released.</p>\n<p>There are some flexibility downsides though, as we can’t “retrofit” a new kernel module for an already released kernel (for example, for <a href=\"https://www.cloudflare.com/en-gb/press-releases/2023/cloudflare-powers-hyper-local-ai-inference-with-nvidia/\">a new piece of hardware we are adopting</a>). However, it is not a practical limitation for us as we release kernels often (roughly every week) to keep up with a steady stream of bug fixes and vulnerability patches in the Linux Kernel.</p>\n<h2 id=\"kexec\">KEXEC</h2>\n<p><a href=\"https://en.wikipedia.org/wiki/Kexec\">KEXEC</a> (or <code>kexec_load()</code>) is an interesting system call in Linux, which allows for one kernel to directly execute (or jump to) another kernel. The idea behind this is to switch/update/downgrade kernels faster without going through a full reboot cycle to minimize the potential system downtime. However, it was developed quite a while ago, when secure boot and system integrity was not quite a concern. Therefore its original design has security flaws and is known to be able to <a href=\"https://mjg59.dreamwidth.org/28746.html\">bypass secure boot and potentially compromise system integrity</a>.</p>\n<p>We can see the problems just based on the <a href=\"https://man7.org/linux/man-pages/man2/kexec_load.2.html\">definition of the system call itself</a>:</p>\n<pre><code class=\"language-c\">struct kexec_segment {\n\tconst void *buf;\n\tsize_t bufsz;\n\tconst void *mem;\n\tsize_t memsz;\n};\n...\nlong kexec_load(unsigned long entry, unsigned long nr_segments, struct kexec_segment *segments, unsigned long flags);\n</code></pre>\n<p>So the kernel expects just a collection of buffers with code to execute. Back in those days there was not much desire to do a lot of data parsing inside the kernel, so the idea was to parse the to-be-executed kernel image in user space and provide the kernel with only the data it needs. Also, to switch kernels live, we need an intermediate program which would take over while the old kernel is shutting down and the new kernel has not yet been executed. In the kexec world this program is called <a href=\"https://git.kernel.org/pub/scm/utils/kernel/kexec/kexec-tools.git/tree/purgatory\">purgatory</a>. Thus the problem is evident: we give the kernel a bunch of code and it will happily execute it at the highest privilege level. But instead of the original kernel or purgatory code, we can easily provide code similar to the one demonstrated earlier in this post, which disables SELinux (or does something else to the kernel).</p>\n<p>At Cloudflare we have had <code>kexec_load()</code> disabled for some time now just because of this. The advantage of faster reboots with kexec comes with <a href=\"https://elixir.bootlin.com/linux/v6.6.17/source/kernel/Kconfig.kexec#L30\">a (small) risk of improperly initialized hardware</a>, so it was not worth using it even without the security concerns. However, kexec does provide one useful feature — it is the foundation of the Linux kernel <a href=\"https://docs.kernel.org/admin-guide/kdump/kdump.html\">crashdumping solution</a>. In a nutshell, if a kernel crashes in production (due to a bug or some other error), a backup kernel (previously loaded with kexec) can take over, collect and save the memory dump for further investigation. This allows to more effectively investigate kernel and other issues in production, so it is a powerful tool to have.</p>\n<p>Luckily, since the <a href=\"https://mjg59.dreamwidth.org/28746.html\">original problems with kexec were outlined</a>, Linux developed an alternative <a href=\"https://elixir.bootlin.com/linux/v6.6.17/source/kernel/Kconfig.kexec#L36\">secure interface for kexec</a>: instead of buffers with code it expects file descriptors with the to-be-executed kernel image and initrd and does parsing inside the kernel. Thus, only a valid kernel image can be supplied. On top of this, we can <a href=\"https://elixir.bootlin.com/linux/v6.6.17/source/kernel/Kconfig.kexec#L48\">configure</a> and <a href=\"https://elixir.bootlin.com/linux/v6.6.17/source/kernel/Kconfig.kexec#L62\">require</a> kexec to ensure the provided images are properly signed, so only authorized code can be executed in the kexec scenario. A secure configuration for kexec looks something like this:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep KEXEC /boot/config-`uname -r`\nCONFIG_KEXEC_CORE=y\nCONFIG_HAVE_IMA_KEXEC=y\n# CONFIG_KEXEC is not set\nCONFIG_KEXEC_FILE=y\nCONFIG_KEXEC_SIG=y\nCONFIG_KEXEC_SIG_FORCE=y\nCONFIG_KEXEC_BZIMAGE_VERIFY_SIG=y\n…\n</code></pre>\n<p>Above we ensure that the legacy <code>kexec_load()</code> system call is disabled by disabling <code>CONFIG_KEXEC</code>, but still can configure Linux Kernel crashdumping via the new <code>kexec_file_load()</code> system call via <code>CONFIG_KEXEC_FILE=y</code> with enforced signature checks (<code>CONFIG_KEXEC_SIG=y</code> and <code>CONFIG_KEXEC_SIG_FORCE=y</code>).</p>\n<p>Note that stock Debian kernel has the legacy <code>kexec_load()</code> system call enabled and does not enforce signature checks for <code>kexec_file_load()</code> (similar to module signature checks):</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep KEXEC /boot/config-6.1.0-18-cloud-amd64\nCONFIG_KEXEC=y\nCONFIG_KEXEC_FILE=y\nCONFIG_ARCH_HAS_KEXEC_PURGATORY=y\nCONFIG_KEXEC_SIG=y\n# CONFIG_KEXEC_SIG_FORCE is not set\nCONFIG_KEXEC_BZIMAGE_VERIFY_SIG=y\n…\n</code></pre>\n<h2 id=\"kernel-address-space-layout-randomization-kaslr\">Kernel Address Space Layout Randomization (KASLR)</h2>\n<p>Even on the stock Debian kernel if you try to repeat the exercise we described in the “Secure boot” section of this post after a system reboot, you will likely see it would fail to disable SELinux now. This is because we hardcoded the kernel address of the <code>selinux_state</code> structure in our malicious kernel module, but the address changed now:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ sudo grep selinux_state /proc/kallsyms\nffffffffb41bcae0 B selinux_state\n</code></pre>\n<p><a href=\"https://docs.kernel.org/security/self-protection.html#kernel-address-space-layout-randomization-kaslr\">Kernel Address Space Layout Randomization (or KASLR)</a> is a simple concept: it slightly and randomly shifts the kernel code and data on each boot:</p>\n<p><img src=\"http://blog.cloudflare.com/content/images/2024/03/Screenshot-2024-03-06-at-13.53.23-2.png\" alt=\"Screenshot-2024-03-06-at-13.53.23-2\" loading=\"lazy\"></p>\n<p>This is to combat targeted exploitation (like the malicious module in this post) based on the knowledge of the location of internal kernel structures and code. It is especially useful for popular Linux distribution kernels, like the Debian one, because most users use the same binary and anyone can download the debug symbols and the System.map file with all the addresses of the kernel internals. Just to note: it will not prevent the module loading and doing harm, but it will likely not achieve the targeted effect of disabling SELinux. Instead, it will modify a random piece of kernel memory potentially causing the kernel to crash.</p>\n<p>Both the Cloudflare kernel and the Debian one have this feature enabled:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep RANDOMIZE_BASE /boot/config-`uname -r`\nCONFIG_RANDOMIZE_BASE=y\n</code></pre>\n<h3 id=\"restricted-kernel-pointers\">Restricted kernel pointers</h3>\n<p>While KASLR helps with targeted exploits, it is quite easy to bypass since everything is shifted by a single random offset as shown on the diagram above. Thus if the attacker knows at least one runtime kernel address, they can recover this offset by subtracting the runtime address from the compile time address of the same symbol (function or data structure) from the kernel’s System.map file. Once they know the offset, they can recover the addresses of all other symbols by adjusting them by this offset.</p>\n<p>Therefore, modern kernels take precautions not to leak kernel addresses at least to unprivileged users. One of the main tunables for this is the <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/sysctl/kernel.html#kptr-restrict\">kptr_restrict sysctl</a>. It is a good idea to set it at least to <code>1</code> to not allow regular users to see kernel pointers:<br>\n(shell/bash)</p>\n<pre><code>ignat@dev:~$ sudo sysctl -w kernel.kptr_restrict=1\nkernel.kptr_restrict = 1\nignat@dev:~$ grep selinux_state /proc/kallsyms\n0000000000000000 B selinux_state\n</code></pre>\n<p>Privileged users can still see the pointers:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ sudo grep selinux_state /proc/kallsyms\nffffffffb41bcae0 B selinux_state\n</code></pre>\n<p>Similar to <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/sysctl/kernel.html#kptr-restrict\">kptr_restrict sysctl</a> there is also <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/sysctl/kernel.html#dmesg-restrict\">dmesg_restrict</a>, which if set, would prevent regular users from reading the kernel log (which may also leak kernel pointers via its messages). While you need to explicitly set <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/sysctl/kernel.html#kptr-restrict\">kptr_restrict sysctl</a> to a non-zero value on each boot (or use some system sysctl configuration utility, like <a href=\"https://www.freedesktop.org/software/systemd/man/latest/systemd-sysctl.service.html\">this one</a>), you can configure <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/sysctl/kernel.html#dmesg-restrict\">dmesg_restrict</a> initial value via the <code>CONFIG_SECURITY_DMESG_RESTRICT</code> kernel configuration option. Both the Cloudflare kernel and the Debian one enforce <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/sysctl/kernel.html#dmesg-restrict\">dmesg_restrict</a> this way:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep CONFIG_SECURITY_DMESG_RESTRICT /boot/config-`uname -r`\nCONFIG_SECURITY_DMESG_RESTRICT=y\n</code></pre>\n<p>Worth noting that <code>/proc/kallsyms</code> and the kernel log are not the only sources of potential kernel pointer leaks. There is a lot of legacy in the Linux kernel and [new sources are continuously being found and patched]. That’s why it is very important to stay up to date with the latest kernel bugfix releases.</p>\n<h2 id=\"lockdown-lsm\">Lockdown LSM</h2>\n<p><a href=\"https://www.kernel.org/doc/html/latest/admin-guide/LSM/index.html\">Linux Security Modules (LSM)</a> is a hook-based framework for implementing security policies and Mandatory Access Control in the Linux Kernel. We have [covered our usage of another LSM module, BPF-LSM, previously].</p>\n<p>BPF-LSM is a useful foundational piece for our kernel security, but in this post we want to mention another useful LSM module we use — <a href=\"https://man7.org/linux/man-pages/man7/kernel_lockdown.7.html\">the Lockdown LSM</a>. Lockdown can be in three states (controlled by the <code>/sys/kernel/security/lockdown</code> special file):</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ cat /sys/kernel/security/lockdown\n[none] integrity confidentiality\n</code></pre>\n<p><code>none</code> is the state where nothing is enforced and the module is effectively disabled. When Lockdown is in the <code>integrity</code> state, the kernel tries to prevent any operation, which may compromise its integrity. We already covered some examples of these in this post: loading unsigned modules and executing unsigned code via KEXEC. But there are other potential ways (which are mentioned in <a href=\"https://man7.org/linux/man-pages/man7/kernel_lockdown.7.html\">the LSM’s man page</a>), all of which this LSM tries to block. <code>confidentiality</code> is the most restrictive mode, where Lockdown will also try to prevent any information leakage from the kernel. In practice this may be too restrictive for server workloads as it blocks all runtime debugging capabilities, like <code>perf</code> or eBPF.</p>\n<p>Let’s see the Lockdown LSM in action. On a barebones Debian system the initial state is <code>none</code> meaning nothing is locked down:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ uname -a\nLinux dev 6.1.0-18-cloud-amd64 #1 SMP PREEMPT_DYNAMIC Debian 6.1.76-1 (2024-02-01) x86_64 GNU/Linux\nignat@dev:~$ cat /sys/kernel/security/lockdown\n[none] integrity confidentiality\n</code></pre>\n<p>We can switch the system into the <code>integrity</code> mode:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ echo integrity | sudo tee /sys/kernel/security/lockdown\nintegrity\nignat@dev:~$ cat /sys/kernel/security/lockdown\nnone [integrity] confidentiality\n</code></pre>\n<p>It is worth noting that we can only put the system into a more restrictive state, but not back. That is, once in <code>integrity</code> mode we can only switch to <code>confidentiality</code> mode, but not back to <code>none</code>:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ echo none | sudo tee /sys/kernel/security/lockdown\nnone\ntee: /sys/kernel/security/lockdown: Operation not permitted\n</code></pre>\n<p>Now we can see that even on a stock Debian kernel, which as we discovered above, does not enforce module signatures by default, we cannot load a potentially malicious unsigned kernel module anymore:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ sudo insmod mymod/mymod.ko\ninsmod: ERROR: could not insert module mymod/mymod.ko: Operation not permitted\n</code></pre>\n<p>And the kernel log will helpfully point out that this is due to Lockdown LSM:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ sudo dmesg | tail -n 1\n[21728.820129] Lockdown: insmod: unsigned module loading is restricted; see man kernel_lockdown.7\n</code></pre>\n<p>As we can see, Lockdown LSM helps to tighten the security of a kernel, which otherwise may not have other enforcing bits enabled, like the stock Debian one.</p>\n<p>If you compile your own kernel, you can go one step further and set <a href=\"https://elixir.bootlin.com/linux/v6.6.17/source/security/lockdown/Kconfig#L33\">the initial state of the Lockdown LSM to be more restrictive than none from the start</a>. This is exactly what we did for the Cloudflare production kernel:</p>\n<pre><code class=\"language-bash\">ignat@dev:~$ grep LOCK_DOWN /boot/config-6.6.17-cloudflare-2024.2.9\n# CONFIG_LOCK_DOWN_KERNEL_FORCE_NONE is not set\nCONFIG_LOCK_DOWN_KERNEL_FORCE_INTEGRITY=y\n# CONFIG_LOCK_DOWN_KERNEL_FORCE_CONFIDENTIALITY is not set\n</code></pre>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>In this post we reviewed some useful Linux kernel security configuration options we use at Cloudflare. This is only a small subset, and there are many more available and even more are being constantly developed, reviewed, and improved by the Linux kernel community. We hope that this post will shed some light on these security features and that, if you haven’t already, you may consider enabling them in your Linux systems.</p>\n<!--kg-card-end: markdown--><h2 id=\"watch-on-cloudflare-tv\">Watch on Cloudflare TV</h2><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\">\n  <iframe\n    src=\"https://customer-rhnwzxvb3mg4wz3v.cloudflarestream.com/8c7fe2111ec8058f8159e90d8709e49a/iframe?preload=true&poster=https%3A%2F%2Fcustomer-rhnwzxvb3mg4wz3v.cloudflarestream.com%2F8c7fe2111ec8058f8159e90d8709e49a%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D%26height%3D600\"\n    loading=\"lazy\"\n    style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\"\n    allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\"\n    allowfullscreen=\"true\"\n  ></iframe>\n</div><!--kg-card-end: html--><p>Tune in for more news, announcements and thought-provoking discussions! Don't miss the full <a href=\"https://cloudflare.tv/shows/security-week\">Security Week hub page</a>.</p>",
		"comment_id": "65e86cb7a5fcdf000a08a125",
		"feature_image": "http://blog.cloudflare.com/content/images/2024/03/image2-14.png",
		"featured": false,
		"visibility": "public",
		"created_at": "2024-03-06T13:16:39.000+00:00",
		"updated_at": "2024-03-06T17:15:56.000+00:00",
		"published_at": "2024-03-06T14:00:43.000+00:00",
		"custom_excerpt": "This post illustrates some of the Linux Kernel features, which are helping us to keep our production systems more secure. We will deep dive into how they work and why you may consider enabling them as well",
		"codeinjection_head": null,
		"codeinjection_foot": null,
		"custom_template": null,
		"canonical_url": null,
		"authors": [
			{
				"id": "5d1644b141acde0011a94fbc",
				"name": "Ignat Korchagin",
				"slug": "ignat",
				"profile_image": "http://blog.cloudflare.com/content/images/2018/02/AAEAAQAAAAAAAAepAAAAJGI3NzA4ZDQxLTE1NTYtNDNlNi05M2NjLTE4NDE3ZTE3OWEyZg.jpg",
				"cover_image": "http://blog.cloudflare.com/content/images/2018/08/general@2x-83.png",
				"bio": null,
				"website": null,
				"location": null,
				"facebook": null,
				"twitter": "@ignatkn",
				"meta_title": null,
				"meta_description": null,
				"url": "http://blog.cloudflare.com/author/ignat/"
			}
		],
		"tags": [
			{
				"id": "65e86d1ca5fcdf000a08a12e",
				"name": "#BLOG-2289",
				"slug": "hash-blog-2289",
				"description": null,
				"feature_image": null,
				"visibility": "internal",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/404/"
			},
			{
				"id": "6057788c17ca5101ba6f1a7d",
				"name": "Security Week",
				"slug": "security-week",
				"description": null,
				"feature_image": "http://blog.cloudflare.com/content/images/2024/03/image4-2.png",
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/security-week/"
			},
			{
				"id": "5d16450341acde0011a951ff",
				"name": "Linux",
				"slug": "linux",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/linux/"
			},
			{
				"id": "5d3a2e0f7eefa70505e91e40",
				"name": "Kernel",
				"slug": "kernel",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/kernel/"
			},
			{
				"id": "5d16450341acde0011a9531b",
				"name": "Deep Dive",
				"slug": "deep-dive",
				"description": null,
				"feature_image": "http://blog.cloudflare.com/content/images/2023/08/CloudflareBlog-DeepDive.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Deep Dive",
				"meta_description": "Collection of Cloudflare blog posts tagged 'Deep Dive'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/deep-dive/"
			},
			{
				"id": "5d16450341acde0011a95265",
				"name": "Security",
				"slug": "security",
				"description": null,
				"feature_image": "http://blog.cloudflare.com/content/images/2020/10/Security.png",
				"visibility": "public",
				"meta_title": "Cloudflare Blog: Security",
				"meta_description": "Collection of Cloudflare blog posts tagged 'Security'.",
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/security/"
			},
			{
				"id": "65c0d31851a92e000adeae66",
				"name": "#front-page",
				"slug": "hash-front-page",
				"description": null,
				"feature_image": null,
				"visibility": "internal",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/404/"
			}
		],
		"primary_author": {
			"id": "5d1644b141acde0011a94fbc",
			"name": "Ignat Korchagin",
			"slug": "ignat",
			"profile_image": "http://blog.cloudflare.com/content/images/2018/02/AAEAAQAAAAAAAAepAAAAJGI3NzA4ZDQxLTE1NTYtNDNlNi05M2NjLTE4NDE3ZTE3OWEyZg.jpg",
			"cover_image": "http://blog.cloudflare.com/content/images/2018/08/general@2x-83.png",
			"bio": null,
			"website": null,
			"location": null,
			"facebook": null,
			"twitter": "@ignatkn",
			"meta_title": null,
			"meta_description": null,
			"url": "http://blog.cloudflare.com/author/ignat/"
		},
		"primary_tag": null,
		"url": "http://blog.cloudflare.com/linux-kernel-hardening/",
		"excerpt": "This post illustrates some of the Linux Kernel features, which are helping us to keep our production systems more secure. We will deep dive into how they work and why you may consider enabling them as well",
		"reading_time": 14,
		"access": true,
		"comments": false,
		"og_image": "http://blog.cloudflare.com/content/images/2024/03/Linux-kernel-security-tunables-everyone-should-consider-adopting-OG-1.png",
		"og_title": null,
		"og_description": null,
		"twitter_image": "http://blog.cloudflare.com/content/images/2024/03/Linux-kernel-security-tunables-everyone-should-consider-adopting-OG.png",
		"twitter_title": null,
		"twitter_description": null,
		"meta_title": null,
		"meta_description": "This post illustrates some of the Linux Kernel features, which are helping us to keep our production systems more secure. We will deep dive into how they work and why you may consider enabling them as well.",
		"email_subject": null,
		"frontmatter": null,
		"feature_image_alt": "Linux kernel security tunables everyone should consider adopting",
		"feature_image_caption": null
	}
}