{
	"initialReadingTime": "8",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"ja-jp",
		"ko-kr",
		"es-es",
		"id-id",
		"th-th"
	],
	"post": {
		"authors": [
			{
				"name": "Achiel van der Mandele",
				"slug": "achiel",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4PBX0l9SGxPiGW7UUCNph8/90c2377644585122570125a7707978aa/achiel.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Annika Garbers",
				"slug": "annika",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6SY53ZloWPZ3xlkvdwhfNZ/17f85d5432fafbd717b7c2fc9b593dd4/annika.png",
				"location": null,
				"website": null,
				"twitter": "@annikagarbers",
				"facebook": null
			}
		],
		"excerpt": "Magic WAN provides secure, performant connectivity and routing for your entire corporate network, reducing cost and operational complexity.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6E88lmxDgMO7Lp5r9sSfxG/9f42fb28a939945dc378a469cd9ae671/magic-wan-firewall.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6kWen07j6aMYOHvDHvd54w/a9a1b0c07afb083e6e1f45cab93b06fb/Magic-WAN-blog-preview-4.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"628\" loading=\"lazy\"/>\n            \n            </figure><p>Back in October 2020, we introduced <a href=\"/cloudflare-one/\">Cloudflare One</a>, our vision for the future of <a href=\"https://www.cloudflare.com/learning/network-layer/network-security/\">corporate networking and security</a>. Since then, we’ve been laser-focused on delivering more pieces of this platform, and today we’re excited to announce two of its most foundational aspects: <a href=\"http://www.cloudflare.com/magic-wan\">Magic WAN</a> and Magic Firewall. Magic WAN provides secure, performant connectivity and routing for your entire corporate network, reducing cost and operational complexity. Magic Firewall integrates smoothly with Magic WAN, enabling you to enforce network firewall policies at the edge, across traffic from any entity within your network.</p><h3>Traditional network architecture doesn’t solve today’s problems</h3><p>Enterprise networks have historically adopted one of a few models, which were designed to enable <a href=\"https://www.cloudflare.com/learning/security/what-is-information-security/\">secure information flow</a> between offices and data centers, with access to the Internet locked down and managed at <a href=\"https://www.cloudflare.com/learning/access-management/what-is-the-network-perimeter/\">office perimeters</a>. As applications moved to the cloud and employees moved out of offices, these designs stopped working, and band-aid solutions like VPN boxes don’t solve the core problems with <a href=\"https://www.cloudflare.com/learning/network-layer/enterprise-networking/\">enterprise network architecture</a>.</p><p>On the connectivity side, full mesh <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-mpls/\">MPLS (multiprotocol label switching) networks</a> are expensive and time consuming to deploy, challenging to maintain, exponentially hard to scale, and often have major gaps in visibility. Other architectures require backhauling traffic through central locations before sending it back to the source, which introduces unacceptable latency penalties and necessitates purchasing costly hub hardware for maximum capacity rather than actual utilization. And most customers we’ve talked to are struggling with the worst of both worlds: a combination of impossible-to-manage architectures stitched together over years or decades. Security architects also struggle with these models - they have to juggle a stack of security hardware boxes from different vendors and trade off cost, performance, and security as their network grows.</p><h3>Move your network perimeter to the edge and secure it as a service</h3><p>With Magic WAN, you can securely connect any traffic source - data centers, offices, devices, cloud properties - to Cloudflare’s network and configure routing policies to get the bits where they need to go, all within one SaaS solution. Magic WAN supports a variety of on-ramps including <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-gre-tunneling/\">Anycast GRE tunnels</a>, <a href=\"https://www.cloudflare.com/network-interconnect/\">Cloudflare Network Interconnect</a>, <a href=\"https://www.cloudflare.com/products/argo-tunnel/\">Argo Tunnel</a>, <a href=\"/warp-for-desktop\">WARP</a>, and a variety of <a href=\"/network-onramp-partnerships\">Network On-ramp Partners</a>. No more MPLS expense or lead times, no more performance penalties from traffic trombones, and no more nightmare of managing a tangle of legacy solutions: instead, use Cloudflare’s global Anycast network as an extension of yours, and get better performance and visibility built-in.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2ld2gNBj2OfGU41qVEztvX/2ed9b48b8fb874590f58ab3f376e8c46/image4-21.png\" alt=\"\" class=\"kg-image\" width=\"899\" height=\"730\" loading=\"lazy\"/>\n            \n            </figure><p>Once your traffic is connected to Cloudflare, how do you control which entities within your network are allowed to interact with each other, or the Internet? This is where Magic Firewall comes in. Magic Firewall allows you to centrally manage policy across your entire network, all at the edge as a service. Magic Firewall gives you fine-grained control over which data is allowed in and out of your network, or inside your network. Even better, you get visibility into exactly how traffic is flowing through your network from a single dashboard.</p><p>Magic WAN provides the foundation for the broad suite of functions included in Cloudflare One, which were all built in software from the ground up to scale and integrate smoothly. Magic Firewall is available for Magic WAN out of the box, and customers can easily activate additional <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust security</a> and performance features such as our <a href=\"https://www.cloudflare.com/teams/\">Secure Web Gateway</a> with <a href=\"https://www.cloudflare.com/learning/access-management/what-is-browser-isolation/\">remote browser isolation</a>, <a href=\"/one-more-zero-trust-thing-cloudflare-intrusion-detection/\">Intrusion Detection System</a>, Smart Routing, and more.</p><blockquote><p><i>“Our network team is excited by Magic WAN. Cloudflare has built a global network-as-a-service platform that will help network teams manage complex edge and multi-cloud environments much more efficiently. Operating a single global WAN with built-in security and fast routing functionality — regardless of the HQ, data center, branch office, or end user location — is a game-changer in WAN technology.”— Sander Petersson, Head of Infrastructure, FlightRadar24</i></p></blockquote><p>What does this look like concretely? Let&#39;s explore some ways you can use Magic WAN and Magic Firewall to <a href=\"https://www.cloudflare.com/network-services/solutions/enterprise-network-security/\">solve problems in enterprise networking and security</a> with an example customer, Acme Corp.</p><h3>Replace MPLS between branch offices &amp; data centers</h3><p>Today, Acme Corp has offices around the world that are each connected to regional data centers and to each other with MPLS. Each data center, which hosts corporate applications and a stack of hardware boxes to keep them secure, also has leased line connectivity to at least one other data center. Acme is also migrating some applications to the cloud, and they’re planning to establish direct connections from their data centers to cloud providers to boost security and reliability.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2YQH7Wz81UKrcKrHcpGzAd/b24919daa36b1b469fc3c2b2f09088ec/image6-8.png\" alt=\"\" class=\"kg-image\" width=\"892\" height=\"736\" loading=\"lazy\"/>\n            \n            </figure><p>As Acme has grown, one of their network team&#39;s most consistent pain points is managing and maintaining their MPLS connectivity. It&#39;s expensive and deployment requires long lead times, limiting Acme’s speed of expanding into new locations (especially internationally) or supporting offices added through acquisitions. Employees in Acme’s offices connecting to cloud providers and SaaS apps experience frustrating latency, since traffic hairpins through an Acme data center for security policies enforced through a stack of hardware boxes before being sent to its destination. Traffic between offices, such as IP telephony and video conferencing, doesn’t have any security policies applied to it, presenting a gap in Acme’s security posture.</p><p>Just as they&#39;re working on transitioning to the cloud for compute and storage, Acme wants to migrate away from these private links and instead leverage the Internet, securely, for connectivity. They considered establishing fully meshed site-to-site IPSec VPN tunnels over the Internet, but the complexity strained their networking team as well as their heterogeneous router deployments. Magic WAN is ready to meet them where they are today, simplifying network management and delivering immediate performance benefits, as well as enabling Acme&#39;s gradual transition away from MPLS.</p><p>In this example deployment with Magic WAN, Acme connects each office and VPC to Cloudflare with Anycast GRE tunnels. With this architecture, Acme only needs to set up a single tunnel for each site/Internet connection in order to automatically receive connectivity to Cloudflare&#39;s entire global network (200+ cities in 100+ countries around the world) - like a hub and spoke architecture, except the hub is everywhere. Acme also chooses to establish dedicated private connectivity from their data centers with <a href=\"https://www.cloudflare.com/network-interconnect/\">Cloudflare Network Interconnect</a>, enabling even more secure and reliable traffic delivery and great connectivity to other networks/cloud providers through Cloudflare’s <a href=\"https://www.peeringdb.com/net/4224\">highly interconnected</a> network.</p><p>Once these tunnels are established, Acme can configure allowed routes for traffic within their private network (RFC 1918 space), and Cloudflare gets the traffic where it needs to go, providing resiliency and traffic optimization. With an easy setup process that takes only a few hours, Acme Corp can start their migration away from MPLS. And as new Cloudflare One capabilities like QoS and Argo for Networks are introduced, Acme’s network performance and reliability will continue to improve.</p><h3>Secure remote employee access to private networks</h3><p>When Acme Corp&#39;s employees abruptly transitioned to working remotely last year due to the COVID-19 pandemic, Acme&#39;s IT organization scrambled to find short term fixes to maintain employee access to internal resources. Their legacy VPNs didn&#39;t hold up - Acme employees working from home struggled with connectivity, reliability, and performance issues as appliances were pushed beyond the limits they were designed for.</p><p>Thankfully, there&#39;s a better solution! Acme Corp can use Cloudflare for Teams and Magic WAN to provide a secure way for employees to access resources behind private networks from their devices, wherever they&#39;re working. Acme employees install the WARP client on their devices to send traffic to Cloudflare&#39;s network, where it can be authenticated and routed to private resources in data centers or VPCs that are connected to Cloudflare via GRE tunnel (shown in the previous example), Argo Tunnel, Cloudflare Network Interconnect, or IPSec (coming soon). This architecture solves the performance and capacity issues Acme experienced with their legacy VPNs - rather than sending all traffic through single choke point devices, it’s routed to the closest Cloudflare location where policy is applied at the edge before being sent along an optimized path to its destination.</p><p>Traffic from Acme Corp&#39;s employee devices, data centers and offices will also be able to be policed by Magic Firewall for powerful, granular policy control that&#39;s enforced across all &quot;on-ramps.&quot; Whether employees are connecting from their phones and laptops or working from Acme offices, the same policies can be applied in the same place. This simplifies configuration and improves visibility for Acme&#39;s IT and security teams, who will be able to log into the Cloudflare dashboard to see and control policies in one place - a game changer compared to managing employee access across different VPNs, firewalls, and cloud services.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2bKIu94AdaXlZTDHf9gJWE/b8269cd813934db33dab942765cf8ff6/image2-22.png\" alt=\"\" class=\"kg-image\" width=\"1257\" height=\"499\" loading=\"lazy\"/>\n            \n            </figure><p>This solution allows Acme to transition away from their VPN, firewall, and <a href=\"https://www.cloudflare.com/learning/access-management/what-is-a-secure-web-gateway/\">secure web gateway appliances</a>, improving performance and enabling easy policy management across traffic from wherever their employees are working.</p><h3>Migrate network and security functions to the edge</h3><p>Historically, Acme relied on stacks of hardware appliances in physical offices and data centers to enforce <a href=\"https://www.cloudflare.com/network-security/\">network security</a> and get visibility into what’s happening on the network: specialized firewalls to inspect inbound or outbound traffic, intrusion detection systems and <a href=\"https://www.cloudflare.com/learning/security/what-is-siem/\">SIEMs</a>. As their organization is moving to the cloud and rethinking the future of remote work, the Acme security team is looking for sustainable solutions that improve security, even beyond what used to be possible in their traditional castle-and-moat architecture.</p><p>Previously, we walked through how Acme could configure Magic WAN to send traffic from offices, data centers, cloud properties, and devices to Cloudflare’s network. Once this traffic is flowing through Cloudflare, it’s easy to add access controls and filtering functions to augment or replace on-prem security hardware, all delivered and administered through a single pane of glass.</p><p>With Magic Firewall, customers get a single <a href=\"https://www.cloudflare.com/learning/cloud/what-is-a-cloud-firewall/\">firewall-as-a-service</a> that runs at the edge, replacing clunky boxes they have installed at branch offices or data centers. Magic Firewall allows them to easily manage configuration, but also simplifies compliance auditing.</p><p>To <a href=\"https://www.cloudflare.com/learning/access-management/what-is-access-control/\">control access</a>, customers can put policies in place that determine exactly which traffic is allowed to go where. For example, Acme wants traffic to flow from the Internet to their web servers inside data centers on port 80 and 443, but wants to lock down <a href=\"https://www.cloudflare.com/learning/access-management/what-is-ssh/\">SSH access</a> to only certain private networks inside branch offices.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4GEELEJG2qGSpnjGhgk4Mw/f68a07d110f6c146007968f4d4c14d44/image1-29.png\" alt=\"\" class=\"kg-image\" width=\"1736\" height=\"831\" loading=\"lazy\"/>\n            \n            </figure><p>If Acme wants to go further in locking down their network, they can adopt a Zero Trust access model  with <a href=\"https://www.cloudflare.com/teams/access/\">Access</a> and <a href=\"https://www.cloudflare.com/teams/gateway/\">Gateway</a> to control who can reach what, and how, across all their traffic flowing through the Cloudflare network. As Cloudflare releases new filtering and control functions, like our upcoming IDS/IPS and DLP solutions, Acme can enable them to further increase security with only a few clicks.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3aWN98JS4FlEiH4enUx9QP/0bad3523e0ff54211f23493c390c7279/image5-22.png\" alt=\"\" class=\"kg-image\" width=\"1201\" height=\"709\" loading=\"lazy\"/>\n            \n            </figure><p>Acme’s long-term goal is to transition all security and performance functions to the cloud, consumed as a service. Magic WAN enables a smooth path for this migration, allowing them to gradually deepen their security posture as they retire legacy hardware.</p><blockquote><p><i>Increased cloud adoption along with the recent pivot to remote workers has increased the volume of Internet, SaaS, and IaaS traffic straining traditional network architectures such as MPLS. WAN architectures that offer a global scale, integrated enterprise network security functions, and direct, secure connectivity to remote users are key to organizations looking to increase their operational agility and lower total costs of ownership.— Ghassan Abdo, IDC Research VP, WW Telecom, Virtualization &amp; CDN</i></p></blockquote><h3>Cloudflare’s network as an extension of yours</h3><p>Like many of our products, Cloudflare One started as a collection of solutions to problems that we experienced in growing and securing our own network. Magic WAN and Magic Firewall allow us to extend the benefits of our careful architecture decisions over the past ten years to customers:</p><ul><li><p><b>Global scale &amp; close to eyeballs:</b> wherever your offices, data centers, and users are, we’re close by. We’ve worked hard to establish great connectivity to eyeball networks because of our CDN business, which pays dividends for remote workers who need great connectivity from their homes back to your network. It also means we can stop threats at the edge, close to their source, rather than running the risk of malicious traffic overwhelming capacity-limited on prem appliances.</p></li><li><p><b>Hardware and carrier-agnostic:</b> use whatever hardware you have today to connect to us, and get the benefits of resiliency afforded by our diverse carrier connectivity.</p></li><li><p><b>Built from scratch to work together:</b> we’ve developed our products in software, from the ground up, to integrate easily. We think constantly about how our products can integrate to make each other better as they’re created and evolved.</p></li></ul><h3>Get started today</h3><p>Magic WAN is available in limited beta, and Magic Firewall is generally available for all <a href=\"https://www.cloudflare.com/magic-transit\">Magic Transit</a> customers and included out of the box with Magic WAN. If you’re interested in testing out Magic WAN or want to learn more about how Cloudflare can help your organization replace legacy MPLS architecture, <a href=\"https://www.cloudflare.com/products/zero-trust/remote-workforces/\">secure access for remote workers</a>, and deepen your security posture while reducing total cost of ownership, please <a href=\"https://www.cloudflare.com/magic-wan\">get in touch</a>.</p>",
		"id": "wjmDtPvG1qvzkh0fZl7mo",
		"localeList": {
			"name": "Magic WAN & Magic Firewall: secure network connectivity as a service Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "Translated for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "Translated for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Magic WAN provides secure, performant connectivity and routing for your entire corporate network, reducing cost and operational complexity. Magic Firewall integrates smoothly with Magic WAN, enabling you to enforce network firewall policies at the edge, across traffic from any entity within your network.",
		"metadata": {
			"title": "Magic WAN & Magic Firewall: secure network connectivity as a service",
			"description": "Magic WAN provides secure, performant connectivity and routing for your entire corporate network, reducing cost and operational complexity. Magic Firewall integrates smoothly with Magic WAN, enabling you to enforce network firewall policies at the edge, across traffic from any entity within your network.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/leNBqM59IPW4sMdLKw3Zg/da4c02ca7bce5bc6878cbd194e7a6050/magic-wan-firewall-nXvRRa.png"
		},
		"primary_author": {},
		"published_at": "2021-03-22T13:00:00.000+00:00",
		"slug": "magic-wan-firewall",
		"tags": [
			{
				"id": "4Z2oveL0P0AeqGa5lL4Vo1",
				"name": "Cloudflare One",
				"slug": "cloudflare-one"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "3DmitkNK6euuD5BlhuvOLW",
				"name": "Security Week",
				"slug": "security-week"
			},
			{
				"id": "4zulnloS9YSU4lEkORfTqo",
				"name": "Firewall",
				"slug": "firewall"
			},
			{
				"id": "1U6ifhBwTuaJ2w4pjNOzNT",
				"name": "Network",
				"slug": "network"
			}
		],
		"title": "Magic WAN & Magic Firewall: secure network connectivity as a service",
		"updated_at": "2024-08-27T01:52:36.321Z",
		"url": "https://blog.cloudflare.com/magic-wan-firewall"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}