{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Patrick R. Donahue",
				"slug": "patrick",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1LQFonIW7hvlt7UKRMOzlk/1922ffdb4fc76d32f8d039753ad6eb16/patrick.png",
				"location": "San Francisco, CA",
				"website": "https://www.cloudflare.com",
				"twitter": "@prdonahue",
				"facebook": null
			}
		],
		"excerpt": "Several months ago we started hearing occasional reports from .NET developers that they were having trouble maintaining HTTPS sessions with one of our customer’s websites. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3axBr3KhM3lpCwdtHMpi1U/9469fef2f0dddc898c2b701a2b5d02e3/microsoft-tls-downgrade-schannel-bug.png",
		"featured": false,
		"html": "\n          <div class=\"flex anchor relative\">\n            <h3 id=\"initial-problem-report\">Initial Problem Report</h3>\n            <a href=\"#initial-problem-report\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Several months ago we started hearing occasional reports from .NET developers that they were having trouble maintaining HTTPS sessions with one of our customer’s websites. Establishing connections worked just fine but they would periodically get disconnected, resulting in an exception that crashed their application. Around the same time, we also started hearing reports that two other Microsoft products—Internet Explorer and its heir-apparent, Edge—were also having trouble with our edge.</p><p>Just a few weeks prior, <a href=\"/tls-session-resumption-full-speed-and-secure/\">we had updated</a> our handling of TLS session tickets to be more performant and more secure. We suspected these improvements were the trigger and focused our investigation there. What we learned was that the problem ran much deeper than .NET or IE. It went all the way down to the SChannel security package, which provides TLS functionality for a vast array of Microsoft applications.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"tls-session-tickets\">TLS Session Tickets</h3>\n            <a href=\"#tls-session-tickets\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Before diving into the story further, however, it’s helpful to understand exactly what TLS session tickets are, how they’re beneficial to HTTPS, and what optimizations CloudFlare does to use them at scale. (If you’d like to skip over the primer and jump right to the punchline, go ahead and <a href=\"#renewingsessionticketsornot\">click here</a>.)</p><h4>Overview</h4><p>First introduced in 2006, <a href=\"https://tools.ietf.org/html/rfc4507\">RFC 4507</a> (since deprecated by <a href=\"https://tools.ietf.org/html/rfc5077\">RFC 5077</a>) proposes a &quot;<i>a mechanism that enables the Transport Layer Security (TLS) server to resume sessions and avoid keeping per-client session state</i>&quot;. Before the server can absolve itself of maintaining state, however, it must first &quot;<i>encapsulate session state into a ticket and forward it to the client</i>&quot;.</p><p>The client then saves this ticket and presents it to the server the next time it needs to make an HTTPS request, skipping most of the back-and-forth process that’s initially required to establish a TLS session. Instead of the standard protocol negotiation messages, the two parties perform what’s known as an “abbreviated handshake,” jumping right to using the previously agreed upon session details.</p><p>This shortcut reduces the connection setup time by more than 50%, since the number of round trips was reduced from two to one.</p><p>Note that the lifetime and continued validity of a ticket is up to both the server and the client: the server communicates a “session lifetime hint” to the client, and the client decides if it’s willing to re-use the session all the way until that expiration. If not, or if there’s any doubt about the session integrity, either side can force a full handshake and regenerate a ticket.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"resuming-the-session\">Resuming the Session</h3>\n            <a href=\"#resuming-the-session\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        \n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3VAT8f6rBufmgbfy91WOGY/0982f6da7f028d24b4a8cc39fc57cb87/without-with-resume-2.png\" alt=\"Figure 1 - Full TLS handshake vs. abbreviated TLS handshake\" class=\"kg-image\" width=\"3683\" height=\"1921\" loading=\"lazy\"/>\n            \n            </figure><h5>Figure 1 - Full TLS handshake vs. abbreviated TLS handshake</h5><p>To inform the server that the browser can utilize session tickets (not all can), the connecting user agent must first advertise its support for them—otherwise there’s no point spending cycles on creating and encrypting the ticket. To convey this capability, the client sends an empty value in the session ticket extension of the initial <i>ClientHello</i> message.</p><p>When the server sees this extension, it knows to hold on to the negotiated details of the session such as the TLS protocol version, cipher suite, and the symmetric key used to encrypt both requests and responses. These details are then packed together <a href=\"https://tools.ietf.org/html/rfc5077#section-4\">in a data structure</a>, encrypted with a &quot;session ticket key&quot; that only the server knows, and sent to the client for safe keeping.</p><p>Because the server knows that only it can decrypt and view the ticket contents, it doesn&#39;t need to hold a copy to check for tampering (e.g., improper extension of the session lifetime), and instead relies upon the client to do so. This distributed storage is what makes RFC 5077 session tickets much more scalable than their predecessor, session IDs.</p><h4>The Challenge of Session Tickets at Scale</h4><p>So, an HTTP server encrypts session tickets with a key that only it can access. In CloudFlare’s case, however, &quot;the server&quot; is actually thousands of machines blanketing the world and responding to requests from as close (network-wise) to browsers as possible.</p><p>Each machine in our <a href=\"https://www.cloudflare.com/network-map/\">36 country, 76 datacenter network</a> is designed to handle all types of requests, including SSL/TLS handshakes and the processing of application data. Requests are routed to servers with the least load and away from degraded network conditions (or entire facility outages).</p><p>Transacting with more than one server during a single session should not (and does not) degrade performance: TLS sessions that begin with a full handshake on one server are resumable with an abbreviated handshake on <i>any</i> other server (assuming the client is holding the appropriate ticket, of course). This complicates our session ticket implementation, since it means each machine needs to have instant access to the same session ticket keys.</p><p>A simplistic (read: insecure) approach to this key distribution problem would be to randomly generate this 48-byte key once and add it to the configuration files replicated to each server. On boot, the server would read the key and use it indefinitely to both issue new tickets and decrypt existing ones.</p><p>The most obvious problem with this method (besides the anti-pattern of storing secrets in configuration files) is that the key rarely changes. As a result, the cryptographic property of “forward secrecy” is greatly compromised. Forward secrecy is important because it renders historical captures of encrypted traffic worthless, even if the server’s private key is compromised.</p><h4>Session Tickets at CloudFlare</h4><p>CloudFlare’s solution to this problem, documented in <a href=\"/tls-session-resumption-full-speed-and-secure/\">previous</a> blog <a href=\"/keyless-ssl-the-nitty-gritty-technical-details/\">posts</a>, is to frequently regenerate and synchronize these session ticket keys across our entire global network. We currently do this once per hour.</p><p>This means we need a mechanism for turning over session ticket keys. For instance, if a client instantiates an HTTPS session at 12:00pm and continues using that ticket past 1:00pm, our edge network will re-encrypt the ticket with a brand new session ticket key.</p><p>To accomplish this, our web servers must have both the full history of all previous keys that could have encrypted the ticket (i.e., one per hour dating back to the maximum session lifetime of 64,800 seconds) as well as immediate access to each newly generated key. The previous keys are used exclusively to decrypt tickets presented by the client, while the new keys are used to &quot;refresh&quot; the encryption on existing tickets and encrypt tickets for entirely new sessions.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"back-to-microsoft\">Back to Microsoft</h3>\n            <a href=\"#back-to-microsoft\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>The handling of these previously issued session tickets — re-wrapped with our newly generated key and sent back to the client in an abbreviated handshake — is where we observed every user agent built on Microsoft SChannel break down.</p><h4>Renewing Session Tickets (or not)</h4><p>According to session ticket specification, the server can, for any reason, reject the session ticket presented to it in an abbreviated handshake and force a full negotiation. When it does this, it simply sends the <code>NewSessionTicket</code> message immediately after receiving the <code>Finished</code> message from the client. The client then saves the new ticket and uses it for subsequent requests. This message flow is documented below in Figure 2, and does not present any problems for our customers’ .NET and IE visitors. That is to say, it’s not part of the bug we uncovered.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4PhOpxocO0n4roYPOHxXKh/d61d860040f562302879042b2c4e9237/new-ticket.png\" alt=\"Figure 2 - Server Rejecting Ticket, Performing Full Handshake, and Issuing New Session Ticket\" class=\"kg-image\" width=\"1903\" height=\"1667\" loading=\"lazy\"/>\n            \n            </figure><p>* <i>Indicates optional message</i></p><h5>Figure 2 - Server Rejecting Ticket, Performing Full Handshake, and Issuing New Session Ticket</h5><p>A common example of this behavior is after a restart when the server loses access to all of its existing session keys. Another reason for rejecting and replacing the session ticket sent by the client is so the server can preserve forward secrecy: the shorter the lifetime of the key, the smaller window an attacker has to brute force it and decrypt traffic.</p><p>While forcing a full handshake and sending a new session ticket is one way to cycle the session ticket key, a more efficient approach is to simply decrypt the ticket during an abbreviated handshake, re-encrypt it with the new key, and send it back to the client in the same packet as the <code>Server Hello</code>. From RFC 5077:</p><blockquote><p>If the server successfully verifies the client&#39;s ticket, then it MAY renew the ticket by including a <code>NewSessionTicket</code> handshake message after the <code>ServerHello</code> in the abbreviated handshake. The client should start using the new ticket as soon as possible after it verifies the server&#39;s <code>Finished</code> message for new connections.</p></blockquote><p>This use case is illustrated below, in Figure 3, with <b>emphasis added</b> on the <code>NewSessionTicket</code> message that was problematic for Microsoft:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7s0wxkvufPUGaHuMdBVPME/5d55e22ccf8d1ede5439797946bf05e5/new-ticket-abbreviated.png\" alt=\"Figure 3 - Server Issuing New Session Ticket during Abbreviated Handshake\" class=\"kg-image\" width=\"1903\" height=\"1328\" loading=\"lazy\"/>\n            \n            </figure><h5>Figure 3 - Server Issuing New Session Ticket during Abbreviated Handshake</h5>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"the-problem-with-schannel\">The Problem with SChannel</h3>\n            <a href=\"#the-problem-with-schannel\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>While this &quot;in-line&quot; <code>NewSessionTicket</code> mechanism works without issue in Chrome or Firefox (Safari still does not have RFC 5077 support) it causes all sorts of trouble with user agents built using Microsoft’s SChannel (i.e., all versions of Internet Explorer, Edge, and .NET running on Windows 8, 8.1, Server 2012, Server 2012 R2, RT, RT 8.1, and 10).</p><p>What we found, with excellent troubleshooting help from our good friends mentioned at the end of this post, was that when a Microsoft UA saw the <code>NewSessionTicket</code>, it either immediately aborted the connection and threw an exception (.NET) or it downgraded(!) from TLS 1.2 to TLS 1.0. Clearly, neither scenario is desirable, but the latter is a legitimate security concern: SSL/TLS downgrade attacks have been exploited in the past, and they’ll almost definitely be exploited again in the future.</p><h4>The Nitty Gritty Details</h4><p>For those brave enough to follow along, below is a brief walk through of the packet captures. The first capture, <a href=\"https://www.cloudshark.org/captures/b598840b6c39\">available on</a> <a href=\"http://www.cloudshark.org\">CloudShark</a>, contains a single TCP stream of the initial TLS handshake. The second capture, <a href=\"https://www.cloudshark.org/captures/6180d2f407d1\">also available</a> online, includes both this original stream as well as the second attempt to establish the session. In short, this is what happened:</p><ol><li><p>The client presents an existing session ticket to the server.</p></li><li><p>The server &quot;turns over&quot; the session ticket key.</p></li><li><p>The client aborts the connection when presented with the new ticket.</p></li><li><p>The client downgrades to TLS 1.0 and tries again.</p></li></ol><h5>Part 1: Presenting The Ticket To The Server</h5><p>As can be seen in the following pcap screenshot, the Internet Explorer 11 client (<code>192.168.2.225</code>) initiates an abbreviated TLS handshake by sending a <code>ClientHello</code> to the server (<code>104.16.31.235</code>) containing a non-empty <code>SessionTicket</code> extension.</p><p>Recall that these 192 bytes represent an encrypted data structure that contains, among other details, the lifetime of the session and the cipher suite originally negotiated.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6uQPZ2zgdUe1lCagw2KI1D/9a00541d2ab7afa55932154370639096/cap1.png\" alt=\"\" class=\"kg-image\" width=\"1280\" height=\"1061\" loading=\"lazy\"/>\n            \n            </figure><h5>Part 2: Turning Over The Key</h5><p>Upon receipt of the session ticket from the client, our edge decrypts it and checks to see if the current key is still valid. After determining that the key has expired and should not be used again (other than to decrypt old tickets), it substitutes in a new key that’s used to re-encrypt the ticket and returns it to the client as part of a <code>NewSessionTicket</code> message. All of these steps take place as part of the same abbreviated handshake.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/46VNgizFMZHlfZ3oTg1cYI/56436ab31e538de804eb83ebb3de1bed/cap2.png\" alt=\"\" class=\"kg-image\" width=\"1280\" height=\"1062\" loading=\"lazy\"/>\n            \n            </figure><h5>Part 3: Aborting The Connection</h5><p>Unfortunately, immediately after the IE11 client ACKs the <code>NewSessionTicket</code> record, it responds by shutting down the connection (TCP FIN). The cause of this aborted connection, as later <a href=\"https://technet.microsoft.com/library/security/3109853.aspx\">confirmed by Microsoft</a>, is a bug in their underlying crypto stack, SChannel.</p><p>What’s really interesting is what happens next with the subsequent <code>ClientHello</code>. As shown below, Internet Explorer/SChannel re-establishes the connection by indicating TLS 1.0 (rather than TLS 1.2) is the highest version it supports. As a result, it advertises support for a significantly smaller set of cipher suites (compare the 24 originally presented with the 12 now presented).</p><p>Another difference is that the TLS 1.0 handshake does not support the <code>signature_algorithm</code> extension (<code>0x00d</code>). Included in the TLS 1.2 specification (see <a href=\"https://www.ietf.org/rfc/rfc5246.txt\">RFC 5246</a>), this extension specifies preference-ordered pairs of signature hash algorithms (e.g., SHA-256/RSA, SHA-256/ECDSA) that the user agent can validate. In fact, this is the primary data point that CloudFlare looks at when <a href=\"/sha-1-deprecation-no-browser-left-behind/\">determining whether to serve a SHA-2 or SHA-1</a> certificate to the client.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3hrWoDcov1QRLrRQMAo3Wy/b0f7a48f3488176757903cf4154f392d/cap3.png\" alt=\"\" class=\"kg-image\" width=\"1280\" height=\"1061\" loading=\"lazy\"/>\n            \n            </figure><h5>Part 4: Completing a Downgraded Connection</h5><p>Finally, the TLS 1.0 handshake completes, during which a new session ticket is sent back to the browser—this time as part of a full handshake. SChannel has no issue with full handshakes, so it commences sending application data (e.g., GET and POST requests).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/40cjuNR3tFjQ6VX1A35Yjx/35538701f52dd4718d9913ad1f715911/cap4-1.png\" alt=\"\" class=\"kg-image\" width=\"1280\" height=\"1118\" loading=\"lazy\"/>\n            \n            </figure>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-has-microsoft-done-to-fix\">What has Microsoft done to fix?</h3>\n            <a href=\"#what-has-microsoft-done-to-fix\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>After we reported the issue to them, Microsoft was extremely responsive and quick to dig in on the bug. While I’m sure it didn’t hurt that our head of engineering, <a href=\"/ben-fathi-why-i-joined-cloudflare/\">Ben Fathi</a>, connected us directly with Matt Thomlinson, Microsoft’s VP of Security—a position Ben used to hold (thanks, Ben!)—it is non-trivial to patch the crypto stack <a href=\"https://technet.microsoft.com/library/security/3109853.aspx\">all the way back</a> through Windows 8.</p><p>Nor, as we’ve seen from previous SChannel updates, is it an easy or <a href=\"http://www.gfi.com/blog/fixing-the-fix-microsoft-reissues-schannel-patch/\">necessarily error-free</a> process. We’d like to thank Microsoft and Matt’s team for their sense of urgency in fixing the issue and rapidly communicating out the resolution to their customers.</p><p>Here are the affected platforms (and a link to <a href=\"https://support.microsoft.com/en-us/kb/3109853\">the software updates</a>):</p><ul><li><p>Windows 8 for 32-bit and x64-based Systems</p></li><li><p>Windows 8.1 for 32-bit and x64-based Systems</p></li><li><p>Windows Server 2012 (including Server Core install)</p></li><li><p>Windows Server 2012 R2 (including Server Core install)</p></li><li><p>Windows RT</p></li><li><p>Windows RT 8.1</p></li><li><p>Windows 10 for 32-bit and x64-based Systems</p></li><li><p>Windows 10 Version 1511 for 32-bit and x64-based Systems</p></li></ul><p>Why didn’t this get caught in testing, you might ask? While I don’t know for sure, I suspect Microsoft probably never saw a server &quot;in the wild&quot; (let alone in their test environment) that rotated session ticket keys as aggressively as we do. As Google crypto wiz <a href=\"https://www.imperialviolet.org/2013/06/27/botchingpfs.html\">Adam Langley writes</a>:</p><blockquote><p>So how do you run forward secrecy with several servers and support session tickets? You need to generate session ticket keys randomly, distribute them to the servers without ever touching persistent storage and rotate them frequently. However, I&#39;m not aware of any open source servers that support anything like that.</p></blockquote><p>Fortunately, back in late 2013, CloudFlare <a href=\"https://github.com/nginx/nginx/commit/79be6a5462498af8655aaed141f13a1d2a34abc8\">committed code to nginx</a> that allows it to read in multiple session ticket keys at boot. We then hooked up our own internal nginx instances to a centralized key-value store that’s replicated to each datacenter so we can roll these keys over without changing configuration files (or even restarting the processes). This work allowed us to advance the forward secrecy capabilities of open-source projects handling HTTPS such as <a href=\"http://nginx.org/\">nginx</a>.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"special-thanks\">Special Thanks</h3>\n            <a href=\"#special-thanks\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Ferreting out the low-level technical details of this complex problem (and testing a temporary workaround while Microsoft had a chance to roll out the fix) was supported by a number of folks in the TLS community.</p><p>In particular, I’d like to thank <a href=\"http://twitter.com/ericlaw\">Eric Lawrence</a> of Fiddler fame for having the patience to induce the issue with a packet capture running, Aaron Coleman of <a href=\"https://www.fitabase.com\">Fitabase</a> for providing <a href=\"https://github.com/aarondcoleman/FitbitProxyTest/blob/master/FitbitProxyASPNetCoreFxTest/Controllers/HomeController.cs\">sample code</a> to replicate the issue in .NET, and Jeremiah Lee of <a href=\"https://www.fitbit.com\">Fitbit</a> for support testing the workaround that was implemented by CloudFlare&#39;s <a href=\"https://twitter.com/lziest\">Zi Lin</a>.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"were-hiring\">We're Hiring!</h3>\n            <a href=\"#were-hiring\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Would you like to work on solving interesting problems like this for hundreds of millions of website visitors? If so, you&#39;re in luck: the CloudFlare Security Engineering team is hiring. Apply through <a href=\"https://www.cloudflare.com/join-our-team/\">our career page</a> - we&#39;d love to talk with you.</p>",
		"id": "6KsRWZfCXX9415kO95zWfE",
		"localeList": {
			"name": "Change the (S)Channel! Deconstructing the Microsoft TLS Session Resumption bug Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "The Microsoft TLS library that powers Internet Explorer, Edge, and .NET, can be forced to downgrade from TLS 1.2 to 1.0 when presented with a NewSessionTicket.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2016-02-11T00:49:00.000+00:00",
		"slug": "microsoft-tls-downgrade-schannel-bug",
		"tags": [
			{
				"id": "2pFyOCtANFB5qS6nbtQbVp",
				"name": "Vulnerabilities",
				"slug": "vulnerabilities"
			},
			{
				"id": "5US4l4wdDysuDpZ4ktL3yP",
				"name": "HTTPS",
				"slug": "https"
			},
			{
				"id": "56vA0Z6hqev6QaJBQmO2J8",
				"name": "TLS",
				"slug": "tls"
			},
			{
				"id": "1HblPaFreDjetoJDJPjTAi",
				"name": "SSL",
				"slug": "ssl"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			}
		],
		"title": "Change the (S)Channel! Deconstructing the Microsoft TLS Session Resumption bug",
		"updated_at": "2024-08-27T02:36:11.061Z",
		"url": "https://blog.cloudflare.com/microsoft-tls-downgrade-schannel-bug"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}