{
	"initialReadingTime": "14",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Lukasz Mierzwa",
				"slug": "lukasz",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3ctPUzMNTSvnvNYl9wDRoh/dcb992787e1ed25129d3948bd1e47d77/lukasz.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Pint is a tool we developed to validate our Prometheus alerting rules and ensure they are always working",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/11wTC61pOVXkMqHfVwRSTE/25d6d82982e4e13823e23412721f707b/monitoring-our-monitoring.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1pbd6fdrraXYLC5WKlqz83/37efd1648a5deb1f4be63a9638532663/image1-54.png\" alt=\"Monitoring our monitoring: how we validate our Prometheus alert rules\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><h3>Background</h3><p>We use <a href=\"https://prometheus.io/\">Prometheus</a> as our core monitoring system. We’ve been heavy Prometheus users since 2017 when we migrated off our previous monitoring system which used a customized <a href=\"https://www.nagios.org/\">Nagios</a> setup. Despite growing our infrastructure a lot, adding tons of new products and learning some hard lessons about operating Prometheus at scale, our original architecture of Prometheus (see <a href=\"https://www.youtube.com/watch?v=ypWwvz5t_LE\">Monitoring Cloudflare&#39;s Planet-Scale Edge Network with Prometheus</a> for an in depth walk through) remains virtually unchanged, proving that Prometheus is a solid foundation for building observability into your services.</p><p>One of the key responsibilities of Prometheus is to alert us when something goes wrong and in this blog post we’ll talk about how we make those alerts more reliable - and we’ll introduce an open source tool we’ve developed to help us with that, and share how you can use it too. If you’re not familiar with Prometheus you might want to start by watching <a href=\"https://www.youtube.com/watch?v=PzFUwBflXYc\">this video</a> to better understand the topic we’ll be covering here.</p><p>Prometheus works by collecting metrics from our services and storing those metrics inside its database, called TSDB. We can then <a href=\"https://prometheus.io/docs/prometheus/latest/querying/basics/\">query these metrics</a> using Prometheus query language called PromQL using ad-hoc queries (for example to power <a href=\"https://grafana.com/grafana/\">Grafana dashboards</a>) or via <a href=\"https://prometheus.io/docs/prometheus/latest/configuration/alerting_rules/\">alerting</a> or <a href=\"https://prometheus.io/docs/prometheus/latest/configuration/recording_rules/\">recording</a> rules. A rule is basically a query that Prometheus will run for us in a loop, and when that query returns any results it will either be recorded as new metrics (with recording rules) or trigger alerts (with alerting rules).</p><h3>Prometheus alerts</h3><p>Since we’re talking about improving our alerting we’ll be focusing on alerting rules.</p><p>To create alerts we first need to have some metrics collected. For the purposes of this blog post let’s assume we’re working with http_requests_total metric, which is used on the examples <a href=\"https://prometheus.io/docs/prometheus/latest/querying/examples/\">page</a>. Here are some examples of how our metrics will look:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">http_requests_total{job=&quot;myserver&quot;, handler=&quot;/&quot;, method=”get”, status=”200”}\nhttp_requests_total{job=&quot;myserver&quot;, handler=&quot;/&quot;, method=”get”, status=”500”}\nhttp_requests_total{job=&quot;myserver&quot;, handler=&quot;/posts&quot;, method=”get”, status=”200”}\nhttp_requests_total{job=&quot;myserver&quot;, handler=&quot;/posts&quot;, method=”get”, status=”500”}\nhttp_requests_total{job=&quot;myserver&quot;, handler=&quot;/posts/new&quot;, method=”post”, status=”201”}\nhttp_requests_total{job=&quot;myserver&quot;, handler=&quot;/posts/new&quot;, method=”post”, status=”401”}</pre></code>\n            <p>Let’s say we want to alert if our HTTP server is returning errors to customers.</p><p>Since, all we need to do is check our metric that tracks how many responses with HTTP status code 500 there were, a simple alerting rule could like this:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">- alert: Serving HTTP 500 errors\n  expr: http_requests_total{status=”500”} &gt; 0</pre></code>\n            <p>This will alert us if we have any 500 errors served to our customers. Prometheus will run our query looking for a time series named http_requests_total that also has a <b>status</b> label with value <b>“500”</b>. Then it will filter all those matched time series and only return ones with value greater than zero.</p><p>If our alert rule returns any results a fire will be triggered, one for each returned result.</p><p>If our rule doesn’t return anything, meaning there are no matched time series, then alert will not trigger.</p><p>The whole flow from metric to alert is pretty simple here as we can see on the diagram below.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/57mqOPxVQ847pKAkMden9K/1ca71401acf93f9695494e257e78a4f7/1-3.png\" alt=\"\" class=\"kg-image\" width=\"1606\" height=\"1097\" loading=\"lazy\"/>\n            \n            </figure><p>If we want to provide more information in the alert we can by setting additional labels and annotations, but alert and expr fields are all we need to get a working rule.</p><p>But the problem with the above rule is that our alert starts when we have our first error, and then it will never go away.</p><p>After all, our http_requests_total is a counter, so it gets incremented every time there’s a new request, which means that it will keep growing as we receive more requests. What this means for us is that our alert is really telling us “was there ever a 500 error?” and even if we fix the problem causing 500 errors we’ll keep getting this alert.</p><p>A better alert would be one that tells us if we’re serving errors <b>right now</b>.</p><p>For that we can use the <a href=\"https://prometheus.io/docs/prometheus/latest/querying/functions/#rate\">rate()</a> function to calculate the per second rate of errors.</p><p>Our modified alert would be:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">- alert: Serving HTTP 500 errors\n  expr: rate(http_requests_total{status=”500”}[2m]) &gt; 0</pre></code>\n            <p>The query above will calculate the rate of 500 errors in the last two minutes. If we start responding with errors to customers our alert will fire, but once errors stop so will this alert.</p><p>This is great because if the underlying issue is resolved the alert will resolve too.</p><p>We can improve our alert further by, for example, alerting on the percentage of errors, rather than absolute numbers, or even calculate error budget, but let’s stop here for now.</p><p>It’s all very simple, so what do we mean when we talk about improving the reliability of alerting? What could go wrong here?</p><h3>What could go wrong?</h3><p>We can craft a valid YAML file with a rule definition that has a perfectly valid query that will simply not work how we expect it to work. Which, when it comes to alerting rules, might mean that the alert we rely upon to tell us when something is not working correctly will fail to alert us when it should. To better understand why that might happen let’s first explain how querying works in Prometheus.</p><h3>Prometheus querying basics</h3><p>There are two basic types of queries we can run against Prometheus. The first one is an <b>instant query</b>. It allows us to ask Prometheus for a point in time value of some time series. If we write our query as http_requests_total we’ll get all time series named http_requests_total along with the most recent value for each of them. We can further customize the query and filter results by adding label matchers, like http_requests_total{status=”500”}.</p><p>Let’s consider we have two instances of our server, green and red, each one is scraped (Prometheus collects metrics from it) every one minute (independently of each other).</p><p>This is what happens when we issue an instant query:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2KyKw0PTiNywwYY6euDbuH/7b70f9497a1eea15c464242136693761/2-fixed.png\" alt=\"\" class=\"kg-image\" width=\"882\" height=\"429\" loading=\"lazy\"/>\n            \n            </figure><p>There’s obviously more to it as we can use <a href=\"https://prometheus.io/docs/prometheus/latest/querying/functions/\">functions</a> and build complex queries that utilize multiple metrics in one expression. But for the purposes of this blog post we’ll stop here.</p><p>The important thing to know about instant queries is that they return the most recent value of a matched time series, and they will look back for up to five minutes (by default) into the past to find it. If the last value is older than five minutes then it’s considered stale and Prometheus won’t return it anymore.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4V3s3dupV4RHtWcAwbPpYd/ba6f25fe912ff66c41463077d2609df0/3-fixed.png\" alt=\"\" class=\"kg-image\" width=\"1689\" height=\"858\" loading=\"lazy\"/>\n            \n            </figure><p>The second type of query is a <b>range query</b> - it works similarly to instant queries, the difference is that instead of returning us the most recent value it gives us a list of values from the selected time range. That time range is always relative so instead of providing two timestamps we provide a range, like “20 minutes”. When we ask for a range query with a 20 minutes range it will return us all values collected for matching time series from 20 minutes ago until now.</p><p>An important distinction between those two types of queries is that range queries don’t have the same “look back for up to five minutes” behavior as instant queries. If Prometheus cannot find any values collected in the provided time range then it doesn’t return anything.</p><p>If we modify our example to request [3m] range query we should expect Prometheus to return three data points for each time series:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1dBwnYThdf3ioljbPdmSKV/a77b1a86010cbf7b8207b4bb55218adf/4-fixed.png\" alt=\"\" class=\"kg-image\" width=\"1763\" height=\"858\" loading=\"lazy\"/>\n            \n            </figure><h3>When queries don’t return anything</h3><p>Knowing a bit more about how queries work in Prometheus we can go back to our alerting rules and spot a potential problem: queries that don’t return anything.</p><p>If our query doesn’t match any time series or if they’re considered stale then Prometheus will return an empty result. This might be because we’ve made a typo in the metric name or label filter, the metric we ask for is no longer being exported, or it was never there in the first place, or we’ve added some condition that wasn’t satisfied, like value of being non-zero in our http_requests_total{status=”500”} &gt; 0 example.</p><p>Prometheus will not return any error in any of the scenarios above because none of them are really problems, it’s just how querying works. If you ask for something that doesn’t match your query then you get empty results. This means that there’s no distinction between “all systems are operational” and “you’ve made a typo in your query”. So if you’re not receiving any alerts from your service it’s either a sign that everything is working fine, or that you’ve made a typo, and you have no working monitoring at all, and it’s up to you to verify which one it is.</p><p>For example, we could be trying to query for http_requests_totals instead of http_requests_total (an extra “s” at the end) and although our query will look fine it won’t ever produce any alert.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2p2hNra24jqNgnfeaaLZ6S/15d40680e928ba796c8a25f8e9a45eea/5-1.png\" alt=\"\" class=\"kg-image\" width=\"1606\" height=\"1111\" loading=\"lazy\"/>\n            \n            </figure><p>Range queries can add another twist - they’re mostly used in Prometheus functions like rate(),  which we used in our example. This function will only work correctly if it receives a range query expression that returns at least two data points for each time series, after all it’s impossible to calculate rate from a single number.</p><p>Since the number of data points depends on the time range we passed to the range query, which we then pass to our rate() function, if we provide a time range that only contains a single value then rate won’t be able to calculate anything and once again we’ll return empty results.</p><p>The number of values collected in a given time range depends on the interval at which Prometheus collects all metrics, so to use rate() correctly you need to know how your Prometheus server is configured. You can read more about this <a href=\"https://www.robustperception.io/what-range-should-i-use-with-rate\">here</a> and <a href=\"https://promlabs.com/blog/2021/01/29/how-exactly-does-promql-calculate-rates\">here</a> if you want to better understand how rate() works in Prometheus.</p><p>For example if we collect our metrics every one minute then a range query http_requests_total[1m] will be able to find only one data point. Here’s a reminder of how this looks:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3ghp7yB5qlTe23SxtTKEm3/00fb502268550a9ed191347f190f499c/6-fixed.png\" alt=\"\" class=\"kg-image\" width=\"1765\" height=\"858\" loading=\"lazy\"/>\n            \n            </figure><p>Since, as we mentioned before, we can only calculate rate() if we have at least two data points, calling rate(http_requests_total[1m]) will never return anything and so our alerts will never work.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1xBQkUPr4OsGRpAbeXXtmc/bacec9fb3cb88cc2fb8dabc7c5221ac8/7.png\" alt=\"\" class=\"kg-image\" width=\"1939\" height=\"1520\" loading=\"lazy\"/>\n            \n            </figure><p>There are more potential problems we can run into when writing Prometheus queries, for example any operations between two metrics will only work if both have the same set of labels, you can read about this <a href=\"https://prometheus.io/docs/prometheus/latest/querying/operators/#vector-matching\">here</a>. But for now we’ll stop here, listing all the gotchas could take a while. The point to remember is simple: if your alerting query doesn’t return anything then it might be that everything is ok and there’s no need to alert, but it might also be that you’ve mistyped your metrics name, your label filter cannot match anything, your metric disappeared from Prometheus, you are using too small time range for your range queries etc.</p><h3>Renaming metrics can be dangerous</h3><p>We’ve been running Prometheus for a few years now and during that time we’ve grown our collection of alerting rules a lot. Plus we keep adding new products or modifying existing ones, which often includes adding and removing metrics, or modifying existing metrics, which may include renaming them or changing what labels are present on these metrics.</p><p>A lot of metrics come from metrics exporters maintained by the Prometheus community, like <a href=\"https://github.com/prometheus/node_exporter\">node_exporter</a>, which we use to gather some operating system metrics from all of our servers. Those exporters also undergo changes which might mean that some metrics are deprecated and removed, or simply renamed.</p><p>A problem we’ve run into a few times is that sometimes our alerting rules wouldn’t be updated after such a change, for example when we upgraded node_exporter across our fleet. Or the addition of a new label on some metrics would suddenly cause Prometheus to no longer return anything for some of the alerting queries we have, making such an alerting rule no longer useful.</p><p>It’s worth noting that Prometheus does have a way of <a href=\"https://prometheus.io/docs/prometheus/latest/configuration/unit_testing_rules/\">unit testing rules</a>, but since it works on mocked data it’s mostly useful to validate the logic of a query. Unit testing won’t tell us if, for example, a metric we rely on suddenly disappeared from Prometheus.</p><h3>Chaining rules</h3><p>When writing alerting rules we try to limit <a href=\"https://en.wikipedia.org/wiki/Alarm_fatigue\">alert fatigue</a> by ensuring that, among many things, alerts are only generated when there’s an action needed, they clearly describe the problem that needs addressing, they have a link to a runbook and a dashboard, and finally that we aggregate them as much as possible. This means that a lot of the alerts we have won’t trigger for each individual instance of a service that’s affected, but rather once per data center or even globally.</p><p>For example, we might alert if the rate of HTTP errors in a datacenter is above 1% of all requests. To do that we first need to calculate the overall rate of errors across all instances of our server. For that we would use a <a href=\"https://prometheus.io/docs/prometheus/latest/configuration/recording_rules/\">recording rule</a>:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">- record: job:http_requests_total:rate2m\n  expr: sum(rate(http_requests_total[2m])) without(method, status, instance)\n\n- record: job:http_requests_status500:rate2m\n  expr: sum(rate(http_requests_total{status=”500”}[2m])) without(method, status, instance)</pre></code>\n            <p>First rule will tell Prometheus to calculate per second rate of all requests and sum it across all instances of our server. Second rule does the same but only sums time series with status labels equal to “500”. Both rules will produce new metrics named after the value of the <b>record</b> field.</p><p>Now we can modify our alert rule to use those new metrics we’re generating with our recording rules:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">- alert: Serving HTTP 500 errors\n  expr: job:http_requests_status500:rate2m / job:http_requests_total:rate2m &gt; 0.01</pre></code>\n            <p>If we have a data center wide problem then we will raise just one alert, rather than one per instance of our server, which can be a great quality of life improvement for our on-call engineers.</p><p>But at the same time we’ve added two new rules that we need to maintain and ensure they produce results. To make things more complicated we could have recording rules producing metrics based on other recording rules, and then we have even more rules that we need to ensure are working correctly.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3j3cCrMguixvR5m9ZTnhPH/eaf4daa82ce7740a7e3dcbf1da3dd938/8.png\" alt=\"\" class=\"kg-image\" width=\"2016\" height=\"1387\" loading=\"lazy\"/>\n            \n            </figure><p>What if all those rules in our chain are maintained by different teams? What if the rule in the middle of the chain suddenly gets renamed because that’s needed by one of the teams? Problems like that can easily crop up now and then if your environment is sufficiently complex, and when they do, they’re not always obvious, after all the only sign that something stopped working is, well, silence - your alerts no longer trigger. If you’re lucky you’re plotting your metrics on a dashboard somewhere and hopefully someone will notice if they become empty, but it’s risky to rely on this.</p><p>We definitely felt that we needed something better than hope.</p><h3>Introducing pint: a Prometheus rule linter</h3><p>To avoid running into such problems in the future we’ve decided to write a tool that would help us do a better job of testing our alerting rules against live Prometheus servers, so we can spot missing metrics or typos easier. We also wanted to allow new engineers, who might not necessarily have all the in-depth knowledge of how Prometheus works, to be able to write rules with confidence without having to get feedback from more experienced team members.</p><p>Since we believe that such a tool will have value for the entire Prometheus community we’ve open-sourced it, and it’s available for anyone to use - say hello to pint!</p><p>You can find sources on <a href=\"https://github.com/cloudflare/pint\">github</a>, there’s also <a href=\"https://cloudflare.github.io/pint/\">online documentation</a> that should help you get started.</p><p>Pint works in 3 different ways:</p><ul><li><p>You can run it against a file(s) with Prometheus rules</p></li><li><p>It can run as a part of your CI pipeline</p></li><li><p>Or you can deploy it as a side-car to all your Prometheus servers</p></li></ul><p>It doesn’t require any configuration to run, but in most cases it will provide the most value if you create a configuration file for it and define some Prometheus servers it should use to validate all rules against. Running without any configured Prometheus servers will limit it to static analysis of all the rules, which can identify a range of problems, but won’t tell you if your rules are trying to query non-existent metrics.</p><p>First mode is where pint reads a file (or a directory containing multiple files), parses it, does all the basic syntax checks and then runs a series of checks for all Prometheus rules in those files.</p><p>Second mode is optimized for validating git based pull requests. Instead of testing all rules from all files pint will only test rules that were modified and report only problems affecting modified lines.</p><p>Third mode is where pint runs as a daemon and tests all rules on a regular basis. If it detects any problem it will expose those problems as metrics. You can then collect those metrics using Prometheus and alert on them as you would for any other problems. This way you can basically use Prometheus to monitor itself.</p><p>What kind of checks can it run for us and what kind of problems can it detect?</p><p>All the checks are documented <a href=\"https://cloudflare.github.io/pint/checks/\">here</a>, along with some tips on how to deal with any detected problems. Let’s cover the most important ones briefly.</p><p>As mentioned above the main motivation was to catch rules that try to query metrics that are missing or when the query was simply mistyped. To do that pint will run each query from every alerting and recording rule to see if it returns any result, if it doesn’t then it will break down this query to identify all individual metrics and check for the existence of each of them. If any of them is missing or if the query tries to filter using labels that aren’t present on any time series for a given metric then it will report that back to us.</p><p>So if someone tries to add a new alerting rule with http_requests_totals typo in it, pint will detect that when running CI checks on the pull request and stop it from being merged. Which takes care of validating rules as they are being added to our configuration management system.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6pVy8R1PRoDvIt8jgooQJu/221e0015a822f861221521a8de3b258e/9.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1031\" loading=\"lazy\"/>\n            \n            </figure><p>Another useful check will try to estimate the number of times a given alerting rule would trigger an alert. Which is useful when raising a pull request that’s adding new alerting rules - nobody wants to be flooded with alerts from a rule that’s too sensitive so having this information on a pull request allows us to spot rules that could lead to alert fatigue.</p><p>Similarly, another check will provide information on how many new time series a recording rule adds to Prometheus. In our setup a single unique time series uses, on average, 4KiB of memory. So if a recording rule generates 10 thousand new time series it will increase Prometheus server memory usage by 10000*4KiB=40MiB. 40 megabytes might not sound like but our peak time series usage in the last year was around 30 million time series in a single Prometheus server, so we pay attention to anything that’s might add a substantial amount of new time series, which pint helps us to notice before such rule gets added to Prometheus.</p><p>On top of all the Prometheus query checks, pint allows us also to ensure that all the alerting rules comply with some policies we’ve set for ourselves. For example, we require everyone to write a runbook for their alerts and link to it in the alerting rule using annotations.</p><p>We also require all alerts to have priority labels, so that high priority alerts are generating pages for responsible teams, while low priority ones are only routed to <a href=\"https://github.com/prymitive/karma\">karma dashboard</a> or create tickets using <a href=\"https://github.com/prometheus-community/jiralert\">jiralert</a>. It’s easy to forget about one of these required fields and that’s not something which can be enforced using unit testing, but pint allows us to do that with a few configuration lines.</p><p>With pint running on all stages of our Prometheus rule life cycle, from initial pull request to monitoring rules deployed in our many data centers, we can rely on our Prometheus alerting rules to always work and notify us of any incident, large or small.</p><p>GitHub: <a href=\"https://github.com/cloudflare/pint\">https://github.com/cloudflare/pint</a></p><h3>Putting it all together</h3><p>Let’s see how we can use pint to validate our rules as we work on them.</p><p>We can begin by creating a file called “rules.yml” and adding both recording rules there.</p><p>The goal is to write new rules that we want to add to Prometheus, but before we actually add those, we want pint to validate it all for us.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">groups:\n- name: Demo recording rules\n  rules:\n  - record: job:http_requests_total:rate2m\n    expr: sum(rate(http_requests_total[2m])) without(method, status, instance)\n\n  - record: job:http_requests_status500:rate2m\n    expr: sum(rate(http_requests_total{status=&quot;500&quot;}[2m]) without(method, status, instance)</pre></code>\n            <p>Next we’ll download the latest version of pint from <a href=\"https://github.com/cloudflare/pint/releases\">GitHub</a> and run check our rules.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ pint lint rules.yml \nlevel=info msg=&quot;File parsed&quot; path=rules.yml rules=2\nrules.yml:8: syntax error: unclosed left parenthesis (promql/syntax)\n    expr: sum(rate(http_requests_total{status=&quot;500&quot;}[2m]) without(method, status, instance)\n\nlevel=info msg=&quot;Problems found&quot; Fatal=1\nlevel=fatal msg=&quot;Execution completed with error(s)&quot; error=&quot;problems found&quot;</pre></code>\n            <p>Whoops, we have “sum(rate(...)” and so we’re missing one of the closing brackets. Let’s fix that and try again.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">groups:\n- name: Demo recording rules\n  rules:\n  - record: job:http_requests_total:rate2m\n    expr: sum(rate(http_requests_total[2m])) without(method, status, instance)\n\n  - record: job:http_requests_status500:rate2m\n    expr: sum(rate(http_requests_total{status=&quot;500&quot;}[2m])) without(method, status, instance)</pre></code>\n            \n            <pre class=\"language-bash\"><code class=\"language-bash\">$ pint lint rules.yml \nlevel=info msg=&quot;File parsed&quot; path=rules.yml rules=2</pre></code>\n            <p>Our rule now passes the most basic checks, so we know it’s valid. But to know if it works with a real Prometheus server we need to tell pint how to talk to Prometheus. For that we’ll need a config file that defines a Prometheus server we test our rule against, it should be the same server we’re planning to deploy our rule to. Here we’ll be using a test instance running on localhost. Let’s create a “pint.hcl” file and define our Prometheus server there:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">prometheus &quot;prom1&quot; {\n  uri     = &quot;http://localhost:9090&quot;\n  timeout = &quot;1m&quot;\n}</pre></code>\n            <p>Now we can re-run our check using this configuration file:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ pint -c pint.hcl lint rules.yml \nlevel=info msg=&quot;Loading configuration file&quot; path=pint.hcl\nlevel=info msg=&quot;File parsed&quot; path=rules.yml rules=2\nrules.yml:5: prometheus &quot;prom1&quot; at http://localhost:9090 didn&#039;t have any series for &quot;http_requests_total&quot; metric in the last 1w (promql/series)\n    expr: sum(rate(http_requests_total[2m])) without(method, status, instance)\n\nrules.yml:8: prometheus &quot;prom1&quot; at http://localhost:9090 didn&#039;t have any series for &quot;http_requests_total&quot; metric in the last 1w (promql/series)\n    expr: sum(rate(http_requests_total{status=&quot;500&quot;}[2m])) without(method, status, instance)\n\nlevel=info msg=&quot;Problems found&quot; Bug=2\nlevel=fatal msg=&quot;Execution completed with error(s)&quot; error=&quot;problems found&quot;</pre></code>\n            <p>Yikes! It’s a test Prometheus instance, and we forgot to collect any metrics from it.</p><p>Let’s fix that by starting our server locally on port 8080 and configuring Prometheus to collect metrics from it:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">scrape_configs:\n  - job_name: webserver\n    static_configs:\n      - targets: [&#039;localhost:8080’]</pre></code>\n            <p>Let’ re-run our checks once more:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ pint -c pint.hcl lint rules.yml \nlevel=info msg=&quot;Loading configuration file&quot; path=pint.hcl\nlevel=info msg=&quot;File parsed&quot; path=rules.yml rules=2</pre></code>\n            <p>This time everything works!</p><p>Now let’s add our alerting rule to our file, so it now looks like this:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">groups:\n- name: Demo recording rules\n  rules:\n  - record: job:http_requests_total:rate2m\n    expr: sum(rate(http_requests_total[2m])) without(method, status, instance)\n\n  - record: job:http_requests_status500:rate2m\n    expr: sum(rate(http_requests_total{status=&quot;500&quot;}[2m])) without(method, status, instance)\n\n- name: Demo alerting rules\n  rules:\n  - alert: Serving HTTP 500 errors\n    expr: job:http_requests_status500:rate2m / job:http_requests_total:rate2m &gt; 0.01</pre></code>\n            <p>And let’s re-run pint once again:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ pint -c pint.hcl lint rules.yml \nlevel=info msg=&quot;Loading configuration file&quot; path=pint.hcl\nlevel=info msg=&quot;File parsed&quot; path=rules.yml rules=3\nrules.yml:13: prometheus &quot;prom1&quot; at http://localhost:9090 didn&#039;t have any series for &quot;job:http_requests_status500:rate2m&quot; metric in the last 1w but found recording rule that generates it, skipping further checks (promql/series)\n    expr: job:http_requests_status500:rate2m / job:http_requests_total:rate2m &gt; 0.01\n\nrules.yml:13: prometheus &quot;prom1&quot; at http://localhost:9090 didn&#039;t have any series for &quot;job:http_requests_total:rate2m&quot; metric in the last 1w but found recording rule that generates it, skipping further checks (promql/series)\n    expr: job:http_requests_status500:rate2m / job:http_requests_total:rate2m &gt; 0.01\n\nlevel=info msg=&quot;Problems found&quot; Information=2</pre></code>\n            <p>It all works according to pint, and so we now can safely deploy our new rules file to Prometheus.</p><p>Notice that pint recognised that both metrics used in our alert come from recording rules, which aren’t yet added to Prometheus, so there’s no point querying Prometheus to verify if they exist there.</p><p>Now what happens if we deploy a new version of our server that renames the “status” label to something else, like “code”?</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ pint -c pint.hcl lint rules.yml \nlevel=info msg=&quot;Loading configuration file&quot; path=pint.hcl\nlevel=info msg=&quot;File parsed&quot; path=rules.yml rules=3\nrules.yml:8: prometheus &quot;prom1&quot; at http://localhost:9090 has &quot;http_requests_total&quot; metric but there are no series with &quot;status&quot; label in the last 1w (promql/series)\n    expr: sum(rate(http_requests_total{status=&quot;500&quot;}[2m])) without(method, status, instance)\n\nrules.yml:13: prometheus &quot;prom1&quot; at http://localhost:9090 didn&#039;t have any series for &quot;job:http_requests_status500:rate2m&quot; metric in the last 1w but found recording rule that generates it, skipping further checks (promql/series)\n    expr: job:http_requests_status500:rate2m / job:http_requests_total:rate2m &gt; 0.01\n\nlevel=info msg=&quot;Problems found&quot; Bug=1 Information=1\nlevel=fatal msg=&quot;Execution completed with error(s)&quot; error=&quot;problems found&quot;</pre></code>\n            <p>Luckily pint will notice this and report it, so we can adopt our rule to match the new name.</p><p>But what if that happens after we deploy our rule? For that we can use the “pint watch” command that runs pint as a daemon periodically checking all rules.</p><p>Please note that validating all metrics used in a query will eventually produce some false positives. In our example metrics with status=”500” label might not be exported by our server until there’s at least one request ending in HTTP 500 error.</p><p>The <a href=\"https://cloudflare.github.io/pint/checks/promql/series.html\">promql/series</a> check responsible for validating presence of all metrics has some documentation on how to deal with this problem. In most cases you’ll want to add a comment that instructs pint to ignore some missing metrics entirely or stop checking label values (only check if there’s “status” label present, without checking if there are time series with status=”500”).</p><h3>Summary</h3><p>Prometheus metrics don’t follow any strict schema, whatever services expose will be collected. At the same time a lot of problems with queries hide behind empty results, which makes noticing these problems non-trivial.</p><p>We use pint to find such problems and report them to engineers, so that our global network is always monitored correctly, and we have confidence that lack of alerts proves how reliable our infrastructure is.</p>",
		"id": "YZO15EI2Aw87tTU31VtF0",
		"localeList": {
			"name": "Monitoring our monitoring: how we validate our Prometheus alert rules Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Pint is a tool we developed to validate our Prometheus alerting rules and ensure they are always working.",
		"metadata": {
			"title": "Monitoring our monitoring: how we validate our Prometheus alert rules",
			"description": "Pint is a tool we developed to validate our Prometheus alerting rules and ensure they are always working.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4WfDis0yipp4RTYKqZZ8lL/14dd63ccb4419b5f79c5fc57fe8721c4/monitoring-our-monitoring-mZPh0R.png"
		},
		"primary_author": {},
		"published_at": "2022-05-19T16:39:19.000+01:00",
		"slug": "monitoring-our-monitoring",
		"tags": [
			{
				"id": "3VJOfQ8TnNJwqu1GIGwPuA",
				"name": "Monitoring",
				"slug": "monitoring"
			},
			{
				"id": "27rpZLTb1hq5wyGAno2aw1",
				"name": "Prometheus",
				"slug": "prometheus"
			},
			{
				"id": "4wT3L4bOFuElnUMa5pXS2G",
				"name": "Observability",
				"slug": "observability"
			},
			{
				"id": "48r7QV00gLMWOIcM1CSDRy",
				"name": "Speed & Reliability",
				"slug": "speed-and-reliability"
			}
		],
		"title": "Monitoring our monitoring: how we validate our Prometheus alert rules",
		"updated_at": "2024-08-27T01:30:20.131Z",
		"url": "https://blog.cloudflare.com/monitoring-our-monitoring"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}