{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [
		"fr-fr",
		"de-de",
		"ja-jp",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Arielle Olache",
				"slug": "arielle",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/30uBJ2ZAg1oCTwCrsuUKFD/a9f645c28c6929ab06c35fae62daa51b/arielle.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Yawar Jamal",
				"slug": "yawar",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4KqS01CmWvnUufNWCS0vgl/b8132cafa246233591b4f847316e8752/yawar.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Today, we are thrilled to announce that Waiting Room now supports coverage of multiple hostname and path combinations with a single waiting room, giving customers more flexibility and offering broader site coverage without interruptions to end-user flows",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/31jdoqDTHK0chsZsONeFU7/aaf2f97bf5729ddef22233381e612120/multihost-waiting-room.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4ifF5x8IwXAYRztjYxlQOW/cabefb3f78f288f72226994d98ba4911/image4.png\" alt=\"\" class=\"kg-image\" width=\"1300\" height=\"600\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://www.cloudflare.com/application-services/products/waiting-room/\">Cloudflare Waiting Room</a> protects sites from overwhelming traffic surges by placing excess visitors in a fully customizable virtual waiting room, admitting them dynamically as spots become available. Instead of throwing error pages or delivering poorly-performing site pages, Waiting Room empowers customers to take control of their end-user experience during unmanageable traffic surges.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4pq031M9XklIgj4DHLZN8O/0b47c08a018945a9118699d9da3e1239/image1.png\" alt=\"Customize the look and feel of your waiting room to enhance the end user experience!\" class=\"kg-image\" width=\"1440\" height=\"1024\" loading=\"lazy\"/>\n            \n            </figure><p>A key decision customers make when setting up a waiting room is what pages it will protect. Before now, customers could select one hostname and path combination to determine what pages would be covered by a waiting room. Today, we are thrilled to announce that Waiting Room now supports coverage of multiple hostname and path combinations with a single waiting room, giving customers more flexibility and offering broader site coverage without interruptions to end-user flows. This new capability is available to all Enterprise customers with an Advanced Purchase of Waiting Room.</p><h3>Waiting Room site placement</h3><p>As part of the simple, no-coding-necessary process for deploying a waiting room, customers specify a hostname and path combination to indicate which pages are covered by a particular waiting room. When a site visitor makes a preliminary request to that hostname and path or any of its subpaths, they will be issued a waiting room cookie and either be admitted to the site or placed in a waiting room if the site is at capacity.</p><p>Last year, we added <a href=\"/waiting-room-bypass-rules/\">Waiting Room Bypass Rules</a>, giving customers many options for creating exceptions to this hostname and path coverage. This unlocked capabilities such as User Agent Bypassing, geo-targeting, URL exclusions, and administrative IP bypassing. It also allowed for some added flexibility regarding which pages a waiting room would apply to on a customer’s site by adding the ability to exclude URLs, paths, and query strings. While this update allowed for greater specificity regarding which traffic should be gated by Waiting Room, it didn’t offer the broader coverage that many customers still needed to protect greater portions of their sites with a single waiting room.</p><h3>Why customers needed broader Waiting Room coverage</h3><p>Let’s review some simple yet impactful examples of why this broader coverage option was important for our customers. Imagine you have an online store, example.com, and you want to ensure that a single waiting room covers the entire customer journey — from the homepage, to product browsing, to checkout. Many sites would delineate these steps in the flow using paths: example.com/, example.com/shop/product1, example.com/checkout. Because Waiting Room assumes an implied wildcard at the end of a waiting room’s configured path, this use case was already satisfied for these sites. Thus, placing a waiting room at example.com/ would cover all the URLs associated with every step of this customer journey. In this setup, once a site visitor has passed the waiting room, they would not be re-queued at any step in their user flow because they are still using the same waiting room’s cookie, which indicates to Waiting Room that they are the same user between URLs.</p><p>However, many sites delineate different steps of this type of shopping flow using subdomains instead of or as well as paths. For example, many sites will have their checkout page on a different subdomain, such as checkout.example.com. Before now, if a customer had this site structure and wanted to protect their entire site with a single waiting room, they would have needed to deploy a waiting room at example.com/ and another at checkout.example.com/. This option was not ideal for many customers because a site visitor could be queued at two different parts of the same customer journey. This is because the waiting room at checkout.example.com/ would count the same visitor as a different user than the waiting room covering example.com/.</p><p>That said, there are cases where it is wise to separate waiting rooms on a single site. For example, a ticketing website could place a waiting room at its apex domain (example.com) and distinct waiting rooms with pre-queues on pages for specific events (example.com/popular_artist_tour). The waiting room set at example.com/ ensures that the main point of entry to the site does not get overwhelmed and crash when ticket sales for any one event open. The waiting room placed on the specific event page ensures that traffic for a single event can start queuing ahead of the event without impacting traffic going to other parts of the site.</p><p>Ultimately, whether a customer wants one or multiple waiting rooms to protect their site, we wanted to give our customers the flexibility to deploy Waiting Room however was best for their use cases and site structure. We’re thrilled to announce that Waiting Room now supports multi-hostname and path coverage with a single waiting room!</p><h3>Getting started with multi-host and path coverage</h3><p>Customers can now configure a waiting room on multiple hostname and path combinations — or routes — belonging to the same zone. To do so, navigate to Traffic &gt; Waiting Room and select Create. The name of your domain will already be populated. To add additional routes to your waiting room configuration, select Add Hostname and Path. You can then enter another hostname and path to be covered by the same waiting room. Remember, there is an implied wildcard after each path. Therefore, creating a waiting room for each URL you want your waiting room to cover is unnecessary. Only create additional routes for URLs that wouldn’t be covered by the other hostname and path combinations you have already entered.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3VNkM6S6x01KPvXmCgOSyw/2758b669364f65b24f658f5d08ca3f87/image3.png\" alt=\"Add multiple hostname and path combinations to your waiting room by selecting Add Hostname and Path\" class=\"kg-image\" width=\"1910\" height=\"670\" loading=\"lazy\"/>\n            \n            </figure><p>When deploying a waiting room that covers multiple hostname and path combinations, you must create a unique cookie name for this waiting room (more on that later!). Then, proceed with the <a href=\"https://developers.cloudflare.com/waiting-room/how-to/create-waiting-room/\">same workflow</a> as usual to deploy your waiting room.</p><h3>Deploying a multi-language waiting room</h3><p>A frequent customer request was the ability to cover a multi-language site with a single waiting room — offering different text per language while counting all site traffic toward the same waiting room limits. There are various ways a site can be structured to delineate between different language options, but the two most common are either by subdomain or path. For a site that uses path delineation, this could look like example.com/en and example.com/es for English and Spanish, respectively. For a site using subdomain delineation, this could look like en.example.com/ and es.example.com/. Before multihost Waiting Room coverage, the subdomain variation would not have been able to be covered by a single waiting room.</p><p>Waiting Room’s existing configuration options already supported the path variation. However, this was only true if the customer wanted to gate the entire site, which they could do by placing the waiting room at example.com/. Many e-commerce customers asked for the ability to gate different high-demand product pages selling the same product but with different language options. For instance, consider example.com/en/product_123 and example.com/es/product_123, where the customer wants the same waiting room and traffic limits to cover both URLs. Before now, this would not have been possible without some complex bypass rule logic.</p><p>Now, customers can deploy a waiting room that accommodates either the subdomain or path approach to structuring a multi-language site. The only remaining step is setting up your waiting room to serve different languages when a user is queued in a waiting room. This can be achieved by constructing a template that reads the URL to determine the locale and define the appropriate translations for each of the locales within the template.</p><p>Here is an example of a template that determines the locale from the URL path, and renders the translated text:</p>\n            <pre class=\"language-html\"><code class=\"language-html\">&lt;!DOCTYPE html&gt;\n&lt;html&gt;\n  &lt;head&gt;\n    &lt;title&gt;Waiting Room powered by Cloudflare&lt;/title&gt;\n  &lt;/head&gt;\n  &lt;body&gt;\n    &lt;section&gt;\n      &lt;h1 id=&quot;inline-msg&quot;&gt;\n        You are now in line.\n      &lt;/h1&gt;\n      &lt;h1 id=&quot;patience-msg&quot;&gt;\n        Thank you for your patience.\n      &lt;/h1&gt;\n    &lt;/section&gt;\n    &lt;h2 id=&quot;waitTime&quot;&gt;&lt;/h2&gt;\n\n    &lt;script&gt;\n      var locale = location.pathname.split(&quot;/&quot;)[1] || &quot;en&quot;;\n      var translations = {\n        &quot;en&quot;: {\n          &quot;waittime_60_less&quot;: &quot;Your estimated wait time is {{waitTime}} minute.&quot;,\n          &quot;waittime_60_greater&quot;: &quot;Your estimated wait time is {{waitTimeHours}} hours and {{waitTimeHourMinutes}} minutes.&quot;,\n          &quot;inline-msg&quot;: &quot;You are now in line.&quot;,\n          &quot;patience-msg&quot;: &quot;Thank you for your patience.&quot;,\n        },\n        &quot;es&quot;: {\n          &quot;waittime_60_less&quot;: &quot;El tiempo de espera estimado es {{waitTime}} minuto.&quot;,\n          &quot;waittime_60_greater&quot;: &quot;El tiempo de espera estimado es {{waitTimeHours}} de horas y {{waitTimeHourMinutes}} minutos.&quot;,\n          &quot;inline-msg&quot;: &quot;Ahora se encuentra en la fila de espera previa.&quot;,\n          &quot;patience-msg&quot;: &quot;Gracias por su paciencia.&quot;,\n        }\n      };\n\n      {{#waitTimeKnown}}\n      var minutes = parseInt( {{waitTime}} , 10);\n      var time = document.getElementById(&#039;waitTime&#039;);\n\n      if ( minutes &lt; 61) {\n        time.innerText = translations[locale][&quot;waittime_60_less&quot;]\n      } else {\n        time.innerText = translations[locale][&quot;waittime_60_greater&quot;]\n      }\n      {{/waitTimeKnown}}\n\n      // translate template text for each of the elements with “id” suffixed with “msg”\n      for (const msg of [&quot;inline-msg&quot;, &quot;patience-msg&quot;]) {\n        const el = document.getElementById(msg);\n        if (el == null) continue;\n        el.innerText = translations[locale][msg];\n      }\n    &lt;/script&gt;\n  &lt;/body&gt;\n&lt;/html&gt;</pre></code>\n            <p>Here’s how the template works: given a site distinguishes different locales with various paths such as <code>/en/product_123</code> or <code>/es/product_123</code> in the <code>&lt;script /&gt;</code> body after the rendering the page, the locale is extracted from the <code>location.pathname</code> via <code>locale = location.pathname.split(“/”)[1]</code>. If there isn’t a locale specified within the <code>translations</code> object we default it to “en”. For example, if a user visits example.com/product_123, then by default render the English text template.</p><p>Similarly, in order to support a multi-language waiting room for sites that delineate site structure via subdomain, it would only require you to update how you extract the locale from the URL. Instead of looking at the <code>pathname</code> we look at the <code>hostname</code> property of the <code>window.location</code> object like <code>locale = location.hostname.split(“.”)[0]</code>, given, we have site structure as following: en.example.com, es.example.com.</p><p>The above code is a pared down example of starter templates we have added to our <a href=\"https://developers.cloudflare.com/waiting-room/how-to/customize-waiting-room/#multiple-language-support\">developer documentation</a>, which we have included to make it easier for you to get started with a multi-language waiting room. You can download these templates and edit them to have the look and feel aligned with your site and with the language options your site offers.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7jf9G0L2xNFyVKFmxOjlgy/92b54f94be702a744af01722a9f8677c/image2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1197\" loading=\"lazy\"/>\n            \n            </figure><p>This is an example of the starter template provided in dev docs. This waiting room is in Queue-all mode and displays the Spanish text when the user visits example.com/es/product_123.</p><p>These templates can further be expanded to include other languages by adding translations to the `translations` object for each of the locales. Thus, a single template is able to serve multiple languages depending on whatever the locale the site is being served as either via subdomain or path.</p><h3>How we handle cookies with a multihostname and path waiting room</h3><p>The waiting room assigns a <code>__cfwaitingroom</code> <a href=\"https://developers.cloudflare.com/waiting-room/reference/waiting-room-cookie/\">cookie</a> to each user to manage the state of the user that determines the position of the user in line <a href=\"/building-waiting-room-on-workers-and-durable-objects/#:~:text=What%20is%20in%20the%20cookie%20returned%20to%20an%20end%20user%3F\">among other properties</a> needed to make the queueing decisions for the user. Traditionally, for a single hostname and path configuration it was trivial to just set the cookie as <code>__cfwaitingroom=[cookie-value]; Domain=example.com; Path=/es/product_123</code>. This ensured that when the page refreshed it would send us the same Waiting Room cookie for us to examine and update. However, this became non-trivial when we wanted to share the same cookie across different subdomain or path combinations, for example, on <code>example.com/en/product_123</code>.</p><h3>Approaches to setting multiple cookies</h3><p>There were two approaches that we brainstormed and evaluated to allow the sharing of the cookie for the same waiting room.</p><p>The first approach we considered was to issue multiple <code>Set-Cookie</code> headers in the HTTP response. For example, in the multi-language example above, we could issue the following in the response header:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Set-Cookie: __cfwaitingroom=[cookie-value]…Domain=example.com; Path=/en/product_123 …\nSet-Cookie: __cfwaitingroom=[cookie-value]...Domain=example.com; Path=/es/product_123 …</pre></code>\n            <p>This approach would allow us to handle the multiple hostnames and paths for the same waiting room. However, it does not present itself as a very scalable solution. Per <a href=\"https://datatracker.ietf.org/doc/html/rfc6265#section-5.2\">RFC6265</a>, there isn’t a strict limit defined in the specification, browsers have their own implementation-specific limits. For example, Chrome allows the response header to grow up to <a href=\"https://source.chromium.org/chromium/chromium/src/+/main:net/http/http_stream_parser.h;l=168;drc=4cc7ba01d3c5dc996ddc98f9d0bd709e3d5bbfd3?q=ERR_RESPONSE_HEADERS_TOO_BIG&ss=chromium\">256K bytes</a> before throwing the transaction with ERR_RESPONSE_HEADERS_TOO_BIG. Additionally, in this case, the response header would grow proportionally to the number of unique hostname and path combinations, and we would be redundantly repeating the same cookie value N (where N is the number of additional routes) number of times. While this approach would have allowed us to effectively handle a bounded list of hostname and path combinations that need to be set, it was not ideal for cases where we can expect more than a handful routes for a particular site.</p><p>The second approach that we considered and chose to move forward with was to set the cookie on the apex domain (or the most common subdomain). In other words, we would figure out the most common subdomain from the list of routes and use that as the domain. Similarly, for the paths, this would entail determining the least common prefix from the list of paths and use that as the value to be set on the path attribute. For example, consider a waiting room with the following two routes configured, a.example.com/shoes/product_123 and b.example.com/shoes/product_456.</p><p>To determine the domain that would be set for the cookie, we can see that <code>example.com</code> is the most common subdomain among the list of domains. Applying the most common subdomain algorithm, we would get <code>example.com</code> as the domain. Applying the least common prefix algorithm on the set of paths, <code>/shoes/product_123</code> and <code>/shoes/product_456</code>, we would get <code>/shoes</code> as the path. Thus, the set-cookie header would be the following:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Set-Cookie: … __cfwaitingroom=[cookie-value]; Domain=example.com; Path=/shoes …</pre></code>\n            <p>Now, when a visitor accesses any of the pages covered by this waiting room, we can guarantee Waiting Room receives the right cookie and there will only be Set-Cookie included in the response header.</p><p>However, we are still not there yet. Although we are able to identify the common subdomain (or apex domain) and common path prefix, there would still be a problem if routes from one waiting room would overlap with another waiting room. For example, say we configure two waiting rooms for the same site where we are selling our special shoes:</p><!--kg-card-begin: html--><p>Waiting Room A<br />\n&nbsp; &nbsp; a.example.com/shoes/product_123<br />\n&nbsp; &nbsp; b.example.com/shoes/product_456</p>\n\n<p>Waiting Room B<br />\n&nbsp; &nbsp; c.example.com/shoes/product_789<br />\n&nbsp; &nbsp; d.example.com/shoes/product_012</p><!--kg-card-end: html--><p>If we apply the same algorithm as described above, we would get the same domain and path properties set for the two cookies. For Waiting Room A, the domain would be <code>example.com</code> and the path would be <code>/shoes</code>. Similarly, for Waiting Room B, the most common subdomain would also be example.com and least common path prefix would be <code>/shoes</code>. This would effectively prevent us from distinguishing the two cookies and route the visitor to the right waiting room. In order to solve the issue of overlapping cookie names, we introduced the requirement of setting a custom suffix that is unique to the customer’s zone. This is why it is required to provide a custom cookie suffix when configuring a waiting room that covers multiple hostnames or paths. Therefore, if Waiting Room A was assigned cookie suffix “a” and Waiting Room B was assigned cookie suffix “b”, the two <code>Set-Cookie</code> definitions would look like the following:</p><p><b>Waiting Room A</b></p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Set-Cookie: __cfwaitingroom_a=[cookie-value]; Domain=example.com; Path=/shoes</pre></code>\n            <p><b>Waiting Room B</b></p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Set-Cookie: __cfwaitingroom_b=[cookie-value]; Domain=example.com; Path=/shoes</pre></code>\n            <p>When a visitor makes a request to any pages where the two different waiting rooms are configured, Waiting Room can distinguish and select which cookie corresponds to the given request and use this to determine which waiting room’s settings apply to that user depending on where they are on the site.</p><p>With the addition of multihost and multipath Waiting Room coverage, we’re thrilled to offer more flexible options for incorporating Waiting Room into your site, giving your visitors the best experience possible while protecting your site during times of high traffic. Make sure your site is always protected from traffic surges. Try out <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/traffic/waiting-rooms\">Waiting Room</a> today or <a href=\"https://www.cloudflare.com/application-services/products/waiting-room/\">reach out to us</a> to learn more about the Advanced Waiting Room!</p>",
		"id": "55w0QUCoPwqzUfaTJm5LRg",
		"localeList": {
			"name": "Waiting Room adds multi-host and path coverage, unlocking broader protection and multilingual setups Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Today, we are thrilled to announce that Waiting Room now supports coverage of multiple hostname and path combinations with a single waiting room, giving customers more flexibility and offering broader site coverage without interruptions to end-user flows.",
		"metadata": {
			"title": "Waiting Room adds multi-host and path coverage, unlocking broader protection and multilingual setups",
			"description": "Today, we are thrilled to announce that Waiting Room now supports coverage of multiple hostname and path combinations with a single waiting room, giving customers more flexibility and offering broader site coverage without interruptions to end-user flows.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4ifMX7CTVBApV4o9FU7qKH/97e95de502db7d3e4f37c1805a6f34a5/multihost-waiting-room-b84WZG.png"
		},
		"primary_author": {},
		"published_at": "2023-10-04T14:00:44.000+01:00",
		"slug": "multihost-waiting-room",
		"tags": [
			{
				"id": "79jLdGrSe87cix3F6A5Snu",
				"name": "Waiting Room",
				"slug": "waiting-room"
			},
			{
				"id": "6Y2Z8Vh9IjcvDIG4aZGRns",
				"name": "Always Online",
				"slug": "always-online"
			},
			{
				"id": "2ScX2j6LG2ruyaS8eLYhsd",
				"name": "Traffic",
				"slug": "traffic"
			}
		],
		"title": "Waiting Room adds multi-host and path coverage, unlocking broader protection and multilingual setups",
		"updated_at": "2024-08-27T01:04:16.258Z",
		"url": "https://blog.cloudflare.com/multihost-waiting-room"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}