{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"ko-kr"
	],
	"post": {
		"authors": [
			{
				"name": "Chris Draper",
				"slug": "chris-draper",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4p4dYXBzgJFSatLcw6Yure/acf33dc5f7d9550efb4173d318a91fbf/chris-draper.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Chris J Arges",
				"slug": "arges",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6USL67cH1IXAgenIGBX1yZ/b839cba4151c76104d2a038929cce425/arges.jpg",
				"location": null,
				"website": null,
				"twitter": "@ChrisArges",
				"facebook": null
			},
			{
				"name": "Ana Oliveira",
				"slug": "ana",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5p7G2JpVHePSyVsRCTHonB/6d3bc15895429329f3716b4a690bf4d3/ana.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "João Santos",
				"slug": "joao-santos",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/wvOubwizbKPKO426C5LZG/10b8b3b6986cb8e7c187a231edc28cc6/joao-santos.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Luís Franco",
				"slug": "luis",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/75UnmkAvED9qAgGBS8NxWn/57fb6b54d5d3475f20b3b3b80ebd92f1/luis.PNG",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Nadin El-Yabroudi",
				"slug": "nadin",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2tb7HXTXdN3vxdSKjd3Zic/d9f2b638354bf6f7989a11bbea0200ad/nadin.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Dan Geraghty",
				"slug": "dan-geraghty",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6SZzGYMTshixYkpUSAsjAp/92db308c1cfd1ae129f8f6816bcde89c/dan-geraghty.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Network engineers often need better visibility into their network’s traffic when analyzing DDoS attacks or troubleshooting other traffic anomalies. To solve this problem, Cloudflare offers a network flow monitoring product that gives customers end-to-end traffic visibility across their network.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7FOGDWd22lmLfWBySaez56/8710d508636ff9673e4dfe5b635d57c7/network-flow-monitoring-generally-available.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4EZamNYbSPCC1yBqXXwaZR/158a957cb00ef4768bdb257033b2a334/image4-4.png\" alt=\"Network flow monitoring is GA, providing end-to-end traffic visibility\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>Network engineers often find they need better visibility into their network’s traffic and operations while analyzing DDoS attacks or troubleshooting other traffic anomalies. These engineers typically have some high level metrics about their network traffic, but they struggle to collect essential information on the specific traffic flows that would clarify the issue. To solve this problem, Cloudflare has been piloting a cloud network flow monitoring product called <a href=\"https://www.cloudflare.com/network-services/products/magic-network-monitoring/\">Magic Network Monitoring</a> that gives customers end-to-end visibility into all traffic across their network.</p><p>Today, Cloudflare is excited to announce that Magic Network Monitoring (previously called <a href=\"/flow-based-monitoring-for-magic-transit/\">Flow Based Monitoring</a>) is now generally available to all enterprise customers. Over the last year, the Cloudflare engineering team has significantly improved Magic Network Monitoring; we’re excited to offer a network services product that will help our customers identify threats faster, reduce vulnerabilities, and <a href=\"https://www.cloudflare.com/network-services/solutions/enterprise-network-security/\">make their network more secure</a>.</p><p>Magic Network Monitoring is automatically enabled for all Magic Transit and Magic WAN enterprise customers. The product is located at the account level of the Cloudflare dashboard and can be opened by navigating to “Analytics &amp; Logs &gt; Magic Monitoring”. The onboarding process for Magic Network Monitoring is self-serve, and all enterprise customers with access can begin configuring the product today.</p><p>Any enterprise customers without Magic Transit or Magic WAN that are interested in testing Magic Network Monitoring can receive access to the free version (with some <a href=\"https://developers.cloudflare.com/magic-network-monitoring/magic-network-monitoring-free/\">limitations</a> on traffic volume) by submitting a request to their Cloudflare account team or filling out this form to <a href=\"https://cloudflare.com/network-services/products/magic-network-monitoring/\">talk with an expert</a>.</p><h3>What is Magic Network Monitoring?</h3><p>Magic Network Monitoring is a cloud network flow monitor. <a href=\"https://en.wikipedia.org/wiki/Traffic_flow_(computer_networking)\">Network traffic flow</a> refers to any stream of packets between one source and one destination with the same Internet protocol and set of ports. Customers can send network flow reports from their routers (or any other network flow generator) to a publicly available endpoint on <a href=\"https://www.cloudflare.com/learning/cdn/glossary/anycast-network/\">Cloudflare’s anycast network</a>, even if the traffic didn’t originally pass through Cloudflare’s network. Cloudflare analyzes the network flow data, then provides customers visibility into key network traffic metrics via an analytics dashboard. These metrics include: traffic volume (in bits or packets) over time, source IPs, destination IPs, ports, traffic protocols, and router IPs. Customers can also configure alerts to identify <a href=\"https://www.cloudflare.com/learning/ddos/what-is-a-ddos-attack/\">DDoS attacks</a> and any other abnormal traffic volume activities.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3CrObnYrLzKlSOjSUS8dH6/4d7859161148d4f49ed8a052de0cb123/1-1.png\" alt=\"\" class=\"kg-image\" width=\"1435\" height=\"802\" loading=\"lazy\"/>\n            \n            </figure><p>Send flow data from your network to Cloudflare for analysis</p><h3>Enterprise DDoS attack type detection</h3><p><a href=\"https://developers.cloudflare.com/magic-transit/on-demand/\">Magic Transit On Demand</a> (MTOD) customers will experience significant traffic visibility benefits when using Magic Network Monitoring. <a href=\"https://www.cloudflare.com/network-services/products/magic-transit/\">Magic Transit</a> is a <a href=\"https://www.cloudflare.com/network-security/\">network security solution</a> that offers DDoS protection and traffic acceleration from every Cloudflare data center for on-premise, cloud-hosted, and hybrid networks. Magic Transit On Demand customers can activate Magic Transit for protection when a DDoS attack is detected.</p><p>In general, we noticed that some MTOD customers lacked the network visibility tools to quickly identify DDoS attacks and take the appropriate mitigation action. Now, MTOD customers can use Magic Network Monitoring to analyze their network data and receive an alert if a DDoS attack is detected.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6HcgWfT995D5YTtTjI7t0x/574610a467b76ac566a6925542cc264e/2-1.png\" alt=\"\" class=\"kg-image\" width=\"1436\" height=\"761\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare detects a DDoS attack from the customer’s network flow data</p><p>Once a DDoS attack is detected, Magic Network Monitoring customers can choose to either manually or automatically enable Magic Transit to mitigate any DDoS attacks.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5FlxXObNPK0L8lx2sN0S6S/1f72af26e54e14b46245c9cd1bb53ba2/3-1.png\" alt=\"\" class=\"kg-image\" width=\"1436\" height=\"761\" loading=\"lazy\"/>\n            \n            </figure><p>Activate Magic Transit for DDoS protection</p><h3>Enterprise network monitoring</h3><p>Cloudflare’s Magic WAN and Cloudflare One customers can also benefit from using Magic Network Monitoring. Today, these customers have excellent visibility into the traffic they send through Cloudflare’s network, but sometimes they may lack visibility into traffic that isn’t sent through Cloudflare. This can include traffic that remains on a local network, or network traffic sent in between cloud environments. Magic WAN and Cloudflare One customers can add Magic Network Monitoring into their suite of product solutions to establish end-to-end network visibility across all traffic on their network.</p><h3>A deep dive into network flow and network traffic sampling</h3><p>Magic Network Monitoring gives customers better visibility into their network traffic by ingesting and analyzing network flow data.</p><p>The process starts when a router (or other network flow generation device) collects <a href=\"https://en.wikipedia.org/wiki/Sampling_(statistics)\">statistical samples</a> of inbound and / or outbound packet data. These samples are collected by examining 1 in every X packets, where X is the sampling rate configured on the router. Typical sampling rates range from 1 in every 1,000 to 1 in every 4,000 packets. The ideal sampling rate depends on the traffic volume, traffic diversity, and the compute / memory power of your router’s hardware. You can read more about the <a href=\"https://developers.cloudflare.com/magic-network-monitoring/routers/recommended-sampling-rate/\">recommended network flow sampling rate</a> in Cloudflare’s MNM Developer Docs.</p><p>The sampled data is packaged into one of two industry standard formats for network flow data: NetFlow or sFlow. In NetFlow, the sampled packet data is grouped by different packet characteristics such as source / destination IP, port, and protocol. Each group of sampled packet data also includes a traffic volume estimate. In sFlow, the entire packet header is selected as the representative sample, and there isn’t any data summarization. As a result, sFlow is a richer data format and includes more details about network traffic than NetFlow data. Once either the NetFlow or sFlow data samples are collected, they’re sent to Magic Network Monitoring for analysis and alerting.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2XoUWHVTlsaVD6wYjekYm6/1cad7d0771490b43d75d9341d6d50edc/4-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"400\" loading=\"lazy\"/>\n            \n            </figure><h3>Why simple random sampling didn’t work for Magic Network Monitoring</h3><p>Magic Network Monitoring has come a long way from its early access release one year ago. In particular, the Cloudflare engineering team invested significant time in improving the accuracy of the traffic volume estimations in MNM. In the early access version of Magic Network Monitoring, customers were unexpectedly reporting that their network traffic volume estimates were too high and didn’t match the expected value.</p><p>Magic Network Monitoring performs its own sampling of the NetFlow or sFlow data it receives, so it can effectively scale and manage the data ingested across Cloudflare’s global network. Increasing the accuracy of the traffic volume estimations was more difficult than expected, as the NetFlow or sFlow data parsed by MNM is already built on sampled packet data. This introduces multiple distinct layers of data sampling in the product’s analytics.</p><p>The first version of Magic Network Monitoring used <a href=\"https://en.wikipedia.org/wiki/Simple_random_sample\">random sampling</a> where a random subset of network flow data with the same timestamp was selected to represent the traffic volume at that point in time. A characteristic of network flow data is that some samples are more significant than others and represent a greater volume of network traffic. In order to account for this significance, we can associate a <a href=\"https://en.wikipedia.org/wiki/Weighting\">weight</a> with each sample based on the traffic volume it represents. Network flow data weights are always positive numbers, and they follow a <a href=\"https://en.wikipedia.org/wiki/Long_tail\">long tail distribution</a>. These data characteristics caused MNM’s random sampling to incorrectly estimate the traffic volume of a customer’s network. Customers would see false spikes in their traffic volume analytics when an outlying data sample from the long tail was randomly selected to be the representative of all traffic at that point in time.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2Tje0Xn9GucCoNamBEyvVE/d42f34ec07fa4acfbc61f617b3aa307f/5-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"400\" loading=\"lazy\"/>\n            \n            </figure><h3>Increasing accuracy with VarOpt reservoir sampling</h3><p>To solve this problem, the Cloudflare engineering team implemented an alternative <a href=\"https://en.wikipedia.org/wiki/Reservoir_sampling\">reservoir sampling</a> technique called <a href=\"https://arxiv.org/pdf/0803.0473.pdf\">VarOpt</a>. VarOpt is designed to collect samples from a stream of data when the length of the data stream is unknown (a perfect application for analyzing incoming network flow data). In the MNM implementation of VarOpt, we start with an empty reservoir of a fixed size that is filled with samples of network flow data. When the reservoir is full, and there is still new incoming network flow data, an old sample is randomly discarded from the reservoir and replaced with a new one.</p><p>After a certain number of samples have been observed, we calculate the traffic volume across all weighted samples in the reservoir, and that is the estimated traffic volume of a customer’s network flow at that point in time. Finally, the reservoir is emptied, and the VarOpt loop is restarted by filling the reservoir with the next set of the latest network flow samples.</p><p>The new VarOpt sampling method significantly increased the accuracy of the traffic volume estimations in Magic Network Monitoring, and solved our customer’s problems. These sampling improvements paved the way for general availability, and we’re excited to make accurate network flow analytics available to everyone.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2NYGpyTodAgtP9K8KycjGZ/6507a0e3a9c017846015ae7862fd7633/6-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"320\" loading=\"lazy\"/>\n            \n            </figure><h3>Developer Docs and Discord Community</h3><p>There are detailed <a href=\"https://developers.cloudflare.com/magic-network-monitoring/\">Developer Docs for Magic Network Monitoring</a> that explain the product’s features and outlines a step-by-step configuration guide for new customers. As you’re working through the Magic Network Monitoring documentation, please feel free to provide feedback by clicking the “Give Feedback” button in the top right corner of the Developer Docs.</p><p>We’ve also created a channel in Cloudflare’s Discord community built around debugging configuration problems, testing new features, and providing product feedback. You can follow this link to join the <a href=\"https://discord.gg/cloudflaredev\">Cloudflare Discord server</a>.</p><h3>Free version</h3><p>A <a href=\"https://developers.cloudflare.com/magic-network-monitoring/magic-network-monitoring-free/\">free version of Magic Network Monitoring</a> is available to all Enterprise customers on request to their Cloudflare account team. The free version is designed to enable Enterprise customers to quickly test and evaluate Magic Network Monitoring before purchasing Magic Transit, Magic WAN, or Cloudflare One. Enterprise customers can fully configure Magic Network Monitoring themselves by following the <a href=\"https://developers.cloudflare.com/magic-network-monitoring/get-started/\">step-by-step onboarding guide</a> in the product’s documentation. The free version has some <a href=\"https://developers.cloudflare.com/magic-network-monitoring/magic-network-monitoring-free/\">limitations</a> on the quantity of traffic that can be processed which are further outlined in the product’s documentation.</p><p>The free version of Magic Network Monitoring is also available to all Free, Pro, and Business plan Cloudflare customers via a closed beta. Anyone can request access to the free version by <a href=\"https://developers.cloudflare.com/magic-network-monitoring/magic-network-monitoring-free/\">reading the free version documentation</a> and <a href=\"https://forms.gle/z93ghpydpKdAFZ7P9\">filling out this form</a>. Priority access is granted to anyone that joins <a href=\"https://discord.com/invite/cloudflaredev\">Cloudflare’s Discord server</a> and sends a message in the Magic Network Monitoring Discord channel.</p><h3>Next steps that you can take today</h3><p>Magic Network Monitoring is generally available, and all Magic Transit and Magic WAN customers have been automatically granted access to the product today. You can navigate to the product by going to the account level of the Cloudflare dashboard, then selecting “Analytics &amp; Logs &gt; Magic Monitoring”.</p><p>If you’re an enterprise customer without Magic Transit or Magic WAN, and you want to use Magic Network Monitoring to improve your traffic visibility, you can <a href=\"https://cloudflare.com/network-services/products/magic-network-monitoring/\">talk with an MNM expert today</a>.</p><p>If you’re interested in using Magic Transit and Magic Network Monitoring for DDoS protection, you can <a href=\"https://www.cloudflare.com/network-services/products/magic-transit/\">request a demo of Magic Transit</a>. If you want to use Magic WAN and Magic Network Monitoring together to establish end-to-end network traffic visibility, you can <a href=\"https://www.cloudflare.com/network-services/products/magic-wan/\">talk with a Magic WAN expert</a>.</p>",
		"id": "5Q496AB243DF9bETeys1Pq",
		"localeList": {
			"name": "Network flow monitoring is GA, providing end-to-end traffic visibility Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Network engineers often need better visibility into their network’s traffic when analyzing DDoS attacks or troubleshooting other traffic anomalies. To solve this problem, Cloudflare offers a network flow monitoring product that gives customers end-to-end traffic visibility across their network.",
		"metadata": {
			"title": "Network flow monitoring is GA, providing end-to-end traffic visibility",
			"description": "Network engineers often need better visibility into their network’s traffic when analyzing DDoS attacks or troubleshooting other traffic anomalies. To solve this problem, Cloudflare offers a network flow monitoring product that gives customers end-to-end traffic visibility across their network.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/30FgOzVPCQXk0MnKmGhHqe/965ce4138d04946987b5ebc5ff4cb684/network-flow-monitoring-generally-available-Jaj0SG.png"
		},
		"primary_author": {},
		"published_at": "2023-10-18T14:00:53.000+01:00",
		"reading_time": 7,
		"slug": "network-flow-monitoring-generally-available",
		"tags": [
			{
				"id": "2MmIaRxeAoiOCQvtkz2tjy",
				"name": "Magic Network Monitoring",
				"slug": "magic-network-monitoring"
			},
			{
				"id": "2s3r2BdfPas9oiGbGRXdmQ",
				"name": "Network Services",
				"slug": "network-services"
			},
			{
				"id": "7qTIAO0WLKVKPVrj8q1vpD",
				"name": "Magic Transit",
				"slug": "magic-transit"
			},
			{
				"id": "7r0zxUQ3XCgTw2blCdlw55",
				"name": "Magic WAN",
				"slug": "magic-wan"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			}
		],
		"title": "Network flow monitoring is GA, providing end-to-end traffic visibility",
		"updated_at": "2024-08-27T01:03:39.258Z",
		"url": "https://blog.cloudflare.com/network-flow-monitoring-generally-available"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}