{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"ko-kr"
	],
	"post": {
		"authors": [
			{
				"name": "Vivek Ganti",
				"slug": "vivek",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/62IKvdVNrkquydlyN6ffOD/783ec521b9579788f78de393095e6c8b/vivek.jpeg",
				"location": null,
				"website": null,
				"twitter": "@VivekGanti",
				"facebook": null
			},
			{
				"name": "Omer Yoachimik",
				"slug": "omer",
				"bio": "Product Manager / Cloudflare's DDoS Protection Service",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6TXRnB1v4ZHGiL3nRlvRTZ/946efe152cca5f55320466c0d3208fc1/omer.png",
				"location": "London",
				"website": null,
				"twitter": "@OmerYoahimik",
				"facebook": null
			}
		],
		"excerpt": "In Q3 ‘20, Cloudflare observed a surge in DDoS attacks, with double the number of DDoS attacks and more attack vectors deployed than ever — with a notable surge in protocol-specific DDoS attacks such as mDNS, Memcached, and Jenkins amplification floods.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3krmfuyxPuI2ZJBr6ETzWK/a8e12f9f8af2593d55bb3471411895de/network-layer-ddos-attack-trends-for-q3-2020.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1jF83Q9sYOyLDQ8T7y5CXX/edc551880215cfd79373fa0511776073/image6-4.png\" alt=\"\" class=\"kg-image\" width=\"1348\" height=\"766\" loading=\"lazy\"/>\n            \n            </figure><p><b>DDoS attacks are surging</b> — both in frequency and sophistication. After doubling from Q1 to Q2, the total number of network layer attacks observed in Q3 doubled again — resulting in a 4x increase in number compared to the pre-COVID levels in the first quarter. Cloudflare also observed more attack vectors deployed than ever — in fact, while SYN, RST, and UDP floods continue to dominate the landscape, we saw an explosion in protocol specific attacks such as mDNS, Memcached, and Jenkins DoS attacks.</p><p>Here are other key network layer DDoS trends we observed in Q3:</p><ul><li><p>Majority of the attacks are under 500 Mbps and 1 Mpps — both still suffice to cause service disruptions</p></li><li><p>We continue to see a majority of attacks be under 1 hr in duration</p></li><li><p>Ransom-driven DDoS attacks (RDDoS) are on the rise as groups claiming to be Fancy Bear, Cozy Bear and the Lazarus Group extort organizations around the world. As of this writing, the ransom campaign is still ongoing. See a special note on this below.</p></li></ul><h3>Number of attacks</h3><p>The total number of L3/4 DDoS attacks we observe on our network continues to increase substantially, as indicated in the graph below. All in all, Q3 saw over 56% of all attacks this year — double that of Q2, and four times that of Q1. In addition, the number of attacks per month increased throughout the quarter.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/eIvD1EPThyRCdvoFBL8XX/96dfe7998e930987adaacbacc3ee26ab/image12-1.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><p>While September witnessed the largest number of attacks overall, August saw the most large attacks (over 500Mbps). Ninety-one percent of large attacks in Q3 took place in that month—while monthly distribution of other attack sizes was far more even.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2IrTs1dyFpufH2GrOLC3Pa/ee2783d6a1d755e2fc612708e5486812/image9-1.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><p>While the total number of attacks between 200-300 Gbps decreased in September, we saw more global attacks on our network in Q3. This suggests the increase in the use of distributed botnets to launch attacks. In fact, in early July, Cloudflare witnessed <a href=\"/moobot-vs-gatebot-cloudflare-automatically-blocks-botnet-ddos-attack-topping-at-654-gbps/\">one of the largest-ever attacks on our network</a> — generated by Moobot, a <a href=\"/inside-mirai-the-infamous-iot-botnet-a-retrospective-analysis/\">Mirai</a>-based botnet. The attack peaked at 654 Gbps and originated from 18,705 unique IP addresses, each believed to be a Moobot-infected IoT device. The attack campaign lasted nearly 10 days, but the customer was protected by Cloudflare, so they observed no downtime or service degradation.</p><!--kg-card-begin: html--><h2 id=\"blog-1-ddos\">Attack size (bit rate and packet rate)</h2><!--kg-card-end: html--><p>There are different ways of measuring a L3/4 DDoS attack’s size. One is the volume of traffic it delivers, measured as the bit rate (specifically, Gigabits-per-second). Another is the number of packets it delivers, measured as the packet rate (specifically, packets-per-second). Attacks with high bit rates attempt to saturate the Internet link, and attacks with high packet rates attempt to overwhelm the routers or other in-line hardware devices.</p><p>In Q3, most of the attacks we observed were smaller in size. In fact, over 87% of all attacks were under 1 Gbps. This represents a significant increase from Q2, when roughly 52% of attacks were that small.  Note that, even ‘small’ attacks of under 500 Mbps are many times sufficient to create major disruptions for Internet properties that are not protected by a Cloud based DDoS protection service. Many organizations have uplinks provided by their ISPs that are far less than 1 Gbps. Assuming their public facing network interface also serves legitimate traffic, you can see how even these ‘small’ DDoS attacks can easily take down Internet properties.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/67jEBElzS4SdgzUg2qWb6y/692994d9e27d0fa35c2a146bd1c93cf0/image10-2.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><p>This trend holds true for attack packet rates. In Q3, 47% of attacks were under 50k pps — compared to just 19% in Q2.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6jDfpcPzz6D2Ga9pudsPdJ/3076ac11c1e3e1ba1ea795868a6947fb/image8-1.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><p>Smaller attacks can indicate that amateur attackers may be behind the attacks — using tools easily available to generate attacks on exposed IPs/ networks. Alternatively, small attacks may serve as a smokescreen to distract security teams from other kinds of cyberattacks that might be taking place simultaneously.</p><h3>Attack duration</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2EGtlfRfpul4ouwzzixxB5/5ceb234382d2de72c1e89f0e7658cea9/image5-3.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><p>In terms of length, very short attacks were the most common attack type observed in Q3, accounting for nearly 88% of all attacks. This observation is in line with our prior reports — in general, Layer 3/4 DDoS attacks are getting shorter in duration.</p><p>Short burst attacks may attempt to cause damage without being detected by DDoS detection systems. DDoS services that rely on manual analysis and mitigation may prove to be useless against these types of attacks because they are over before the analyst even identifies the attack traffic.</p><p>Alternatively, the use of short attacks may be used to probe the cyber defenses of the target. Load-testing tools and automated DDoS tools, that are widely available on the dark web, can generate short bursts of, say, a SYN flood, and then following up with another short attack using an alternate attack vector. This allows attackers to understand the security posture of their targets before they decide to potentially launch larger attacks at larger rates and longer durations - which come at a cost.</p><p>In other cases, attackers generate small DDoS attacks as proof and warning to the target organization of the attacker’s ability to cause real damage later on. It’s often followed by a ransom note to the target organization, demanding payment so as to avoid suffering an attack that could more thoroughly cripple network infrastructure.</p><p>Whatever their motivation, DDoS attacks of any size or duration are not going away anytime soon. Even short DDoS attacks cause harm, and having an automated real-time defense mechanism in place is critical for any online business.</p><h3>Attack vectors</h3><p><a href=\"https://www.cloudflare.com/learning/ddos/syn-flood-ddos-attack/\">SYN floods</a> constituted nearly 65% of all attacks observed in Q3, followed by RST floods and UDP floods in second and third places. This is relatively consistent with observations from previous quarters, highlighting the DDoS attack vector of choice by attackers.</p><p>While TCP based attacks like SYN and RST floods continue to be popular, UDP-protocol specific attacks such as mDNS, Memcached, and Jenkins are seeing an explosion compared to the prior quarter.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3aC5Dl4SPW5m6IWzVdlJpJ/42797286bbdac341d1954da31099e68d/image-5.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1IzY6gk4kSWcqvKrcBtLmo/2c18bde7001d261b541cf688e8e239c9/image13-1.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><p>Multicast DNS (mDNS) is a UDP-based protocol that is used in local networks for service/device discovery. Vulnerable mDNS servers respond to unicast queries originating outside of the local network, which are ‘spoofed’ (altered) with the victim&#39;s source address. This results in amplification attacks. In Q3, we noticed an explosion of mDNS attacks — specifically, we saw a 2,680% increase compared to the previous quarter.</p><p>This was followed by <a href=\"https://www.cloudflare.com/learning/ddos/memcached-ddos-attack\">Memcached</a> and Jenkins attacks. Memcached is a Key Value database. Requests can be made over the UDP protocol with a spoofed source address of the target. The size of the Value stored in the requested Key will affect the amplification factor, resulting in a DDoS amplification attack. Similarly, Jenkins, NTP, Ubiquity and the other UDP based protocols have seen a dramatic increase over the quarter due to its UDP stateless nature. A vulnerability in the older version (<a href=\"https://nvd.nist.gov/vuln/detail/CVE-2020-2100\">Jenkins 2.218</a> and earlier) aided the launch of DDoS attacks. This vulnerability was fixed in Jenkins 2.219 by disabling UDP multicast/ broadcast messages by default. However there are still many vulnerable and exposed devices that run UDP based services which are being harnessed to generate volumetric amplification attacks.</p><h3>Attack by country</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7G3o9akXvt2LTGVWEijSqr/a36725581dcd01a54848541d62e69da7/image2-9.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1N6lAC9tcUt07R9tJlv1Tv/69e494f8df542d2750a925d82b07ced9/image4-8.png\" alt=\"\" class=\"kg-image\" width=\"1567\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><p>Looking at country-based distribution, the United States observed the most number of L3/4 DDoS attacks, followed by Germany and Australia. Note that when analyzing L3/4 DDoS attacks, we bucket the traffic by the Cloudflare edge data center locations where the traffic was ingested, and not by the location of the source IP. The reason is when attackers launch L3/4 attacks they can spoof the source IP address in order to obfuscate the attack source. If we were to derive the country based on a spoofed source IP, we would get a spoofed country. Cloudflare is able to overcome the challenges of spoofed IPs by displaying the attack data by the location of Cloudflare’s data center in which the attack was observed. We’re able to achieve geographical accuracy in our report because we have data centers in over 200 cities around the world.</p><h3>Africa</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7wsuVQRHIvB0rqToNcP9Tl/dd5f361620d4f0dd4ea3d2d199ead683/BDES-1247_DDoS_Trends_Report_Q32020-10.png\" alt=\"\" class=\"kg-image\" width=\"2320\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><h3>Asia Pacific &amp; Oceania</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6ACJVFEAu49FbAEq1QNt6v/813786a4bdaa2554b63b1dd4dabade4d/BDES-1247_DDoS_Trends_Report_Q32020-11.png\" alt=\"\" class=\"kg-image\" width=\"2320\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><h3>Europe</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/ITS2QtgD0BCbrSl2td6LE/3c38fdb58e9487be2a2946012b1201cc/BDES-1247_DDoS_Trends_Report_Q32020-12.png\" alt=\"\" class=\"kg-image\" width=\"2320\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><h3>Middle East</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/21t1TvjNu1RBkTF4u3pIxI/15076f0511bd0e2501e1c304ae29c45e/Middle-East_3x.png\" alt=\"\" class=\"kg-image\" width=\"3341\" height=\"1189\" loading=\"lazy\"/>\n            \n            </figure><h3>North America</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3V3ZzVYkNANX8iwKAmVSbK/442467e5897ce8946a98d0ab5bcc8256/North-America_3x.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"712\" loading=\"lazy\"/>\n            \n            </figure><h3>South America</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5BOr2iIu2AbVgqIsyLRKTB/94a309327bbce782305a9eeb2230e730/BDES-1247_DDoS_Trends_Report_Q32020-15.png\" alt=\"\" class=\"kg-image\" width=\"2320\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><h3>United States</h3>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/66zKSWET6zVODRjcb2seiU/e36588c61e70069f993f48f5cee5eb43/BDES-1247_DDoS_Trends_Report_Q32020-16.png\" alt=\"\" class=\"kg-image\" width=\"2320\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure><h3>A note on recent ransom-driven DDoS attacks</h3><p>Over the past months, Cloudflare has observed another disturbing trend — a rise in extortion and ransom-based DDoS (RDDoS) attacks targeting organizations around the world. While RDDoS threats do not always result in an actual attack, the cases seen in recent months show that attacker groups are willing to carry out the threat, launching large scale DDoS attacks that can overwhelm organizations that lack adequate protection. In some cases, the initial teaser attack may be sufficient to cause impact if not protected by a Cloud based DDoS protection service.</p><p>In a RDDoS attack, a malicious party threatens a person or organization with a cyberattack that could knock their networks, websites, or applications offline for a period of time, unless the person or organization pays a ransom. You can read more about RDDoS attacks <a href=\"https://www.cloudflare.com/learning/ddos/ransom-ddos-attack/\">here</a>.</p><p>Entities claiming to be Fancy Bear, Cozy Bear, and Lazarus have been threatening to launch DDoS attacks against organizations’ websites and network infrastructure unless a ransom is paid before a given deadline. Additionally, an initial ‘teaser’ DDoS attack is usually launched as a form of demonstration before parallel to the ransom email. The demonstration attack is typically a UDP reflection attack using a variety of protocols, lasting roughly 30 minutes in duration (or less).</p><p>What to do if you receive a threat:</p><ol><li><p><b>Do not panic and we recommend you to not pay the ransom</b>: Paying the ransom only encourages bad actors, finances illegal activities —and there’s no guarantee that they won’t attack your network now or later.</p></li><li><p><b>Notify local law enforcement</b>: They will also likely request a copy of the ransom letter that you received.</p></li><li><p><b>Contact Cloudflare</b>: We can help ensure your website and network infrastructure are safeguarded from these ransom attacks.</p></li></ol><h3>Cloudflare DDoS protection is different</h3><p>On-prem hardware/cloud-scrubbing centers can&#39;t address the challenges of modern volumetric DDoS attacks. Appliances are easily overwhelmed by large DDoS attacks, Internet links quickly saturate, and rerouting traffic to cloud scrubbing centers introduces unacceptable latency penalties. Our <a href=\"https://www.cloudflare.com/ddos/\">cloud-native, always-on, automated DDoS protection</a> approach solves problems that traditional cloud signaling approaches were originally created to address.</p><p>Cloudflare’s mission is to help build a better Internet, which grounds our DDoS approach and is why in 2017, we pioneered <a href=\"/unmetered-mitigation/\">unmetered DDoS mitigation</a> for all of our customers on all plans including the <a href=\"https://www.cloudflare.com/plans/free/\">free plan</a>. We are able to provide this level of protection because every server on our network can <a href=\"https://www.cloudflare.com/products/zero-trust/threat-defense/\">detect &amp; block threats</a>, enabling us to absorb attacks of any size/kind, with no latency impact. This architecture gives us unparalleled advantages compared to any other vendor.</p><ul><li><p><b>51 Tbps of DDoS mitigation capacity and under 3 sec TTM</b>: Every data center in Cloudflare’s network detects and mitigates DDoS attacks. Once an attack is identified, the Cloudflare’s local data center mitigation system (dosd) generates and applies a dynamically crafted rule with a real-time signature — and mitigates attacks in under 3 seconds globally on average. This 3-second Time To Mitigate (TTM) is one of the fastest in the industry. Firewall rules and “proactive”/static configurations take effect immediately.</p></li><li><p><b>Fast performance included</b>:  Cloudflare is architected so that customers do not incur a latency penalty as a result of attacks. We deliver DDoS protection from every Cloudflare data center (instead of legacy scrubbing centers or on-premise hardware boxes) which allows us to mitigate attacks closest to the source. Cloudflare analyzes traffic out-of-path ensuring that our DDoS mitigation solution doesn’t add any latency to legitimate traffic. The rule is applied at the most optimal place in the Linux stack for a cost efficient mitigation, ensuring no performance penalty.</p></li><li><p><b>Global Threat Intelligence</b>: Like an immune system, our network learns from/mitigates attacks against any customer to protect them all. With threat intelligence (TI), it automatically blocks attacks and is employed in customer facing features (Bot Fight mode, Firewall Rules &amp; Security Level). Users create custom rules to mitigate attacks based on traffic attribute filters, threat &amp; bot scores generated using ML models (protecting against bots/botnets/DDoS).</p></li></ul><p>To learn more about Cloudflare’s DDoS solution <a href=\"https://www.cloudflare.com/plans/enterprise/\">contact us</a> or <a href=\"https://dash.cloudflare.com/\">get started</a>.</p>",
		"id": "2wAF9ScxGpcNPZViO9aZhy",
		"localeList": {
			"name": "Network-layer DDoS attack trends for Q3 2020 Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "In Q3 ‘20, Cloudflare observed a surge in DDoS attacks, with double the number of DDoS attacks and more attack vectors deployed than ever — with a notable surge in protocol-specific DDoS attacks such as mDNS, Memcached, and Jenkins amplification floods.",
		"metadata": {
			"title": "Network-layer DDoS attack trends for Q3 2020",
			"description": "In Q3 ‘20, Cloudflare observed a surge in DDoS attacks, with double the number of DDoS attacks and more attack vectors deployed than ever — with a notable surge in protocol-specific DDoS attacks such as mDNS, Memcached, and Jenkins amplification floods.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1Fo91fVxWa0ajkyqa5x9tG/b14d1657e3106c684e8e06a5f9631a91/network-layer-ddos-attack-trends-for-q3-2020-OAoUzK.png"
		},
		"primary_author": {},
		"published_at": "2020-11-18T12:00:00.000+00:00",
		"reading_time": 9,
		"slug": "network-layer-ddos-attack-trends-for-q3-2020",
		"tags": [
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "3yArjf0gLKZy8ObEDxbNNi",
				"name": "Trends",
				"slug": "trends"
			},
			{
				"id": "MXYgUwJ95r7GcYFDp9g9o",
				"name": "RDDoS",
				"slug": "rddos"
			},
			{
				"id": "3A8zENWUQfuFg8Pwk89BtL",
				"name": "Ransom Attacks",
				"slug": "ransom-attacks"
			},
			{
				"id": "38pRAsiGNd0uupgsAlp6qb",
				"name": "Fancy Bear",
				"slug": "fancy-bear"
			},
			{
				"id": "54Tkjs4keJGD0ddq0dfL5Y",
				"name": "DDoS Reports",
				"slug": "ddos-reports"
			}
		],
		"title": "Network-layer DDoS attack trends for Q3 2020",
		"updated_at": "2024-08-27T01:56:01.127Z",
		"url": "https://blog.cloudflare.com/network-layer-ddos-attack-trends-for-q3-2020"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}