{
	"locale": "en-us",
	"localesAvailable": [
		"fr-fr",
		"de-de",
		"it-it",
		"pt-br",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Tanya Verma",
				"slug": "tanya",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4quDYEhBbKpsdMG60fOEOV/9fa4a3c879b8d7a76b3949092c9db240/tanya.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Sudheesh Singanamalla",
				"slug": "sudheesh",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1gkjKUHvLpftKBFIivkAlw/491322a812cef9c9525e66d3c329463a/sudheesh.jpg",
				"location": "Seattle",
				"website": "https://sudheesh.info/",
				"twitter": "@sudheesh001",
				"facebook": null
			}
		],
		"excerpt": "Oblivious DoH (ODoH) makes secure DNS over HTTPS (DoH) queries into private queries which prevent the leakage of client IP addresses to resolvers. The new proposed ODoH standard addresses this problem and today we are enabling users to use this protocol with 1.1.1.1",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7p97uca5T7wfhXkOPZDSjr/8fff6628ae33db02a2ec9d37f401c12e/oblivious-dns.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4YBSKOlLClafeeeiPkHjGT/3c5018b6bef3f43cb06f29eb46d6b086/image2-4.png\" alt=\"Improving DNS Privacy with Oblivious DoH in 1.1.1.1\" class=\"kg-image\" width=\"1999\" height=\"1068\" loading=\"lazy\"/>\n            \n            </figure><p>Today we are announcing support for a new proposed DNS standard — co-authored by engineers from Cloudflare, Apple, and Fastly — that separates IP addresses from queries, so that no single entity can see both at the same time. Even better, we’ve made source code available, so anyone can try out ODoH, or run their own ODoH service!</p><p>But first, a bit of context. The <a href=\"https://www.cloudflare.com/learning/dns/what-is-dns/\">Domain Name System (DNS)</a> is the foundation of a human-usable Internet. It maps usable domain names, such as cloudflare.com, to IP addresses and other information needed to connect to that domain. A quick primer about <a href=\"/announcing-1111/\">the importance and issues with DNS</a> can be read in a previous blog post. For this post, it’s enough to know that, in the initial design and still dominant usage of DNS, queries are sent in cleartext. This means anyone on the network path between your device and the DNS resolver can see both the query that contains the hostname (or website) you want, as well as the IP address that identifies your device.</p><p>To safeguard DNS from onlookers and third parties, the IETF standardized DNS encryption with DNS over HTTPS (DoH) and DNS over TLS (DoT). Both protocols prevent queries from being intercepted, redirected, or modified between the client and resolver. Client support for DoT and DoH is growing, having been implemented in recent versions of Firefox, iOS, and more. Even so, until there is wider deployment among Internet service providers, Cloudflare is one of only a few providers to offer a public DoH/DoT service. This has raised two main concerns. One concern is that the centralization of DNS introduces single points of failure (although, with data centers in more than 100 countries, Cloudflare is designed to always be reachable). The other concern is that the resolver can still link all queries to client IP addresses.</p><p>Cloudflare is committed to end-user privacy. Users of our public DNS resolver service are protected by a <a href=\"/announcing-the-results-of-the-1-1-1-1-public-dns-resolver-privacy-examination/\">strong, audited privacy policy</a>. However, for some, trusting Cloudflare with sensitive query information is a barrier to adoption, even with such a strong privacy policy. Instead of relying on privacy policies and audits, what if we could give users an option to remove that bar with technical guarantees?</p><p>Today, Cloudflare and partners are launching support for a protocol that does exactly that: Oblivious DNS over HTTPS, or ODoH for short.</p><h3>ODoH Partners:</h3><p>We&#39;re excited to launch ODoH with several leading launch partners who are equally committed to privacy.</p><p>A key component of ODoH is a proxy that is disjoint from the target resolver. Today, we’re launching ODoH with several leading proxy partners, including: PCCW, SURF, and Equinix.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7axirA87xboerNnYyli8zt/e9e0310f1d7f8eb17ba66ec1a283268e/image3-8.png\" alt=\"\" class=\"kg-image\" width=\"1135\" height=\"587\" loading=\"lazy\"/>\n            \n            </figure><blockquote><p>“ODoH is a revolutionary new concept designed to keep users&#39; privacy at the center of everything. Our ODoH partnership with Cloudflare positions us well in the privacy and &quot;Infrastructure of the Internet&quot; space. As well as the enhanced security and performance of the underlying PCCW Global network, which can be accessed on-demand via Console Connect, the performance of the proxies on our network are now improved by Cloudflare’s 1.1.1.1 resolvers. This model for the first time completely decouples client proxy from the resolvers. This partnership strengthens our existing focus on privacy as the world moves to a more remote model and privacy becomes an even more critical feature.” -- <b>Michael Glynn, Vice President, Digital Automated Innovation, PCCW Global</b></p></blockquote>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/uPbM9bA5gK1hN0WV5oafZ/a0bd29366722a889120ddd15818b40b6/image8-1.png\" alt=\"\" class=\"kg-image\" width=\"600\" height=\"102\" loading=\"lazy\"/>\n            \n            </figure><blockquote><p>“We are partnering with Cloudflare to implement better user privacy via ODoH. The move to ODoH is a true paradigm shift, where the users’ privacy or the IP address is not exposed to any provider, resulting in true privacy. With the launch of ODoH-pilot, we’re joining the power of Cloudflare’s network to meet the challenges of any users around the globe. The move to ODoH is not only a paradigm shift but it emphasizes how privacy is important to any users than ever, especially during 2020. It resonates with our core focus and belief around Privacy.” — <b>Joost van Dijk, Technical Product Manager, SURF</b></p></blockquote>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2TQuTnYRxLfYdwe6vge5Yp/88a8baf7b92c2ac42519b8506430db60/image9.png\" alt=\"\" class=\"kg-image\" width=\"280\" height=\"178\" loading=\"lazy\"/>\n            \n            </figure><h3>How does Oblivious DNS over HTTPS (ODoH) work?</h3><p>ODoH is an emerging protocol being developed at the <a href=\"https://tools.ietf.org/html/draft-pauly-dprive-oblivious-doh-03\">IETF</a>. ODoH works by adding a layer of public key encryption, as well as a network proxy between clients and DoH servers such as 1.1.1.1. The combination of these two added elements guarantees that only the user has access to both the DNS messages and their own IP address at the same time.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4yoWivpvmLp3zicMA3zRcv/da0117cae953c7d4a13fac1baf99e29f/image6-2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"580\" loading=\"lazy\"/>\n            \n            </figure><p>There are three players in the ODoH path. Looking at the figure above, let’s begin with the target. <b>The target</b> decrypts queries encrypted by the client, via a proxy. Similarly, the target encrypts responses and returns them to the proxy. The standard says that the target may or may not be the resolver (we’ll touch on this later). <b>The proxy</b> does as a proxy is supposed to do, in that it forwards messages between client and target. <b>The client</b> behaves as it does in DNS and DoH, but differs by encrypting queries for the target, and decrypting the target’s responses. Any client that chooses to do so can specify a proxy and target of choice.</p><p>Together, the added encryption and proxying provide the following guarantees:</p><ol><li><p>The target sees only the query and the proxy’s IP address.</p></li><li><p>The proxy has no visibility into the DNS messages, with no ability to identify, read, or modify either the query being sent by the client or the answer being returned by the target.</p></li><li><p>Only the intended target can read the content of the query and produce a response.</p></li></ol><p>These three guarantees improve client privacy while maintaining the security and integrity of DNS queries. However, each of these guarantees relies on one fundamental property — that <b>the proxy and the target servers do not collude</b>. So long as there is no collusion, an attacker succeeds only if both the proxy and target are compromised.</p><p>One aspect of this system worth highlighting is that the target is separate from the upstream recursive resolver that performs DNS resolution. In practice, for performance, we expect the target to be the same. In fact, 1.1.1.1 is now both a recursive resolver and a target! There is no reason that a target needs to exist separately from any resolver. If they are separated then the target is free to choose resolvers, and just act as a go-between. The only real requirement, remember, is that the proxy and target never collude.</p><p>Also, importantly, clients are in complete control of proxy and target selection. Without any need for <a href=\"https://wiki.mozilla.org/Trusted_Recursive_Resolver\">TRR</a>-like programs, clients can have privacy for their queries, in addition to security. Since the target only knows about the proxy, the target and any upstream resolver are oblivious to the existence of any client IP addresses. Importantly, this puts clients in greater control over their queries and the ways they might be used. For example, clients could select and alter their proxies and targets any time, for any reason!</p><h3>ODoH Message Flow</h3><p>In ODoH, the ‘O’ stands for oblivious, and this property comes from the level of encryption of the DNS messages themselves. This added encryption is `end-to-end` between client and target, and independent from the connection-level encryption provided by TLS/HTTPS. One might ask why this additional encryption is required at all in the presence of a proxy. This is because two separate TLS connections are required to support proxy functionality. Specifically, the proxy terminates a TLS connection from the client, and initiates another TLS connection to the target. Between those two connections, the DNS message contexts would otherwise appear in plaintext! For this reason, ODoH additionally encrypts messages between client and target so the proxy has no access to the message contents.</p><p>The whole process begins with clients that encrypt their query for the target using <a href=\"https://tools.ietf.org/html/draft-irtf-cfrg-hpke-06\">HPKE</a>. Clients obtain the target’s public key via DNS, where it is bundled into a <a href=\"https://tools.ietf.org/html/draft-ietf-dnsop-svcb-https-02\">HTTPS resource record</a> and protected by DNSSEC. When the TTL for this key expires, clients request a new copy of the key as needed (just as they would for an A/AAAA record when that record’s TTL expires). The usage of a target’s DNSSEC-validated public key guarantees that only the intended target can decrypt the query and encrypt a response (answer).</p><p>Clients transmit these encrypted queries to a proxy over an HTTPS connection. Upon receipt, the proxy forwards the query to the designated target. The target then decrypts the query, produces a response by sending the query to a recursive resolver such as 1.1.1.1, and then encrypts the response to the client. The encrypted query from the client contains encapsulated keying material from which targets derive the response encryption symmetric key.</p><p>This response is then sent back to the proxy, and then subsequently forwarded to the client. All communication is authenticated and confidential since these DNS messages are end-to-end encrypted, despite being transmitted over two separate HTTPS connections (client-proxy and proxy-target). The message that otherwise appears to the proxy as plaintext is actually an encrypted garble.</p><h3>What about Performance? Do I have to trade performance to get privacy?</h3><p>We’ve been doing lots of measurements to find out, and will be doing more as ODoH deploys more widely. Our initial set of measurement configurations spanned cities in the USA, Canada, and Brazil. Importantly, our measurements include not just 1.1.1.1, but also 8.8.8.8 and 9.9.9.9. The full set of measurements, so far, is documented for <a href=\"https://arxiv.org/abs/2011.10121\">open access</a>.</p><p>In those measurements, it was important to isolate the cost of proxying and additional encryption from the cost of TCP and TLS connection setup. This is because the TLS and TCP costs are incurred by DoH, anyway. So, in our setup, we ‘primed’ measurements by establishing connections once and reusing that connection for all measurements. We did this for both DoH and for ODoH, since the same strategy could be used in either case.</p><p>The first thing that we can say with confidence is that the additional encryption is marginal. We know this because we randomly selected 10,000 domains from the <a href=\"https://arxiv.org/abs/1806.01156\">Tranco million dataset</a> and measured both encryption of the A record with a different public key, as well as its decryption. The additional cost between a proxied DoH query/response and its ODoH counterpart is consistently less than 1ms at the 99th percentile.</p><p>The ODoH request-response pipeline, however, is much more than just encryption. A very useful way of looking at measurements is by looking at the cumulative distribution chart — if you’re familiar with these kinds of charts, skip to the next paragraph. In contrast to most charts where we start along the x-axis, with cumulative distributions we often start with the y-axis.</p><p>The chart below shows the cumulative distributions for query/response times in DoH, ODoH, and DoH when transmitted over the Tor Network. The dashed horizontal line that starts on the left from 0.5 is the 50% mark. Along this horizontal line, for any plotted curve, the part of the curve below the dashed line is 50% of the data points. Now look at the x-axis, which is a measure of time. The lines that appear to the left are faster than lines to the right. One last important detail is that the x-axis is plotted on a logarithmic scale. What does this mean? Notice that the distance between the labeled markers (10x) is equal in cumulative distributions but the ‘x’ is an exponent, and represents orders of magnitude. So, while the time difference between the first two markers is 9ms, the difference between the 3rd and 4th markers is 900ms.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1hhI6LPQUHxDXKAN7VKJmb/fd42d4e02dcb201ba87b505fb0223750/image7-1.png\" alt=\"\" class=\"kg-image\" width=\"879\" height=\"681\" loading=\"lazy\"/>\n            \n            </figure><p>In this chart, the middle curve represents ODoH measurements. We also measured the performance of privacy-preserving alternatives, for example, DoH queries transmitted over the Tor network as represented by the right curve in the chart. (Additional privacy-preserving alternatives are captured in the open access <a href=\"https://arxiv.org/abs/2011.10121\">technical report</a>.) Compared to other privacy-oriented DNS variants, ODoH cuts query time in half, or better. This point is important since privacy and performance rarely play nicely together, so seeing this kind of improvement is encouraging!</p><p>The chart above also tells us that 50% of the time ODoH queries are resolved in fewer than 228ms. Now compare the middle line to the left line that represents ‘straight-line’ (or normal) DoH without any modification. That left plotline says that 50% of the time, DoH queries are resolved in fewer than 146ms. Looking below the 50% mark, the curves also tell us that ½ the time that difference is never greater than 100ms. On the other side, looking at the curves above the 50% mark tells us that ½ ODoH queries are competitive with DoH.</p><p>Those curves also hide a lot of information, so it is important to delve further into the measurements. The chart below has three different cumulative distribution curves that describe ODoH performance if we select proxies and targets by their latency. This is also an example of the insights that measurements can reveal, some of which are counterintuitive. For example, looking above 0.5, these curves say that ½ of ODoH query/response times are virtually indistinguishable, no matter the choice of proxy and target. Now shift attention below 0.5 and compare the two solid curves against the dashed curve that represents overall average. This region suggests that selecting the lowest-latency proxy and target offers minimal improvement over the average but, most importantly, it shows that selecting the lowest-latency proxy leads to worse performance!</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4ruOPaoGythP8vZQm6RUJI/24b19eed2b73e4a1b2a7d2f8e6b3f5ba/image4-3.png\" alt=\"\" class=\"kg-image\" width=\"568\" height=\"459\" loading=\"lazy\"/>\n            \n            </figure><p>Open questions remain, of course. This first set of measurements were executed largely in North America. Does performance change at a global level? How does this affect client performance, in practice? We’re working on finding out, and this release will help us to do that.</p><h3>Interesting! Can I experiment with ODoH? Is there an open ODoH service?</h3><p>Yes, and yes! We have open sourced our interoperable ODoH implementations in Rust, <a href=\"https://github.com/cloudflare/odoh-rs/\">odoh-rs</a> and Go, <a href=\"https://github.com/cloudflare/odoh-go/\">odoh-go</a>, as well as integrated the target into the Cloudflare DNS Resolver. That’s right, 1.1.1.1 is ready to receive queries via ODoH.</p><p>We have also open sourced test clients in Rust, <a href=\"https://github.com/cloudflare/odoh-client-rs/\">odoh-client-rs</a>, and Go, <a href=\"https://github.com/cloudflare/odoh-client-go/\">odoh-client-go</a>, to demo ODoH queries. You can also check out the HPKE configuration used by ODoH for message encryption to 1.1.1.1 by querying the service directly:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ dig -t type65 +dnssec @ns1.cloudflare.com odoh.cloudflare-dns.com \n\n; &lt;&lt;&gt;&gt; DiG 9.10.6 &lt;&lt;&gt;&gt; -t type65 +dnssec @ns1.cloudflare.com odoh.cloudflare-dns.com\n; (1 server found)\n;; global options: +cmd\n;; Got answer:\n;; -&gt;&gt;HEADER&lt;&lt;- opcode: QUERY, status: NOERROR, id: 19923\n;; flags: qr aa rd; QUERY: 1, ANSWER: 2, AUTHORITY: 0, ADDITIONAL: 1\n;; WARNING: recursion requested but not available\n\n;; OPT PSEUDOSECTION:\n; EDNS: version: 0, flags: do; udp: 1232\n;; QUESTION SECTION:\n;odoh.cloudflare-dns.com.\tIN\tTYPE65\n\n;; ANSWER SECTION:\nodoh.cloudflare-dns.com. 300\tIN\tTYPE65\t\\# 108 00010000010003026832000400086810F8F96810F9F9000600202606 470000000000000000006810F8F92606470000000000000000006810 F9F98001002E002CFF0200280020000100010020ED82DBE32CCDE189 BC6C643A80B5FAFF82548D21601C613408BACAAE6467B30A\nodoh.cloudflare-dns.com. 300\tIN\tRRSIG\tTYPE65 13 3 300 20201119163629 20201117143629 34505 odoh.cloudflare-dns.com. yny5+ApxPSO6Q4aegv09ZnBmPiXxDEnX5Xv21TAchxbxt1VhqlHpb5Oc 8yQPNGXb0fb+NyibmHlvTXjphYjcPA==\n\n;; Query time: 21 msec\n;; SERVER: 173.245.58.100#53(173.245.58.100)\n;; WHEN: Wed Nov 18 07:36:29 PST 2020\n;; MSG SIZE  rcvd: 291</pre></code>\n            <p>We are working to add ODoH to existing stub resolvers such as <a href=\"https://github.com/cloudflare/cloudflared\">cloudflared</a>. If you&#39;re interested in adding support to a client, or if you encounter bugs with the implementations, please drop us a line at <a href=\"mailto:ask-research@cloudflare.com\">ask-research@cloudflare.com</a>! Announcements about the ODoH specification and server will be sent to the <a href=\"https://datatracker.ietf.org/wg/dprive/about/\">IETF DPRIVE</a> <a href=\"https://mailarchive.ietf.org/arch/browse/dns-privacy/\">mailing list</a>. You can subscribe and follow announcements and discussion about the specification <a href=\"https://www.ietf.org/mailman/listinfo/dns-privacy\">here</a>.</p><p>We are committed to moving it forward in the IETF and are already seeing interest from client vendors. Eric Rescorla, CTO of Firefox, says,</p><blockquote><p>Oblivious DoH is a great addition to the secure DNS ecosystem. We&#39;re excited to see it starting to take off and are looking forward to experimenting with it in Firefox.</p></blockquote><p>We hope that more operators join us along the way and provide support for the protocol, by running either proxies or targets, and we hope client support will increase as the available infrastructure increases, too.</p><p>The ODoH protocol is a practical approach for improving privacy of users, and aims to improve the overall adoption of encrypted DNS protocols without compromising performance and user experience on the Internet.</p><h3>Acknowledgements</h3><p><a href=\"/author/marek/\">Marek Vavruša</a> and <a href=\"/author/anbang/\">Anbang Wen</a> were instrumental in getting the 1.1.1.1 resolver to support ODoH. Chris Wood and <a href=\"/author/peter-wu/\">Peter Wu</a> helped get the ODoH libraries ready and tested. The <a href=\"https://tools.ietf.org/html/draft-pauly-dprive-oblivious-doh-03\">IETF draft for ODoH</a> is authored by Eric Kinnear, Patrick McManus, Tommy Pauly and Christopher Wood. ODoH itself took inspiration from &quot;<a href=\"https://odns.cs.princeton.edu/pdf/pets.pdf\">Oblivious DNS: Practical Privacy for DNS Queries</a>&quot;, the work of Schmitt et al. published in PoPETs 2019.</p>",
		"id": "78tVb2BsQn3qchSgCeuhv5",
		"localeList": {
			"name": "Improving DNS Privacy with Oblivious DoH in 1.1.1.1 Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "Translated for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "Translated for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Oblivious DoH (ODoH) makes secure DNS over HTTPS (DoH) queries into private queries which prevent the leakage of client IP addresses to resolvers. The new proposed ODoH standard addresses this problem and today we are enabling users to use this protocol with 1.1.1.1",
		"metadata": {
			"title": "Improving DNS Privacy with Oblivious DoH in 1.1.1.1",
			"description": "Oblivious DoH (ODoH) makes secure DNS over HTTPS (DoH) queries into private queries which prevent the leakage of client IP addresses to resolvers. The new proposed ODoH standard addresses this problem and today we are enabling users to use this protocol with 1.1.1.1",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/123538LArJ0gGoGM6d07pL/bd92343fc4a1d418503f3c99c70e4c56/oblivious-dns-SC2t49.png"
		},
		"primary_author": {},
		"published_at": "2020-12-08T12:00:00.000+00:00",
		"reading_time": 11,
		"slug": "oblivious-dns",
		"tags": [
			{
				"id": "6WcvsmvlJDoRfH0gGvrvX1",
				"name": "Privacy Week",
				"slug": "privacy-week"
			},
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "5fZHv2k9HnJ7phOPmYexHw",
				"name": "DNS",
				"slug": "dns"
			},
			{
				"id": "lYgpkmxckzYQz50iiVcjw",
				"name": "DoH",
				"slug": "doh"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			}
		],
		"title": "Improving DNS Privacy with Oblivious DoH in 1.1.1.1",
		"updated_at": "2024-08-27T01:55:20.574Z",
		"url": "https://blog.cloudflare.com/oblivious-dns"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}