{
	"initialReadingTime": "8",
	"locale": "en-us",
	"localesAvailable": [
		"fr-fr",
		"de-de",
		"ja-jp"
	],
	"post": {
		"authors": [
			{
				"name": "Marwan Fayed",
				"slug": "marwan",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/IXphrXdPbBBtMHdRMzIrB/69d59b81aad9874359afc69103e164ac/marwan.jpg",
				"location": null,
				"website": null,
				"twitter": "@marwanfayed",
				"facebook": null
			},
			{
				"name": "Annika Garbers",
				"slug": "annika",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6SY53ZloWPZ3xlkvdwhfNZ/17f85d5432fafbd717b7c2fc9b593dd4/annika.png",
				"location": null,
				"website": null,
				"twitter": "@annikagarbers",
				"facebook": null
			}
		],
		"excerpt": "Cloudflare is excited to announce Project Pangea. We’re launching a program that provides secure, performant, reliable access to the Internet for community networks that support underserved communities, and we’re doing it for free because we want to help build an Internet for everyone.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/uO0AxLOwOy4EiDu5spUhH/72148a215a36a7619c1e620f87d93ec7/pangea.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/31hXtvmeqYsWzNTLsSusWz/7d1c1898e3c754b2b259ea47b15c9ec2/_jj0thD7C2phfszLmS2E1OHUoRwZ5ctQcUG4Tv731wARMO0rTsrKP_6B8kqpxIZuuyhYIz88IAtegQZzOJ5iD1-ilHmheKEOXiKvXeKb00sHv-AWdkDBt7I6XIfs.png\" alt=\"Announcing Project Pangea: Helping Underserved Communities Expand Access to the Internet For Free\" class=\"kg-image\" width=\"1600\" height=\"845\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://www.weforum.org/agenda/2020/04/coronavirus-covid-19-pandemic-digital-divide-internet-data-broadband-mobbile/\">Half of the world’s population has no access to the Internet</a>, with many more limited to poor, expensive, and unreliable connectivity. This problem persists despite large levels of public investment, private infrastructure, and effort by local organizers.</p><p>Today, Cloudflare is excited to announce Project Pangea: a piece of the puzzle to help solve this problem. We’re launching a program that provides secure, performant, reliable access to the Internet for community networks that support underserved communities, and we’re doing it for free<sup>1</sup> because <a href=\"/understanding-where-the-internet-isnt-good-enough-yet/\">we want to help build an Internet for everyone</a>.</p><h3>What is Cloudflare doing to help?</h3><p>Project Pangea is Cloudflare’s project to help bring underserved communities secure connectivity to the Internet through Cloudflare’s global and interconnected network.</p><p>Cloudflare is offering our suite of network services — <a href=\"https://www.cloudflare.com/network-interconnect/\">Cloudflare Network Interconnect</a>, <a href=\"https://www.cloudflare.com/magic-transit/\">Magic Transit</a>, and <a href=\"/introducing-magic-firewall/\">Magic Firewall</a> — for free to nonprofit community networks, local networks, or other networks primarily focused on providing Internet access to local underserved or developing areas. This service would dramatically reduce the cost for communities to connect to the Internet, with industry leading security and performance functions built-in:</p><ul><li><p><b>Cloudflare Network Interconnect</b> provides access to Cloudflare’s edge in 200+ cities across the globe through physical and virtual connectivity options.</p></li><li><p><b>Magic Transit</b> acts as a conduit to and from the broader Internet and protects community networks by mitigating DDoS attacks within seconds at the edge.</p></li><li><p><b>Magic Firewall</b> gives community networks access to a network-layer <a href=\"https://www.cloudflare.com/learning/cloud/what-is-a-cloud-firewall/\">firewall as a service</a>, providing further protection from malicious traffic.</p></li></ul><p>We’ve learned from working with customers that pure connectivity is not enough to keep a network sustainably connected to the Internet. Malicious traffic, such as DDoS attacks, can target a network and saturate Internet service links, which can lead to providers aggressively rate limiting or even entirely shutting down incoming traffic until the attack subsides. This is why we’re including our security services in addition to connectivity as part of Project Pangea: no attacker should be able to keep communities closed off from accessing the Internet.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6qlqh0LQN6YOGyFRsyBFNO/3e39009a70a3f155e1bd0216500222e0/pangea-flow.png\" alt=\"Pangea Flow Chart\" class=\"kg-image\" width=\"1600\" height=\"491\" loading=\"lazy\"/>\n            \n            </figure><h3>What is a community network?</h3><p>Community networks have existed almost as long as commercial subscribership to the Internet that began with dial-up service. The Internet Society, or <a href=\"https://www.internetsociety.org/issues/community-networks/\">ISOC</a>, describes community networks as happening “when people come together to build and maintain the necessary infrastructure for Internet connection.”</p><p>Most often, community networks emerge from need, and in response to the lack or absence of available Internet connectivity. They consistently demonstrate success where public and private-sector initiatives have either failed or under-deliver. We’re not talking about stop-gap solutions here, either — community networks around the world have been providing reliable, sustainable, high-quality connections for years.</p><p>Many will operate only within their communities, but many others can grow, and have grown, to regional or national scale. The most common models of governance and operation are as not-for-profits or cooperatives, models that ensure reinvestment within the communities being served. For example, we see networks that reinvest their proceeds to replace Wi-Fi infrastructure with fibre-to-the-home.</p><p>Cloudflare celebrates these networks’ successes, and also the diversity of the communities that these networks represent. In that spirit, we’d like to dispel myths that we encountered during the launch of this program — many of which we wrongly assumed or believed to be true — because the myths turn out to be barriers that communities so often are forced to overcome.  Community networks are built on knowledge sharing, and so we’re sharing some of that knowledge, so others can help accelerate community projects and policies, rather than rely on the assumptions that impede progress.</p><p><b>Myth #1: Only very rural or remote regions are underserved and in need.</b> It’s true that remote regions are underserved. It is also true that underserved regions exist within 10 km (about six miles) of large city centers, and even within the largest cities themselves, as evidenced by the existence of some of our launch partners.</p><p><b>Myth #2: Remote, rural, or underserved is also low-income.</b> This might just be the biggest myth of all. Rural and remote populations are often thriving communities that can afford service, but have no access. In contrast, the need for urban community networks are often egalitarian, and emerge because the access that is available is unaffordable to many.</p><p><b>Myth #3: Service is necessarily more expensive.</b> This myth is sometimes expressed by statements such as, “if large service providers can’t offer affordable access, then no one can.”  More than a myth, this is a lie. Community networks (including our launch partners) use novel governance and cost models to ensure that subscribers pay rates similar to the wider market.</p><p><b>Myth #4: Technical expertise is a hard requirement and is unavailable.</b> There is a rich body of evidence and examples showing that, with small amounts of training and support, communities can build their own local networks cheaply and reliably with commodity hardware and non-specialist equipment.</p><p>These myths aside, there is one truth: <b>the path to sustainability is hard</b>. The start and initial growth of community networks often consists of volunteer time or grant funding, which are difficult to sustain in the long-term. Eventually the starting models need to transition to models of “willing to charge and willing to pay” — Project Pangea is designed to help fill this gap.</p><h2>What is the problem?</h2><p>Communities around the world can and have put up Wi-Fi antennas and laid their own fibre. Even so, and however well-connected the community is to itself, <i>Internet services are prohibitively expensive — if they can be found at all</i>.</p><p>Two elements are required to connect to the Internet, and each incurs its own cost:</p><ul><li><p><b>Backhaul</b> connections to an interconnection point — the connection point may be anything from a local cabinet to a large Internet exchange point (IXP).</p></li><li><p><b>Internet Services</b> are provided by a network that interfaces with the wider Internet, and agrees to route traffic to and from on behalf of the community network.</p></li></ul><p>These are distinct elements. Backhaul service carries data packets along a physical link (a fibre cable or wireless medium). Internet service is separate and may be provided over that link, or at its endpoint.</p><p>The cost of Internet service for networks is both dominant and variable (with usage), so in most cases it is cheaper to purchase both as a bundle from service providers that also own or operate their own physical network. Telecommunications and energy companies are prime examples.</p><p>However, the operating costs and complexity of long-distance backhaul is significantly lower than the costs of Internet service. If reliable, high capacity service were affordable, then community networks could extend their knowledge and governance models sustainably to also provide their own backhaul.</p><p>For all that community networks can build, establish, and operate, the one element entirely outside their control is the cost of Internet service — a problem that Project Pangea helps to solve.</p><h3>Why does the problem persist?</h3><p>On this subject, I — Marwan — can only share insights drawn from prior experience as a computer science professor, and a co-founder of <a href=\"https://hubs.net.uk/\">HUBS c.i.c.</a>, launched with talented professors and a network engineer. HUBS is a not-for-profit backhaul and Internet provider in Scotland. It is a cooperative of more than a dozen community networks — some that serve communities with no roads in or out — across thousands of square kilometers along Scotland’s West Coast and Borders regions. As is true of many community networks, not least some of Pangea’s launch partners, HUBS’ is award-<a href=\"https://digital-strategy.ec.europa.eu/en/news/winners-european-broadband-awards-2016\">winning</a>, and engages in <a href=\"https://committees.parliament.uk/committee/136/scottish-affairs-committee/news/102790/ee-o2-three-and-vodafone-questioned-on-scotland-mobile-coverage/\">advocacy and policy</a>.</p><p>During that time my co-founders and I engaged with research funders, economic development agencies, three levels of government, and so many communities that I lost track. After all that, the answer to the question is still far from clear. There are, however, noteworthy observations and experiences that stood out, and often came from surprising places:</p><ul><li><p>Cables on the ground get chewed by animals that, small or large, might never be seen.</p></li><li><p>Burying power and Ethernet cables, even 15 centimeters below soil, makes no difference because (we think) animals are drawn by the electrical current.</p></li><li><p>Property owners sometimes need to be convinced that 8 to 10 square meters to build a small tower in exchange for free Internet and community benefit is a good thing.</p></li><li><p>The raising of small towers, even that no one will see, is sometimes blocked by legislation or regulation that assumes private non-residential structures can only be a shed, or never taller than a shed.</p></li><li><p>Private fibre backbone installations installed with public funds are often inaccessible, or are charged by distance even though the cost to light 100 meters of fibre is identical to the cost of lighting 1 km of fibre.</p></li><li><p>Civil service agencies may be enthusiastic, but are also cautious, even in the face of evidence. Be patient, suffer frustration, be more patient, and repeat. Success is possible.</p></li><li><p>If and where possible, it’s best to avoid attempts to deliver service where national telecommunications companies have plans to do so.</p></li><li><p>Never underestimate tidal fading -- twice a day, wireless signals over water will be amazing, and will completely disappear. We should have known!</p></li></ul><p>All anecdotes aside, the best policies and practices are non-trivial -- but because of so many prior community efforts, and organizations such as <a href=\"https://www.internetsociety.org/issues/access/\">ISOC</a>, the <a href=\"https://www.apc.org/\">APC</a>, the <a href=\"https://a4ai.org/\">A4AI</a>, and more, the challenges and solutions are better understood than ever before.</p><h3>How does a community network reach the Internet?</h3><p>First, we’d like to honor the many organisations we’ve learned from who might say that there are no <i>technical</i> barriers to success. Connections within the community networks may be shaped by geographical features or regional regulations. For example, wireless lines of sight between antenna towers on personal property are guided by hills or restricted by regulations. Similarly, Ethernet cables and fibre deployments are guided by property ownership, digging rights, and the presence or migration of grazing animals that dig into soil and gnaw at cables — yes, they do, even small rabbits.</p><p>Once the community establishes its own area network, the connections to meet Internet services are more conventional, more familiar. In part, the choice is influenced or determined by proximity to Internet exchanges, PoPs, or regional fibre cabinet installations. The connections with community networks fall into three broad categories.</p><p><b>Colocation.</b> A community network may be fortunate enough to have service coverage that overlaps with, or is near to, an Internet eXchange Point (IXP), as shown in the figure below. In this case a natural choice is to colocate a router within the exchange, near to the Internet service provider’s router (labeled as Cloudflare in the figure). Our launch partner <a href=\"https://www.nycmesh.net/\">NYC Mesh</a> connects in this manner. Unfortunately, being that exchanges are most often located in urban settings, colocation is unavailable to many, if not most, community networks.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4yA8E4pM9To8f8Cp3Hz7xJ/b2bf5d18aae3a39536c27ed524c6f141/Colocation-Community-Network.png\" alt=\"Colocation Community Network\" class=\"kg-image\" width=\"1600\" height=\"399\" loading=\"lazy\"/>\n            \n            </figure><p><b>Conventional point-to-point backhaul.</b> Community networks that are remote must establish a point-to-point backhaul connection to the Internet exchange. This connection method is shown in the figure below in which the community network in the previous figure has moved to the left, and is joined by a physical long-distance link to the Internet service router that remains in the exchange on the right.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1ZzArG47FqRbwCM0s4jU5T/2bd3c2e74c4a4faa4eab1c3e393d1fe8/Conventional-point-to-point-backhaul.png\" alt=\"Conventional point-to-point backhaul\" class=\"kg-image\" width=\"1600\" height=\"410\" loading=\"lazy\"/>\n            \n            </figure><p>Point-to-point backhaul is familiar. If the infrastructure is available -- and this is a big ‘if’ -- then backhaul is most often available from a utility company, such as a telecommunications or energy provider, that may also bundle Internet service as a way to reduce total costs. Even bundled, the total cost is variable and unaffordable to individual community networks, and is exacerbated by distance. Some community networks have succeeded in acquiring backhaul through university, research and education, or publicly-funded networks that are compelled or convinced to offer the service in the public interest. On the west coast of Scotland, for example, <a href=\"https://www.tegola.org.uk/tegola-history.html\">Tegola</a> launched with service from the University of Highlands and Islands and the University of Edinburgh.</p><p><b>Start a backhaul cooperative for point-to-point and colocation.</b> The last connection option we see among our launch partners overcomes the prohibitive costs by forming a cooperative network in which the individual subscriber community networks are also members. The cooperative model can be seen in the figure below. The exchange remains on the right. On the left the community network in the previous figure is now replaced by a collection of community networks that may optionally connect with each other (for example, to establish reliable routing if any link fails). Either directly or indirectly via other community networks, each of these community networks has a connection to a remote router at the near-end of the point-to-point connection. Crucially, the point-to-point backhaul service -- as well as the co-located end-points -- are owned and operated by the cooperative. In this manner, an otherwise expensive backhaul service is made affordable by being a shared cost.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5Z87gKX4VyktNOkRqFCLhp/58d2b43a5218a24f5b73777d237c83ae/Launch-a-backhaul-cooperative-for-point-to-point-and-colocation.png\" alt=\"Launch a backhaul cooperative for point-to-point and colocation\" class=\"kg-image\" width=\"1600\" height=\"689\" loading=\"lazy\"/>\n            \n            </figure><p>Two of our launch partners, <a href=\"https://guifi.net/\">Guifi.net</a> and <a href=\"https://hubs.net.uk/\">HUBS c.i.c.</a>, are organised this way and their 10+ years in operation demonstrate both success and sustainability. Since the backhaul provider is a cooperative, the community network members have a say in the ways that revenue is saved, spent, and — best of all — reinvested back into the service and infrastructure.</p><h3>Why is Cloudflare doing this?</h3><p>Cloudflare’s mission is to help build a better Internet, for <i>everyone</i>, not just those with privileged access based on their geographical location. Project Pangea aligns with this mission by extending the Internet we’re helping to build — a faster, more reliable, more secure Internet — to otherwise underserved communities.</p><h3>How can my community network get involved?</h3><p>Check out our <a href=\"http://www.cloudflare.com/pangea\">landing page</a> to learn more and apply for Project Pangea today.</p><h3>The ‘community’ in Cloudflare</h3><p>Lastly, in a blog post about community networks, we feel it is appropriate to acknowledge the ‘community’ at Cloudflare: Project Pangea is the culmination of multiple projects, and multiple peoples’ hours, effort, dedication, and community spirit. Many, many thanks to all.</p><p>______</p><p><sup>1</sup>For eligible networks, free up to 5Gbps at p95 levels.</p>",
		"id": "1QJVpfsZRMaJn1UAqQfa15",
		"localeList": {
			"name": "Announcing Project Pangea: Helping Underserved Communities Expand Access to the Internet For Free Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Cloudflare is excited to announce Project Pangea. We’re launching a program that provides secure, performant, reliable access to the Internet for community networks that support underserved communities, and we’re doing it for free because we want to help build an Internet for everyone.",
		"metadata": {
			"title": "Announcing Project Pangea: Helping Underserved Communities Expand Access to the Internet For Free",
			"description": "Cloudflare is excited to announce Project Pangea. We’re launching a program that provides secure, performant, reliable access to the Internet for community networks that support underserved communities, and we’re doing it for free because we want to help build an Internet for everyone.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2gDwcVagSeIq7Gj0RA4Mj1/7c156270fd6cf4f48e56e5b0394c9688/pangea-dgp8wN.png"
		},
		"primary_author": {},
		"published_at": "2021-07-26T13:59:25.000+01:00",
		"slug": "pangea",
		"tags": [
			{
				"id": "6lUVvF42EgOEz8W2khsQKl",
				"name": "Impact Week",
				"slug": "impact-week"
			},
			{
				"id": "6DztJkFpX9dQTerEBwqNwc",
				"name": "Project Pangea",
				"slug": "project-pangea"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "7qTIAO0WLKVKPVrj8q1vpD",
				"name": "Magic Transit",
				"slug": "magic-transit"
			},
			{
				"id": "3eQV4ag3OjB2nvXokDNSZ2",
				"name": "Magic Firewall",
				"slug": "magic-firewall"
			},
			{
				"id": "3Tec5EKPXWLRTcxRoFr7P7",
				"name": "Network Interconnect",
				"slug": "network-interconnect"
			}
		],
		"title": "Announcing Project Pangea: Helping Underserved Communities Expand Access to the Internet For Free",
		"updated_at": "2024-08-27T01:48:00.700Z",
		"url": "https://blog.cloudflare.com/pangea"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}