{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Emily Terrell",
				"slug": "emily-terrell",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/17QysF3xmCRN3TqYfLA3xV/5ec72bd93f23bbd8e0516eefe0c72d20/emily-terrell.JPG",
				"location": "Washington, D.C.",
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Patrick Nemeroff",
				"slug": "patrick-nemeroff",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/VCesgczkMfscIiYY7wdHl/a010f23de25bf3bb321e738ed7a7ed5e/patrick-nemeroff.jpeg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "We’re pleased to announce that the litigation against Sable has finally concluded on terms that we believe send a strong message to patent trolls everywhere — if you bring meritless patent claims against Cloudflare, we will fight back and we will win.\n",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/50x8xiEb0xDPtv0CmgkGjj/1baada5ffda318ea15ea1125473b9587/BLOG-2579_1.png",
		"featured": false,
		"html": "<p></p><p>Back in February, we celebrated our <a href=\"https://blog.cloudflare.com/cloudflare-defeats-patent-troll-sable-at-trial\"><u>victory at trial</u></a> in the U.S. District Court for the Western District of Texas against patent trolls Sable IP and Sable Networks. This was the culmination of nearly three years of litigation against Sable, but it wasn’t the end of the story. </p><p>Today we’re pleased to announce that the litigation against Sable has finally concluded on terms that we believe send a strong message to patent trolls everywhere — if you bring meritless patent claims against Cloudflare, we will fight back and we will win.</p><p>We’re also pleased to announce additional prizes in <a href=\"https://www.cloudflare.com/jengo/sable-prior-art-search/\"><u>Project Jengo</u></a>, and to make a final call for submissions before we determine the winners of the Final Awards. As a reminder, Project Jengo is Cloudflare’s effort to fight back against patent trolls by flipping the incentive structure that has encouraged the growth of patent trolls who extract settlements out of companies using frivolous lawsuits. We do this by asking the public to help identify prior art that can invalidate any of the patents that a troll holds, not just the ones that are asserted against Cloudflare. We’ve already given out over $125,000 to individuals since the <a href=\"https://blog.cloudflare.com/project-jengo/\"><u>launch of Project Jengo in 2017</u></a>, and we’re looking forward to celebrating the successful end of the Sable iteration of Project Jengo with our Final Awards!</p><p>To learn more about how things concluded with Sable and next steps in Project Jengo, read on.  </p><h3>Background</h3><p>For anyone just joining us on this odyssey, here is a little background on how we got here:</p><p>Sable sued Cloudflare back in March 2021. Sable is a patent troll. It doesn’t make, develop, innovate, or sell anything. Sable IP is merely a shell entity formed to monetize (make money from) an ancient patent portfolio acquired by Sable Networks from Caspian Networks in 2006. <a href=\"https://www.lightreading.com/cable-technology/caspian-closes-its-doors\"><u>Caspian Networks was a router company that went out of business nearly 20 years ago</u></a>. Using Caspian’s old patents, Sable sued Cloudflare and many other companies, including Cisco, Fortinet, Check Point, SonicWall, and Juniper Networks, alleging patent infringement. While these other companies resolved their disputes with Sable out of court, Cloudflare fought back. </p><p>Sable initially asserted around 100 claims from four different patents against Cloudflare, accusing multiple Cloudflare products and features of infringement. Sable’s patents — the old Caspian Networks patents — related to hardware-based router technologies common over 20 years ago. Sable’s infringement arguments stretched these patent claims to their limits (and beyond) as Sable tried to apply Caspian’s hardware-based technologies to Cloudflare’s modern software-defined services delivered on the cloud.</p><p>Cloudflare fought back against Sable by launching a <a href=\"https://www.cloudflare.com/jengo/sable-prior-art-search/\"><u>new round of Project Jengo</u></a>, Cloudflare’s prior art contest, seeking prior art to invalidate all of Sable’s patents.</p><p>After years of Cloudflare aggressively litigating against Sable’s patents before the U.S. Patent and Trademark Office and the district court, Sable was left with only one claim from one patent to assert against Cloudflare at trial. If you’d like to know more, we described those battles, in which Cloudflare successfully eliminated around 99% of Sable’s claims, in more detail in a <a href=\"https://blog.cloudflare.com/cloudflare-defeats-patent-troll-sable-at-trial/\"><u>prior blog post</u></a>.</p><p>Sable and Cloudflare came together in a five-day jury trial in Waco, Texas in February 2024. At trial, Sable did its best to try to map its decades-old router technology onto Cloudflare’s modern software-based architecture. But Sable’s case was riddled with technical issues and its efforts backed only by the desire for a payout.</p><h3>The jury agrees: Cloudflare <u>does not infringe</u></h3><p>To defeat Sable’s claim of infringement we needed to explain to the jury — in clear and understandable terms — why what Cloudflare does is different from what was covered by claim 25 of Sable’s remaining patent, U.S. Patent No. <a href=\"https://patents.google.com/patent/US7012919B1/en?oq=7012919\"><u>7,012,919</u></a> (the ’919 patent). To do this, we enlisted the help of one of our talented Cloudflare engineers, Eric Reeves, as well as <a href=\"https://engineering.washu.edu/faculty/Paul-Min.html\"><u>Dr. Paul Min, Senior Professor of Electrical &amp; Systems Engineering at Washington University</u></a>, an expert in the field of computer networking. Eric and Dr. Min helped us explain to the jury the multiple reasons we didn’t infringe.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/XWCN4456ulrVi0xmCMfbb/8efb979e5788ee1321c3115eeb526a2d/BLOG-2579_2.png\" alt=\"BLOG-2579 2\" class=\"kg-image\" width=\"1077\" height=\"569\" loading=\"lazy\"/>\n          </figure><p><sup><i>From slide deck presented by Cloudflare to the jury during the trial</i></sup></p><p>First, we explained that the accused Cloudflare products (<a href=\"https://developers.cloudflare.com/magic-transit/\"><u>Magic Transit</u></a> and <a href=\"https://developers.cloudflare.com/argo-smart-routing/argo-for-packets/\"><u>Argo for Packets</u></a>) do not route “flows” or “micro-flows” as required by claim 25. Instead, they handle packets individually, on a packet-by-packet basis. Indeed, processing each packet individually is important to the functioning of these products and Cloudflare’s DDoS and security services as a whole.</p><p>Eric also helped to tell our invention story to the jury. He explained how the Cloudflare team saw problems that needed to be solved, and built unique and innovative new products to solve them. He described the work that went into developing Magic Transit and Argo for Packets, and how these products are part of Cloudflare’s modern software-based approach, which is fundamentally different from the hardware-based technology of the ’919 patent. Together, Eric and Dr. Min explained how the benefits of Magic Transit and Argo for Packets enjoyed by Cloudflare’s customers are not attributable to any technology claimed by the ’919 patent.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/mYelecmdKiTa0Nm76ziHY/f27109c3dd34dfcea79d2db1b58439eb/BLOG-2579_3.png\" alt=\"BLOG-2579 3\" class=\"kg-image\" width=\"1085\" height=\"619\" loading=\"lazy\"/>\n          </figure><p><sup><i>From slide deck presented by Cloudflare to the jury during the trial</i></sup></p><p>Second, we explained that Cloudflare doesn’t infringe because claim 25 of the ’919 patent requires certain processes to occur “at” ingress and egress line cards, and Cloudflare’s accused servers do not include line cards.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2BDR7faD5Y8xCnbMn43VLP/3b25b64ab573c964936b478c1c34848e/BLOG-2579_4.png\" alt=\"BLOG-2579 4\" class=\"kg-image\" width=\"1074\" height=\"572\" loading=\"lazy\"/>\n          </figure><p><sup><i>From slide deck presented by Cloudflare to the jury during the trial</i></sup></p><p>As Dr. Min explained, “line cards” are a specific type of hardware — a physical hardware “card” — that are commonly used in routers. Sable’s witnesses could not deny that the technology of the ’919 patent was tied to old router technology. After all, Caspian Networks Inc. (where the ’919 patent inventors worked) was a router company. Caspian’s core products were routers, and we showed the jury documents describing Caspian’s routers, which used “flow-based” technology on physical hardware line cards.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2So3SbVAhV4bR7Mtcgd1ys/1b3053c8e273b0091267875dd30dd445/Screenshot_2024-10-01_at_11.54.29_AM.png\" alt=\"BLOG-2579 5\" class=\"kg-image\" width=\"774\" height=\"574\" loading=\"lazy\"/>\n          </figure><p><sup><i>Trial exhibit, image of sample line card</i></sup></p><p>While Sable’s technical expert tried his hardest to convince the jury that various software and hardware components of Cloudflare’s servers constitute “line cards,” his explanations defied credibility. The simple fact is that Cloudflare’s servers do not have line cards.</p><p>Ultimately, the jury understood, returning a verdict that Cloudflare does not infringe claim 25 of the ‘919 patent.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/RvaSu6DljUohL3bWZEZAa/e94e72c6c3360bb3efea10b19206cc4c/BLOG-2579_6.png\" alt=\"BLOG-2579 6\" class=\"kg-image\" width=\"509\" height=\"321\" loading=\"lazy\"/>\n          </figure><p><sup><i>Excerpt from Verdict Form completed by the jury</i></sup></p><h3>The jury agrees: Sable’s patent claim is <u>invalid</u></h3><p>In addition to proving that we do not infringe, we also took on the challenge of proving to the jury that claim 25 of the ’919 patent is invalid and never should have been issued.</p><p>Proving invalidity to a jury is hard. The burden on the defendant is high: Cloudflare needed to prove by clear and convincing evidence that claim 25 is invalid.  And, proving it by describing how the claim is obvious in light of the prior art is complicated.</p><p>To do this, we again relied on our technical expert, Dr. Min, to explain how two prior art references, U.S. Patent No. <a href=\"https://patents.google.com/patent/US6584071B1/en?oq=6584071\"><u>6,584,071</u></a> (Kodialam) and U.S. Patent No. <a href=\"https://patents.google.com/patent/US6680933B1/en?oq=6680933\"><u>6,680,933</u></a> (Cheeseman) together render claim 25 of the ’919 patent obvious. Kodialam and Cheeseman are patents from <a href=\"https://en.wikipedia.org/wiki/Nortel\"><u>Nortel Networks</u></a> and <a href=\"https://en.wikipedia.org/wiki/Lucent_Technologies\"><u>Lucent</u></a> relating to router technology developed in the late 1990s. Both are prior art to the ’919 patent (i.e., they pre-date the priority date of the ’919 patent), and when considered together by a person skilled in the area of computer engineering and computer networking technology, they rendered obvious the so-called invention of claim 25.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2AwZ3KBpPNQ6Hvfu7I3myv/10d396e88fffb51b02b588e5e95d6cbe/BLOG-2579_7.png\" alt=\"BLOG-2579 7\" class=\"kg-image\" width=\"509\" height=\"263\" loading=\"lazy\"/>\n          </figure><p><sup><i>Excerpt from Verdict Form completed by the jury</i></sup><sup> </sup></p><h3>Sable does not get its payday …</h3><p>Sable’s real motivation for suing Cloudflare — its desire for a payout — was made clear by Sable’s trial witnesses, who were unified only by their desire to present a wildly inflated view of the alleged “value” of the Sable patent and the damages allegedly owed by Cloudflare. </p><p>Sable’s attorneys tried their best to present their clients as reasonable businessmen, just trying to get what they’re owed for Cloudflare’s purported use of Sable’s patent. But Sable couldn’t hide its true colors from the jury. When Sable presented testimony from Brooks Borchers, the founder of Sable IP, Mr. Borchers was forced to admit that Sable IP is in the “business” of filing lawsuits.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/33xEZlojjm1nvnjnV4H7UC/6db1f410d21b919cc744317047f127ef/Screenshot_2024-10-01_at_11.37.17_AM.png\" alt=\"BLOG-2579 8\" class=\"kg-image\" width=\"725\" height=\"326\" loading=\"lazy\"/>\n          </figure><p><sup><i>Excerpt from Borchers trial testimony</i></sup></p><p> In fact, Mr. Borchers was forced to admit that Sable’s approach is to sue first and ask questions later. Even among patent trolls, this is hardly a noble business practice.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4Dr73QwC1urT9QNZYTzYK7/3882fcdbdeae32f583be2fdea8641729/BLOG-2579_9.png\" alt=\"BLOG-2579 9\" class=\"kg-image\" width=\"638\" height=\"796\" loading=\"lazy\"/>\n          </figure><p><sup><i>Excerpts from Borchers trial testimony</i></sup></p><p>What&#39;s more, Mr. Borchers and his lawyers have teamed up on cases like this before, following the same sue-first-and-ask-questions-later playbook in hopes of a payout. Sable’s true motivations for suing Cloudflare were on full display after this testimony, making Sable’s damages demand all the more galling.</p><p>Sable’s damages expert, Stephen Dell, told the jury that Sable was owed somewhere between <span>&#36;</span>25 million and $94.2 million in damages. But, Mr. Dell was forced to admit to multiple flaws in his damages calculation, and Cloudflare’s damages expert Chris Bakewell explained to the jury how bad inputs and faulty assumptions led Mr. Dell to a wildly inflated damages figure. Indeed, after hearing Sable’s expert’s testimony, Judge Albright said he was “very skeptical” of Mr. Dell’s opinions, explaining that he was “very concerned that there’s not support for his methodology.”</p><p>In the end, Mr. Dell’s outsized damages demand didn’t matter because the jury found that Cloudflare did not infringe and that the asserted patent claim is invalid. But, it was revealing of Sable’s motivation (greed) and the lengths that it would go to try to get a payout.</p><p>When all was said and done, after all the testimony and argument, we were thrilled when the jury returned its verdict — after less than two hours of deliberations — finding across the board for Cloudflare. The jury’s verdict is truly a validation of our strong belief in the importance of standing up to patent trolls like Sable, and we are grateful for the jury’s time, attention and consideration!</p><h3>Sable admits defeat, and agrees to pay Cloudflare!</h3><p>A jury verdict is not the end of the road in a patent case ... there are post-trial motions, appeals, and other procedural hurdles to jump through before a case is truly over. Tired from the fight, and smarting from its loss, Sable decided it wanted to throw in the towel and end the fight once and for all.</p><p>In the end, Sable agreed to pay Cloudflare $225,000, grant Cloudflare a royalty-free license to its entire patent portfolio, and to dedicate its patents to the public, ensuring that Sable can never again assert them against another company.</p><p>Let’s repeat that first part, just to make sure everyone understands: </p><p>Sable, the patent troll that sued Cloudflare back in March 2021 asserting around 100 claims across four patents, in the end wound up paying Cloudflare. While this $225,000 can’t fully compensate us for the time, energy and frustration of having to deal with this litigation for nearly three years, it does help to even the score a bit. And we hope that it sends an important message to patent trolls everywhere to beware before taking on Cloudflare.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/N9m8NlHvXQxDqPyeKVkvW/25fd9499ec94efe977f63de6bcfc78b7/BLOG-2579_10.png\" alt=\"BLOG-2579 10\" class=\"kg-image\" width=\"749\" height=\"139\" loading=\"lazy\"/>\n          </figure><p><sup> </sup><sup><i>Excerpt from the Dedication to the Public and Royalty Free License Agreement between Sable and Cloudflare</i></sup></p><p>And, let’s talk a bit more about that final part:</p><p>Sable has agreed to dedicate its entire patent portfolio to the public. This means that Sable will tell the U.S. Patent and Trademark Office that it gives up all of its legal rights to its patent portfolio. Sable can never again use these patents to sue for infringement; they can never again use these patents to try to make a quick buck.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4rpPZkNJBZYB7t69g1YssH/b7da43e0686c05ac752effa4411227a1/BLOG-2579_11.png\" alt=\"BLOG-2579 11\" class=\"kg-image\" width=\"740\" height=\"205\" loading=\"lazy\"/>\n          </figure><p><sup><i>Excerpt from the Dedication to the Public and Royalty Free License Agreement between Sable and Cloudflare</i></sup></p><h3>To sum it up …</h3><p>Cloudflare fought back against the patent troll and we won. We not only defeated Sable&#39;s claims in court, we forced Sable to pay Cloudflare for the trouble, and we got Sable&#39;s patents dedicated to the public, ensuring that it can never assert these patents against any other company ever again. It was admittedly a lot of work for Cloudflare, but totally worth it.</p><h3>Project Jengo for Sable: Conclusion of the Case</h3><p>A crucial part of our efforts to secure this across-the-board win are our Project Jengo participants.</p><p>Since the <a href=\"https://blog.cloudflare.com/project-jengo-redux-cloudflares-prior-art-search-bounty-returns/\"><u>launch of the Project Jengo for the Sable case</u></a>, we’ve received hundreds of prior art references from dedicated Project Jengo participants. So far we have awarded <span>&#36;</span>70,000 in prizes to the winners of Chapters 1 through 8. And we still have $30,000 in prizes to award in the Final Awards.</p><p>This blog post marks the official “Conclusion of the Case” under the <a href=\"https://www.cloudflare.com/jengo/sable-rules/\"><u>Project Jengo Sable Rules</u></a>. We will continue to accept submissions during the 30-day Grace Period, which lasts until November 2, 2024, and then will move on to selecting winners of the Final Awards.</p><h3>We are thrilled to announce the winners of Chapters 7 and 8</h3><p>We publicly celebrated the <a href=\"https://blog.cloudflare.com/project-jengo-2-first-three-winners/\"><u>Chapter 1</u></a>, <a href=\"https://blog.cloudflare.com/former-rd-engineer-wins-round-2-of-project-jengo-and-cloudflare-wins-at-the-patent-office/\"><u>Chapter 2</u></a>, <a href=\"https://blog.cloudflare.com/arkansas-engineer-wins-round-3-of-project-jengo-and-cloudflare-continues-to-win-at-the-patent-office/\"><u>Chapter 3</u></a> and <a href=\"https://blog.cloudflare.com/three-new-winners-of-project-jengo-and-more-defeats-for-the-patent-troll/\"><u>Chapters 4-6</u></a> winners in previous blog posts. However, as the trial approached in the Sable case, we chose not to make public announcements for the Chapter 7 and 8 winners out of respect for the judicial process. Now that the case is over, we are delighted to give a big public shout out to the winners of Project Jengo Chapters 7 and 8!</p><p>We selected four total winners in Chapters 7 and 8, each receiving prizes of <span>&#36;</span>5,000, for a grand total of $20,000. Our Chapter 7 winners, George W. and Madhu, each provided helpful and detailed charts containing element-by-element comparisons of the prior art to the relevant Sable patents. George W. is an electrical engineer and lawyer, who is active in the intellectual property community. He learned about Project Jengo in an article posted online, and thought it was a clever idea. The Chapter 8 winners, Jatin and Ketan, also provided thoughtful and detailed submissions. Jatin submitted two pieces of prior art that were particularly good references for Sable’s U.S. Patent No. 7,012,919, which contains the one claim that remained asserted against Cloudflare at trial.</p><p>We also want to again thank our prior chapter winners and everyone who participated in Project Jengo! We look forward to selecting the Final Awards winners — it will be fun to take a walk down memory lane re-reviewing the fantastic prior art submitted by our prior winners, and we can’t wait to check out the new submissions, too! Please use the “Submit Prior Art” link on <a href=\"https://www.cloudflare.com/jengo/sable-prior-art-search/\"><u>this page</u></a> for your final entries. Once we’ve announced our Final Awards, we will also update the <a href=\"https://www.cloudflare.com/jengo/priorart/\"><u>Sable patents prior art listing</u></a> on our website, to share all the prior art submitted by our Project Jengo participants.</p>",
		"id": "0B7FSzdpWp0xwOchgrEAA",
		"localeList": {
			"name": "blog-english-only",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "We’re pleased to announce that the litigation against Sable has finally concluded on terms that we believe send a strong message to patent trolls everywhere — if you bring meritless patent claims against Cloudflare, we will fight back and we will win.\n",
		"metadata": {
			"title": "Patent troll Sable pays up, dedicates all its patents to the public!",
			"description": "We’re pleased to announce that the litigation against Sable has finally concluded on terms that we believe send a strong message to patent trolls everywhere — if you bring meritless patent claims against Cloudflare, we will fight back and we will win.\n",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/50x8xiEb0xDPtv0CmgkGjj/1baada5ffda318ea15ea1125473b9587/BLOG-2579_1.png"
		},
		"primary_author": {},
		"published_at": "2024-10-02T14:00+01:00",
		"slug": "patent-troll-sable-pays-up",
		"tags": [
			{
				"id": "6Mfeneq15Xpvfczf1vVoll",
				"name": "Jengo",
				"slug": "jengo"
			},
			{
				"id": "1WqckrYcHhVMB4L8GH5cKj",
				"name": "Patents",
				"slug": "patents"
			},
			{
				"id": "16yk8DVbNNifxov5cWvAov",
				"name": "Legal",
				"slug": "legal"
			}
		],
		"title": "Patent troll Sable pays up, dedicates all its patents to the public!",
		"updated_at": "2024-10-03T13:00:02.855Z",
		"url": "https://blog.cloudflare.com/patent-troll-sable-pays-up"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}