{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Matthew Prince",
				"slug": "matthew-prince",
				"bio": "A little bit geek, wonk, and nerd. Repeat entrepreneur, recovering lawyer, and former ski instructor. Co-founder & CEO of Cloudflare (NYSE: NET).",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VD9WePJ1jvjFwuSRF0IfQ/4867307860761eb8209f67f2a9dd771f/matthew-prince.jpeg",
				"location": "San Francisco, CA",
				"website": null,
				"twitter": "@eastdakota",
				"facebook": null
			}
		],
		"excerpt": "We knew the case against patent trolls was the right one, but we have been overwhelmed by the response to our blog posts on patent trolls and our program for finding prior art on the patents held by Blackbird Tech, which we’ve dubbed Project Jengo.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/CAZlADnkd4fX73A5n0FbF/b633b47dbaba837b1da15155e9136220/patent-troll-battle-update-doubling-down-on-project-jengo.png",
		"featured": false,
		"html": "<p>We knew the case against patent trolls was the right one, but we have been overwhelmed by the response to our blog posts <a href=\"/standing-up-to-a-dangerous-new-breed-of-patent-troll/\">on patent trolls</a> and our <a href=\"/project-jengo/\">program for finding prior art</a> on the patents held by Blackbird Tech, which we’ve dubbed Project Jengo. As we discuss in this post, your comments and contributions have allowed us to expand and intensify our efforts to challenge the growing threat that patent trolls pose to innovative tech companies.</p><h4>We’re SIGNIFICANTLY expanding our program to find prior art on the Blackbird Tech patents</h4><p>In a little over a week since we started the program, we’ve received 141 separate prior art submissions. But we know there’s an opportunity to find a lot more.</p><p>We’ve been impressed with the exceptionally high quality of the submissions. The Cloudflare community of users and readers of our blog are an accomplished bunch, so we have a number of searches that were done by expert engineers and programmers. In one case that stood out to us, someone wrote in about a project they personally had worked on as an engineer back in 1993, which they are convinced is conclusive prior art to a Blackbird Tech patent. We will continue to collect and review these submissions.</p><p>The submissions so far relate to 18 of the 38 Blackbird Tech patents and applications. You can see a summary of the number of submissions per patent <a href=\"http://cloudflare.works/files/Patent_Search_Totals_052217.pdf\">here (PDF)</a>. You&#39;ll see there are still 20 Blackbird Tech patents and applications we’ve yet to receive a submission for.</p><p>We’re looking for prior art on 100% of the Blackbird Tech patents. If you are interested in helping, take some time to <a href=\"https://www.cloudflare.com/blackbirdpatents/\">look into those patents</a> where we don’t have anything yet. We’ll update the chart as we review the submissions with additional information about the number we receive, and their quality, to help focus the search. After the initial review, we’ll start to color code the patents (i.e., red/yellow/green) to demonstrate the number and quality of submissions we’ve received on each patent.</p><h4>An anonymous benefactor donated another $50K to help invalidate all of Blackbird Tech&#39;s patents</h4><p>And our efforts to cover the field have been re-doubled. We’re excited to report that a friend in the industry who read our blog post and shares our concerns about the corrosive impact of patent trolls has made an <b>anonymous donation of $50,000 to support our efforts to invalidate the Blackbird Tech patents</b>. That means that we are now committing at least $100,000 to the effort to find prior art on and initiate actions to invalidate the Blackbird Tech patents.</p><p>We initially dedicated a \\$50,000 bounty to invalidate Blackbird Tech&#39;s patents. We split the bounty so \\$20,000 was to invalidate the particular patent Blackbird Tech sued us on and \\$30,000 was to help invalidate any other Blackbird Tech patent. We&#39;ve received so many prior art submissions on the patent in question in Cloudflare&#39;s case that we don&#39;t believe we need an additional incentive there. Instead, we&#39;re dedicating 100% of the anonymously donated \\$50,000 to invalidating the other Blackbird Tech patents. This will be used both to boost the bounty we pay to researchers as well as to fund invalidation cases we file with the USPTO. Our goal remains invalidating every one of Blackbird Tech&#39;s patents. Again if you want more information about how you can participate, you can find the description <a href=\"/project-jengo/\">here</a>.</p><h4>And, of course, there will be t-shirts!</h4>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2N4rq4zbzz1LmS0hZQ3jRW/ba27bd3087e1fcf0eedfbac38b7dbaeb/troll-Hunter-Shirts-1-1290.png\" alt=\"Troll Hunter Shirt Design\" class=\"kg-image\" width=\"1290\" height=\"1720\" loading=\"lazy\"/>\n            \n            </figure><p>And it wouldn’t be a cooperative effort in the tech community if we didn’t give out T-shirts to commemorate your participation in the process. You can see the T-shirt design above, all you have to do is provide a legitimate entry of prior art on any of the Blackbird Tech patents and we’ll send one to you (limit one shirt per participant).</p><h4>Blackbird Tech’s “new model” of patent litigation may be a violation of professional ethics, soon it may also be an explicit violation of law</h4><p>We think the business operations of the Blackbird Tech attorneys may violate the Rules of Professional Conduct in both Illinois and Massachusetts, where Blackbird Tech’s offices are located and where its co-founders work, and we have asked ethics regulators in those states to undertake a review. But we think it’s worth going a step further and working with innovation-supporting legislators in the states where Blackbird Tech operates to make it absolutely clear this new breed of patent troll is not welcome.</p><p>As we mentioned in the original blog post, there have already been several proposals at both the state and federal level to push back and limit the ability of patent trolls to use the courts to bring cases against successful companies. Yet Blackbird Tech is pushing in the other direction and attempting to come up with novel ways to increase the efficiency and effectiveness of patent trolls.</p><p>On May 23, 2017, Rep. <a href=\"http://www.repkeithwheeler.com/\">Keith Wheeler</a> of Illinois introduced a bill (the “<a href=\"http://www.ilga.gov/legislation/BillStatus.asp?DocNum=4052&GAID=14&DocTypeID=HB&LegId=107029&SessionID=91&GA=100\">Ethics in Patent Litigation Act</a>”) that would make it the public policy of the State of Illinois that attorneys in the state, like Blackbird co-founder Chris Freeman (<a href=\"https://www.linkedin.com/in/chris-freeman-316ab3/\">LinkedIn</a>), should not be able to buy patents themselves for the purpose of suing on them if they are not in the business of any other productive activity. We appreciate Rep. Wheeler’s support of innovation and his stance against patent trolls, feel free to show your support via Twitter below (form no longer available).</p><p>In Massachusetts, where Blackbird&#39;s other attorney co-founder, Wendy Verlander (<a href=\"https://twitter.com/bbirdtech_CEO\">@bbirdtech_CEO</a>; <a href=\"https://www.linkedin.com/in/wendy-verlander-9a27341/\">LinkedIn</a>) is based, Sen. <a href=\"http://senatorlesser.com/\">Eric Lesser</a> has specifically targeted patent trolls in a <a href=\"https://malegislature.gov/Bills/190/S128\">bill</a> he introduced earlier this year.</p><blockquote><p>Well done. It&#39;s time to stand up to patent trolls. We have a bill in <a href=\"https://twitter.com/MA_Senate\">@MA_Senate</a> that will do just that. <a href=\"https://twitter.com/ScottKirsner\">@ScottKirsner</a> <a href=\"https://twitter.com/jonchesto\">@jonchesto</a> <a href=\"https://twitter.com/epaley\">@epaley</a> <a href=\"https://t.co/O2hHB1R3DT\">https://t.co/O2hHB1R3DT</a></p><p>— Eric Lesser (@EricLesser) <a href=\"https://twitter.com/EricLesser/status/865425815785283584\">May 19, 2017</a></p></blockquote><p>You can show your support for Sen. Lesser’s stance on these issues using the Twitter generator below (form no longer available). We will be working with Sen. Lesser in the weeks and months ahead to address our concern about Blackbird Tech’s “new model” of patent troll.</p><p>Even though the patent system may be based on Federal law, states have the ability to set rules for how businesses, and especially lawyers, behave in their jurisdictions. So we’re happy to work with interested lawmakers in other states, including Delaware, to advance new laws that limit the practices of patent trolls, including Blackbird Tech’s “new model.” We can share the information we’ve learned and pull together model legislation. If you are interested or know a legislator who may be, feel free to <a href=\"mailto:legislativeleads@cloudflare.com\">email us</a>.</p><h4>Blackbird Tech calls themselves “very much the same” as and “almost identical” to a law firm when it suits their purposes, and “not a law firm” when it doesn’t</h4><p>As we wrote before, we believe Blackbird Tech&#39;s dangerous new model of patent trolling — where they buy patents and then act their own attorneys in cases — may be a violation of the rules of professional ethics. In particular, we are concerned that they may be splitting fees with non-attorneys and that they may be acquiring causes of action. Both practices run counter to the rules of professional ethics for lawyers and law firms.</p><p>It is increasingly clear to us that Blackbird’s response to questions about their compliance with the rules of professional conduct will be, at best, based on simple agreements that merely create a shortcut around their ethical obligations, and at worst, directly contradictory.</p><p>Blackbird Tech wants to have it both ways. In response to the original blog post, <a href=\"http://fortune.com/2017/05/11/blackbird-patent-troll/\">Blackbird Tech denied</a> both that it was a law firm and that it used contingency fee agreements. Specifically:</p><p><i>In a phone conversation with Fortune, Blackbird CEO Wendy Verlander said the company is not a law firm and that it doesn&#39;t use contingency fee arrangements for the patents it buys, but conceded &quot;it&#39;s a similar arrangement.&quot;</i></p><p>Ms. Verlander objects to being characterized as a law firm because if Blackbird is found to be one then their practices would be governed by, and may be a violation of, the rules of professional ethics. Ms. Verlander’s denial that Blackbird Tech doesn’t use contingency agreements, only to quickly concede that what they do is “a similar arrangement” suggests again that Blackbird Tech is finding it convenient to work around the ethical rules.</p><p>This runs fundamentally counter to the concept of ethical rules, which are meant to be driven by the spirit of those obligations. Anyone out to intentionally “cut corners” or do the “bare minimum” to comply with only the letter of such obligations are by default in violation of the “special responsibilities” which should be driven by “personal conscience” as described in the preamble of the ABA Model Rules.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3ylEjbbQPQyG3YtXbuPu6a/970927b20d4c3ae1534423e55ff16ddc/Wendy-Verlander-and-Chris-Freeman-of-Blackbird-Technologies-1.png\" alt=\"Wendy Verlander and Chris Freeman, the Founders of the Blackbird Technologies Law Firm\" class=\"kg-image\" width=\"336\" height=\"221\" loading=\"lazy\"/>\n            \n            </figure><p>And Ms. Verlander’s unequivocal assertion that Blackbird Tech is not a law firm can be contrasted with sworn statements submitted by Blackbird Tech attorneys to courts last May asserting how much they operate like a law firm. In <i>Blackbird Tech v. Service Lighting and Electrical Supplies</i>, Blackbird Tech CEO <a href=\"http://cloudflare.works/files/%5B44-2%5D%20Verlander%20Declaration.pdf\">Wendy Verlander</a>, Blackbird Tech co-founder <a href=\"http://cloudflare.works/files/%5B44-1%5D%20Freeman%20Declaration.pdf\">Chris Freeman</a>, and Blackbird Tech employee <a href=\"http://cloudflare.works/files/%5B44-3%5D%20Thompson%20Declaration.pdf\">Sean Thompson</a>, each filed declarations in opposition to a proposed protective order.</p><p>Protective orders are important in patent litigation. Often, discovery in those cases involves companies handing over highly confidential information about their most important trade secrets or the history of how they developed valuable intellectual property. In most cases, courts limit access to such materials only to outside counsel, as opposed to the parties’ employees and in-house counsel. In-house counsel generally serve a number of functions at a business that include competitive decision-making, either directly or indirectly. Because in-house counsel may benefit from the additional perspective and insight gained by exposure to sensitive trade secrets of a competitor, and are unable to simply wipe their memories clean, courts in patent litigation cases often limit their review of particularly sensitive documents. In such cases, documents classified as “HIGHLY CONFIDENTIAL—ATTORNEY EYES ONLY” are limited to review by outside counsel, who are less likely to face the same sort of business decisions in the future.</p><p>When it served their purposes in opposition to a proposed protective order, the Blackbird Tech attorneys were quick to point out how much they operated only like a law firm and distance themselves from their business roles. Their sworn declarations specifically asserted:</p><ul><li><p>“Although the structure of Blackbird is unique, the realities of patent litigation at Blackbird are very much the same as patent litigation on behalf of clients at law firms.” (Verlander at ¶13, Freeman at ¶14)</p></li><li><p>“Thus, in many ways, my role at Blackbird as a member of the Litigation Group is <b>identical to my previous role as outside counsel at a law firm</b>.” (Verlander at ¶13, Freeman at ¶14)(emphasis added)</p></li><li><p><b>“Blackbird’s Litigation Group operates almost identically to outside law firm counsel</b>. Blackbird’s litigators are presented with patents and possible infringers, just as clients bring to law firms. The Blackbird litigators then bring their litigation expertise to bear and thoroughly analyze the patent and the potential infringement case, ultimately deciding whether to move forward with litigation — just as a law firm would evaluate a case. If the Blackbird litigation team identifies a strong infringement case, the litigators draft Complaints and conduct litigation, acting in the same role as outside counsel.” (Verlander at ¶14, Freeman at ¶15)(emphasis added).</p></li><li><p>“On a day-to-day basis, what I do at Blackbird is the same as what I did when practicing at a firm.” (Thompson at ¶2).</p></li></ul><p>This inconsistency points out once again how Blackbird is attempting to gain an advantage by turning traditional roles on their head. If they were a typical company, that was looking to make products using the patents they own, then we’d be able to seek discovery on their products and operations. Instead, they function as a law firm with no business operations that would be subject to the same sort of scrutiny they will apply to a company like Cloudflare.</p><p>And they say that they’re not a law firm, yet they expect all their employees, including their CEO, to be permitted to exercise the special role of an attorney “identical to [their] previous role as outside counsel at a law firm.” But it would be difficult for them to deny that their employees, including their CEO, are engaged in impermissible attorney practices like buying causes of actions and giving a financial interest in litigation to non-parties, which are clearly not “identical” to what they would have done “as outside counsel at a firm.” They can’t have it both ways.</p><h4>Coverage of the blog post took our arguments even further</h4><p>In our previous <a href=\"/standing-up-to-a-dangerous-new-breed-of-patent-troll/\">blog posts</a> on patent trolls, we thought we’d said about everything there was to say, or at least exhausted anyone who might have something else to say. But we found that most of the reports about our efforts did much more than merely parrot our statements and ask Blackbird Tech for a response. These reports raise some excellent additional points that we expect to use in our ongoing efforts to defend the case brought by Blackbird Tech.</p><p>Several of the reporters noted that Blackbird Tech’s claims seem a bit farfetched and found their own factual basis for contesting those claims. Joe Mullin (<a href=\"https://twitter.com/joemullin\">@joemullin</a>) at <a href=\"https://arstechnica.com/tech-policy/2017/05/cloudflare-sued-by-its-first-patent-troll-hits-back-hard/\">Ars Technica</a> noted that the Blackbird Tech patent—particularly in the overbroad way it is applying it in the case against Cloudflare—has prior art that dates back to the beginning of the last century:</p><p><i>The suggestion that intercepting and modifying electronic communications is a 1998 “invention” is a preposterous one. By World War I, numerous state governments had systems in place to censor and edit telegraph and telephone conversations.</i></p><p>Similarly, Shaun Nichols (<a href=\"https://twitter.com/shaundnichols\">@shaundnichols</a>) of the <a href=\"https://www.theregister.co.uk/2017/05/11/cloudflare_patent_trolls/\">Register</a> notes that the differences between the Blackbird Tech patent and our operations are “remarkable”:</p><p><i>In our view, from a quick read of the documentation, Blackbird&#39;s design sounds remarkably different to Cloudflare&#39;s approach. Critically, the server-side includes described in the patent have been around well before the patent was filed: Apache, for example, had them as early as 1996, meaning the design may be derailed by prior art.</i></p><p>And beyond the legal arguments in the patent case, <a href=\"https://www.techdirt.com/blog/?company=kirkland+%26+ellis\">Techdirt</a> felt that our arguments questioning the operations of Blackbird Tech itself sounded strikingly familiar to another operation that was found to be legally improper:</p><p><i>Righthaven. As you may recall, that was a copyright trolling operation that effectively &quot;bought&quot; the bare right to sue from newspapers. They pretended they bought the copyright (since you can&#39;t just buy a right to sue), but the transfer agreement left all the actual power with the newspapers, and courts eventually realized that all Righthaven really obtained was the right to sue. That resulted in the collapse of Righthaven. This isn&#39;t exactly analogous, but there are some clear similarities, in having a &quot;company,&quot; rather than a law firm (but still run completely by lawyers), &quot;purchase&quot; patents or copyrights solely for the purpose of suing, while setting up arrangements to share the proceeds with the previous holder of those copyrights or patents. It&#39;s a pretty sleazy business no matter what — and with Righthaven it proved to be its undoing. Blackbird may face a similar challenge.</i></p><p>It’s probably best to close this post with a statement from Mike Masnick (<a href=\"https://twitter.com/mmasnick\">@mmasnick</a>) of <a href=\"https://www.techdirt.com/blog/?company=kirkland+%26+ellis\">Techdirt</a> that we may save for a closing argument down the road because it summarized the situation better than we had:</p><p><i>Kudos to Cloudflare for hitting back against patent trolling that serves no purpose whatsoever, other than to shake down innovative companies and stifle their services. But, really, the true travesty here is that the company needs to do this at all. Our patent (and copyright) systems seem almost perfectly designed for this kind of shakedown game, having nothing whatsoever to do with the stated purpose of supporting actual innovators and creators. Instead, it&#39;s become a paper game abused by lawyers to enrich themselves at the expense of actual innovators and creators.</i></p><p>We will keep you updated. In the meantime, you can contribute to our efforts by continuing to participate in the search for prior art on the Blackbird Tech patents, or you can engage in the political process by supporting efforts to change the patent litigation process. And support folks like Rep. Wheeler or Sen. Lesser with their proposals to limit the power of patent trolls.</p>",
		"id": "66G9NbSKpLmACbfgvHpbll",
		"localeList": {
			"name": "Patent Troll Battle Update: Doubling Down on Project Jengo Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-05-25T17:00:00.000+01:00",
		"reading_time": 10,
		"slug": "patent-troll-battle-update-doubling-down-on-project-jengo",
		"tags": [
			{
				"id": "1WqckrYcHhVMB4L8GH5cKj",
				"name": "Patents",
				"slug": "patents"
			},
			{
				"id": "6Mfeneq15Xpvfczf1vVoll",
				"name": "Jengo",
				"slug": "jengo"
			},
			{
				"id": "1AyqklWs7kExQEHm1fe6po",
				"name": "Community",
				"slug": "community"
			},
			{
				"id": "16yk8DVbNNifxov5cWvAov",
				"name": "Legal",
				"slug": "legal"
			},
			{
				"id": "38DiCg1nEmAho9Wau8MiCl",
				"name": "SWAG",
				"slug": "swag"
			}
		],
		"title": "Patent Troll Battle Update: Doubling Down on Project Jengo",
		"updated_at": "2024-08-27T02:29:50.823Z",
		"url": "https://blog.cloudflare.com/patent-troll-battle-update-doubling-down-on-project-jengo"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}