{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Sofía Celi",
				"slug": "sofia",
				"bio": "Cryptography researcher and implementer at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2waJR10lPQ4007cOdOJQ5P/070caf2211c94b6a2bc5fb22c947ce5e/sofia.jpg",
				"location": "Lisbon",
				"website": "http://claucece.github.io/",
				"twitter": "@claucece",
				"facebook": null
			},
			{
				"name": "Nick Sullivan",
				"slug": "nick-sullivan",
				"bio": "Nick Sullivan was Head of Research (& Cryptography) at Cloudflare until 2023. He is passionate about improving security and privacy through cutting-edge research and the development of open standards.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1awsFzXodRY6h5BEcWKcCE/85e0d04bb0360398b832e6476173945e/nick-sullivan.jpg",
				"location": "San Francisco",
				"website": "https://crypto.dance",
				"twitter": "@grittygrease",
				"facebook": null
			}
		],
		"excerpt": "The story and path of post-quantum cryptography is clear. But, what are the future challenges? In this blog post, we explore them",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5lWepBwuKHnAXzdr637WqB/b894c961bb85281efb80ac6e2b29d64a/post-quantum-future.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/10YBSkgmz4NcTqsMqSDKHg/8d3a50a6f535845c9ea84ab7ef72d1e2/image1-28.png\" alt=\"blog post about the future efforts of Cloudflare in post-quantum cryptography.\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><blockquote><p><i>“People ask me to predict the future, when all I want to do is prevent it. Better yet, build it. Predicting the future is much too easy, anyway. You look at the people around you, the street you stand on, the visible air you breathe, and predict more of the same. To hell with more. I want better.”— </i><b><i>Ray Bradbury</i></b><i>, from Beyond 1984: The People Machines</i></p></blockquote><p>The <a href=\"/post-quantum-taxonomy/\">story and the path are clear</a>: quantum computers are coming that will have the ability to break the cryptographic mechanisms we rely on to secure modern communications, but there is hope! The cryptographic community has designed new mechanisms to safeguard against this disruption. There are challenges: will the new safeguards be practical? How will the fast-evolving Internet migrate to this new reality? In <a href=\"/making-protocols-post-quantum/\">other</a> <a href=\"/post-quantum-key-encapsulation/\">blog</a> <a href=\"/post-quantum-key-encapsulation/\">posts</a> in this series, we have outlined some potential solutions to these questions: there are new algorithms for maintaining confidentiality and authentication (in a “post-quantum” manner) in the protocols we use. But will they be fast enough to deploy at scale? Will they provide the required properties and work in all protocols? Are they easy to use?</p><p>Adding post-quantum cryptography into architectures and networks is not only about being novel and looking at interesting research problems or exciting engineering challenges. It is primarily about protecting people’s communications and data because a quantum adversary can not only decrypt future traffic but, if they want to, past traffic. Quantum adversaries could also be capable of other attacks (by using quantum algorithms, for example) that we may be unaware of now, so protecting against them is, in a way, the challenge of facing the unknown. We can’t fully predict everything that will happen with the advent of quantum computers<sup>1</sup>, but we can prepare and build greater protections than the ones that currently exist. We do not see the future as apocalyptic, but as an opportunity to reflect, discover and build better.</p><p>What are the challenges, then? And related to this question: what have we learned from the past that enables us to <i>build better</i> in a post-quantum world?</p><h3>Beyond a post-quantum TLS</h3><p>As we have shown in <a href=\"/post-quantum-taxonomy/\">other</a> <a href=\"/making-protocols-post-quantum/\">blog posts</a>, the most important security and privacy properties to protect in the face of a quantum computer are confidentiality and authentication. The <a href=\"https://en.wikipedia.org/wiki/Threat_model\">threat model</a> of confidentiality is clear: quantum computers will not only be able to decrypt on-going traffic, but also any traffic that was recorded and stored prior to their arrival. The threat model for authentication is a little more complex: a quantum computer could be used to impersonate a party (by successfully mounting a <a href=\"https://en.wikipedia.org/wiki/Man-in-the-middle_attack\">monster-in-the-middle attack</a>, for example) in a connection or conversation, and it could also be used to retroactively modify elements of the past message, like the identity of a sender (by, for example, changing the authorship of a past message to a different party). Both threat models are important to consider and pose a problem not only for future traffic but also for any traffic sent now.</p><p>In the case of using a quantum computer to impersonate a party: how can this be done? Suppose an attacker is able to use a quantum computer to compromise a user’s TLS certificate private key (which has been used to sign lots of past connections). The attacker can then forge connections and pretend that they come from the honest user (by signing with the user’s key) to another user, let’s say Bob. Bob will think the connections are coming from the honest user (as they all did in the past), when, in reality, they are now coming from the attacker.</p><p>We have algorithms that protect confidentiality and authentication in the face of quantum threats. We know how to integrate them into TLS, as we have seen in <a href=\"/making-protocols-post-quantum/\">this blog post</a>, so is that it? Will our connections then be safe? We argue that we will not yet be done, and these are the future challenges we see:</p><ul><li><p>Changing the key exchange of the TLS handshake is simple; changing the authentication of TLS, in practice, is hard.</p></li><li><p><a href=\"/monsters-in-the-middleboxes/\">Middleboxes and middleware</a> in the network, such as antivirus software and corporate proxies, can be slow to upgrade, <a href=\"/why-tls-1-3-isnt-in-browsers-yet/\">hindering the rollout</a> of new protocols.</p></li><li><p>TLS is not the only foundational protocol of the Internet, there are other protocols to take into account: some of them are very similar to TLS and they are easy to fix; others such as DNSSEC or QUIC are more challenging.</p></li></ul><p><a href=\"https://datatracker.ietf.org/doc/html/rfc8446\">TLS</a> (we will be focusing on its current version, which is 1.3) is a protocol that aims to achieve three primary security properties:</p><ul><li><p><a href=\"https://www.cloudflare.com/en-gb/learning/ssl/what-happens-in-a-tls-handshake/\"><b>Confidentiality:</b> communication can be read only by the intended recipient,</a></p></li><li><p><a href=\"https://www.cloudflare.com/en-gb/learning/ssl/what-happens-in-a-tls-handshake/\"><b>Integrity</b>: communication cannot be changed in transit, and</a></p></li><li><p><a href=\"https://www.cloudflare.com/en-gb/learning/ssl/what-happens-in-a-tls-handshake/\"><b>Authentication:</b> we are assured communication comes from the peer we are talking to</a>.</p></li></ul><p>The first two properties are easy to maintain in a quantum-computer world: confidentiality is maintained by swapping the existing non-quantum-safe algorithm for a post-quantum one; integrity is maintained because the algorithms are intractable on a quantum computer. What about the last property, authentication? There are three ways to achieve authentication in a TLS handshake, depending on whether server-only or mutual authentication is required:</p><ol><li><p>By using a ‘pre-shared’ key (PSK) generated from a previous run of the TLS connection that can be used to establish a new connection (this is often called &quot;session resumption&quot; or &quot;resuming&quot; with a PSK),</p></li><li><p>By using a <a href=\"/opaque-oblivious-passwords/\">Password-Authenticated Key Exchange (PAKE)</a> for handshake authentication or post-handshake authentication (with the usage of <a href=\"https://datatracker.ietf.org/doc/draft-ietf-tls-exported-authenticator/\">exported authenticators</a>, for example). This can be done by using the <a href=\"https://github.com/grittygrease/draft-sullivan-tls-opaque/blob/master/draft-sullivan-tls-opaque.md\">OPAQUE</a> or the <a href=\"http://www.watersprings.org/pub/id/draft-barnes-tls-pake-00.html\">SPAKE</a> protocols,</p></li><li><p>By using public certificates that advertise parameters that are employed to assure (i.e., create a proof of) the identity of the party you are talking to (this is by far the most common method).</p></li></ol><p>Securing the first authentication mechanism is easily achieved in the post-quantum sphere as a unique key is derived from the initial quantum-protected handshake. The second authentication mechanism does not pose a theoretical challenge (as public and private parameters are replaced with post-quantum counterparts) but rather faces practical limitations: certificate-based authentication involves multiple actors and it is difficult to properly synchronize this change with them, as we will see next. It is not only one public parameter and one public certificate: certificate-based authentication is achieved through the use of a certificate chain with multiple entities.</p><p>A certificate chain is a chain of trust by which different entities attest to the validity of public parameters to provide verifiability and confidence. Typically, for one party to authenticate another (for example, for a client to authenticate a server), a chain of certificates starting from a root’s Certificate Authority (CA) certificate is used, followed by at least one intermediate CA certificate, and finally by the leaf (or end-entity) certificate of the actual party. This is what you usually find in real-world connections. It is worth noting that the order of this chain (for TLS 1.3) does not require each certificate to certify the one immediately preceding it. Servers sometimes send both a current and deprecated intermediate certificate for transitional purposes, or are configured incorrectly.</p><p>What are these certificates? Why do multiple actors need to validate them? A (digital) certificate certifies the ownership of a public key by the named party of the certificate: it attests that the party owns the private counterpart of the public parameter through the use of <a href=\"https://en.wikipedia.org/wiki/Digital_signature\">digital signatures</a>. A CA is the entity that issues these certificates. Browsers, operating systems or mobile devices operate CA “membership” programs where a CA must meet certain criteria to be incorporated into the trusted set. Devices accept their CA root certificates as they come “pre-installed” in a root store. Root certificates, in turn, are used to generate a number of intermediate certificates which will be, in turn, used to generate leaf certificates. This certificate chain process of generation, validation and revocation is not only a procedure that happens at a software level but rather an amalgamation of policies, rules, roles, and hardware<sup>2</sup> and software needs. This is what is often called the <a href=\"https://en.wikipedia.org/wiki/Public_key_infrastructure\">Public Key Infrastructure (PKI)</a>.</p><p>All of the above goes to show that while we can change all of these parameters to post-quantum ones, it is not as simple as just modifying the TLS handshake. Certificate-based authentication involves many actors and processes, and it does not only involve one algorithm (as it happens in the key exchange phase) but typically at least six signatures: one handshake signature; two in the certificate chain; one <a href=\"/high-reliability-ocsp-stapling/\">OCSP staple</a> and <a href=\"/introducing-certificate-transparency-and-nimbus/\">two SCTs</a>. The last five signatures together are used to prove that the server you’re talking to is the right server for the website you’re visiting, for example. Of these five, the last three are essentially patches: the OCSP staple is used to deal with revoked certificates and the SCTs are to detect rogue CA’s. Starting with a clean slate, could we improve on the <i>status quo</i> with an efficient solution?</p><p>More pointedly, we can ask if indeed we still need to use this system of public attestation. The migration to post-quantum cryptography is also an opportunity to modify this system. The PKI as it exists is difficult to maintain, update, revoke, <a href=\"https://hal.inria.fr/hal-01625766/file/CSF2017-PKI%281%29.pdf\">model, or compose.</a> We have an opportunity, perhaps, to rethink this system.</p><p>Even without considering making fundamental changes to public attestation, updating the existing complex system presents both technical and management/coordination challenges:</p><ul><li><p>On the technical side: are the post-quantum signatures, which have larger sizes and bigger computation times, usable in our handshakes? We explore <a href=\"/sizing-up-post-quantum-signatures/\">this idea in this experiment</a>, but we need more information. One potential solution is to cache intermediate certificates or to use other forms of authentication beyond digital signatures (like <a href=\"/kemtls-post-quantum-tls-without-signatures/\">KEMTLS</a>).</p></li><li><p>On the management/coordination side: how are we going to coordinate the migration of this complex system? Will there be some kind of ceremony to update algorithms? How will we deal with the situation where some systems have updated but others have not? How will we revoke past certificates?</p></li></ul><p>This challenge brings into light that the migration to post-quantum cryptography is not only about the technical changes but is dependent on how the Internet works as the interconnected community that it is. Changing systems involves coordination and the collective willingness to do so.</p><p>On the other hand, post-quantum password-based authentication for TLS is still an open discussion. Most PAKE systems nowadays use <a href=\"https://en.wikipedia.org/wiki/Decisional_Diffie%E2%80%93Hellman_assumption\">Diffie-Hellman assumptions</a>, which can be broken by a quantum computer. There are <a href=\"https://eprint.iacr.org/2020/1532\">some</a> <a href=\"https://eprint.iacr.org/2019/1271.pdf\">ideas</a> on how to transition their underlying algorithms to the post-quantum world; but these seem to be so inefficient as to render their deployment infeasible. It seems, though, that password authentication has an interesting property called “<a href=\"https://eprint.iacr.org/2021/696.pdf\">quantum annoyance</a>”. A quantum computer can compromise the algorithm, but only one instance of the problem at the time for each guess of a password: “Essentially, the adversary must guess a password, solve a discrete logarithm based on their guess, and then check to see if they were correct”, as <a href=\"https://eprint.iacr.org/2021/696.pdf\">stated in the paper</a>. Early quantum computers might take quite a long time to solve each guess, which means that a quantum-annoying PAKE combined with a large password space could delay quantum adversaries considerably in their goal of recovering a large number of passwords. Password-based authentication for TLS, therefore, could be safe for a longer time. But this does not mean, however, that it is not threatened by quantum adversaries.</p><p>The world of security protocols, though, does not end with TLS. There are many other security protocols (such as <a href=\"https://en.wikipedia.org/wiki/Domain_Name_System_Security_Extensions#:~:text=The%20Domain%20Name%20System%20Security,Internet%20Protocol%20(IP)%20networks.\">DNSSEC</a>, <a href=\"https://www.wireguard.com/\">WireGuard</a>, SSH, <a href=\"https://en.wikipedia.org/wiki/QUIC\">QUIC</a>, and more) that will need to transition to post-quantum cryptography. For DNSSEC, the challenge is complicated by the protocol not seeming to be able to <a href=\"https://github.com/claucece/PQNet-Workshop/blob/main/slides/PQC%20and%20DNSSEC%20(with%20animations).pdf\">deal with large signatures or high computation costs on verification time</a>. According to <a href=\"https://www.sidnlabs.nl/downloads/7qGFW0DiOkov0vWyDK9qaK/de709198ac34477797b381f146639e27/Retrofitting_Post-Quantum_Cryptography_in_Internet_Protocols.pdf\">research</a> from SIDN Labs, it seems like only Falcon-512 and Rainbow-I-CZ can be used in DNSSEC (note that, though, there is a <a href=\"https://eprint.iacr.org/2022/214\">recent attack</a> on Rainbow).</p><!--kg-card-begin: html--><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-x5oc{background-color:#ffce93;border-color:inherit;text-align:left;vertical-align:top}\n.tg .tg-fymr{border-color:inherit;font-weight:bold;text-align:left;vertical-align:top}\n.tg .tg-0pky{border-color:inherit;text-align:left;vertical-align:top}\n</style>\n<table class=\"tg\" style=\"undefined;table-layout: fixed; width: 744px\">\n<colgroup>\n<col style=\"width: 180px\">\n<col style=\"width: 180px\">\n<col style=\"width: 180px\">\n<col style=\"width: 200px\">\n</colgroup>\n<thead>\n  <tr>\n    <th class=\"tg-fymr\">Scheme</th>\n    <th class=\"tg-fymr\">Public key size</th>\n    <th class=\"tg-fymr\">Signature size</th>\n    <th class=\"tg-fymr\">Speed of operations</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td class=\"tg-0pky\" colspan=\"4\"><span style=\"font-style:italic\">Finalists</span><br></td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">Dilithium2</td>\n    <td class=\"tg-0pky\">1,312</td>\n    <td class=\"tg-0pky\">2,420</td>\n    <td class=\"tg-0pky\">Very fast</td>\n  </tr>\n  <tr>\n    <td class=\"tg-x5oc\">Falcon-512</td>\n    <td class=\"tg-x5oc\">897</td>\n    <td class=\"tg-x5oc\">690</td>\n    <td class=\"tg-x5oc\">Fast, if you have the right hardware</td>\n  </tr>\n  <tr>\n    <td class=\"tg-x5oc\">Rainbos-I-CZ</td>\n    <td class=\"tg-x5oc\">103,648</td>\n    <td class=\"tg-x5oc\">66</td>\n    <td class=\"tg-x5oc\">Fast</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\" colspan=\"4\"><span style=\"font-style:italic\">Alternate Candidates</span></td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\"><span style=\"font-weight:400;font-style:normal;text-decoration:none\">SPHINCS</span><sup>+</sup>-128f</td>\n    <td class=\"tg-0pky\">32</td>\n    <td class=\"tg-0pky\">17,088</td>\n    <td class=\"tg-0pky\">Slow</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\"><span style=\"font-weight:400;font-style:normal;text-decoration:none;color:#000;background-color:transparent\">SPHINCS</span><sup>+</sup><span style=\"font-weight:400;font-style:normal;text-decoration:none;color:#000;background-color:transparent\">-128s</span></td>\n    <td class=\"tg-0pky\">32</td>\n    <td class=\"tg-0pky\">7,856</td>\n    <td class=\"tg-0pky\">Very slow</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">GeMSS-128</td>\n    <td class=\"tg-0pky\">352,188</td>\n    <td class=\"tg-0pky\">33</td>\n    <td class=\"tg-0pky\">Very slow</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">Picnic3</td>\n    <td class=\"tg-0pky\">35</td>\n    <td class=\"tg-0pky\">14,612</td>\n    <td class=\"tg-0pky\">Very slow</td>\n  </tr>\n</tbody>\n</table><!--kg-card-end: html--><p>Table 1: Signature post-quantum algorithms. The orange rows show the suitable algorithms for DNSSEC.</p><p>What are the alternatives for a post-quantum DNSSEC? Perhaps, the isogeny-based signature scheme, <a href=\"https://eprint.iacr.org/2020/1240\">SQISign</a>, might be a solution if its verification time can be improved (which currently is 42 ms as <a href=\"https://eprint.iacr.org/2020/1240.pdf\">noted in the original paper</a> when running on a 3.40GHz Intel Core i7-6700 CPU over 250 runs for verification. Still slower than <a href=\"https://en.wikipedia.org/wiki/P-384\">P-384</a>. Recently, it <a href=\"https://eprint.iacr.org/2022/234.pdf\">has improved to 25ms</a>). Another solution might be the usage of <a href=\"https://eprint.iacr.org/2021/1144.pdf\">MAYO</a>, which on an Intel i5-8400H CPU at 2.5GHz, a signing operation can take 2.50 million cycles, and a verification operation can take 1.3 million cycles. There is a lot of research that needs to be done to make isogeny-based cryptography faster so it will fit the protocol’s needs (research on this area is currently ongoing —see, for example, the <a href=\"https://isogenyschool2020.co.uk/\">Isogeny School</a>) and provide assurance of their security properties. Another alternative could be using other forms of authentication for this protocol’s case, like using <a href=\"https://blog.verisign.com/security/securing-the-dns-in-a-post-quantum-world-hash-based-signatures-and-synthesized-zone-signing-keys/\">hash-based signatures</a>.</p><p>DNSSEC is just one example of a protocol where post-quantum cryptography has a long road ahead, as we need hands-on experimentation to go along with technical updates. For the other protocols, there is timely research: there are, for example, proposals for a <a href=\"https://eprint.iacr.org/2020/379.pdf\">post-quantum WireGuard</a> and for a <a href=\"https://openquantumsafe.org/applications/ssh.html\">post-quantum SSH</a>. More research, though, needs to be done on the practical implications of these changes over real connections.</p><p>One important thing to note here is that there will likely be an intermediate period in which security protocols provide a “hybrid” set of algorithms for transitional purposes, compliance and security. “Hybrid” means that both a pre-quantum (or classical) algorithm and a post-quantum one are used to generate the secret used to encrypt or provide authentication. The security reason for using this hybrid mode is due to safeguarding in case post-quantum algorithms are broken. There are still many unknowns here (single code point, multiple codepoints, contingency plans) that we need to consider.</p><h3>The failures of cryptography in practice</h3><p>The Achilles heel for cryptography is often introducing it into the real-world. Designing, implementing, and deploying cryptography is notoriously <a href=\"https://www.usenix.org/system/files/conference/usenixsecurity16/sec16_paper_garman.pdf\">hard to get right</a> due to flaws in security proofs, implementation bugs, and vulnerabilities<sup>3</sup> of software and hardware. We often deploy cryptography that is found to be flawed and the cost of fixing it is immense (it involves resources, coordination, and more). We have some previous lessons to draw from it as a community, though. For TLS 1.3, we pushed for <a href=\"https://ieeexplore.ieee.org/document/7958593\">verifying implementations</a> of the standard, and for using tools to <a href=\"https://bblanche.gitlabpages.inria.fr/publications/BlanchetETAPS12.pdf\">analyze the symbolic and computational models</a>, as seen in <a href=\"/post-quantum-formal-analysis/\">other</a> <a href=\"/post-quantum-easycrypt-jasmin/\">blog posts</a>. Every time we design a new algorithm, we should aim for this same level of confidence, especially for the big migration to post-quantum cryptography.</p><p>In other blog posts, we have discussed our formal verification <a href=\"/post-quantum-easycrypt-jasmin/\">efforts</a>, so we will not repeat these here. Rather let’s focus on what remains to be done on the formal verification front. Verification, analysis and implementation are not yet complete and we still need to:</p><ul><li><p>Create easy-to-understand guides into what formal analysis is and how it can be used (as formal languages are unfamiliar to developers).</p></li><li><p>Develop user-tested APIs.</p></li><li><p>Flawless integration of a post-quantum algorithm’s API into protocols’ APIs.</p></li><li><p>Test and analyze the boundaries between verified and unverified code.</p></li><li><p>Verifying specifications at the standard level by, for example, integrating <a href=\"https://hal.inria.fr/hal-03176482/document\">hacspec</a> into IETF drafts.</p></li></ul><p>Only in doing so can we prevent some of the security issues we have had in the past. Post-quantum cryptography will be a big migration and we can, if we are not careful, repeat the same issues of the past. We want a future that is better. We want to mitigate bugs and provide high assurance of the security of connections users have.</p><h3>A post-quantum tunnel is born</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5txFSxUXLbi6kiuyOjyTH9/5174cdca6770612cacc6153c430f5145/image3-27.png\" alt=\"a post-quantum Cloudflare Tunnel.\" class=\"kg-image\" width=\"1474\" height=\"460\" loading=\"lazy\"/>\n            \n            </figure><p>We’ve described the challenges of post-quantum cryptography from a theoretical and practical perspective. These are problems we are working on and issues that we are analyzing. They will take time to solve. But what can you expect in the short-term? What new ideas do we have? Let’s look at where else we can put post-quantum cryptography.</p><p><a href=\"/tunnel-for-everyone/\">Cloudflare Tunnel</a> is a service that creates a secure, outbound-only connection between your services and Cloudflare by deploying a lightweight connector in your environment. This is the end at the server side. At the other end, at the client side, we have <a href=\"/1111-warp-better-vpn/\">WARP</a>, a ‘VPN’ for client devices that can secure and accelerate all HTTPS traffic. So, what if we add post-quantum cryptography to all our <a href=\"/post-quantumify-cloudflare\">internal infrastructure</a>, and also add it to this server and the client endpoints? We would then have a post-quantum server to client connection where any request from the WARP client to a private network (one that uses Tunnel) is secure against a quantum adversary (how to do it will be similar to what is <a href=\"https://developers.cloudflare.com/cloudflare-one/tutorials/warp-to-tunnel\">detailed here</a>). Why would we want to do this? First, because it is great to have a connection that is fully protected against quantum computers. Second, because we can better measure the impacts of post-quantum cryptography in this environment (and even measure them in a mobile environment). This will also mean that we can provide guidelines to clients and servers on how to migrate to post-quantum cryptography. It would also be the first available service to do so at this scale. How will all of us experience this transition? Only time will tell, but we are excited to work towards this vision.</p><p>And, furthermore, as Tunnel uses the <a href=\"https://en.wikipedia.org/wiki/QUIC\">QUIC protocol</a> <a href=\"/getting-cloudflare-tunnels-to-connect-to-the-cloudflare-network-with-quic/\">in some cases</a> and WARP uses the WireGuard protocol, this means that we can experiment with post-quantum cryptography in protocols that are novel and have not seen much experimentation in the past.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6eSXBxWZXlVqSd1tnMTbqp/cc684b389576d9c70b9c3b279b6a9b6b/image2-25.png\" alt=\"The future of Cloudflare is post-quantum.\" class=\"kg-image\" width=\"1156\" height=\"421\" loading=\"lazy\"/>\n            \n            </figure><p>So, what is the future in the post-quantum cryptography era? The future is better and not just the same. The future is fast and more secure. Deploying cryptography can be challenging and we have had problems with it in the past; but post-quantum cryptography is the opportunity to dream of better security, it is the path to explore, and it is the reality to make it happen.</p><p>Thank you for reading our post-quantum blog post series and expect more post-quantum content and updates from us!</p><hr/><p><i>If you are a student enrolled in a PhD or equivalent research program and looking for an internship for 2022, see </i><a href=\"https://research.cloudflare.com/outreach/academic-programs/interns/\"><b><i>open opportunities</i></b></a><b><i>.</i></b></p><p><i>If you’re interested in contributing to projects helping Cloudflare, </i><a href=\"https://www.cloudflare.com/en-gb/careers/jobs/?department=Engineering&location=default\"><i>our engineering teams are hiring</i></a><i>.</i></p><p><i>You can reach us with questions, comments, and research ideas at </i><a href=\"mailto:ask-research@cloudflare.com\"><i>ask-research@cloudflare.com</i></a><i>.</i></p><p>.....</p><p><sup>1 </sup>And when we do predict, we often predict more of the same attacks we are accustomed to: adversaries breaking into connections, security being tampered with. Is this all that they will be capable of?</p><p><sup>2</sup>The private part of a public key advertised in a certificate is often the target of attacks. An attacker who steals a certificate authority&#39;s private keys is able to forge certificates, for example. Private keys are almost always stored on a hardware security module (HSM), which prevents key extraction. This is a small example of how hardware is involved in the process.</p><p><sup>3</sup>Like constant-time failures, side-channel, and timing attacks.</p>",
		"id": "5qmZiK0vIXo8sNj0Aj25ZB",
		"localeList": {
			"name": "The post-quantum future: challenges and opportunities Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2022-02-25T16:03:25.000+00:00",
		"reading_time": 12,
		"slug": "post-quantum-future",
		"tags": [
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			},
			{
				"id": "6bIo7ayy56Fzdrtf9z2EWy",
				"name": "Post-Quantum",
				"slug": "post-quantum"
			}
		],
		"title": "The post-quantum future: challenges and opportunities",
		"updated_at": "2024-08-27T01:35:55.524Z",
		"url": "https://blog.cloudflare.com/post-quantum-future"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}