{
	"initialReadingTime": "10",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Goutam Tamvada",
				"slug": "goutam-tamvada",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/79UwIJZF6oQoK9k7epS0jB/e06cffd7d9d6a241c302f5a3469cfc38/goutam-tamvada.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Sofía Celi",
				"slug": "sofia",
				"bio": "Cryptography researcher and implementer at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2waJR10lPQ4007cOdOJQ5P/070caf2211c94b6a2bc5fb22c947ce5e/sofia.jpg",
				"location": "Lisbon",
				"website": "http://claucece.github.io/",
				"twitter": "@claucece",
				"facebook": null
			}
		],
		"excerpt": "How can one attest to an identity and prove it belongs to one self? And how can one do it in the face of quantum computers? In this blog post, we examine these questions and explain what post-quantum signatures are",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/39olGB2yhOWTnjIZGXw0wl/b2eaa6f2f15206aa6d98d3d4a79baab6/post-quantum-signatures.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1ewsKSumB2t0mCKIp9i1yo/caeda255bb0d18bc1d95c4d484e6a1eb/image6-5.png\" alt=\"Blogpost around what is a post-quantum signature scheme.\" class=\"kg-image\" width=\"1800\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>To provide authentication is no more than to assert, to provide proof of, an identity. We can claim who we claim to be but if there is no proof of it (recognition of our face, voice or mannerisms) there is no assurance of that. In fact, we can claim to be someone we are not. We can even claim we are someone that does not exist, as clever Odysseus did once.</p><p>The story goes that there was a man named <a href=\"https://en.wikipedia.org/wiki/Odysseus\">Odysseus</a> who angered the gods and was punished with perpetual wandering. He traveled and traveled the seas meeting people and suffering calamities. On one of his trips, he came across the <a href=\"https://en.wikipedia.org/wiki/Polyphemus\">Cyclops Polyphemus</a> who, in short, wanted to eat him. Clever Odysseus got away (as he usually did) by wounding the cyclops’ eye. As he was wounded, he asked for Odysseus name to which the latter replied:</p><blockquote><p>“Cyclops, you asked for my glorious name, and I will tell it; but do give the stranger&#39;s gift, just as you promised. <i>Nobody</i> I am called. <i>Nobody</i> they called me: by mother, father, and by all my comrades”</p></blockquote><p><i>(As seen in </i><a href=\"https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.01.0135%3Abook%3D9%3Acard%3D360\"><i>The Odyssey, book 9</i></a><i>. Translation by the authors of the blogpost).</i></p><p>The cyclops believed that was Odysseus&#39; name (<a href=\"https://en.wikipedia.org/wiki/Outis\">Nobody</a>) and proceeded to tell everyone, which resulted in no one believing him. “How can nobody have wounded you?” they questioned the cyclops. It was a trick, a play of words by Odysseus. Because to give an identity, to tell the world who you are (or who you are pretending to be) is easy. To provide proof of it is very difficult. The cyclops could have asked Odysseus to prove who he was, and the story would have been different. And Odysseus wouldn’t have left the cyclops laughing.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1Pkg7X1JgYTojfc5AgbTxY/40499a72f2c82697a187373899a74c81/image1-17.png\" alt=\"Odysseus and the cyclops.\" class=\"kg-image\" width=\"1802\" height=\"889\" loading=\"lazy\"/>\n            \n            </figure><p>In the digital world, proving your identity is more complex. In face-to-face conversations, we can often attest to the identity of someone by knowing and verifying their face, their voice, or by someone else introducing them to us. From computer to computer, the scenario is a little different. But there are ways. When a user connects to their banking provider on the Internet, they need assurance not only that the information they send is secured; but that they are also sending it to their bank, and not a malicious website masquerading as their provider. The Transport Layer Security (TLS) protocol provides this through digitally signed statements of identity (certificates). Digital signature schemes also play a central role in DNSSEC as well, an extension to the <a href=\"https://www.cloudflare.com/learning/dns/what-is-dns/\">Domain Name System (DNS)</a> that protects applications from accepting forged or manipulated DNS data, which is what happens during <a href=\"https://en.wikipedia.org/wiki/DNS_spoofing\">DNS cache poisoning</a>, for example.</p><p>A digital signature is a demonstration of authorship of a document, conversation, or message sent using digital means. As with “regular” signatures, they can be publicly verified by anyone that knows that it is a signature made by someone.</p><p>A digital signature scheme is a collection of three algorithms:</p><ol><li><p>A key generation algorithm, <i>Generate</i>, which generates a public verification key and a private signing key (a keypair).</p></li><li><p>A signing algorithm, <i>Sign</i>, which takes the private signing key, a message, and outputs a signature of the message.</p></li><li><p>A verification algorithm, <i>Verify</i>, which takes the public verification key, the signature and the message, and outputs a value stating whether the signature is valid or not.</p></li></ol><p>In the case of the Odysseus&#39; story, what the cyclops could have done to verify his identity (to verify that he indeed was <i>Nobody</i>) was to ask for a proof of identity: for example, for other people to vouch that he is who he claims to be. Or he could have asked for a digital signature (attested by several people or registered as his own) attesting he was <i>Nobody.</i> Nothing like that happened, so the cyclops was fooled.</p><p>In the Transport Layer Security protocol, TLS, authentication needs to be executed at the time a connection or conversation is established (as data sent after this point will be authenticated until that is explicitly disabled), rather than for the full lifetime of the data (as with confidentiality). Because of that, the need to transition to post-quantum signatures is not as urgent as it is for post-quantum key exchange schemes, and we do not believe there are sufficiently powerful quantum computers at the moment that can be used to listen in on connections and forge signatures. At some point, that will no longer be true, and the transition will have to be made.</p><p>There are various candidates for authentication schemes (including digital signatures) that are quantum secure: some use cryptographic hash functions, some use problems over lattices, while others use techniques from the field of <a href=\"https://en.wikipedia.org/wiki/Secure_multi-party_computation\">multi-party computation</a>. It is also possible to use Key Encapsulation Mechanisms (or KEMs) to achieve authentication in cryptographic protocols.</p><p>In this post, much like in the one about <a href=\"/post-quantum-key-encapsulation\">Key Encapsulation Mechanisms</a>, we will give a bird’s-eye view of the construction of one particular post-quantum signature algorithm. We will discuss <a href=\"https://pq-crystals.org/dilithium/data/dilithium-specification-round3.pdf\">CRYSTALS-Dilithium</a>, as an example of how a signature scheme can be constructed. Dilithium is a finalist candidate in the <a href=\"https://csrc.nist.gov/Projects/post-quantum-cryptography/round-3-submissions\">NIST post-quantum cryptography standardization process</a> and provides an example of a standard technique used to construct digital signature schemes. We chose to explain Dilithium here as it is a finalist and its design is straightforward to explain.</p><p>We will again build the algorithm up layer-by-layer. We will look at:</p><ul><li><p>Its mathematical underpinnings: as we see in <a href=\"/post-quantum-key-encapsulation\">other blog posts</a>, a cryptographic algorithm can be built as a Matryoshka doll or a <a href=\"https://en.wikipedia.org/wiki/Chinese_boxes\">Chinese box</a>. Let us use the Chinese box analogy here. The first box, in this case, is the mathematical base, whose hardness should be strong so that security is maintained. In the post-quantum world, this is usually the hardness of some lattice or isogeny problems.</p></li><li><p>Its algorithmic construction: these are all the subsequent boxes that take the mathematical base and construct an algorithm out of it. In the case of a signature, first one constructs an identification scheme, which we will define in the next sections, and then transform it to a signature scheme using the <a href=\"https://www.iacr.org/archive/asiacrypt2009/59120596/59120596.pdf\">Fiat-Shamir transformation</a>.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6HkQpmpEYsnuu4tZx9NM9C/59dd2e33936fc8dfbce1221b1582279f/image5-6.png\" alt=\"The different boxes of a post-quantum algorithm\" class=\"kg-image\" width=\"1800\" height=\"750\" loading=\"lazy\"/>\n            \n            </figure><p>The mathematical core of <i>Dilithium</i> is, as with <a href=\"https://csrc.nist.gov/Projects/post-quantum-cryptography/round-3-submissions\">FrodoKEM</a>, based on the hardness of a variant of the Learning with Errors (LWE) problem and the Short Integer Solution (SIS) problem. As we have already <a href=\"/post-quantum-key-encapsulation\">talked about LWE</a>, let’s now briefly go over SIS.</p><p><b>Note to the reader</b>: Some mathematics is coming in the next sections; but don’t worry, we will guide you through it.</p><h3>The Short Integer Solution Problem</h3><p>In order to properly explain what the SIS problem is, we need to first start by understanding what a <i>lattice</i> is. A lattice is a regular repeated arrangement of objects or elements over a space. In geometry, these objects can be points; in physics, these objects can be atoms. For our purposes, we can think of a lattice as a set of points in <i>n</i>-dimensional space with a periodic (repeated) structure, as we see in the image. It is important to understand the meaning of <i>n</i>-dimensional space here: a two-dimensional space is, for example, the one that we often see represented on planes: a projection of the physical universe into a plane with two dimensions which are length and width. Historically, lattices have been investigated since the late 18th century for various reasons. For a more comprehensive introduction to lattices, you can read this <a href=\"https://cims.nyu.edu/~regev/papers/qcrypto.pdf\">great paper</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4XTU1HRx6QrSZx9fsPjhEa/fc017296eac694e7c732cf0232c0eb0e/image4-11.png\" alt=\"picture of a lattice.\" class=\"kg-image\" width=\"1152\" height=\"1536\" loading=\"lazy\"/>\n            \n            </figure><p>Picture of a lattice. They are found in the wild in Portugal.</p><p>What does <a href=\"https://crypto.stanford.edu/cs355/18sp/lec9.pdf\">SIS</a> pertain to? You are given a positive integer <i>q</i> and a <a href=\"https://en.wikipedia.org/wiki/Matrix_(mathematics)\">matrix</a> (a rectangular array of numbers) <i>A</i> of dimensions <i>n x m</i> (the number of rows is <i>n</i> and the number of columns is <i>m</i>), whose elements are integers between 0 and a number <i>q</i>. You are then asked to find a <a href=\"https://en.wikipedia.org/wiki/Vector_(mathematics_and_physics)\">vector</a> <i>r</i> (smaller than a certain amount, called the “norm bound”) such that <i>Ar = 0</i>. The conjecture is that, for a sufficiently large <i>n</i>, finding this solution is hard even for quantum computers. This problem is “dual” to the LWE problem that we explored in <a href=\"/post-quantum-key-encapsulation\">another blog post</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/26WDPtAXRotNflQ4IqzL0s/3b28317a0739f329652e86d59f3db242/image2-18.png\" alt=\"the SIS problem\" class=\"kg-image\" width=\"927\" height=\"496\" loading=\"lazy\"/>\n            \n            </figure><p>We can define this same <a href=\"https://web.eecs.umich.edu/~cpeikert/pubs/slides-abit2.pdf\">problem over a lattice</a>. Take a lattice <i>L(A)</i>, made up of <i>m</i> different <i>n</i>-dimensional vectors <i>y</i> (the repeated elements)<i>.</i> The goal is to find non-zero vectors in the lattice such that <i>Ay = 0 (mod q)</i> (for some <i>q</i>), whose size is less than a certain specified amount. This problem can be seen as trying to find the “short” solutions in the lattice, which makes the problem the <a href=\"https://en.wikipedia.org/wiki/Lattice_problem#Shortest_vector_problem_(SVP)\">Short Vector Problem</a> (SVP) in the average case. Finding this solution is simple to do in two dimensions (as seen in the diagram), but finding the solution in more dimensions is hard.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3CDPZWUUhMGnb2VKGMoxyG/595f28cde66e2e1afa460965c75dc4c2/image3-20.png\" alt=\"The SIS problem as the SVP. The goal is to find the “short” vectors in the radius.\" class=\"kg-image\" width=\"792\" height=\"678\" loading=\"lazy\"/>\n            \n            </figure><p>The SIS problem as the SVP. The goal is to find the “short” vectors in the radius.</p><p>The SIS problem is often used in cryptographic constructions such as one-way functions, collision resistant hash functions, digital signature schemes, and identification schemes.</p><p>We have now built the first Chinese box: the mathematical base. Let’s take this base now and create schemes from it.</p><h3>Identification Schemes</h3><p>From the mathematical base of our Chinese box, we build the first computational algorithm: an identification scheme. An identification scheme consists of a key generation algorithm, which outputs a public and private key, and an interactive protocol between a prover <i>P</i> and a verifier <i>V</i>. The prover has access to the public key and private key, and the verifier only has access to the public key. A series of messages are then exchanged such that the prover can demonstrate to the verifier that they know the private key, without leaking any other information about the private key.</p><p>More specifically, a three-move (three rounds of interaction) identification scheme is a collection of algorithms. Let’s think about it in the terms of Odysseus trying to prove to the cyclops that he is <i>Nobody</i>:</p><ul><li><p>Odysseus (the prover) runs a key generation algorithm, <i>Generate</i>, that outputs a public and private keypair.</p></li><li><p>Odysseus then runs a commitment algorithm, <i>Commit,</i> that uses the private key, and outputs a commitment <i>Y</i>. The commitment is nothing more than a statement that this specific private key is the one that will be used. He sends this to the cyclops.</p></li><li><p>The cyclops (the verifier) takes the commitment and runs a challenge algorithm, <i>Challenge</i>, and outputs a challenge <i>c</i>. This challenge is a question that asks: are you really the owner of the private key?</p></li><li><p>Odysseus receives the challenge and runs a response algorithm, <i>Response</i>. This outputs a response <i>z</i> to the challenge. He sends this value to the cyclops.</p></li><li><p>The cyclops runs the verification algorithm, <i>Verify</i>, which outputs either accept (1) or reject (0) if the answer is correct.</p></li></ul><p>If Odysseus was really the owner of the private key for <i>Nobody</i>, he would have been able to answer the challenge in a positive manner (with a 1). But, as he is not, he runs away (and this is the last time we see him in this blogpost).</p><h3>The Dilithium Identification Scheme</h3><p>The basic building blocks of Dilithium are polynomials and rings. This is the second-last box of the Chinese box, and we will explore it now.</p><p>A polynomial ring, <i>R</i>, is a <a href=\"https://en.wikipedia.org/wiki/Ring_(mathematics)\">ring</a> of all polynomials. A ring is a set in which two operations can exist: addition and multiplication of integers; and a polynomial is an expression of variables and coefficients. The “size” of these polynomials, defined as the size of the largest coefficient, plays a crucial role for these kinds of algorithms.</p><p>In the case of Dilithium, the <i>Generation</i> algorithm creates a <i>k x l</i> matrix <i>A</i>. Each entry of this matrix is a polynomial in the defined ring. The generation algorithm also creates random private vectors <i>s1</i> and <i>s2</i>, whose components are elements of <i>R</i>, the ring_._ The public key is the matrix <i>A</i> and <i>t = As1 + s2</i>. It is infeasible for a quantum computer to know the secret values given just <i>t</i> and <i>A</i>. This problem is called Module-Learning With Errors (MLWE) problem, and it is a variant of LWE as seen <a href=\"/post-quantum-key-encapsulation\">in this blog post</a>.</p><p>Armed with the public and private keys, the Dilithium <i>identification scheme</i> proceeds as follows (some details are left out for simplicity, like the rejection sampling):</p><ol><li><p>The prover wants to prove they know the private key. They generate a random secret nonce y whose coefficient is less than a security parameter. They then compute Ay and set a commitment w1 to be the “high-order”<sup>1</sup> bits of the coefficients in this vector.</p></li><li><p>The verifier accepts the commitment and creates a challenge c.</p></li><li><p>The prover creates the potential signature z = y + cs1 (notice the usage of the random secret nonce and of the private key) and performs checks on the sizes of several parameters which makes the signature secure. This is the answer to the challenge.</p></li><li><p>The verifier receives the signature and computes w1 to be the “high-order” bits of Az−ct (notice the usage of the public key). They accept this answer if all the coefficients of z are less than the security parameter, and if w1 is equal to w0.</p></li></ol><p>The identity scheme previously mentioned is an interactive protocol that requires participation from both parties. How do we turn this into a non-interactive signature scheme where one party issues signatures and other parties can verify them (the reason for this conversation is that anyone should be able to publicly verify)? Here, we place the last Chinese box.</p><p>A three-move identification scheme can be turned into a signature scheme using the Fiat–Shamir transformation: instead of the verifier accepting the commitment and sending a challenge <i>c</i>, the prover computes the challenge as a hash <i>H(M || w1)</i>  of the message <i>M</i> and of the value <i>w1</i> (computed in step 1 of the previous scheme). This is an approach in which the signer has created an instance of a lattice problem, which only the signer knows the solution to.</p><p>This in turn means that if a message was signed with a key, it could have only been signed by the person with access to the private key, and it can be verified by anyone with access to the public key.</p><p>How is this procedure related to the lattice’s problems we have seen? It is used to prove the security of the scheme: specifically the M-SIS (module SIS) problem and the LWE decisional problem.</p><p>The Chinese box is now constructed, and we have a digital signature scheme that can be used safely in the face of quantum computers.</p><h3>Other Digital Signatures beyond Dilithium</h3><p>In Star Trek, <a href=\"https://en.wikipedia.org/wiki/Dilithium_(Star_Trek)\"><i>Dilithium</i></a> is a rare material that cannot be replicated. Similarly, signatures cannot be replicated or forged: each one is unique. But this does not mean that there are no other algorithms we can use to generate post-quantum signatures. Dilithium is currently designated as a finalist candidate for standardization as part of the post-quantum NIST process. But, there are others:</p><ul><li><p><a href=\"https://falcon-sign.info/\">Falcon</a>, another lattice-based candidate, based on NTRU lattices.</p></li><li><p><a href=\"https://www.pqcrainbow.org/\">Rainbow</a>, a scheme based on multivariate polynomials.</p></li></ul><p>We have seen examples of KEMs in <a href=\"/post-quantum-key-encapsulation\">other blog posts</a> and signatures that are resistant to attacks by quantum computers. Now is the time to step back and take a look at the bigger picture. We have the building blocks, but the problem of actually building post-quantum secure cryptographic protocols with them remains, as well as making existing protocols such as TLS post-quantum secure. This problem is not entirely straightforward, owing to the trade-offs that post-quantum algorithms present. As we have carefully stitched together mathematical problems and cryptographic tools to get algorithms with the properties we desire, so do we have to carefully compose these algorithms to get the secure protocols that we need.</p><h3>References:</h3><ul><li><p>“Fiat-Shamir With Aborts: Applications to Lattice and Factoring-Based Signatures” by Vadim Lyubashevsky: <a href=\"https://www.iacr.org/archive/asiacrypt2009/59120596/59120596.pdf\">https://www.iacr.org/archive/asiacrypt2009/59120596/59120596.pdf</a></p></li><li><p>“A Concrete Treatment of Fiat-Shamir Signatures in the Quantum Random-Oracle Model” by Eike Kiltz, Vadim Lyubashevsky and Christian Schaffner: <a href=\"https://eprint.iacr.org/2017/916.pdf\">https://eprint.iacr.org/2017/916.pdf</a></p></li><li><p>“On Lattices, Learning with Errors, Random Linear Codes, and Cryptography” by Oded Regev: <a href=\"https://cims.nyu.edu/~regev/papers/qcrypto.pdf\">https://cims.nyu.edu/~regev/papers/qcrypto.pdf</a></p></li><li><p>“CRYSTALS: (Cryptographic Suite for Algebraic Lattices) Dilithium” by Léo Ducas, Eike Kiltz, Tancrede Lepoint, Vadim Lyubashevsky, Peter Schwabe, Gregor Seiler and Damien Stehle: <a href=\"https://csrc.nist.gov/CSRC/media/Presentations/crystals-dilithium-round-2-update/images-media/crystals-dilithium-lyubashevsky.pdf\">https://csrc.nist.gov/CSRC/media/Presentations/crystals-dilithium-round-2-update/images-media/crystals-dilithium-lyubashevsky.pdf</a></p></li><li><p>“The Design and Cryptanalysis of Post-Quantum Digital Signature Algorithms” by Ward Beullens: <a href=\"https://www.esat.kuleuven.be/cosic/publications/thesis-417.pdf\">https://www.esat.kuleuven.be/cosic/publications/thesis-417.pdf</a></p></li><li><p>“How To Prove Yourself: Practical Solutions to Identification and Signature Problems” by Amos Fiat and Adi Shamir: <a href=\"https://link.springer.com/content/pdf/10.1007/3-540-47721-7_12.pdf\">https://link.springer.com/content/pdf/10.1007/3-540-47721-7_12.pdf</a></p></li></ul><p>.....</p><p><sup>1</sup>This “high-order” and “low-order” procedure decomposes a vector, and there is a specific procedure for this for Dilithium. It aims to reduce the size of the public key.</p>",
		"id": "U0ZZL2iHPnagcIJvsEI3A",
		"localeList": {
			"name": "Deep dive into a post-quantum signature scheme Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "How can one attest to an identity and prove it belongs to one self? And how can one do it in the face of quantum computers? In this blog post, we examine these questions and explain what post-quantum signatures are. ",
		"metadata": {
			"title": "Deep dive into a post-quantum signature scheme",
			"description": "How can one attest to an identity and prove it belongs to one self? And how can one do it in the face of quantum computers? In this blog post, we examine these questions and explain what post-quantum signatures are. ",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/53i0wuhcRS505f4z3SjkIb/041a1bb08ed3441956c84de331130da9/post-quantum-signatures-kyqWWM.png"
		},
		"primary_author": {},
		"published_at": "2022-02-22T13:59:15.000+00:00",
		"slug": "post-quantum-signatures",
		"tags": [
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			},
			{
				"id": "6bIo7ayy56Fzdrtf9z2EWy",
				"name": "Post-Quantum",
				"slug": "post-quantum"
			}
		],
		"title": "Deep dive into a post-quantum signature scheme",
		"updated_at": "2024-08-27T01:36:29.366Z",
		"url": "https://blog.cloudflare.com/post-quantum-signatures"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}