{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Doug Kramer",
				"slug": "doug-kramer",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1qiVA4VVk0FP4TtAhtVKIG/f01e6a0b2f4dc381256a571f67e99371/doug-kramer.jpeg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "We’ve written a couple times about the problem of patent trolls, and what we are doing in response to the first case a troll filed against Cloudflare. We set a goal to find prior art on all 38 Blackbird Tech patents and applications. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/63kFkto98oAoyyfhGLPxj8/98598cce45ba6af55aeed9640ca84b8e/project-jengo-challenges.png",
		"featured": false,
		"html": "<p>We’ve written a couple times about <a href=\"/project-jengo/\">the problem of patent trolls</a>, and <a href=\"/patent-troll-battle-update-doubling-down-on-project-jengo/\">what we are doing</a> in response to the first case a troll filed against Cloudflare. We set a goal to find prior art on all 38 Blackbird Tech patents and applications and then obtain a legal determination that Blackbird Tech’s patents are invalid. Such a determination will end Blackbird’s ability to file or threaten to file abusive patent claims, against us or anyone else.</p><p>The patent system exists to reward inventors, so it is no surprise that a patent has to claim something new — an “invention.” Sometimes the United States Patent and Trademark Office (USPTO) — the agency that administers the patent system — mistakenly issues patents that do not claim anything particularly new. The patent examiner may not be aware that the proposed “invention” was already in use in the industry, and the patent applicant (the only party in the process) doesn’t have an incentive to share that information. Often, the USPTO issues patents that are too vague and can later be broadly interpreted by patent owners to cover different and subsequent technologies that could not otherwise have been patented in the first place and couldn’t have been anticipated by the patent examiner.</p><h4>Bad patents are bad for innovation, so how do we get rid of them?</h4><p>The first step to invalidating the Blackbird Tech patents is to collect prior art on the patents. Prior art can include almost any type of evidence showing that the “invention” described in a patent already existed when the patent was filed. Common types of prior art include earlier-filed patents, journal articles, and commercial products (e.g., computer programs) that predate the challenged patent.</p><p>Prior art can be used to challenge the validity of the patent in several ways. First, we can challenge the validity of the patent asserted against us (<a href=\"https://www.google.com/patents/US6453335\">the ‘335 patent</a>) in the patent infringement case that Blackbird Tech filed against us. We can also challenge any of Blackbird’s patent in proceedings at the USPTO, through either a petition for inter partes review (IPR) or ex parte reexamination.</p><p>In this blog post, we walk through the administrative challenges to patents at the USPTO, especially the IPR, which we consider to be one of the most effective ways to shield ourselves and others from patent troll attacks on innovation.</p><h4>No gridlock here: Congress agrees that bad patents must go</h4><p>The IPR process was created by Congress in 2011 through the <a href=\"https://www.congress.gov/bill/112th-congress/house-bill/1249?q=%7B%22search%22%3A%5B%22PL112-29%22%5D%7D&r=1\">America Invents Act</a> with overwhelming bipartisan support, passing the House by a vote of 304 to 117 and the Senate 89 to 9, and <a href=\"https://obamawhitehouse.archives.gov/the-press-office/2011/09/16/president-obama-signs-america-invents-act-overhauling-patent-system-stim\">was signed by President Obama</a> on September 16, 2011. The law was based on a growing awareness that it had become too easy to obtain low quality patents and too hard to challenge them in expensive and long court proceedings. As technologies continued to grow and develop, the patent system became inundated with bad patents issued during the dot-com era, many of which included vague claims relating to rudimentary web technologies. Over a decade later, these claims were being applied out of context and asserted broadly to shake down innovative companies using vastly more sophisticated technologies.</p><p>While few of the patents used in these shake-downs would have survived an invalidity challenge in front of a judge, the prohibitively high cost and delay of litigation meant that the vast majority of patent infringement claims settled outside of court for nuisance value. Defending a patent lawsuit in federal court costs <a href=\"https://www.cnet.com/news/how-much-is-that-patent-lawsuit-going-to-cost-you/\">millions of dollars</a> (regardless of whether you ultimately have to pay a Plaintiff) and can take <a href=\"https://www.pwc.com/us/en/forensic-services/publications/assets/2016-pwc-patent-litigation-study.pdf\">2-3 years</a> to resolve. As a result, courts rarely had an opportunity to invalidate bad patents. The patents lived on, and the nefarious cycle continued.</p><p>Seeking to break the cycle of misuse, Congress stepped in and created IPR to provide a streamlined process for invalidating bad patents. IPR is an administrative proceeding conducted by the USPTO itself, rather than a federal court. IPR proceedings have a limited scope and harness the USPTO’s special expertise in resolving questions of patent validity. As a result, a typical IPR proceeding can be completed in <a href=\"http://www.ptab-blog.com/2015/11/13/the-cost-effectiveness-of-ptab-proceedings/\">about half the time and at one tenth of the cost</a> of a federal court case.</p><p>To date, <a href=\"https://www.uspto.gov/sites/default/files/documents/Trial_Statistics_2017-05-31.pdf\">over 6,000 IPR petitions have been filed</a>, of which over 1,600 have resulted in written decisions by the USPTO. Many other cases either settled or remain pending. IPR petitioners have had a high rate of success. Of the 1,600 cases that reached a written decision, 1,300 of those cases were successful in having the USPTO invalidate at least one claim, and 1,000 were successful in having the entire patent invalidated.</p><h4>Looking under the hood of an IPR</h4><p>To initiate an IPR, the party challenging the patent files a petition with the USPTO identifying the patents, explaining why the patents should be found invalid, and presenting the relevant prior art. The owner of the challenged patent has an opportunity file a written response to the petition.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3MYlSlfEgyFF015t4ooImP/52d7d709414761f68a8acbacc7fd9f76/1600px-1970_Chevrolet_Camaro_Z28_under_the_hood.jpg\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1197\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://commons.wikimedia.org/wiki/File:Publicsquare1905.jpg#file\">Image</a> by <a href=\"https://www.flickr.com/people/katescars/\">Katherine Tompkins</a></p><p>The USPTO actually makes two major decisions during an IPR. The first is a threshold determination of whether to institute the IPR at all. The USPTO will institute an IPR if the petition (combined with the patent owner’s response, if one was filed) establishes a “reasonable likelihood that the petitioner will prevail” in invalidating one or more claims. One unusual feature of the IPR process is that the USPTO’s institution decision cannot be appealed. Both parties must live with whatever institution decision the USPTO makes. Since 2015, the USPTO has instituted <a href=\"https://patentlyo.com/patent/2016/07/partes-review-statistics.html\">about two thirds</a> of all IPR petitions.</p><p>After an IPR is instituted, both sides have an opportunity to gather evidence, file motions, and present arguments. The USPTO then issues a final written decision on the validity of the patent. Unlike the institution decision, the final written decision of an IPR is appealable to the <a href=\"http://www.cafc.uscourts.gov/the-court/court-jurisdiction\">Federal Circuit Court of Appeals</a> (a specialized appeals court that, among other things, hears appeals in most cases that involve patents). The time between the institution decision and the final written decision should not exceed a year, making IPR exceptionally compact compared to most full court proceedings.</p><p>In addition to speed, the legal standards that the USPTO applies in IPR proceedings are more favorable to the patent challenger than those applied in federal court:</p><ul><li><p><i>The burden of proof for invalidating a patent in an IPR is lower than in federal court.</i> The petitioner in an IPR proceeding must meet the “preponderance of the evidence” standard. This is the same standard of proof that applies in the vast majority of civil (non-criminal) cases. Simply put, whichever side has more convincing evidence wins. By contrast, a party raising an invalidity challenge in federal court must meet a higher “clear and convincing evidence” standard to prove that the patent is invalid.</p></li><li><p><i>The “strike zone” for prior art is bigger in an IPR than in federal court.</i> The USPTO interprets challenged patents broadly — using the “broadest reasonable interpretation” standard — making it relatively easy to find prior art that falls within the scope of the patent. This makes sense as patent trolls often take the broadest possible interpretation of their patents when they decide whom to sue, thereby creating pressure for those parties to settle. Federal courts, on the other hand, interpret the challenged patent more narrowly, through the eyes of a hypothetical “person of ordinary skill in the art” (POSITA). A POSITA is someone who has experience in the technological field of the patent and can use technical context to narrow the scope of the patent. This narrower scope makes it harder to find prior art that falls within the scope of the patent.</p></li><li><p>Although the legal standards in an IPR proceeding tend to favor the challenger, other aspects of IPR proceedings can favor the patent owners. For example, unlike federal courts, IPR proceedings provide an opportunity for patent owners to amend their claims to circumvent the challenger’s prior art.</p></li></ul><h4>Ex parte reexamination forces abusive patent owners to defend their patents</h4><p>For all of the built-in efficiencies of the IPR process, an IPR still closely resembles a traditional court case in many important respects. For example, an IPR generally requires a petitioner to undertake a full slate of heavy-duty legal tasks, like writing briefs, filing motions, and making oral arguments. As a result, even though going through an IPR process is <b>far less</b> painful and expensive than being dragged through the federal courts, it still involves significant legal fees and demands a high level of attention that could otherwise be spent innovating.</p><p>Enter <i>ex parte</i> reexamination, which strips down the process for challenging patent validity even further. In <i>ex parte</i> reexamination, the party challenging the patent files a petition with the USPTO in much the same manner as an IPR. However, once the petition is filed, the petitioner steps out of the picture entirely. Instead, the USPTO reassesses the validity of the challenged patent by engaging in a semi-collaborative back-and-forth between the USPTO and the patent owner, without the challenger’s continued involvement. This back-and-forth is virtually identical to the original examination process between the USPTO and applicant that led to the patent being issued in the first place.</p><p>Like an IPR petition, the petition for <i>ex parte</i> reexamination has to cast sufficient doubt on the validity of the patent before the USPTO will order an <i>ex parte</i> reexamination. In this case, the legal standard that the USPTO uses is whether the petition establishes a “substantial new question of patentability.” To date, over 90% of petitions for <i>ex parte</i> reexamination have been granted.</p><p>With a relatively low up-front investment and no continuing costs incurred by the petitioner, an <i>ex parte</i> reexamination has the advantage of forcing patent owners back to the USPTO to defend their patents or risk invalidation. And <a href=\"https://www.uspto.gov/sites/default/files/documents/ex_parte_historical_stats_roll_up.pdf\">more often than not</a>, the patent owner in an <i>ex parte</i> reexamination will end up making significant concessions along the way -- amendments that narrow the scope of a patent. To date, 67% of <i>ex parte</i> reexaminations have resulted in at least an amendment to the patent, and another 12% have been successful in having an entire patent invalidated. These concessions, even seemingly minor ones, can successfully thwart a dubious claim of patent infringement and severely limit the owner’s ability to pursue future claims of infringement.</p><h4>USPTO review of patent validity (IPR and ex parte) faces an uncertain future</h4><p>In a surprise decision last week, the U.S. Supreme Court announced that it has decided to hear the case of <a href=\"http://www.scotusblog.com/case-files/cases/oil-states-energy-services-llc-v-greenes-energy-group-llc/\">Oil States vs. Greene’s Energy Group, et al</a>. The key questions that the Court will decide is whether or not the IPR process is constitutional. The stakes are significant: if the Supreme Court finds IPR unconstitutional, then the entire system of administrative review by the USPTO — including IPR and <i>ex parte</i> — will be abandoned.</p><p>Oil States had a patent related to — you guessed it — oil drilling technology invalidated in an IPR proceeding and subsequently lost an appeal in a lower federal court. It has asked the Supreme Court to hear the case because it feels that once the USPTO issues a patent, an inventor has a constitutionally protected property right that — under <a href=\"http://www.heritage.org/constitution/#!/articles/3\">Article III</a> of the U.S. Constitution (which outlines the powers of the judicial branch of the government), and the <a href=\"https://constitutioncenter.org/interactive-constitution/amendments/amendment-vii\">7th Amendment</a> (which addresses the right to a jury trial in certain types of cases) — cannot be revoked without judicial intervention.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/28lDtNFHXttHJlNx6ZkKH6/acd7bd4bad305f2029146120fbc4b467/West_Texas_Pumpjack.jpg\" alt=\"\" class=\"kg-image\" width=\"2576\" height=\"1932\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://commons.wikimedia.org/wiki/File:West_Texas_Pumpjack.JPG\">Image</a> by <a href=\"https://commons.wikimedia.org/wiki/File:West_Texas_Pumpjack.JPG\">Eric Kounce</a></p><p>It’s important to understand what it means for the Supreme Court to agree to hear a case — or as lawyers would insist: grant a <a href=\"https://www.law.cornell.edu/wex/writ_of_certiorari\">writ of certiorari</a>. The Supreme Court only hears the case it wants to in order to resolve issues of sufficient importance or disagreement. Over the past several years, the Court has only agreed to hear <a href=\"https://www.supremecourt.gov/about/justicecaseload.aspx\">about 1% of the cases submitted to it</a>. Four Justices have to vote in favor before a writ of certiorari is granted. Grants are almost always made where there is disagreement among the federal appellate courts or on issues taken from the front page.</p><p><i>Oil States</i> is not the first case to make its arguments against the IPR system, but it is the first that the Supreme Court has agreed to hear. Notably, lower courts have repeatedly rejected the stance taken by the petitioner in <i>Oil States</i>. This is more problematic than it seems because if the Supreme Court was comfortable with the status quo, there would be no reason for them to hear the case. The decision to hear the case suggests that at least the four justices who voted to grant the writ of certiorari are considering going in another direction (though perhaps predicting the Supreme Court’s views is better left to <a href=\"http://www.sciencemag.org/news/2017/05/artificial-intelligence-prevails-predicting-supreme-court-decisions\">science</a>).</p><h4>A quick fix of the patent system is better than no fix at all</h4><p>Because Congressional action creating the IPR was a prudent and resoundingly popular action to blunt abuses of the patent system, there are several concerning aspects of a potential invalidation of the IPR system by the Supreme Court. The patent troll system is based on the idea that American companies would rather pay billions of dollars to resolve meritless claims of infringement than suffer the delay and expense of pursuing those claims in federal court.</p><p>In response, members of Congress set up a better--though still not perfect--system for having these disputes resolved. The court system should have taken steps to improve its own processes to make them less susceptible to being used to distort the ability to have legitimate disputes resolved. Instead, a decision by the Court to invalidate the IPR process would be the equivalent of the Court failing to clean up its own mess and then prohibiting anyone else from doing so.</p><p>And it seems a bit incongruous that rights granted through a system created by statute which gave decision making authority to a patent examiner at the USPTO—the patent system—cannot be modified or altered through a system created by a subsequent statute and using the benefit of actual experience. USPTO reviewers grant patent rights, so why are other USPTO reviewers prohibited from changing that designation?</p><h4>Getting ourselves into the game</h4>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/iE2KH81ycO8KDDvJW0oFi/f53d260a18f04dca8ca62eff8a48d61a/3518931365_1c26d256c9_b.jpg\" alt=\"\" class=\"kg-image\" width=\"1024\" height=\"615\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://creativecommons.org/licenses/by-sa/2.0/\">CC BY-SA 2.0</a> <a href=\"https://www.flickr.com/photos/maenie/3518931365\">image</a> by <a href=\"https://www.flickr.com/photos/maenie/\">meanie</a></p><p>We will be closely monitoring developments in <i>Oil States</i> and expect that we will contribute to an Amicus (or “friend of the court”) brief making sure the justices are aware of our position on this issue. Our hope is that the justices voting to grant the writ of certiorari were only considering the implications on the parties to that case (neither of which is an NPE), and not fully considering the larger community of innovative companies that are helped by the IPR system.</p><p>While we await a decision in <i>Oil States</i>, expect to see Cloudflare initiate IPR and ex parte proceedings against Blackbird Tech patents in the coming months. In the meantime, you can continue to support our efforts by searching for prior art on the Blackbird Tech patents, and you can engage in the political process by supporting efforts to improve the patent litigation process.</p>",
		"id": "1e2PNrsRYQd2mNsBfLdZhx",
		"localeList": {
			"name": "Project Jengo: Explaining Challenges to Patent Validity (and a looming threat) Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-06-23T14:00:00.000+01:00",
		"reading_time": 10,
		"slug": "project-jengo-challenges",
		"tags": [
			{
				"id": "16yk8DVbNNifxov5cWvAov",
				"name": "Legal",
				"slug": "legal"
			},
			{
				"id": "1WqckrYcHhVMB4L8GH5cKj",
				"name": "Patents",
				"slug": "patents"
			},
			{
				"id": "6Mfeneq15Xpvfczf1vVoll",
				"name": "Jengo",
				"slug": "jengo"
			},
			{
				"id": "1AyqklWs7kExQEHm1fe6po",
				"name": "Community",
				"slug": "community"
			}
		],
		"title": "Project Jengo: Explaining Challenges to Patent Validity (and a looming threat)",
		"updated_at": "2024-08-27T02:29:42.456Z",
		"url": "https://blog.cloudflare.com/project-jengo-challenges"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}