{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Jocelyn Woolbright",
				"slug": "jocelyn",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/bDRrsgewAVO6JTmna7b6v/76a5b49472184190ae967a1f962add6a/jocelyn.jpg",
				"location": null,
				"website": null,
				"twitter": "@jo_woolbright",
				"facebook": null
			}
		],
		"excerpt": "Six years ago, Cloudflare started Project Galileo to provide free services to vulnerable nonprofits, journalism and independent media voices online who might otherwise be in danger of being silenced by cyberattacks. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3ZXAPuSzQ3s4qImDq3k6IL/2e3773c87e382df0c0d9b27cc8cf7647/project-galileo-sixth-anniversary.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/15aQ4stoeMr92NIrjMiF5n/2736e3b829cc0ea535e6aa4ed61f58da/Screen-Shot-2020-06-10-at-12.30.41-PM.png\" alt=\"\" class=\"kg-image\" width=\"825\" height=\"484\" loading=\"lazy\"/>\n            \n            </figure><p>Consistent with our mission to “help build a better Internet,” Cloudflare believes that one of the most important roles for the Internet is to empower marginalized voices that may not be heard, or bring together oppressed groups of people that may otherwise find themselves isolated and alone. Six years ago, Cloudflare started Project Galileo to provide free services to vulnerable nonprofits, journalism and independent media voices online who might otherwise be in danger of being silenced by cyberattacks. Much has changed in the past couple of months as the COVID-19 pandemic has transformed the world while the United States faces a wave of protests addressing racial violence and inequality. These events have put further strain on vulnerable groups working in these spaces, and we have seen many organizations step up to ensure that those who are most affected by these circumstances are protected. At Cloudflare, we believe that protecting these groups from attack is essential to helping build a better Internet.</p><p>We are excited to mark the 6th anniversary of the project this month, and it is a good time for us to reflect, talk to participants, and see how the Project has grown and changed over the course of the previous year. This year, the spread of COVID-19 and the global response to the pandemic has shown us new ways that Project Galileo can help. Our goal for the 6th anniversary of Project Galileo is to share updates and stories from the field from organizations that have stepped up in this time of uncertainty.</p><p>Earlier this week, we published a <a href=\"/cyberattacks-since-the-murder-of-george-floyd/\">blog post</a> on the increase in cyberattacks on advocacy organizations fighting racism. We believe that these stories of racial injustice in the United States need to be heard and we are committed to ensuring groups working in fighting racism, promoting inclusiveness and diversity get the protections they need. While we will continue to update on those ongoing events, we want to take the time to share additional stories from heroes in Project Galileo.</p><p>A year ago, we reported that we were protecting nearly 600 organizations and partnering with 28 civil society organizations to identify and provide services to politically and artistically vulnerable entities on the Internet. A single year has brought us more than a 60 percent increase in the total number of participants in the project, with more than 1,000 participants currently receiving Cloudflare’s security protections in every region of the world.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5qitNTyV9vID3sUogBY9VL/b100699c0c76662a206e32a909c2db7d/Galileo-infographic.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"977\" loading=\"lazy\"/>\n            \n            </figure><p>We’ve also added eight new civil society partners, working in areas from promoting the arts to aiding democratic movements to protecting human rights. Since we rely on our partners to identify and approve requests from important organizations working in these areas, expertise that we simply don’t have, one of our goals in the last year was to increase our partnerships with civil society organizations to expand our protections in new geographic regions. We are constantly looking for partners around the world to identify at-risk groups to ensure they have the tools they need to stay online. Our new partners on Project Galileo are:</p><ul><li><p>Center for International Media Assistance &amp; National Endowment of Democracy</p></li><li><p>DefendDefenders</p></li><li><p>Freedom House</p></li><li><p>International Republican Institute</p></li><li><p>Open Briefing</p></li><li><p>PEN America</p></li><li><p>The Carter Center</p></li><li><p>The Internet Society</p></li></ul><p>One of our new partners, The Carter Center, joined the Project as a partner in September 2019. The Carter Center works in 80 countries in areas such as election monitoring, democratic institution-building, and supporting human rights defenders. With their expertise in promoting human rights, we knew they would be an important addition to help identify at-risk organizations in need of our security protections.</p><blockquote><p>“Project Galileo plays a crucial role in helping to safeguard election observers, human rights activists, and independent media from malicious actors that aim to silence their voices.”</p><p>- <b>Michael Baldassaro</b>, Sr. Advisor, Digital Threats to Democracy</p></blockquote><p>On the anniversary, we&#39;d like to share in this section the stories of our participants, to provide some insight of the variety and commitment of organizations trying to do good during a time of significant adversity, and how ongoing access to the power and scope of the Internet plays an essential role in doing that work.</p><p>Before we talk about the general groups of websites that participate in the Project, we think it&#39;s worth taking a moment to highlight a couple of organizations that specifically work on COVID-19 relief efforts.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"covid-19-relief-efforts\">COVID-19 Relief Efforts</h3>\n            <a href=\"#covid-19-relief-efforts\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>In the past couple months, we have seen an increase in applications for Project Galileo related to COVID-19 relief efforts from entities that have spearheaded initiatives such as symptom tracking sites, personal protective equipment donation, DIY mask creation and other related efforts. One of these groups is <a href=\"https://www.coronasafe.in/\">CoronaSafe</a>. CoronaSafe is a guide and collection of tools built as an open-source public utility for the Kerala State government in India on how to stay safe during the pandemic. These projects include access to information available for tracking the spread of COVID-19, telemedicine options, food delivery networks, tracking hospital capacity, ambulance networks and maps of COVID-19 hotspots in the Kerala region. They joined Project Galileo in March 2020 and in two weeks they launched 20 projects in multiple languages.</p><blockquote><p>“We&#39;re seeing thousands of new visitors each week that are looking for information and resources about COVID-19 across our multiple domains. We’ve seen attacks trying to get to us and huge spikes in traffic since March when we launched, and Cloudflare has kept us up and running through it all.”</p><p>- <i><b>Bodhish Thomas</b></i><i>, CoronaSafe</i></p></blockquote><p>In Germany, we have seen initiatives such as <a href=\"https://digitales-wartezimmer.org/\">Digital Waitingroom,</a> a platform that simulates a doctor’s visit, providing information on symptoms associated with COVID-19. The platform implements interfaces to information services, health authorities, medical practices, hospitals, laboratories, databases, and other digital processes in order to handle the tasks with the least possible effort and the highest possible transparency for the patient.</p><p>In the education space, <a href=\"https://meet.ffmuc.net/\">Freifunk Munich</a> joined Project Galileo in March of 2020 as it started creating an online conference system specifically for families during COVID-19.</p><blockquote><p>“When COVID-19 sprung up, we launched a video conferencing service for schools so that they could access online learning. Almost immediately we saw an increase in DDoS attacks that threatened to take down our whole operation.”</p><p>- <b>Annika Wickert</b>, Freifunk Munich</p></blockquote><p>Education and teaching have moved online as many schools and universities race to adopt e-learning alternatives. The <a href=\"https://www.ic3.gov/media/2020/200401.aspx\">FBI’s Internet Crime Complaint Center</a> (IC3) warned that attackers could take advantage of COVID-19 by increasingly targeting virtual environments, including those utilized by school districts.</p><p>In Australia, <a href=\"https://beatcovid19now.org/\">#BeatCovid19Now</a> was accepted into the project in March 2020. #BeatCovid19Now is a symptom tracker led by researchers at the Centre for Global Health and Equity with help from data scientists at the Swinburne University of Technology. The tracker provides daily symptom tracking while collecting information for research purposes to help future decision-makers, health authorities, and researchers to better understand pandemics.</p><blockquote><p>&quot;Our team was able to distribute our Covid-19 symptom tracker internationally and concentrate on predicting and preventing outbreaks without worrying about malicious attacks that might expose sensitive information to hackers. The integration was seamless and until I was receiving the reports I hadn&#39;t appreciated just how important it was to employ such a service.&quot;</p><p>- <b>Matthew Bailes</b>, Professor and the Director of the ARC Centre of Excellence for Gravitational Wave Discovery.</p></blockquote><p>The website handles sensitive information, and with SSL encryption and web application firewall, they are easily able to secure this information against cyberattacks with Cloudflare.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"social-welfare-and-community-building-organizations\">Social Welfare and Community Building Organizations</h3>\n            <a href=\"#social-welfare-and-community-building-organizations\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Approximately 35% of Project Galileo participants work in social welfare and community building, education, environment/disaster relief, and global health. Since the spread of COVID-19, many of our Project Galileo participants in this space have shifted their attention to relief efforts – delivering essential personal protective equipment, emergency food distributions, and assisting front line defenders in the regions hit hardest by the virus.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1xRwxtHoTGhREXJb6liooZ/330c3cd0609632110acc7d9128fc52de/Screen-Shot-2020-06-10-at-12.15.49-PM.png\" alt=\"\" class=\"kg-image\" width=\"638\" height=\"313\" loading=\"lazy\"/>\n            \n            </figure><p>One of these organizations is <a href=\"https://thewaterproject.org/\">The Water Project</a>, which joined Project Galileo in 2017. The organization was founded in 2007 with the mission of providing reliable access to clean water and proper sanitation in communities in sub-Saharan Africa. Since April 2020, The Water Project has expanded its scope in health and hygiene work to include COVID-19 prevention training in more than 700 communities in the region.</p><p>Although it may defy logic based on the nature of their work, the project needs protection against cyberattacks that seek to disrupt their operations.</p><blockquote><p>&quot;Our website is where all of our donors, team members, partners, and communities come together to learn about our work, manage project data, track impact and performance, and offer support. If it doesn&#39;t work, we don&#39;t work and the communities we serve suffer.”</p><p>- <b>Peter Chasse</b>, President and Founder of The Water Project</p></blockquote><p>During the pandemic, we are also supporting many organizations that work in providing emotional support through hotlines and mental health services, such as <a href=\"https://www.themix.org.uk/\">The MIX UK</a>, who has been a member of the project since 2017. In response to the pandemic, The Mix is extending its services to phone, chat, and online helplines while also providing a series of resources available to young people with information on how to cope during the pandemic.</p><p>Similarly, <a href=\"https://www.samaritans.org/\">Samaritans</a>, a charity working in the United Kingdom and Ireland with over 20,000 volunteers and 200 branches, recently joined Project Galileo. Samaritans provide round-the-clock emotional support and campaigns to make suicide prevention a national and local priority. In their application for Project Galileo, they requested an onboarding session for Cloudflare for Team products as all their volunteers are working from home due to the coronavirus outbreak.</p><blockquote><p>“Cloudflare for Teams enables staff to continue to securely access and maintain our highly critical systems, and ensure that we can continue to provide emotional support to people in desperate need.”</p><p>- <b>Francis Bacon</b>, Asst Director, Digital Services and Change of Samaritans</p></blockquote><p>Due to the spread of COVID-19, many people have had to change their daily routine while managing the fear of contracting the virus. In the eight weeks since lockdown in the UK, Samaritans has provided emotional support to more than 400,000 people with 1 in 3 people mentioning COVID-19 related anxiety, as is the common theme among many of the calls. These types of emotional support services are essential to many people’s livelihood and working to ensure that people have the tools they need to alleviate their suffering is crucial.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"environmental-organizations\">Environmental Organizations</h3>\n            <a href=\"#environmental-organizations\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Approximately 5% of Project Galileo participants are nonprofit organizations with an environmental focus.</p><p><a href=\"https://citizensgbr.org/\">Citizens of the Great Barrier Reef</a>, for example, has been protected under Galileo since the organization&#39;s launch in 2017. Citizens of the Great Barrier Reef is an environmental conservation organization with an important mission, to conserve, protect, and restore the Great Barrier Reef through public engagement and service. With only four full-time employees based in Cairns, Australia, the organization utilizes the internet to extend reach and rally thousands of people to join their mission. Cloudflare’s caching features has allowed the organization to reduce bandwidth costs, which is incredibly important for organizations working on restricted budgets, and secure their origin server from large bursts of traffic or malicious actors attempting to access the website.</p><blockquote><p>&quot;Under Project Galileo, we can remain fully operational as a web-fronted organization with a small team and the budget of a local cafe.<i>”</i></p><p>- <b>Som Meaden</b>, Technologist at the Citizens of the Great Barrier Reef</p></blockquote>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/pkPV0j9Jwd6S6RB5Ar75C/643f76340f755a07bff79ea69e9128e7/Powered-by-project-Galileo.png\" alt=\"\" class=\"kg-image\" width=\"870\" height=\"295\" loading=\"lazy\"/>\n            \n            </figure>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"independent-media-and-journalism\">Independent media and journalism</h3>\n            <a href=\"#independent-media-and-journalism\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Nearly a quarter – 23 percent – of the organizations participating in the Project are related to journalism and independent media.  At the beginning of the COVID-19 pandemic, we saw a significant increase in traffic to journalism and media sites under Project Galileo. National and local media sites have been crucial in providing authoritative information during the pandemic and providing efficient updates on virus mitigation efforts and community developments.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1Ezx3XwgEcaV0xQXJgOIst/97c1b5fb1c2b1af437f5dafc41fcf272/Galileo-Media-Traffic-patterns_2x-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1048\" loading=\"lazy\"/>\n            \n            </figure><p>The importance of securing independent media and journalism sites from cyberattacks is crucial for organizations under Project Galileo, especially during a time where accurate information is critical.</p><blockquote><p>“Amid the COVID-19 global health crisis, independent news outlets in many countries have reported an uptick in cyberattacks aimed at pulling them offline. These attacks are most likely coming from increasingly sophisticated authoritarian regimes that are targeting them for their factual reporting, which often exposes the government’s mishandling of the pandemic.”</p><p>- <b>Daniel O’Maley</b>, Digital Policy Specialist at the Center of Intl Media Assistance at the National Endowment for Democracy</p></blockquote><p>CIMA/NED recently joined Project Galileo as a partner and has helped identify and support these groups to ensure the free flow of information.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"civil-society-and-ngo\">Civil Society and NGO</h3>\n            <a href=\"#civil-society-and-ngo\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Civil society and non-governmental organizations make up 16% of organizations under Project Galileo.</p><p>For the <a href=\"https://ipcig.org/\">International Policy Center for Inclusive Growth</a>, a global forum that brings together economists, political scientists, and experts in the field of international relations to help fight global poverty and reduce inequality in the Global South, the security of their web infrastructure is a top priority. Since the beginning, they have had more than 7.6 million downloads of their policy publications in over 179 countries. When they launched their online, member-based knowledge sharing and capacity building <a href=\"https://socialprotection.org/\">platform</a> in 2019, they suffered a DDoS attack. The site was dealing with extended bouts of downtime and unreliability in a particularly sensitive time — an online training on social policies was about to be offered to dozens of participants in sub-Saharan Africa. With a rising profile, IPC-IG contacted Cloudflare to prevent attacks on its website.</p><blockquote><p>“In a matter of hours, IPC-IG’s website was not only protected from attacks but protected at no cost.”</p><p>- <b>Patricia Cavallari</b>, Sr Knowledge Management Assistant at IPC-IG.</p></blockquote><p>Currently, through their online platform, <a href=\"https://socialprotection.org/\">Social Protections</a>, an inter-agency task-force to map social protection responses to the COVID-19 crisis, they are gathering resources and promoting webinars to discuss policy alternatives.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"cloudflares-commitment-to-protect\">Cloudflare’s Commitment to Protect</h3>\n            <a href=\"#cloudflares-commitment-to-protect\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Since 2014, we have promised to protect organizations working in these spaces to ensure they are not censored or taken offline by cyberattacks. Although the world has changed dramatically,  we continue to stand by our promise to protect these organizations and ensure they have the tools they need to stay online. If you are an organization looking for protection under Project Galileo, please visit our website: <a href=\"https://www.cloudflare.com/galileo/\">cloudflare.com/galileo</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3dLH6d9btAEstttyxAL1vv/37687b59a5d8378a6c35649acef5b71b/Galileo-6-years_2x.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"919\" loading=\"lazy\"/>\n            \n            </figure>",
		"id": "4OIQXh1w9KiDCBIKlUlv3t",
		"localeList": {
			"name": "Project Galileo’s 6th year Anniversary: The Impact of COVID-19 on the most vulnerable groups on the Internet Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Six years ago, Cloudflare started Project Galileo to provide free services to vulnerable nonprofits, journalism and independent media voices online.",
		"metadata": {
			"title": "Project Galileo’s 6th year Anniversary: The Impact of COVID-19 on the most vulnerable groups on the Internet",
			"description": "Six years ago, Cloudflare started Project Galileo to provide free services to vulnerable nonprofits, journalism and independent media voices online.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7eB3UDHfcA2Wetd1DgllbA/89ba457815b5ac8c127597d0a2051b88/project-galileo-sixth-anniversary-giLUgj.png"
		},
		"primary_author": {},
		"published_at": "2020-06-11T14:00:00.000+01:00",
		"slug": "project-galileo-sixth-anniversary",
		"tags": [
			{
				"id": "27Nvn0koMcyAUxIANBJCWz",
				"name": "Project Galileo",
				"slug": "project-galileo"
			},
			{
				"id": "16yk8DVbNNifxov5cWvAov",
				"name": "Legal",
				"slug": "legal"
			}
		],
		"title": "Project Galileo’s 6th year Anniversary: The Impact of COVID-19 on the most vulnerable groups on the Internet",
		"updated_at": "2024-10-09T23:11:30.510Z",
		"url": "https://blog.cloudflare.com/project-galileo-sixth-anniversary"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}