{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw"
	],
	"post": {
		"authors": [
			{
				"name": "Peter Foster",
				"slug": "peter-foster",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/WvbnoXMjb0d3R9kQEvYoo/cc0fb24a16b52a82b04538ec4587944a/peter-foster.jpeg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "At Cloudflare, we protect customer APIs from abuse. This is no easy task, as abusive traffic can take different forms, from giant DDoS attacks to low-and-slow credential stuffing campaigns. We now address this challenge in a new way: by looking outside typical volumetric measures and using statistical machine learning to find important API client request sequences.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/cXbrrUBFQ0TU8PyC1TPxa/d0e16866a0d265e1be71d8a6540ee98e/image1.png",
		"featured": false,
		"html": "<p>Consider the case of a malicious actor attempting to inject, scrape, harvest, or exfiltrate data via an API. Such malicious activities are often characterized by the particular order in which the actor initiates requests to API endpoints. Moreover, the malicious activity is often not readily detectable using volumetric techniques alone, because the actor may intentionally execute API requests slowly, in an attempt to thwart volumetric abuse protection. To reliably prevent such malicious activity, we therefore need to consider the sequential order of API requests. We use the term <b>sequential abuse</b> to refer to malicious API request behavior. Our fundamental goal thus involves distinguishing malicious from benign API request sequences.</p><p>In this blog post, you’ll learn about how we address the challenge of helping customers protect their APIs against sequential abuse. To this end, we’ll unmask the statistical machine learning (ML) techniques currently underpinning our <a href=\"https://developers.cloudflare.com/api-shield/security/sequence-analytics/\"><u>Sequence Analytics</u></a> product. We’ll build on the high-level introduction to Sequence Analytics provided in a <a href=\"https://blog.cloudflare.com/api-sequence-analytics\"><u>previous blog post</u></a>.</p><h3>API sessions</h3><p>Introduced in the previous blog post, let’s consider the idea of a time-ordered series of HTTP API requests initiated by a specific user. These occur as the user interacts with a service, such as while browsing a website or using a mobile app. We refer to the user’s time-ordered series of API requests as a <b>session</b>. Choosing a familiar example, the session for a customer interacting with a banking service might look like:</p><table><thead>\n  <tr>\n    <th>Time Order</th>\n    <th>Method</th>\n    <th>Path</th>\n    <th>Description</th>\n  </tr></thead>\n<tbody>\n  <tr>\n    <td>1</td>\n    <td>POST</td>\n    <td>/api/v1/auth</td>\n    <td>Authenticates a user</td>\n  </tr>\n  <tr>\n    <td>2</td>\n    <td>GET</td>\n    <td>/api/v1/accounts/{account_id}</td>\n    <td>Displays account balance, where account_id is an account belonging to the user</td>\n  </tr>\n  <tr>\n    <td>3</td>\n    <td>POST</td>\n    <td>/api/v1/transferFunds</td>\n    <td>Containing a request body detailing an account to transfer funds from, an account to transfer funds to, and an amount of money to transfer</td>\n  </tr>\n</tbody>\n</table>\n<br><p>One of our aims is to enable our customers to <a href=\"https://www.cloudflare.com/learning/security/api/what-is-api-security/\"><u>secure their APIs</u></a> by automatically suggesting rules applicable to our <a href=\"https://developers.cloudflare.com/api-shield/security/sequence-mitigation/\"><u>Sequence Mitigation</u></a> product for enforcing desired sequential behavior. If we enforce the expected behavior, we can prevent unwanted sequential behavior. In our example, desired sequential behavior might entail that /api/v1/auth must always precede /api/v1/accounts/{account_id}.</p><p>One important challenge we had to address is that the <a href=\"https://blog.cloudflare.com/api-sequence-analytics\"><u>number of possible sessions grows rapidly as the session length increases</u></a>. To see why, we can consider the alternative ways in which a user might interact with the example banking service: The user may, for example, execute multiple transfers, and/or check the balance of multiple accounts, in any order. Assuming that there are 3 possible <b>endpoints</b>, the following graph illustrates possible sessions when the user interacts with the banking service:</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5YqgBdzxmu1z2Rm5xiSR6h/045c88f4ff0e7fa8f3c4f7ea5028636f/image2.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"900\" loading=\"lazy\"/>\n          </figure><p>Because of this large number of possible sessions, suggesting mitigation rules requires that we address the challenge of summarizing sequential behavior from past session data as an intermediate step. We’ll refer to a series of consecutive endpoints in a session (for example /api/v1/accounts/{account_id} → /api/v1/transferFunds) in our example as a <b>sequence</b>. Specifically, a challenge we needed to address is that the sequential behavior relevant for creating rules isn’t necessarily apparent from volume alone: Consider for example that /api/transferFunds might nearly always be preceded by /api/v1/accounts/{account_id}, but also that the sequence /api/v1/accounts/{account_id} → /api/v1/transferFunds might occur relatively rarely, compared to the sequence /api/v1/auth → /api/v1/accounts/{account_id}. It is therefore conceivable that if we were to summarize based on volume alone, we might potentially deem the sequence /api/v1/accounts/{account_id} → /api/v1/transferFunds as unimportant, when in fact we ought to surface it as a potential rule. </p><h3>Learning important sequences from API sessions</h3><p>A widely-applied modeling approach applicable to sequential data is the <a href=\"https://en.wikipedia.org/wiki/Markov_chain\"><b><u>Markov chain</u></b></a>, in which the probability of each endpoint in our session data depends only on a fixed number of preceding endpoints. First, we’ll show how standard Markov chains can be applied to our session data, while pointing out some of their limitations. Second, we’ll show how we use a less well-known, but powerful, type of Markov chain to determine important sequences.</p><p>For illustrative purposes, let’s assume that there are 3 possible endpoints in our session data. We’ll represent these endpoints using the letters <i>a</i>, <i>b</i> and <i>c</i>:</p><ul><li><p><i>a</i>: /api/v1/auth</p></li><li><p><i>b</i>: /api/v1/accounts/{account_id}</p></li><li><p><i>c</i>: /api/v1/transferFunds</p></li></ul><p>In its simplest form, a Markov chain is nothing more than a table which tells us the probability of the next letter, given knowledge of the immediately preceding letter. If we were to model past session data using the simplest kind of Markov chain, we might end up with a table like this one:</p><table>\n  <tr>\n    <td rowspan=\"2\" style=\"width: 30%;\">Known preceding endpoint in the session</td>\n    <td colspan=\"3\">Estimated probability of next endpoint in the session</td>\n  </tr>\n  <tr>\n    <td>a</td>\n    <td>b</td>\n    <td>c</td>\n  </tr>\n<tbody>\n  <tr>\n    <td>a</td>\n    <td>0.10 (1555)</td>\n    <td>0.89 (13718)</td>\n    <td>0.01 (169)</td>\n  </tr>\n  <tr>\n    <td>b</td>\n    <td>0.03 (9618)</td>\n    <td>0.63 (205084)</td>\n    <td>0.35 (113382)</td>\n  </tr>\n  <tr>\n    <td>c</td>\n    <td>0.02 (3340)</td>\n    <td>0.67 (109896)</td>\n    <td>0.31 (51553)</td>\n  </tr>\n</tbody>\n</table>\n<center><small>Table 1</small></center>\n<br><p>Table 1 lists the parameters of the Markov chain, namely the estimated probabilities of observing <i>a</i>, <i>b</i> or <i>c</i> as the next endpoint in a session, given knowledge of the immediately preceding endpoint in the session. For example, the 3rd row cell with value 0.67 means that given knowledge of immediately preceding endpoint <i>c</i>, the estimated probability of observing <i>b</i> as the next endpoint in a session is 67%, regardless of whether <i>c </i>was preceded by any endpoints. Thus, each entry in the table corresponds to a sequence of two endpoints. The values in brackets are the number of times we saw each two-endpoint sequence in past session data and are used to compute the probabilities in the table. For example, the value 0.01 is the result of evaluating the fraction 169 / (1555+13718+169). This method of estimating probabilities is known as <a href=\"https://en.wikipedia.org/wiki/Maximum_likelihood_estimation\"><u>maximum likelihood estimation</u></a>.</p><p>To determine important sequences, we rely on <a href=\"https://en.wikipedia.org/wiki/Credible_interval\"><b><u>credible intervals</u></b></a> for estimating probabilities instead of maximum likelihood estimation. Instead of producing a single point estimate (as described above), credible intervals represent a plausible range of probabilities. This range reflects the amount of data available, i.e. the total number of sequence occurrences in each row. More data produces narrower credible intervals (reflecting a greater degree of certainty) and conversely less data produces wider credible intervals (reflecting a lesser degree of certainty). Based on the values in brackets in the table above, we thus might obtain the following credible intervals (entries in boldface will be explained further on):</p><table><thead>\n  <tr>\n    <td rowspan=\"2\" style=\"width: 30%;\">Known preceding endpoint in the session</td>\n    <td colspan=\"3\">Estimated probability of next endpoint in the session</td>\n  </tr>\n  <tr>\n    <td>a</td>\n    <td>b</td>\n    <td>c</td>\n  </tr></thead>\n<tbody>\n  <tr>\n    <td>a</td>\n    <td><b>0.09-0.11 (1555)</b></td>\n    <td><b>0.88-0.89 (13718)</b></td>\n    <td><b>0.01-0.01 (169)</b></td>\n  </tr>\n  <tr>\n    <td>b</td>\n    <td>0.03-0.03 (9618)</td>\n    <td>0.62-0.63 (205084)</td>\n    <td>0.34-0.35 (113382)</td>\n  </tr>\n  <tr>\n    <td>c</td>\n    <td>0.02-0.02 (3340)</td>\n    <td>0.66-0.67 (109896)</td>\n    <td>0.31-0.32 (51553)</td>\n  </tr>\n</tbody>\n</table>\n<center><small>Table 2</small></center>\n<br><p>For brevity, we won’t demonstrate here how to work out the credible intervals by hand (they involve evaluating the <a href=\"https://en.wikipedia.org/wiki/Quantile_function\"><u>quantile function</u></a> of a <a href=\"https://en.wikipedia.org/wiki/Beta_distribution\"><u>beta distribution</u></a>). Notwithstanding, the revised table indicates how more data causes credible intervals to shrink: note the first row with a total of 15442 occurrences in comparison to the second row with a total of 328084 occurrences.</p><p>To determine important sequences, we use slightly more complex Markov chains than those described above. As an intermediate step, let’s first consider the case where each table entry corresponds to a sequence of 3 endpoints (instead of 2 as above), exemplified by the following table:</p><table><thead>\n  <tr>\n    <td rowspan=\"2\" style=\"width: 30%;\">Known preceding endpoints in the session</td>\n    <td colspan=\"3\">Estimated probability of next endpoint in the session</td>\n  </tr>\n  <tr>\n    <td>a</td>\n    <td>b</td>\n    <td>c</td>\n  </tr></thead>\n<tbody>\n  <tr>\n    <td>aa</td>\n    <td><b>0.09-0.13 (173)</b></td>\n    <td><b>0.86-0.90 (1367)</b></td>\n    <td><b>0.00-0.02 (13)</b></td>\n  </tr>\n  <tr>\n    <td>ba</td>\n    <td><b>0.09-0.11 (940)</b></td>\n    <td><b>0.88-0.90 (8552)</b></td>\n    <td><b>0.01-0.01 (109)</b></td>\n  </tr>\n  <tr>\n    <td>ca</td>\n    <td><b>0.09-0.12 (357)</b></td>\n    <td><b>0.87-0.90 (2945)</b></td>\n    <td><b>0.01-0.02 (35)</b></td>\n  </tr>\n  <tr>\n    <td>ab</td>\n    <td>0.02-0.02 (272)</td>\n    <td>0.56-0.58 (7823)</td>\n    <td>0.40-0.42 (5604)</td>\n  </tr>\n  <tr>\n    <td>bb</td>\n    <td>0.03-0.03 (6067)</td>\n    <td>0.60-0.60 (122796)</td>\n    <td>0.37-0.37 (75801)</td>\n  </tr>\n  <tr>\n    <td>cb</td>\n    <td>0.03-0.03 (3279)</td>\n    <td>0.68-0.68 (74449)</td>\n    <td>0.29-0.29 (31960)</td>\n  </tr>\n  <tr>\n    <td>ac</td>\n    <td>0.01-0.09 (6)</td>\n    <td>0.77-0.91 (144)</td>\n    <td>0.06-0.19 (19)</td>\n  </tr>\n  <tr>\n    <td>bc</td>\n    <td>0.02-0.02 (2326)</td>\n    <td>0.77-0.77 (87215)</td>\n    <td>0.21-0.21 (23612)</td>\n  </tr>\n  <tr>\n    <td>cc</td>\n    <td>0.02-0.02 (1008)</td>\n    <td>0.43-0.44 (22527)</td>\n    <td>0.54-0.55 (27919)</td>\n  </tr>\n</tbody></table>\n<center><small>Table 3</small></center>\n<br><p>Table 3 again lists the estimated probabilities of observing <i>a</i>, <i>b</i> or <i>c</i> as the next endpoint in a session, but given knowledge of 2 immediately preceding endpoints in the session (instead of 1 immediately preceding endpoint as before). That is, the 3rd row cell with interval 0.09-0.13 means that given knowledge of immediately preceding endpoints <i>ca</i>, the probability of observing <i>a</i> as the next endpoint has a credible interval spanning 9% and 13%, regardless of whether <i>ca </i>was preceded by any endpoints. In parlance, we say that the above table represents a Markov chain of <b>order</b> 2. This is because the entries in the table represent probabilities of observing the next endpoint, given knowledge of 2 immediately preceding endpoints as <b>context</b>.</p><p>As a special case, the Markov chain of order 0 simply represents the distribution over endpoints in a session. We can tabulate the probabilities as follows, in relation to a single row corresponding to an ‘empty context’:</p><table><thead>\n  <tr>\n    <td rowspan=\"2\" style=\"width: 30%;\">Known preceding endpoints in the session</td>\n    <td colspan=\"3\">Estimated probability of next endpoint in the session</td>\n  </tr>\n  <tr>\n    <td>a</td>\n    <td>b</td>\n    <td>c</td>\n  </tr></thead>\n<tbody>\n  <tr>\n    <td></td>\n    <td>0.03-0.03 (15466)</td>\n    <td>0.64-0.65 (328732)</td>\n    <td>0.32-0.33 (165117)</td>\n  </tr>\n</tbody>\n</table>\n<center><small>Table 4</small></center>\n<br><p>Note that the probabilities in Table 4 do not solely represent the case where there were no preceding endpoints in the session. Rather, the probabilities are for the occurrence of endpoints in the session, for the general case where we have no knowledge of the preceding endpoints and regardless of how many endpoints previously occurred.    </p><p>Returning to our task of identifying important sequences, one possible approach might be to simply use a Markov chain of some fixed order <i>N</i>. For example, if we were to apply a threshold of 0.85 to the lower bounds of credible intervals in Table 3, we’d retain 3 sequences in total. On the other hand, this approach comes with two noteworthy limitations:</p><ol><li><p>We need a way to select a suitable value for the model order <i>N</i>. </p></li><li><p>Since the model order remains fixed, identified sequences all have the same length <i>N</i>+1.</p></li></ol><h3>Variable order Markov chains</h3><p><b>Variable order Markov chains</b> (VOMCs) are a more powerful extension of the described fixed-order Markov chains which address the preceding limitations. VOMCs make use of the fact that for some chosen value of the Markov chain of fixed order <i>N</i>, the probability table might include statistically redundant information: Let’s compare Tables 3 and 2 above and consider in Table 3 the rows in boldface corresponding to contexts <i>aa</i>, <i>ba</i>, <i>ca</i> (these 3 contexts all share <code><i>a</i></code> as their suffix). </p><p>For all the 3 possible next endpoints <i>a, b, c</i>, these rows specify credible intervals which overlap with their respective estimates in Table 2 corresponding to context <i>a</i> (also indicated in boldface). We can interpret these overlapping intervals as representing no discernible difference between probability estimates, given knowledge of <i>a</i> as the preceding endpoint. With no discernible effect of what preceded <i>a </i>on the probability of the next endpoint, we can consider these 3 rows in Table 3 redundant: We may ‘collapse’ them by replacing them with the row in Table 2 corresponding to context <i>a</i>. </p><p>The result of revising Table 3 as described looks as follows (with the new row indicated in boldface):</p><table><thead>\n  <tr>\n    <td rowspan=\"2\" style=\"width: 30%;\">Known preceding endpoints in the session</td>\n    <td colspan=\"3\">Estimated probability of next endpoint in the session</td>\n  </tr>\n  <tr>\n    <td>a</td>\n    <td>b</td>\n    <td>c</td>\n  </tr></thead>\n<tbody>\n  <tr>\n    <td> a</td>\n    <td><b>0.09-0.11 (1555)</b></td>\n    <td><b>0.88-0.89 (13718)</b></td>\n    <td><b>0.01-0.01 (169)</b></td>\n  </tr>\n  <tr>\n    <td>ab</td>\n    <td>0.02-0.02 (272)</td>\n    <td>0.56-0.58 (7823)</td>\n    <td>0.40-0.42 (5604)</td>\n  </tr>\n  <tr>\n    <td>ac</td>\n    <td>0.03-0.03 (6067)</td>\n    <td>0.60-0.60 (122796)</td>\n    <td>0.37-0.37 (75801)</td>\n  </tr>\n  <tr>\n    <td>bb</td>\n    <td>0.03-0.03 (3279)</td>\n    <td>0.68-0.68 (74449)</td>\n    <td>0.29-0.29 (31960)</td>\n  </tr>\n  <tr>\n    <td>bc</td>\n    <td>0.01-0.09 (6)</td>\n    <td>0.77-0.91 (144)</td>\n    <td>0.06-0.19 (19)</td>\n  </tr>\n  <tr>\n    <td>cb</td>\n    <td>0.02-0.02 (2326)</td>\n    <td>0.77-0.77 (87215)</td>\n    <td>0.21-0.21 (23612)</td>\n  </tr>\n  <tr>\n    <td>cc</td>\n    <td>0.02-0.02 (1008)</td>\n    <td>0.43-0.44 (22527)</td>\n    <td>0.54-0.55 (27919)</td>\n  </tr>\n</tbody></table>\n<center><small>Table 5</small></center>\n<br><p>Table 5 represents a VOMC, because the context length varies: In the example, we have context lengths 1 and 2. It follows that entries in the table represent sequences of length varying between 2 and 3 endpoints, depending on context length. Generalizing the described approach of collapsing contexts leads to the following algorithm sketch for learning a VOMC in an offline setting:</p><p><code>(1) Define the table </code><code><i>T</i></code><code> containing the estimated probability of the next endpoint in a session, given alternatively </code><code><i>0, 1, 2, …, N_max</i></code><code> preceding endpoints in the session. That is, form a single table by concatenating the rows corresponding to Markov chains of fixed orders </code><code><i>0, 1, 2, …, N_max</i></code><code>.</code></p><p><code>(2) is_modified := true </code></p><p><code>(3) DO WHILE is_modified</code></p><p><code>   (4) </code><code><i>D</i></code><code> := all contexts in </code><code><i>T </i></code><code>which are not suffixes of at least 1 other      context in </code><code><i>T</i></code></p><p><code>   (5) is_modified = false</code></p><p><code>   (6) FOR </code><code><i>ctx</i></code><code> IN </code><code><i>C</i></code></p><p><code>        (7) IF length(</code><code><i>ctx</i></code><code>) &gt; 0</code></p><p><code>           (8) </code><code><i>parent_ctx</i></code><code> := the context obtained by deleting the leftmost endpoint in </code><code><i>ctx</i></code></p><p><code>           (9) IF is_collapsible(</code><code><i>ctx</i></code><code>, </code><code><i>parent_ctx</i></code><code>)</code></p><p><code>              (10) Modify </code><code><i>T</i></code><code> by discarding </code><code><i>ctx</i></code></p><p><code>              (11) is_modified = true</code></p><p>In the pseudo-code, length(<i>ctx</i>) is the length of context <i>ctx</i>. On line 9, is_collapsible() involves comparing credible intervals for the contexts <i>ctx</i> and <i>parent_ctx</i> in the manner described for generating Table 5: is_collapsible() evaluates to true, if and only if we observe that all credible intervals overlap, when comparing contexts <i>ctx</i> and <i>parent_ctx</i> separately for each of the possible next endpoints. The maximum sequence length is <i>N_max</i>+1<i>, </i>where <i>N_max </i>is some constant. On line 4, we say that context <i>q </i>is a <b>suffix</b> of another context <i>p</i> if we can form <i>p</i> by prepending zero or more endpoints to <i>q</i>. (According to this definition, the ‘empty context’ mentioned above for the order 0 model is a suffix of all contexts in <i>T</i>.) The above algorithm sketch is a variant of the ideas first introduced by Rissanen [<a href=\"https://ieeexplore.ieee.org/abstract/document/1056741/\"><u>1</u></a>], Ron et al. [<a href=\"https://link.springer.com/article/10.1023/A:1026490906255\"><u>2</u></a>].</p><p>Finally, we take the entries in the resulting table <i>T</i> as our important sequences. Thus, the result of applying VOMCs is a set of sequences that we deem important. For Sequence Analytics however, we believe that it is additionally useful to rank sequences. We do this by computing a ‘precedence score’ between 0.0 and 1.0, which is the number of occurrences of the sequence divided by the number of occurrences of the last endpoint in the sequence. Thus, precedence scores close to 1.0 indicate that a given endpoint is nearly always preceded by the remaining endpoints in the sequence. In this way, manual inspection of the highest-scoring sequences is a semi-automated heuristic for creating precedence rules in our Sequence Mitigation product.</p><h3>Learning sequences at scale</h3><p>The preceding represents a very high-level overview of the statistical ML techniques that we use in Sequence Analytics. In practice, we have devised an efficient algorithm which does not require an upfront training step, but rather updates the model continuously as the data arrive and generates a frequently-updating summary of important sequences. This approach allows us to overcome additional challenges around memory cost not touched on in this blog post. Most significantly, a straightforward implementation of the algorithm sketch above would still result in the number of table rows (contexts) exploding with increasing maximum sequence length. A further challenge we had to address is how to ensure that our system is able to deal with high-volume APIs, without adversely impacting CPU load. We use a horizontally scalable adaptive sampling strategy upfront, such that more aggressive sampling is applied to high-volume APIs. Our algorithm then consumes the sampled streams of API requests. After a customer onboards, sequences are assembled and learned over time, so that the current summary of important sequences represents a sliding window with a look-back interval of approximately 24 hours. Sequence Analytics further stores sequences in <a href=\"https://blog.cloudflare.com/tag/clickhouse/\"><u>Clickhouse</u></a> and exposes them via a <a href=\"https://developers.cloudflare.com/analytics/graphql-api/\"><u>GraphQL API</u></a> and via the <a href=\"https://dash.cloudflare.com/\"><u>Cloudflare dashboard</u></a>. Customers who would like to enforce sequence rules can do so using <a href=\"https://developers.cloudflare.com/api-shield/security/sequence-mitigation/\"><u>Sequence Mitigation</u></a>. Sequence Mitigation is what is responsible for ensuring that rules are shared and matched in distributed fashion on Cloudflare’s global network — another exciting topic for a future blog post!</p><h3>What’s next</h3><p>Now that you have a better understanding of how we surface important API request sequences, stay tuned for a future blog post in this series, where we’ll describe how we find the anomalous API request sequences that customers may want to stop. For now, API Gateway customers can get started in two ways: with <a href=\"https://developers.cloudflare.com/api-shield/security/sequence-analytics/\"><u>Sequence Analytics</u></a> to explore important API request sequences and with <a href=\"https://developers.cloudflare.com/api-shield/security/sequence-mitigation/\"><u>Sequence Mitigation</u></a> to enforce sequences of API requests. Enterprise customers that haven’t purchased API Gateway can get started by <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/security/api-shield\"><u>enabling the API Gateway trial</u></a> inside the Cloudflare Dashboard or contacting their account manager.</p>",
		"id": "27ZTkLyAI8VPmwUK2U3jU7",
		"localeList": {
			"name": "Protecting APIs from abuse using sequence learning and variable order Markov chains Loc",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "At Cloudflare, we protect customer APIs from abuse. This is no easy task, as abusive traffic can take different forms, from giant DDoS attacks to low-and-slow credential stuffing campaigns. We now address this challenge in a new way: by looking outside typical volumetric measures and using statistical machine learning to find important API client request sequences.",
		"metadata": {
			"title": "Protecting APIs from abuse using sequence learning and variable order Markov chains",
			"description": "At Cloudflare, we protect customer APIs from abuse. This is no easy task, as abusive traffic can take different forms, from giant DDoS attacks to low-and-slow credential stuffing campaigns. We now address this challenge in a new way: by looking outside typical volumetric measures and using statistical machine learning to find important API client request sequences.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7eOoAs5kXcv6q1reyAKTgW/45027ee2cf1952ca32263b4b3e94fd86/Protecting_APIs_from_abuse_using_sequence_learning_and_variable_order_Markov_chains-OG.png"
		},
		"primary_author": {},
		"published_at": "2024-09-12T15:15+01:00",
		"slug": "protecting-apis-from-abuse-using-sequence-learning-and-variable-order-markov",
		"tags": [
			{
				"id": "6Foe3R8of95cWVnQwe5Toi",
				"name": "AI",
				"slug": "ai"
			},
			{
				"id": "6GvYnn2MD0ye88h10BplGd",
				"name": "API Shield",
				"slug": "api-shield"
			},
			{
				"id": "7aSCe0ZArYqX0ThFK2gRm0",
				"name": "API Gateway",
				"slug": "api-gateway"
			},
			{
				"id": "4lmuF3Pb7F4hTBUe3svrD0",
				"name": "API Security",
				"slug": "api-security"
			}
		],
		"title": "Protecting APIs from abuse using sequence learning and variable order Markov chains",
		"updated_at": "2024-09-30T06:39:42.000Z",
		"url": "https://blog.cloudflare.com/protecting-apis-from-abuse-using-sequence-learning-and-variable-order-markov"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}