{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"fr-fr",
		"de-de",
		"ja-jp",
		"ko-kr",
		"es-es",
		"id-id"
	],
	"post": {
		"authors": [
			{
				"name": "Jocelyn Woolbright",
				"slug": "jocelyn",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/bDRrsgewAVO6JTmna7b6v/e506c6b4d16b209a4ea401bb898ec66b/jocelyn.jpg",
				"location": null,
				"website": null,
				"twitter": "@jo_woolbright",
				"facebook": null
			}
		],
		"excerpt": "In 2024, more than 80 national elections are slated to occur, directly impacting approximately 4.2 billion individuals. At Cloudflare, we’re ready to support a range of players in the election space by providing security, performance, and reliability tools to help facilitate the democratic process",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6rMRXxC3nQ6voyWqW7SF7/77f39e6bf28841bff535b91e2edaf8db/protecting-global-democracy-against-threats-from-emerging-technology.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7qqWEJxH0Ut9YAAoR5qdKh/457aed23ffa86a154ab2640746aca6bd/image2-18.png\" alt=\"Cloudflare protects global democracy against threats from emerging technology during the 2024 voting season\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>In 2024, more than 80 national elections are slated to occur, directly impacting approximately 4.2 billion individuals in places such as Indonesia, the United States, India, the European Union, and more. This marks the most extensive election cycle worldwide until the year 2048. Elections are a cornerstone of democracy, providing citizens with the means to shape their government, hold leaders accountable, and participate in the political process.</p><p>At Cloudflare, we’ve been supporting state and local governments that run elections for free for the last seven years. As we look at the upcoming elections around the world, we are reminded how important our services are in keeping information related to elections reliable and secure from those looking to disrupt these processes. Unfortunately, the problems that election officials face in keeping elections secure has only gotten more complicated and requires facilitating information sharing, capacity building, and joint efforts to safeguard democratic processes.</p><p>At Cloudflare, we support a range of players in the election space by providing security, performance, and reliability tools to help facilitate the democratic process. With <a href=\"https://www.cloudflare.com/impact/\">Cloudflare Impact projects,</a> we have found a way to protect a range of stakeholders who play an important role in the election process and better prepare them for the unexpected. As we have grown our various Impact projects to protect more than 2,900 domains, we have learned how best to protect vulnerable groups online.</p><p>During Security Week, we want to provide a look at how we are preparing groups that work in elections around the world for 2024, as well as exploring emerging threat trends.</p><h3>A look at the year ahead</h3><p><a href=\"https://www.cloudflare.com/cloudflare-for-government/\">State and local governments</a> play a critical role in various aspects of the election process. From voter registration to candidate filing, polling place setup, distribution of ballots, tabulations of voters, and reporting of election results, they ensure that elections are conducted fairly, securely, and efficiently.</p><p>If we have learned anything from the last seven years, it is that election officials have even more on their plate when it comes to conducting free and fair elections. Countries conducting elections this year are likely to face a complicated array of threats, from voter manipulation to physical violence. Unfortunately, in many countries, people have been blamed for election results that displeased certain politicians and constituents, and numerous election officials have encountered death threats, online harassment, and mistreatment. In April 2023, the <a href=\"https://www.brennancenter.org/our-work/analysis-opinion/poll-election-officials-shows-high-turnover-amid-safety-threats-and\">Brennan Center found that 45%</a> of local election officials said they fear for the safety of their colleagues.</p><p>When it comes to safeguarding online infrastructure, securing voter registration systems, ensuring the integrity of election-related information, and planning effective incident response are necessary as online threats grow more and more sophisticated. For example, in the three months leading up to the 2022 US midterm elections, <a href=\"/securing-the-inboxes-of-democracy/\">Cloudflare prevented around 150,000 phishing emails</a> targeting campaign officials.</p><h3>How we use our services to promote free and fair elections</h3><p>The core principle driving our work in the election space is the idea that access to accurate voting information, as provided by state and local governments, is fundamental to the proper functioning of democracy. We see ourselves as one piece of a larger puzzle when it comes to safeguarding elections.</p><p>Protecting election entities is an enormous task, and there is strength in partnerships that provide with a broad range of roles and expertise. We have seen groups such as the Cybersecurity and Infrastructure Security Agency <a href=\"https://apnews.com/article/election-security-2024-voting-cybersecurity-8bda7ab6b3f921d363ab3257fd4b378b\">increase their role in boosting election security</a> efforts throughout the last few years. There have been partnerships between governments, organizations, and private companies assisting election officials with the tools and expertise on the best ways to secure the democratic process.</p><p>In 2020, <a href=\"/cloudflares-athenian-project-expands-internationally\">we partnered</a> with the International Foundation for Electoral Systems to find a way to expand our protections to election management bodies outside the United States. In our partnership, we have been able to provide our Enterprise-level services to six election management bodies, including the Central Election Commission of Kosovo, State Election Commission of North Macedonia, and many local election bodies in Canada.</p><blockquote><p><i>“Cloudflare is a technology enabler for the State Election Committee (SEC) in North Macedonia, and its tools help us ensure that early election results will be accessible to the general population, thus promoting visibility and transparency.”</i><i><b>- Vladislav Bidikov,</b></i> <i>Cybersecurity Task Force Member, State Election Commission of North Macedonia</i>        </p></blockquote><h3>Internet trends during elections</h3><p>Looking at Internet trends during elections, we have seen in several countries that Internet traffic typically drops during the day, when people are going to the polling booths. That was the case in <a href=\"/french-elections-2022-runoff\">France</a> and <a href=\"/how-the-brazilian-presidential-elections-affected-internet-traffic\">Brazil</a> in 2022, for example. After the polling booths close, traffic usually increases, when citizens are looking for results — a spotlight also shared with the traditional TV channels.</p><p>Indonesia, a country with more than 200 million voters (and a population of 275 million) and over 17,000 islands, held <a href=\"https://www.aljazeera.com/news/2024/2/14/prabowo-subianto-claims-victory-in-indonesian-presidential-election\">general elections on Wednesday, February 14</a>. On that day, daily traffic dropped 5% compared with the previous week. Hourly traffic during the day dropped as much as 15% between 08:00 and 13:00 local time (Western Indonesia time, where most of the population lives), when polling stations were open. Traffic was lower than in the previous week during that day, and only picked up on the following day.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4aL3vXiXZApsOeusGXfmH1/5f4be488f0f0029c1a346d485862f66d/Untitled.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"525\" loading=\"lazy\"/>\n            \n            </figure><p>On the other hand, mobile device usage was at its highest point of 2024 to date on February 14, representing 77% of all requests from the country.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5kXh1WxSFeusuxTvQbRwls/c14cbe99b261598f96fa69dc2acc9c8a/Untitled--1-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"516\" loading=\"lazy\"/>\n            \n            </figure><h3>Pakistan election day Internet outage</h3><p>In Pakistan, general elections were held on February 8. During this time, our data shows an outage that started around 02:00 UTC, recovering after 15:00. The Internet shutdown targeted mobile networks and was criticized by <a href=\"https://www.amnesty.org/en/latest/news/2024/02/pakistan-election-day-internet-shutdown-is-a-reckless-attack-on-peoples-rights/\">Amnesty International</a>.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1cFdm3IDJ17kp08RkUfiXZ/21af378f583d235d2df79198f4499229/Untitled--2-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"900\" loading=\"lazy\"/>\n            \n            </figure><p>The Telenor (AS24499), Jazz (AS45669), and Zong (AS59257) mobile networks were impacted. For example, here is a view of the Telenor network:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/uJBZnZfOcuboioFFtbwZP/82ff9ec802fe6bd73f73cd044c00b9ae/Untitled--3-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"900\" loading=\"lazy\"/>\n            \n            </figure><p>In addition, social media platform X experienced a <a href=\"https://pakobserver.net/court-directs-govt-to-restore-x-twitter-across-pakistan/\">national-scale disruption</a> following protests ignited by allegations of vote rigging in the general elections. When it comes to Internet shutdowns, we see complete Internet blackouts represent the most severe type of Internet shutdowns, but limitations on the usage of social media and messaging applications, especially during elections, also pose large obstacles. Many of these platforms have become indispensable for journalists and the media, serving as an important channel to connect with audiences, share and publicize their content, and securely communicate with their sources.</p><h3>How do you prepare for the unexpected?</h3><p>We have detailed our work during many elections in the United States, including how we protected the <a href=\"/2020-us-election-cybersecurity-analysis\">2020 elections</a> during times of uncertainty. As we prepare for the 2024 election, we will continue collaborating with experts on how to best provide our services. Last year, we conducted an <a href=\"/2024-the-year-of-elections\">analysis on threats</a> to election groups. Highlights include:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4bV7Tbjla2as6nmfbExxuh/f92ed0a65f6118c17edbc212bd18e61c/image10-4.png\" alt=\"\" class=\"kg-image\" width=\"1866\" height=\"702\" loading=\"lazy\"/>\n            \n            </figure><p>Early in 2024, we conducted webinars for state and local governments under the Athenian Project to identify configuration recommendations and provide lessons learned during the 2020 and 2022 midterms in the United States. We discussed topics such as preventing website defacement, and security checklist items such as checking domain and SSL certificate expiration dates. We are happy to report that many of these efforts in assisting state and local governments on configurations to make sure they are getting the most of our free Cloudflare products have been successful, with more than 92% of domains under the project using our <a href=\"https://developers.cloudflare.com/dns/manage-dns-records/reference/proxied-dns-records/\">proxy services</a> to protect their website. But we still have a long way to go. We found that <a href=\"https://www.cloudflare.com/learning/access-management/what-is-two-factor-authentication/\">2FA</a> is still a problem, and we strongly encourage participants to enable it to protect accounts and sensitive information.</p><p>Ahead of the elections, we have also heard from larger election entities, such as secretaries of state, <a href=\"https://www.cisecurity.org/elections\">nonprofit organizations</a> supporting election officials, and <a href=\"https://www.cisa.gov/topics/partnerships-and-collaboration/joint-cyber-defense-collaborative\">government agencies</a>, who have reached out for our expertise on how to better support smaller election groups.</p><h3>What keeps state and local election officials up at night?</h3><p>To help prepare for the 2024 general elections in the United States, we wanted to learn more from state and local governments protected under the Athenian Project about what worries them in terms of online security threats. We sent out a brief survey to participants and found:</p><ul><li><p>A majority of participants believe that the use of <a href=\"https://www.cloudflare.com/learning/ai/what-is-generative-ai/\">generative AI tools</a> will have a significant impact on the 2024 election.</p></li><li><p>80% of participants surveyed indicated that their team has experienced an email phishing attack in the last year.</p></li><li><p>Trust and reputation is the highest concern when it comes to a cyber attack with election operations as a close second.</p></li></ul><p>We asked participants what they wished more people understood about their efforts in election security and reliability, and one county&#39;s response stood out. To paraphrase, they said that election officials are also citizens and residents in their communities, and they strive to have safe, fair elections. We look forward to learning more about threats to these groups and how our products can help keep their internal data safe from attacks.</p><h3>Super Tuesday</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5KYvGOgAoSDgn1qEo3MyTz/f08b072cf564e92e375ea4b2b6a180a4/image11-1.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"451\" loading=\"lazy\"/>\n            \n            </figure><p>Because Super Tuesday in the United States involves several states, including California, Alabama, Iowa, North Carolina, and more, that hold their primaries or caucuses on the same day, it is often seen as a critical turning point in the presidential primary process.</p><p>On March 6, 2024, <a href=\"https://therecord.media/cisa-no-credible-threats-to-super-tuesday-voting\">CISA reported</a> there had been no credible digital threats to Super Tuesday, to the relief of many security experts. These comments came after <a href=\"https://www.bbc.com/news/technology-68483732\">Meta reported an outage</a> that which caused Facebook, Messenger, and Instagram to be inaccessible to many users in the United States.</p><p>During Super Tuesday, we had the opportunity to witness firsthand the benefits of having access to free cybersecurity services to a range of elections groups. We are happy to report that during this time, we did not see any major cyberattacks against these groups. As part of this, we want to share updated insights into trends we have identified against election groups we protect to identify the types of attacks that they face with the hope of better securing them online.</p><h3>Athenian Project</h3><p>Under the Athenian Project, we protect more than 400 state and local government websites in 32 states that run elections. We identified 100 websites in the 16 states conducting elections on Super Tuesday and observed a considerable increase in traffic after Monday, March 4th.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3oXOC4mzVN1cOnbrVRh939/809fa7c3afef48398c822379527073fe/Untitled--4-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"461\" loading=\"lazy\"/>\n            \n            </figure><p>When it comes to automated traffic to these websites, the figure below shows that we saw traffic classified as bot traffic maintain a relatively steady pattern between February 26 and March 5th. <a href=\"https://www.cloudflare.com/learning/bots/what-is-bot-traffic/\">Bot traffic</a> describes any non-human traffic to a website or an app, and it is important to note that not all bot traffic is malicious. Legitimate bot traffic includes activities like search engine indexing, while malicious bot traffic is designed to engage in fraudulent activities such as spamming, scraping content for unauthorized use, or launching distributed denial-of-service (DDoS) attacks.</p><p>As March 5th began, an increase in “human” traffic was clearly visible, with a significant increase starting at 05:00 EST and decreasing around 23:00. This is typical of what we see in the election space, as many people are visiting these websites to identify their polling place locations, or view up-to-date election results.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/56g4GQHYaQElOUgLnIRgLt/af333a6d0b09c5acfe83d7f19776b35b/Untitled--5-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"449\" loading=\"lazy\"/>\n            \n            </figure><p>On Super Tuesday, Cloudflare mitigated over 18.9 million requests on March 5th, 2024, against state and local governments under the Athenian project.</p><h3>Cloudflare for Campaigns</h3><p>In 2020, <a href=\"https://www.cloudflare.com/press-releases/2020/cloudflare-launches-cloudflare-for-campaigns-to-protect-u-s-election/\">we partnered with Defending Digital Campaigns</a>, a nonprofit organization dedicated to providing cyber security resources and assistance to political campaigns and committees in the United States. Through our partnership, we have been able to provide more than $3 million in Cloudflare products. For this analysis, we identified 49 websites protected by <a href=\"https://www.cloudflare.com/campaigns/usa/\">Cloudflare for Campaigns</a> that are located in the states that conducted an election during Super Tuesday. In total, we protect 97 campaign websites and 27 political party websites.</p><p>Overall traffic to these websites remained fairly consistent through the latter half of February and into March, but started to grow the weekend ahead of Super Tuesday, as seen in the figure below. Peaks were seen at 23:00 EST on March 4 and 20:00 EST on March 5.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4oMR4BDun92WDC9dBKowD0/55d4b45c8b7ac1edb328c7e200d417c8/Untitled--6-.png\" alt=\"\" class=\"kg-image\" width=\"1291\" height=\"500\" loading=\"lazy\"/>\n            \n            </figure><p>We’ve noticed that these websites under Cloudflare for Campaign zones experience low, constant bot traffic, although it increased slightly during the first days of March. But the figure below shows that the overall increase in traffic discussed above was driven by a significant increase in request traffic identified as coming from actual users (that is, “human”).</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/SEQ4DN9L7EQkER89Ew7PS/ab4fcc885bdc0ce602692db3b6f0a54e/Untitled--7-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"441\" loading=\"lazy\"/>\n            \n            </figure><p>A majority of the traffic was to political parties protected under the project in these Super Tuesday states, with 53% of the traffic identified going to these party websites.</p><h3>Project Galileo</h3><p>Cloudflare protects more than 65 Internet properties in the United States that work on a range of topics related to voting rights and promoting free and fair elections. Super Tuesday resulted in a considerable spike in traffic to these websites around 09:00 EST of 3.22M requests, which far surpassed the previous maximum value of 1.56M on February 20th at 11:00 EST, a 2x increase.</p><p>This spike was determined to be from user-driven traffic (not bot) and caused by a single zone related to a nonpartisan nonprofit organization that provides online voter guides for every state, including voter registration forms. The organization has been protected under Project Galileo since 2017. Their request traffic experienced a 1360% increase in traffic between 07:00 and 09:00 am EST. This is a clear example on the importance of access to cybersecurity tools in advance of a major event, as spikes in traffic can be unpredictable.</p><h3>2024 and beyond</h3><p>As we approach the 2024 election cycle, Cloudflare is ready to provide support to election officials, voting rights groups, political campaigns, and parties involved in elections.</p><p>With a year full of elections and given the global attention on election security, engagement of seasoned professionals with expertise is essential to safeguard the democratic process. Through continued collaboration with stakeholders in the election space, we continuously develop strategies for effectively securing web infrastructure and internal teams. Our commitment persists in safeguarding resources throughout the voting process and fostering trust in democratic institutions around the world.</p><p>We want to ensure that all groups working to promote democracy around the world have the tools they need to stay secure online. If you work in the election space and need our help, please apply at <a href=\"https://www.cloudflare.com/election-security/\">https://www.cloudflare.com/election-security</a>.</p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\">\n  <iframe\n    src=\"https://customer-rhnwzxvb3mg4wz3v.cloudflarestream.com/ee000b663995d280ac4c3b8bed71dd59/iframe?preload=true&poster=https%3A%2F%2Fcustomer-rhnwzxvb3mg4wz3v.cloudflarestream.com%2Fee000b663995d280ac4c3b8bed71dd59%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D%26height%3D600\"\n    loading=\"lazy\"\n    style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\"\n    allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\"\n    allowfullscreen=\"true\"\n  ></iframe>\n</div><!--kg-card-end: html--><p>Tune in for more news, announcements and thought-provoking discussions! Don&#39;t miss the full <a href=\"https://cloudflare.tv/shows/security-week\">Security Week hub page</a>.</p>",
		"id": "4UAavYjxHpmxxg37aDRLRA",
		"localeList": {
			"name": "Cloudflare protects global democracy against threats from emerging technology during the 2024 voting season Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "Translated for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "In 2024, more than 80 national elections are slated to occur, directly impacting approximately 4.2 billion individuals. At Cloudflare, we’re ready to support a range of players in the election space by providing security, performance, and reliability tools to help facilitate the democratic process.",
		"metadata": {
			"title": "Cloudflare protects global democracy against threats from emerging technology during the 2024 voting season",
			"description": "In 2024, more than 80 national elections are slated to occur, directly impacting approximately 4.2 billion individuals. At Cloudflare, we’re ready to support a range of players in the election space by providing security, performance, and reliability tools to help facilitate the democratic process.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1j95wKPRu6kwbrgPj3Ao9W/89601929c3dfd70f6c8899ac52630e34/protecting-global-democracy-against-threats-from-emerging-technology-tMpe07.png"
		},
		"primary_author": {},
		"published_at": "2024-03-07T14:02:00.000+00:00",
		"reading_time": 10,
		"slug": "protecting-global-democracy-against-threats-from-emerging-technology",
		"tags": [
			{
				"id": "3DmitkNK6euuD5BlhuvOLW",
				"name": "Security Week",
				"slug": "security-week"
			},
			{
				"id": "1vuoQKKVEjwfXESBNNFbGI",
				"name": "Election Security",
				"slug": "election-security"
			}
		],
		"title": "Cloudflare protects global democracy against threats from emerging technology during the 2024 voting season",
		"updated_at": "2024-08-27T00:59:36.367Z",
		"url": "https://blog.cloudflare.com/protecting-global-democracy-against-threats-from-emerging-technology"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}