{
	"initialReadingTime": "14",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Sofía Celi",
				"slug": "sofia",
				"bio": "Cryptography researcher and implementer at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2waJR10lPQ4007cOdOJQ5P/070caf2211c94b6a2bc5fb22c947ce5e/sofia.jpg",
				"location": "Lisbon",
				"website": "http://claucece.github.io/",
				"twitter": "@claucece",
				"facebook": null
			}
		],
		"excerpt": "What is quantum computing and what advances have been made so far on this front? In this blog post, we will answer this question and see how to protect against quantum adversaries",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/69PXUUmMRluOL0Q0BTFlg5/bcdfac66d6a47d75b34ca7b12dd40cb3/quantum-solace-and-spectre.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6papD3Do13xUEZoOfmT2d5/d924261b58b72e7170cd59c4052a2c8b/Blog-822---The-Quantum-solace-and-spectre-Blogpost.png\" alt=\"Blogpost about the current trends on quantum and post-quantum algorithms.\" class=\"kg-image\" width=\"1600\" height=\"905\" loading=\"lazy\"/>\n            \n            </figure><blockquote><p><i>Not only is the universe stranger than we think, but it is stranger than we can think of— </i><b><i>Werner Heisenberg</i></b></p></blockquote><p>Even for a physicist as renowned as Heisenberg, the universe was strange. And it was strange because several phenomena could only be explained through the lens of quantum mechanics. This field changed the way we understood the world, challenged our imagination, and, since the <a href=\"https://en.wikipedia.org/wiki/Solvay_Conference\">Fifth Solvay Conference</a> in 1927, has been integrated into every explanation of the physical world (it is, to this day, our best description of the inner workings of nature). Quantum mechanics created a rift: every physical phenomena (even the most micro and macro ones) stopped being explained only by <a href=\"https://en.wikipedia.org/wiki/Classical_physics\">classical physics</a> and started to be explained by quantum mechanics. There is another world in which quantum mechanics has not yet created this rift: the realm of computers (note, though, that manufacturers have been <a href=\"https://semiengineering.com/quantum-effects-at-7-5nm/\">affected by quantum effects</a> for a long time). That is about to change.</p><p><a href=\"https://www.eejournal.com/article/richard-feynman-and-quantum-computing/\">In the 80s</a>, several physicists (including, for example, Richard Feynman and Yuri Manin) asked themselves these questions: are there computers that can, with high accuracy and in a reasonable amount of time, simulate physics? And, specifically, can they simulate quantum mechanics? These two questions started a long field of work that we now call “quantum computing”. Note that you can simulate quantum phenomena with classical computers. But we can simulate in a much faster manner with a quantum computer.</p><p>Any computer is already a quantum system, but a quantum computer uses the true computational power that quantum mechanics offers. It solves some problems much faster than a classical computer. Any computational problem solvable by a classical computer is also solvable by a quantum computer, as any physical phenomena (such as operations performed in classical computers) can be described using quantum mechanics. Contrariwise, any problem solvable by a quantum computer is also solvable by a classical computer: quantum computers provide no additional power over classical computers in terms of what they could theoretically compute. Quantum computers cannot solve <a href=\"https://en.wikipedia.org/wiki/Undecidable_problem\">undecidable problems</a>, and they do not disprove the <a href=\"https://en.wikipedia.org/wiki/Church%E2%80%93Turing_thesis\">Church–Turing thesis</a>. But, they are faster for specific problems! Let’s explore now why this is the case.</p><p>In a classical computer, data is stored in bits: 0 or 1, current <i>on</i> or current <i>off</i>, true or false. Nature is not that binary: any physical bit (current or not; particle or not; magnetized or not) is in fact a <i>qubit</i> and exists on a spectrum (or rather a <a href=\"https://en.wikipedia.org/wiki/Bloch_sphere\">sphere</a>) of superpositions between 0 and 1. We have mentioned two terms that might be new to the reader: <i>qubit</i> and <i>superposition</i>. Let’s first define the second term.</p><p>A <i>superposition</i> is a normalized linear combination of all the possible configurations of <i>something</i>. What is this <i>something</i>? If we take the <a href=\"https://en.wikipedia.org/wiki/Schr%C3%B6dinger_equation\">Schrödinger equation</a> to explain, “for any isolated region of the universe that you want to consider, that equation describes the evolution in time of the state of that region, which we represent as a normalized linear combination — a <i>superposition</i> — of all the possible configurations of elementary particles in that region”, as <a href=\"https://scottaaronson.com/democritus/lec1.html\">Aaronson put it</a>. <i>Something</i>, then, refers to all elementary particles. Does it mean, then, that we all are in a superposition? The answer to that question is open to many interpretations (for a nice introduction on the topic, one can read “Quantum Computing Since Democritus” by Scott Aaronson).</p><p>As you see, we are concerned then no longer on matter or energy or waves (as in classical physics), but rather on information and probabilities. In a quantum system, we first initialize information (like a <i>bit</i>) to some “easy” states, like 0 and 1. This information will be in a superposition of both states at the same time rather than just one <i>or</i> the other. If we examine a classical bit, we will either get the states of 1 or 0. Instead, with a <i>qubit</i> (quantum information) we can only get results with some probability. A _qubi_t can exist in a continuum of states between ⟨0 and ⟨1 (using <a href=\"https://en.wikipedia.org/wiki/Bra%E2%80%93ket_notation\">Dirac’s notation</a>) all waiting to happen with some probability until it is observed.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/261LCjxL0vVwA0MLjCA6Nt/e7b3b21940f604d55c4e1b0da4341ec7/image2-15.png\" alt=\"A qubit stores a combination of two or more states.\" class=\"kg-image\" width=\"2000\" height=\"768\" loading=\"lazy\"/>\n            \n            </figure><p>A qubit stores a combination of two or more states.</p><p>In day-to-day life, we don’t see this quantum weirdness because we’re looking at huge jittery ensembles of qubits where this weirdness gets lost in noise. However, if we turn the temperature way down and isolate some qubits from noise, we can do some proper quantum computation. For instance, to find a 256-bit decryption key, we can set 256 qubits to a superposition of all possible keys. Then, we can run the decryption algorithm, trying the key in the qubits. We end up with a superposition of many failures and one success. We did 2<sup>256</sup> computations in a single go! Unfortunately, we can’t read out this superposition. In fact, if we open up the quantum computer to inspect the qubits inside, the outside noise will collapse the superposition into one outcome, which will most certainly be a failure. The real art of quantum computing is interfering this superposition with itself in a clever way to amplify out the answer we want. For the case we are talking about, <a href=\"https://en.wikipedia.org/wiki/Grover%27s_algorithm\">Lov Grover</a> figured out how to do it. Unfortunately, it requires about 2<sup>128</sup> steps: we have a nice, but not exponential speed-up.</p><p>Quantum computers do not provide any additional power over classical computers in terms of computability: they don’t solve unsolvable problems. But they provide efficiency: they find solutions in faster time, even for algorithms that are too “expensive” for a non-quantum (classical) computer. A classical computer can solve any known computational problem if it is given enough time and resources. But, on some occasions, they will need so much time and so many resources that it will be deemed inefficient to try to solve this problem: waiting millions of years with millions of computers working at the same time trying to solve a problem is not something that we consider feasible to do. This idea of efficient and inefficient algorithms was made mathematically precise by the field of computational complexity. Roughly speaking, an efficient algorithm is one which runs in time polynomial in the size of the problem solved.</p><p>We can look at this differently. The many quantum states can be potentially observed (even in a classical computer), but states <i>interfere</i> with each other, which prevents the usage of statistical sampling to obtain the state. We, then, have to track every possible configuration that a quantum system can be in. Tracking every possible configuration is theoretically possible by a classical computer, but would exceed the memory capacity of even the most powerful classical computers. So, we need quantum computers to efficiently solve these problems.</p><p>Quantum computers are powerful. They can efficiently simulate quantum mechanics experiments, and are able to perform <a href=\"https://quantumalgorithmzoo.org/\">a number of mathematical, optimization, and search problems</a> in a faster manner than classical computers. A sufficiently scaled quantum computer can, for example, factor large integers efficiently, as <a href=\"https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.123.5183&rep=rep1&type=pdf\">was shown by Shor</a>. They also have significant advantages when it comes to searching <a href=\"https://arxiv.org/abs/quant-ph/9605043\">on unstructured databases</a> or <a href=\"https://arxiv.org/abs/quant-ph/0011023\">solving the discrete logarithm problem</a>. These advances are the <i>solace</i>: they efficiently advance computational problems that seem stalled. But, they are also a <i>spectre</i>, a threat: the problems that they efficiently solve are what is used as the core of much of cryptography as it exists today. They, hence, can break most of the secure connections we use nowadays. For a longer explanation of the matter, see <a href=\"/the-quantum-menace/\">our past blog post</a>.</p><p>The realization of large-scale quantum computers will pose a threat to our connections and infrastructure. This threat is urgent and acts as a spectre of the future: an attacker can record and store secured traffic now and decrypt it later when a quantum computer exists. The spectre is ever more present if one recalls that migrating applications, architectures and protocols is a long procedure. Migrating these services to quantum-secure cryptography will take a lot of time.</p><p>In our <a href=\"/securing-the-post-quantum-world/\">other blog posts</a>, we talk at length about what quantum computers are and what threats they pose. In this one, we want to give an overview of the advances in quantum computing and their threats to cryptography, as well as an update to what is considered quantum-secure cryptography.</p><h3>The new upcoming decade of quantum computing</h3><p>In our <a href=\"/the-quantum-menace/\">previous blog post</a>, we mainly talked about improvements to <a href=\"https://arxiv.org/abs/1905.09749\">reduce the cost of factoring integers and computing discrete logarithms</a> during the middle of 2019. But recent years have brought new advances to the field. Google, for example, is aiming to build a “useful, error-corrected quantum computer” by <a href=\"https://blog.google/technology/ai/unveiling-our-new-quantum-ai-campus/\">the end of the decade</a>. Their goal is to be able to better simulate nature and, specifically, to better simulate molecules. This research can then be used, for example, to create <a href=\"https://www.ibm.com/blogs/research/2020/01/next-gen-lithium-sulfur-batteries/\">better batteries</a> or generate <a href=\"https://www.ibm.com/downloads/cas/8QDGKDZJ#:~:text=strict%20safety%20protocols.-,Quantum%20computing%20has%20the%20potential%20to%20improve%20the%20analysis%20of,may%20include%20single%2Dcell%20methods.\">better targeted medicines</a>.</p><p>Why will it take them (and, generally, anyone) so long to create this quantum computer? Classical mechanisms, like Newtonian physics or classical computers, provide great detail and prediction of events and phenomena at a macroscopic level, which makes them perfect for our everyday computational needs. Quantum mechanics, on the other hand, are better manifested and understood at the microscopic level. Quantum phenomena are, furthermore, very fragile: uncontrolled interaction of quantum phenomena with the environment can make quantum features disappear, a process which is referred to as _decoherenc_e. Due to this, measurement of quantum states has to be controlled, properly prepared and isolated from its environment. Furthermore, <a href=\"https://en.wikipedia.org/wiki/Measurement_problem\">measuring a quantum phenomenon</a> disturbs its state, so reliable methods of computing information have to be developed.</p><p>Creating a computer that achieves computational tasks with these challenges is a daunting one. In fact, it may ultimately be impossible to completely eliminate errors in the computational tasks. It can even be an impossible task at a perfect level, as a certain amount of errors will persist. Reliable computation seems to be only achievable in a quantum computational model by employing error correction.</p><p>So, when will we know that a created quantum device is ready for the “quantum” use cases? One can use the idea of “<a href=\"https://arxiv.org/abs/1801.00862\">quantum supremacy</a>”, which is defined as the ability for a quantum device to perform a computational task that would be practically impossible (in terms of efficiency and usage of computational power) for classical computers. Nevertheless, this idea can be criticized as classical algorithms improve over time, and there is no clear definition on how to compare quantum computations with their classical counterparts (one must prove that no classical means would allow us to perform the same computational task in a faster time) in order to say that indeed quantum computations of the task are faster.</p><p>A molecule can indeed be claimed to be “quantum supreme” if researchers find it computationally prohibitive (unrealistically expensive) to solve the <a href=\"https://en.wikipedia.org/wiki/Schr%C3%B6dinger_equation\">Schrödinger equation</a> and calculate its ground state. That molecule constitutes a “<a href=\"https://arxiv.org/pdf/1612.05903.pdf\">useful quantum computer, for the task of simulating itself</a>.” But, for computer science, this individual instance is not enough: “for any one molecule, the difficulty in simulating it classically might reflect genuine asymptotic hardness, but it might also reflect other issues (e.g., a failure to exploit special structure in the molecule, or the same issues of modeling error, constant-factor overheads, and so forth that arise even in simulations of classical physics)”, as stated by <a href=\"https://arxiv.org/pdf/1612.05903.pdf\">Aaronson and Chen</a>.</p><p>By the end of 2019, Google argued they had <a href=\"https://www.nature.com/articles/s41586-019-1666-5.pdf\">reached quantum supremacy</a> (with the quantum processor named “<a href=\"https://en.wikipedia.org/wiki/Sycamore_processor\">Sycamore</a>”) but their claim was <a href=\"https://www.ibm.com/blogs/research/2019/10/on-quantum-supremacy/\">debated</a> mainly due to the perceived lack of criteria to properly define when “quantum supremacy” is reached<sup>1</sup>. Google claimed that “a state-of-the-art supercomputer would require approximately 10,000 years to perform the equivalent task” and it was refuted by IBM by saying that “an ideal simulation of the same task can be performed on a classical system in 2.5 days and with far greater fidelity”. Regardless of this lack of criteria, this result in itself is a remarkable achievement and shows great interest of parties into creating a quantum computer. Last November, it was claimed that the most challenging sampling task performed on Sycamore can be accomplished within one week on the <a href=\"https://en.wikipedia.org/wiki/Sunway_TaihuLight\">Sunway supercomputer</a>. A crucial point has to be understood on the matter, though: “<a href=\"https://scottaaronson.blog/?p=6111\">more like a week still seems to be needed on the supercomputer</a>”, as noted by Aaronson. Quantum supremacy then is still not an irrevocable agreement.</p><p>Google’s quantum computer has already been applied to simulating real physical phenomena. Early in 2021, it was used to <a href=\"https://arxiv.org/abs/2107.13571\">demonstrate a “time crystal”</a> (a quantum system of particles which move in a regular, repeating motion without burning any energy to the environment). On the other hand, by late 2021, IBM <a href=\"https://techmonitor.ai/technology/ibm-eagle-chip-quantum-computing\">unveiled its 127-qubit chip Eagle</a>, but we don’t yet know how much gate fidelity (how close <a href=\"https://arxiv.org/pdf/0910.1315.pdf\">two operations are to each other</a>) it really attains, as outlined by Aaronson in <a href=\"https://scottaaronson.blog/?p=6111\">his blog post</a>.</p><p>What do all of these advances mean for cryptography? Does it mean that soon all secure connections will be broken? If not “soon”, when will it be? The answers to all of these questions are complex and unclear. The <a href=\"https://globalriskinstitute.org/publications/quantum-threat-timeline-report-2020/\">Quantum Threat Timeline Report</a> of 2020 suggests that the majority of researchers on the subject think that 15 to 40 years<sup>2</sup> will be the time frame for when a “cryptography-breaking” quantum computer arrives. It is worth noting that these predictions are more optimistic than compared to the same <a href=\"https://globalriskinstitute.org/publications/quantum-threat-timeline/\">report of 2019</a>, which suggests that, due to the advances of the quantum computing field, researchers feel more assured of their imminent arrival.</p><h3>The upcoming decades of breaking cryptography</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4MptzoQWhV84gy0bhgHio0/b4da7f17db484a2809068ae317d7e24a/Eyes-on-the-Horizon.png\" alt=\"the dawn\" class=\"kg-image\" width=\"1600\" height=\"273\" loading=\"lazy\"/>\n            \n            </figure><p>Quantum computing will shine a light into new areas of development and advances, but it will also expose secret areas: faster mechanisms to solve mathematical problems and break cryptography. The metaphor of the dawn can be used to show how close we are to quantum computers breaking some types of cryptography (how far are we to twilight), which will be catastrophic to the needs of privacy, communication and security we have.</p><p>It is worth noting again, though, that the advent of quantum computing is not a bad scenario in itself. Quantum computing will bring much progress in the form of advances to the understanding and mimicking of the fundamental way in which nature interacts. Their inconvenience is that they break most of the cryptography algorithms we use nowadays. They also have <a href=\"https://www.cs.virginia.edu/~robins/The_Limits_of_Quantum_Computers.pdf\">their limits</a>: they cannot solve every problem, and in cryptography there are algorithms that will not be broken by them.</p><p>Let’s start by defining first what dawn is. Dawn is the arrival of stable quantum computers that break cryptography in a reasonable amount of time and space (explicitly: breaking the mathematical foundation of the <a href=\"https://en.wikipedia.org/wiki/Elliptic-curve_cryptography\">p256 algorithm</a>; although some research defines this as breaking <a href=\"https://en.wikipedia.org/wiki/RSA_(cryptosystem)\">RSA2048</a>). It is also the time by which a new day arrives: a day that starts with new advances in medicine, for example, by better mimicking molecules’ nature with a computer.</p><p>How close to dawn are we? To answer this question, we have to look at the recent advances in the aim of breaking cryptography with a quantum computer. One of the most interesting advances is that the <a href=\"https://research.ibm.com/blog/factor-15-shors-algorithm\">number 15 was factored in 2001</a> (it is 20 years already) and <a href=\"https://arxiv.org/abs/1111.4147\">number 21 was factored in 2012</a> by a quantum computer. While this does not seem so exciting for us (as we can factor it in our minds), it is astonishing to see that a quantum computer was stable enough to do so.</p><p>Why do we care about computers factoring or not factoring integers? The reason is that they are the mathematical base of certain public key cryptography algorithms (like, RSA) and, if they are factored, the algorithm is broken.</p><p>Taking a step further, quantum computers are also able to break encryption algorithms themselves, such as <a href=\"https://en.wikipedia.org/wiki/Advanced_Encryption_Standard\">AES</a>, as we can use quantum efficient searching algorithms for the task. This kind of searching algorithm, <a href=\"https://en.wikipedia.org/wiki/Grover%27s_algorithm\">Grover’s algorithm</a>, solves the task of <a href=\"https://en.wikipedia.org/wiki/Inverse_function\">function inversion</a>, which speeds up collision and preimage attacks (attacks that you don’t want to be sped up in your encryption algorithms). These attacks are related to <a href=\"https://en.wikipedia.org/wiki/Hash_function\">hash functions</a>: a collision attack is one that tries to find two messages that produce the same hash; a preimage attack is one that tries to find a message given its hash value. A smart evolution of this algorithm, using <a href=\"https://www.scottaaronson.com/papers/qchvpra.pdf\">Hidden Variables</a> as part of a computational model, will theoretically make searching much more efficient.</p><p>So what are the tasks needed for a quantum computer to break cryptography? It should:</p><ul><li><p>Be able to factor big integers, or,</p></li><li><p>Be able to efficiently search for collisions or pre-images, or,</p></li><li><p>Be able to solve the <a href=\"https://en.wikipedia.org/wiki/Discrete_logarithm_records\">discrete logarithm problem</a>.</p></li></ul><p>Why do we care about these quantum computers breaking cryptographic algorithms that we rarely hear of? What has it to do with the connections we make? Cryptographic algorithms are the base of the secure protocols that we use today. Every time we visit a website, we are using a broad suite of cryptographic algorithms that preserve the security, privacy and integrity of connections. Without them, we don’t have the properties we are used to when connecting over digital means.</p><p>What can we do? Do we now stop using digital means altogether? There are solutions. Of course, the easy answer will be, for example, to <a href=\"https://cr.yp.to/papers/pqrsa-20170419.pdf\">increase the size of integers</a> to make them impossible to be factored by a quantum computer. But, is it really a usable algorithm? How slow will our connections be if we have to increase these algorithms exponentially?</p><p>As we get closer to twilight, we also get closer to the dawn of new beginnings, the rise of post-quantum cryptography.</p><h4>The rise and state of post-quantum cryptography</h4><p>As dawn approaches, researchers everywhere have been busy looking for solutions. If the mathematical underpinnings of an algorithm are what is broken by a quantum computer, can we just change them? Are there mathematical problems that are hard even for quantum computers? The answer is yes and, even more interestingly, we already know how to create algorithms out of them.</p><p>The mathematical problems that we use in this new upcoming era, called post-quantum, are of many kinds:</p><ul><li><p>Lattices by using learning with errors (LWE) or ring learning with errors problems (rLWE).</p></li><li><p>Isogenies, which rely on properties of supersingular elliptic curves and supersingular isogeny graphs.</p></li><li><p>Multivariate cryptography, which relies on the difficulty of solving systems of multivariate equations.</p></li><li><p>Code-based cryptography, which relies on the theory of error-correcting codes.</p></li></ul><p>With these mathematical constructions, we can build algorithms that can be used to protect our connections and data. How do we know, nevertheless, that the algorithms are safe? Even if a mathematical construction that an algorithm uses is safe from the quantum spectre, is the interaction with other parts of the system or in regard to adversaries safe? Who decides on this?</p><p>Because it is difficult to determine answers to these questions on an isolated level, the <a href=\"https://www.nist.gov/\">National Institute of Standards and Technology</a> of the United States has been running, since 2016, a <a href=\"https://csrc.nist.gov/projects/post-quantum-cryptography\">post-quantum process</a> that will define how these algorithms work, their design, what properties they provide and how they will be used. We now have a set of finalists that are close to being standardized. The competition standardizes on two tracks: algorithms for key encapsulation mechanisms and public-key encryption (or KEMs) and algorithms for the authentication (mainly, digital signatures). The current finalists are:</p><p>For the public-key encryption and key-establishment algorithms:</p><ul><li><p>Classic McEliece, a code-based cryptography scheme.</p></li><li><p>CRYSTALS-KYBER, a lattice based scheme.</p></li><li><p>NTRU, a lattice based scheme.</p></li><li><p>SABER, a lattice based scheme.</p></li></ul><p>For the digital signature algorithms:</p><ul><li><p>CRYSTALS-DILITHIUM, a lattice based scheme.</p></li><li><p>FALCON, a lattice based scheme.</p></li><li><p>Rainbow, a multivariate cryptography scheme.</p></li></ul><p>What do these finalists show us? It seems that we can rely on the security given by lattice-based schemes (which is no slight to the security of any of the other schemes). It also shows us that in the majority of the cases, we prioritize schemes that can be used in the same way cryptography is used nowadays: with fast operations&#39; computation time, and with small parameters’ sizes. In the migration to post-quantum cryptography, it is not only about using safe mathematical constructions and secure algorithms but also about how they integrate into the systems, architectures, protocols, and expected speed and space efficiencies we currently depend on. More research seems to be needed in the signatures/authentication front and the inclusion of new innovative signature schemes (like <a href=\"https://eprint.iacr.org/2020/1240\">SQISign</a> or <a href=\"https://eprint.iacr.org/2021/1144\">MAYO</a>), and that is why <a href=\"https://www.nist.gov/video/third-pqc-standardization-conference-session-i-welcomecandidate-updates\">NIST will be calling for a fourth round of its competition</a>.</p><p>It is worth noting that there exists another flavor of upcoming cryptography called “<a href=\"https://en.wikipedia.org/wiki/Quantum_cryptography\">quantum cryptography</a>”, but its efficient dawn seems to be far away (though, some Quantum Key Distribution — QKD — protocols are being deployed now). Quantum cryptography is one that uses quantum mechanical properties to perform cryptographic tasks. It has mainly focused on QKD), but it seems to be too inefficient to be used in practice outside very limited settings. And even though, in theory, these schemes should be perfectly secure against any eavesdropper; in practice, the physical machines may still fall victim to side-channel attacks.</p><p>Is dawn, then, the collapse of cryptography? It can be, on one hand, as it is the collapse of most classical cryptography. But, on the other hand, it is also the dawn of new, post-quantum cryptography and the start of quantum computing for the benefit of the world. Will the process of reaching dawn be simple? Certainly, not. Migrating systems, architectures and protocols to new algorithms is an intimidating task. But we at Cloudflare and as a community are taking the steps, as you will read in other blog posts throughout this week.</p><h4>References:</h4><ul><li><p><a href=\"https://courses.cs.washington.edu/courses/cse599/01wi/papers/simon_qc.pdf\">“On the power of Quantum Computation”</a> by Daniel R. Simon</p></li><li><p><a href=\"https://www.scottaaronson.com/papers/npcomplete.pdf\">“NP-complete Problems and Physical Reality”</a> by Scott Aaronson</p></li><li><p><a href=\"https://arxiv.org/pdf/1807.10749.pdf\">‘Quantum Supremacy Is Both Closer and Farther than It Appears”</a> by Igor L. Markov, Aneeqa Fatima, Sergei V. Isakov, and Sergio Boixo</p></li><li><p><a href=\"https://arxiv.org/pdf/1612.05903.pdf\">“Complexity-Theoretic Foundations of Quantum Supremacy Experiments”</a> by Scott Aaronson and Lijie Chen</p></li><li><p><a href=\"https://www.nature.com/articles/s41586-019-1666-5.pdf\">“Quantum supremacy using a programmable superconducting processor”</a> by Frank Arute <i>et al</i>.</p></li><li><p><a href=\"https://arxiv.org/abs/1910.09534\">“Leveraging Secondary Storage to Simulate Deep 54-qubit Sycamore Circuits”</a> by Edwin Pednault, John A. Gunnels, Giacomo Nannicini, Lior Horesh, Robert Wisnieff</p></li><li><p><a href=\"https://arxiv.org/abs/0708.0261\">“An Introduction to Quantum Computing”</a> by Noson S. Yanofsky</p></li><li><p><a href=\"https://www.nature.com/articles/nature23461\">“Post-quantum cryptography”</a> by Daniel J. Bernstein and Tanja Lange</p></li><li><p><a href=\"https://arxiv.org/pdf/0910.1315.pdf\">“Gate fidelity fluctuations and quantum process invariants”</a> by Easwar Magesan, Robin Blume-Kohout, and Joseph Emerson</p></li><li><p>“<a href=\"https://arxiv.org/abs/1805.07185\">Complete characterization of the directly implementable quantum gates used in the IBM quantum processors</a>” by Abhishek Shukla, Mitali Sisodia, and Anirban Pathak</p></li></ul><p>.......</p><p><sup>1</sup>In the original paper, they estimate of 10,000 years is based on the observation that there is not enough Random Access Memory (RAM) to store the full state vector in a Schrödinger-type simulation and, then, it is needed to use a <a href=\"https://arxiv.org/abs/1807.10749\">hybrid Schrödinger–Feynman algorithm</a>, which is memory-efficient but exponentially more computationally expensive. In contrast, <a href=\"https://arxiv.org/abs/1910.09534\">IBM used a Schrödinger-style classical simulation approach</a> that uses both RAM and hard drive space.</p><p><sup>2</sup>There is a 50% or more likelihood of “cryptography-breaking” quantum computers arriving. Slightly more than half of the researchers answered that, in the next 15 years, they will arrive. About 86% of the researchers answered that, in the next 20 years, they will arrive. All but one among the researchers answered that, in the next 30 years, they will arrive.</p><p><sup>3</sup>Although, in practice, this seems difficult to attain.</p>",
		"id": "4AjaRpTOtmH4LtsF1O3xc6",
		"localeList": {
			"name": "The quantum solace and spectre Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "What is quantum computing and what advances have been made so far on this front? In this blog post, we will answer this question and see how to protect against quantum adversaries.",
		"metadata": {
			"title": "The quantum solace and spectre",
			"description": "What is quantum computing and what advances have been made so far on this front? In this blog post, we will answer this question and see how to protect against quantum adversaries.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5uBcJgLLVmYmZdNeNhj7yN/b1d890e3866c8d7dbcf7f6cb05308b79/quantum-solace-and-spectre-Ba6kkT.png"
		},
		"primary_author": {},
		"published_at": "2022-02-21T13:59:28.000+00:00",
		"slug": "quantum-solace-and-spectre",
		"tags": [
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			},
			{
				"id": "6bIo7ayy56Fzdrtf9z2EWy",
				"name": "Post-Quantum",
				"slug": "post-quantum"
			}
		],
		"title": "The quantum solace and spectre",
		"updated_at": "2024-08-27T01:36:35.517Z",
		"url": "https://blog.cloudflare.com/quantum-solace-and-spectre"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}