{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"ja-jp",
		"pt-br",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "João Tomé",
				"slug": "joao-tome",
				"bio": "After years as a journalist covering technology, cinema, sports (soccer/football), and mobility (including hosting a TV show about it), I’m now telling data-driven and other stories at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/KOYiYhfI8O9WNWxB8IWk7/a87510f59b05f585ec6a0e4fd71f7352/joao-tome.jpeg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": "@emot",
				"facebook": null
			}
		],
		"excerpt": "Building on similar reports we’ve done over the past two years, we have compiled a ranking of the top Internet properties of 2023",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4dhTKm62MM3RkFXvaiCBGe/f1ba1912277bf10a8f7936e0fe2897ac/radar-2023-year-in-review-internet-services.png",
		"featured": false,
		"html": "<p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3GBwDGorqisyz8nBypbzp/d421470b94f4ecb57956d2fe62fb1a78/Radar-Year-in-Review-ranked-light-2.png\" alt=\"From Google to Generative AI: Ranking top Internet services in 2023\" class=\"kg-image\" width=\"1201\" height=\"679\" loading=\"lazy\"/>\n            \n            </figure><p>Ask nearly any Internet user, and they are bound to have their own personal list of favorite sites, applications, and Internet services for news, messaging, video, AI chatbots, music, and more. Sum that question up across a lot of users in a lot of different countries, and you end up with a sense of the most popular websites and services in the world. In a nutshell, that’s what this blog post is about: how humans interacted with the online world in 2023 from what Cloudflare observed.</p><p>Building on similar reports we’ve done over the past two years, we have compiled a ranking of the top Internet properties of 2023. In addition to our overall ranking, we chose 9 categories to focus on. One of these is a new addition in 2023: Generative AI. Here are the 9 categories we’ll be digging into:</p><p>1. <a href=\"#generativeai\">Generative AI</a>2. <a href=\"#socialmedia\">Social Media</a>3. <a href=\"#ecommerce\">E-commerce</a>4. <a href=\"#videostreaming\">Video Streaming</a>5. <a href=\"#news\">News</a>6. <a href=\"#messaging\">Messaging</a>7. <a href=\"#metaversegaming\">Metaverse &amp; Gaming</a>8. <a href=\"#financialservices\">Financial Services</a>9. <a href=\"#cryptocurrencyservices\">Cryptocurrency Services</a></p><p>Our method for calculating the results is the same as in <a href=\"/radar-2022-year-in-review/\">2022</a>: we analyze anonymized DNS query data from our <a href=\"https://1.1.1.1/\">1.1.1.1</a> public <a href=\"https://www.cloudflare.com/learning/dns/what-is-1.1.1.1/\">DNS resolver</a>, used by millions of people around the world. To build the lists of Internet services, we use two additional methods. First, we aggregate domains that belong to one online service. For instance, for Twitter/X, we include twitter.com, t.co, and x.com among others. Second, we reference our large <a href=\"https://radar.cloudflare.com/domains\">source list of domains</a> and identify the sites that provide services to humans. That means that our rankings do not include every domain seen in the data (for example, we exclude domains such as root-servers.net and cloudflare-dns.com). A site’s overall ranking is relative to other sites that meet these criteria; its rank within a category is relative to other sites in the same category. That’s important to note: just because a site has gone down in the rankings, it doesn’t necessarily mean its traffic has declined — it could just be that other sites&#39; traffic increased. Similarly, the inverse is true. What we’re doing here isn’t tracking absolute traffic, but rather, relative popularity.</p><p>With that, we can begin our analysis. Following the success of OpenAI’s ChatGPT launch on November 30, 2022, <a href=\"https://www.cloudflare.com/learning/ai/what-is-generative-ai/\">Generative AI</a> has captivated both the world and the news. OpenAI is now close to ranking among our top 100 most popular Internet services overall, rising from #200 in January.</p><p>In e-commerce, low price and fast fashion marketplace Temu experienced similar growth, becoming the year&#39;s surprise by surpassing Shein and other major players, reaching #7 in its category. And Black Friday was the best day for several other e-commerce services, as well as payment services such as PayPal, Stripe and Klarna.</p><p>In social media, X/Twitter lost some ground in our Overall ranking, but maintained its status as a significant online discussion platform. New additions like Threads by Instagram, launched in July, are still gaining their footing in the category. Additionally, we observed notable news-related trends linked to events such as the March 2023 United States banking crisis, the Titan submersible implosion, the Wagner Group rebellion, and the October 7 Hamas attack on Israel.</p><p>We close our report out with a discussion of a range of trends that don’t fit neatly into our other categories, including a look at Taylor Swift’s and Beyoncé websites — both of which appeared in our overall traffic rankings.</p><p>Keep reading for a detailed look at the evolution of trends throughout the year. For more, visit our <a href=\"https://radar.cloudflare.com/year-in-review/2023#internet-services\">2023 Cloudflare Radar Year in Review microsite</a>. Along with the lists of most popular Internet services, the Year in Review site and its <a href=\"/radar-2023-year-in-review/\">associated blog post</a> explore a number of additional metrics.</p><h2>Google is #1. Facebook, Apple and TikTok follow</h2><p>Since we began reporting these rankings in <a href=\"/popular-domains-year-in-review-2021/\">2021</a>, we always start with an Overall Top 10 list. These are the services that are the top Internet properties globally in 2023, based on DNS traffic through our 1.1.1.1 resolver. Unsurprisingly, Google (we’re including here services like Google Maps and Google Flights that use google.com, for example) remained the #1 most popular Internet service in our Overall ranking. Since we implemented our new ranking method <a href=\"/radar-2022-year-in-review/\">last year</a>, no other service has challenged Google&#39;s position as the #1 leader in our rankings.</p><h3>Top 10 — Most popular Internet services 2023, Overall</h3><ol><li><p>Google</p></li><li><p>Facebook</p></li><li><p>Apple</p></li><li><p>TikTok</p></li><li><p>Microsoft</p></li><li><p>YouTube</p></li><li><p>AWS</p></li><li><p>Instagram</p></li><li><p>Amazon</p></li><li><p>iCloud</p></li></ol><p>Beyond Google, Facebook was consistently #2, while Apple (that uses, for example, apple.com for several use cases, including on iPhone related services) was generally #3, except when TikTok took the spot in April. Microsoft mostly held the #5 ranking, although it sometimes traded places with YouTube at #6.</p><p>AWS — we’re separating it from Amazon by using domains like amazonaws.com — held a firm position at #7, and Instagram was clearly #8 through the year, with a few exceptions involving Amazon. The #10 position changed more frequently, alternating between iCloud (for which we use domains such as icloud.com, distinct from apple.com), Netflix (mainly on weekends), and Microsoft Office. In the chart below, you can follow the evolution of the top Internet services in our Overall ranking throughout the year.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6IE7ubSH10KxQR0Apl49fX/81a15a57d135a53574019b2e2c9131a2/pasted-image-0--7--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"522\" loading=\"lazy\"/>\n            \n            </figure><p>In 2022, X/Twitter ranked as high as #10 in our Overall ranking, but never reached this spot in 2023. We&#39;ll talk more about X/Twitter&#39;s performance in the Social Media category below.</p><!--kg-card-begin: html--><h2 id=\"generativeai\">Ready to face the Generative AI era?</h2><!--kg-card-end: html--><p>The Generative AI category became a global phenomenon in 2023, though it started gaining attention in late November 2022 with the launch of ChatGPT from OpenAI. We tested it on our <a href=\"https://cloudflare.tv/shows/this-week-in-net/this-week-in-net-new-pricing-annual-plans-and-an-ai-chatgpt-test/zv9wlxZQ\">&#39;This Week in NET’</a> show on December 2, 2022, and were impressed. It&#39;s not surprising that OpenAI was popular early in 2023 and topped this list. Other generative AI services also emerged during the year.</p><h3>Top 10 — Generative AI services 2023</h3><ol><li><p>OpenAI</p></li><li><p>character.ai</p></li><li><p>QuillBot</p></li><li><p>Hugging Face</p></li><li><p>Poe</p></li><li><p>Perplexity</p></li><li><p>Wordtune</p></li><li><p>Bard</p></li><li><p>ProWritingAid</p></li><li><p>Voicemod</p></li></ol><p>Significant changes occurred below Open AI’s #1 spot throughout the year. After mid-year, we noticed a shift, when character.ai took the #2 spot from Quillbot. Quora&#39;s Poe AI, which combines several AI chatbots including ChatGPT, entered the top 10 in late March, holding the #3 spot until late April before settling at #4.</p><p>This figure shows movement among the Generative AI services that were more popular later in the year:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6OsxjufFDsQd95K9Co00ui/27db2b6dd938264420a24aef8d0199cc/Untitled-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"633\" loading=\"lazy\"/>\n            \n            </figure><p>AI model platform Hugging Face was typically #5, but Google’s Bard also reached #5 in November. Bard, launched in limited regions in March, made our top 10 within the category after its broader release in Europe and Brazil. It was #7 from July to September before peaking later in the year.</p><p>Other Generative AI services that became important in our list later in 2023 include Anthropic&#39;s Claude (whose new model, Claude 2, launched in July, though it <a href=\"https://www.anthropic.com/claude-ai-locations\">is not yet available</a> in the European Union). It was #5 in August before dropping to #6 after September. Perplexity AI, a ChatGPT competitor, was #8 after September.</p><p>Midjourney, which relies on Discord bot commands to create artwork, peaked at #3 in late March but started declining, dropping to #5 in April and May, and then to #10 in September.</p><p>Other AI-inclusive services like Prowritingaid, Voicemod, and Wordtune were more popular earlier in the year but became less so later on. Bardeen was in the top 10 in May and June, while Descript appeared at #9 between March and May.</p><p>Notable trends that we observed when looking at trends for Generative AI services in our larger Overall ranking include:</p><ul><li><p><b>OpenAI</b>, which was around #200 in our Overall ranking in early January, saw a significant rise between March and April (OpenAI launched <a href=\"https://openai.com/gpt-4\">GPT-4</a> and <a href=\"https://openai.com/blog/chatgpt-plugins\">plugins</a> during that time) and is now near the top 100. It peaked early in November (#104 on November 9), right after OpenAI&#39;s first developer conference on November 6 in San Francisco. The <a href=\"https://en.wikipedia.org/wiki/Removal_of_Sam_Altman_from_OpenAI\">brief removal</a> of Sam Altman in late November didn&#39;t have a noticeable impact.</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4RUWGoZnc0zRm5lDJOR3xq/996fd205206aae281ec9eee2f121e126/pasted-image-0-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"528\" loading=\"lazy\"/>\n            \n            </figure><ul><li><p><b>character.ai</b>&#39;s growth was similar to OpenAI, rising from the top 500 in early January to around #200 recently. <b>Quillbot</b> remained steady throughout the year, around #258.</p></li><li><p><b>Poe AI</b> peaked at #276 on June 18 and is now around #290. <b>Claude AI</b> was around #380 in November after a late August peak at #337.</p></li></ul><!--kg-card-begin: html--><h2 id=\"socialmedia\">Social media: The Facebook (not X) effect</h2><!--kg-card-end: html--><p>An analysis from <a href=\"https://datareportal.com/social-media-users\">Kepios</a> estimates that there are 4.95 billion social media users around the world in 2023, comprising 61.4% of the world population, so this category plays a big role in our everyday life as a central stage for communication, information, and general attention.</p><p>Unsurprisingly, social media platforms such as Facebook, TikTok, and Instagram rank high in our most popular Internet properties and are featured in our Top 10 Overall Internet services list.</p><p>Within our Social Media category list, the top five remained the same as last year. Facebook was #1, followed by TikTok (#2), Instagram (#3), X/Twitter (#4), and Snapchat (#5).</p><h3>Top 10 — Social Media services 2023</h3><ol><li><p>Facebook</p></li><li><p>TikTok</p></li><li><p>Instagram</p></li><li><p>X/Twitter</p></li><li><p>Snapchat</p></li><li><p>LinkedIn</p></li><li><p>Discord</p></li><li><p>Reddit</p></li><li><p>Pinterest</p></li><li><p>Kwai</p></li></ol><p>In contrast to 2022, when Twitter (renamed <a href=\"https://en.wikipedia.org/wiki/Twitter#Branding\">X</a> in July 2023) and Instagram often swapped places at #3, this year X/Twitter never challenged Instagram in our rankings.</p><p>LinkedIn held a strong #6, with Discord challenging it during a few days in January and April.</p><p>Reddit, usually at #8, competed with Discord for the #7 spot in February and March but fell back to #8 in April, concurrent with the controversy around Reddit <a href=\"https://en.wikipedia.org/wiki/2023_Reddit_API_controversy\">API changes</a>. Reddit often challenged Discord on weekdays, while Discord was more popular on weekends. Following these are Pinterest (#9) and Kwai, the Chinese video app popular in Brazil, Indonesia, and other countries (#10). Here’s the top 10 chart across 2023:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3DryR3S2jtK7FzrLWhyiKp/085f5fab9e45b37f503f9ced8dbaa8af/Untitled--1--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"638\" loading=\"lazy\"/>\n            \n            </figure><h3>A Twitter (or X) drop after a possible football (or soccer) peak</h3><p>Let&#39;s continue on social media, but leave its specific category and examine how social media services fared in our Overall ranking where bigger shifts between services are seen.</p><p>The graph below depicts the position of Instagram and Twitter in the Overall ranking. Instagram consistently ranked in the top 10, typically holding positions #8 or #9 with brief dips to #10 around May 2023.</p><p>X/Twitter, which reached as high as #8 overall last year following the start of the war in Ukraine, ended 2022 at #12 and continued its downward trend in 2023. It started between #12 and #16, lower than last year, and ended between #13 and #19. Here&#39;s how these two evolved in 2023:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2brQw8zfvHrocJ0ktEXoue/ca94541acd539c483c3131ea0ca96ce8/pasted-image-0--1--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"523\" loading=\"lazy\"/>\n            \n            </figure><p>We noticed that X/Twitter was particularly popular on weekends, peaking at #11 or #12 between April 15 and June 10. ​​Specifically, it ranked at #11 in the weekends before May 14 and then at #12 from May 14 to June 10. This coincides with key moments in European football competitions. However, after the European Champions League final on June 10, X/Twitter never reached those heights again.</p><p>Let’s explore this possible football (or soccer) Twitter trend. X/Twitter&#39;s rankings peaked around significant moments in the English Premier League (arguably the <a href=\"https://internationalbroadcasts.fandom.com/wiki/Premier_League\">most-watched sports league</a> in the world), particularly when Manchester City made crucial advances to their title after April 15. The trend lasted until the European Champions League final on June 10, where City&#39;s victory and historic <a href=\"https://www.uefa.com/uefachampionsleague/news/0251-0e99b1ba85da-ec8053dc0a29-1000--who-has-won-a-treble-including-domestic-league-and-cup-title/\">treble</a> coincided with X/Twitter&#39;s final peak ranking of the year — the weekend of June 3, when there were already no Premier League games, and X/Twitter dropped to #13.</p><h3>Alternatives to X/Twitter: Mastodon, Threads, and others</h3><p>Tumblr, a more established platform than other recent alternatives, fluctuated between #125 and #153 in our Overall ranking, showing a downward trend. Close behind was an aggregation of several hundred Mastodon servers, ranking between #160 and #200.</p><p>Threads from Instagram/Meta (seen in the next chart), peaked at #227 on July 6 in our Overall ranking, then dropped but recovered to around #300 after late August, and did not make it into the top 10 social media services ranking for 2023. For context, Kwai (#10 in the Social Media ranking) usually ranks around our Overall top 50.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1ePcQclaW19DhwQUxyXUMR/7a0b13af347288981bc911d95937fdf7/pasted-image-0--2--2.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"548\" loading=\"lazy\"/>\n            \n            </figure><p>Bluesky, a newer entrant, first appeared in our Top 500 in late August, with a first spike at #432 on September 19 and reaching the top 400 in November, peaking at #397 on November 19. Truth Social had a peak at #318 on August 23 but then dropped, averaging around #450 in November.</p><p>Other social apps including Hive Social, Counter Social, Post.News, T2/Pebble, Parler, etc., didn&#39;t appear in our Overall 500 ranking.</p><p>Here are some other trends we observed among social media apps, and how they did in our Overall ranking:</p><ul><li><p><b>Snapchat</b> was more popular on weekends, fluctuating between #18 and #21 overall, with improved performance after October, with several days at #18, close to X/Twitter.</p></li><li><p><b>Discord</b> was also more popular on weekends, varying between #24 and #35, peaking in April at #24. It had a similar trend to Midjourney, the generative AI image service that generates images for its users on Discord. It ended the year around #32.</p></li><li><p><b>Reddit,</b> which was more popular on weekdays, dropped in our ranking during the summer in the Northern Hemisphere, in contrast with other social media services, and moved between #30 and #38.</p></li><li><p><b>Quora</b> was also more popular on weekdays, and fluctuated between #116 and #146, dropping in summer and settling around #130 in November.</p></li><li><p><b>Tinder</b>, the social dating app, fell from a peak of #124 to #133 in November, and is much more popular on Sundays.</p></li><li><p><b>OnlyFans</b> showed steady growth, peaking at #148 in early July and settling around #175. The adult oriented social content subscription service was more popular on the weekends, particularly on Sundays.</p></li><li><p><b>BeReal</b>, a French social media app for daily photo sharing, approached but did not enter the Social Media top 10 ranking, and grew to a peak of #141 in our Overall ranking in September but fell in November.</p></li></ul><!--kg-card-begin: html--><h2 id=\"ecommerce\">E-commerce: Temu means growth</h2><!--kg-card-end: html--><p>E-commerce remains as relevant as ever, something that is especially evident in our recent <a href=\"/cyber-week-analyzing-internet-traffic-and-e-commerce-trends/\">Cyber Week blog post</a>. Amazon consistently tops the category, with Taobao as a solid #2. In 2022, eBay was mostly #2 but has now dropped to #3, although it had several days in early 2023 in the #2 spot, as well as on <a href=\"https://community.ebay.com/t5/Announcements/Commemorating-Juneteenth/ba-p/31018439\">June 19</a>.</p><h3>Top 10 — E-commerce services 2023</h3><ol><li><p>Amazon</p></li><li><p>Taobao</p></li><li><p>eBay</p></li><li><p>Shopify</p></li><li><p>Alibaba</p></li><li><p>AliExpress</p></li><li><p>Temu</p></li><li><p>Rakuten</p></li><li><p>Mercado Libre</p></li><li><p>Walmart</p></li></ol><p>Throughout the year, Shopify was a solid #4, overtaking eBay at #3 on Black Friday. Alibaba was #5, peaking on <a href=\"https://en.wikipedia.org/wiki/Singles%27_Day\">Singles’ Day</a>, November 11. AliExpress followed at #6.</p><p>Rakuten and Temu battled for the #7 ranking in 2023. <a href=\"https://en.wikipedia.org/wiki/Temu_(marketplace)\">Temu</a>, the Chinese-owned and Boston-based low price and fast fashion marketplace (launched in the US in September 2022) was definitely one of the surprises of the year. It expanded to Canada, Australia and New Zealand in February, and ended 2023 as #7 in front of Rakuten. It ranked #6 at times during the year, including Black Friday. Temu wasn’t in our top 10 in 2022.</p><p>The South American e-commerce platform Mercado Libre, the American retail giant Walmart, and the fast fashion brand Shein, ‘battled’ during the year for the 9th and 10th place rankings in the E-commerce category.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/35KZXKcSCKvQzZLRS1MYj0/e4a42cf7f72f0f1b7a00507e1e561cb2/Untitled--2--3.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"630\" loading=\"lazy\"/>\n            \n            </figure><p>Looking at how e-commerce sites did in our Overall ranking, we observed the following trends:</p><ul><li><p><b>Amazon</b> finished the year at #9 overall, reaching #8 on its <a href=\"https://www.aboutamazon.com/news/retail/the-history-of-prime-day\">Prime Day</a> shopping event (July 11-12) and Black Friday.</p></li><li><p><b>Shein</b>, the Chinese fast fashion brand, showed growth, starting at around #130 in January and ending around #120. It’s a similar trend to the one we observed in 2022.</p></li><li><p><b>Temu</b> was not in the top 200 in January but finished in the top 100, peaking on Black Friday at #84 — a similar trend was seen in OpenAI performance. Temu also overtook Shein in May 2023.</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3NIo954MjpIufgxK7XNyKa/20a4e3d27fb45bf97430ca7c20d221de/pasted-image-0--3--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"525\" loading=\"lazy\"/>\n            \n            </figure><ul><li><p><b>Best Buy</b> also peaked on Black Friday in 2023, as did <b>Nike, Adidas, Victoria&#39;s Secret</b>, and <b>H&amp;M</b>. <b>Zara&#39;s</b> best day was November 23.</p></li><li><p><b>Target</b> first peaked on November 12 at #134 and again on Black Friday at #135.</p></li><li><p><b>Ikea</b> didn’t perform as well during Black Friday week in our ranking, and had its 2023 peak on June 14-15 (#172), when it launched its own <a href=\"https://ca.sports.yahoo.com/photos/ikea-launches-summer-sale-60-073500367/\">summer sale</a> and a <a href=\"https://www.reuters.com/technology/ikea-bets-remote-interior-design-ai-changes-sales-strategy-2023-06-13/\">remote interior design AI related strategy</a>.</p></li><li><p><b>Alibaba’s</b> highest position in 2023 was on Single’s Day, November 11, at #67.</p></li></ul><!--kg-card-begin: html--><h2 id=\"videostreaming\">Video streaming: YouTube and Netflix remain uncontested</h2><!--kg-card-end: html--><p>Video streaming platforms continue to play a central role in entertaining us. YouTube remains the top service for all video streaming, with Netflix as a close second. However, within our rankings, Netflix is the clear leader among paid streaming services, followed by Disney Plus, Amazon Prime Video, Hulu, and HBO/HBO Max.</p><h3>Top 10 — Video streaming services 2023</h3><ol><li><p>YouTube</p></li><li><p>Netflix</p></li><li><p>Twitch</p></li><li><p>Roku</p></li><li><p>Disney Plus</p></li><li><p>Prime Video</p></li><li><p>Hulu</p></li><li><p>HBO/Max</p></li><li><p>Vimeo</p></li><li><p>Pluto TV</p></li></ol><p>Twitch, which has a significant amount of video game live-streaming content, secured the #3 spot, as it did in 2022. Roku, a digital media player that also offers streaming services, ranked #4. Following are Disney Plus, Prime Video, Hulu, and HBO/Max (now known as Max), with Vimeo surpassing Pluto TV later in the year. Dailymotion also made a top 10 appearance in late February for a few days.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3vw09rFfZBAOISOZahxbt2/7f089e817bd487073b53c6967839b826/Untitled--3-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"630\" loading=\"lazy\"/>\n            \n            </figure><p>Throughout the year, Disney+ occasionally challenged Roku, especially on weekends following the premiere of the Star Wars-related miniseries <a href=\"https://en.wikipedia.org/wiki/Ahsoka_(TV_series)\">Ahsoka</a> on August 23.</p><p>Looking at how video streaming services performed in our Overall ranking, we found:</p><ul><li><p><b>Netflix</b> peaked at #9 on Sundays in April and May, coinciding with the release of &#39;<a href=\"https://en.wikipedia.org/wiki/The_Diplomat_(American_TV_series)\">The Diplomat</a>&#39; starring Keri Russell — it was the <a href=\"https://www.netflix.com/tudum/top10/tv?week=2023-04-23\">most watched show</a> on the platform at that time. Netflix, Prime Video, HBO/Max, were more popular on weekends.</p></li><li><p><b>Prime Video</b> was more popular earlier in the year, peaking at #50 on March 26, the weekend &#39;<a href=\"https://en.wikipedia.org/wiki/Top_Gun:_Maverick\">Top Gun: Maverick</a>&#39; premiered.</p></li><li><p><b>HBO/Max</b> has been dropping in our Overall ranking since September but remains in the top 100.</p></li><li><p><b>Peacock</b>, NBC&#39;s streaming service, peaked at #111 in October and was more popular on Sundays.</p></li><li><p><b>Paramount Plus</b> has been falling in our Overall ranking, down to around #156 in November, and is also more popular on Sundays.</p></li></ul><!--kg-card-begin: html--><h2 id=\"news\">The News: Globo and BBC global perspectives</h2><!--kg-card-end: html--><p>News organizations worldwide play a crucial role in keeping the public informed, especially during times of crisis like pandemics, wars, or financial uncertainty. With that in mind, the ranking of news organizations also highlights a few newsworthy trends.</p><h3>Top 10 — News services 2023</h3><ol><li><p>Globo</p></li><li><p>BBC</p></li><li><p>Fox News</p></li><li><p>CNN</p></li><li><p>NY Times</p></li><li><p>Daily Mail</p></li><li><p>Washington Post</p></li><li><p>The Guardian</p></li><li><p>NPR</p></li><li><p>Wall Street Journal</p></li></ol><p>Last year, BBC and Globo tied for #1 in this category. In 2023, Globo — a <a href=\"https://en.wikipedia.org/wiki/Grupo_Globo\">Brazilian media conglomerate</a> popular in South America, was consistently #1, followed by the BBC, the UK&#39;s national broadcaster. The only exception was on June 20, when the BBC was #1. This coincided with the <a href=\"https://en.wikipedia.org/wiki/Titan_submersible_implosion\">Titan submersible implosion</a> on June 18, which remained in global news for most of the following week.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5M0Mx5puOtpFqMBJjIvK5W/c4d31b3f6724dacb00a2e1335f240a12/Untitled--4-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"638\" loading=\"lazy\"/>\n            \n            </figure><p>Fox News and CNN also played a key role in our list. Fox News was overtaken by CNN for the #3 spot from July onwards, though Fox led again in November. The New York Times held a steady #5, followed by the Daily Mail and NPR, with the Washington Post overtaking NPR in June.</p><p>The ranking lower in the top 10 fluctuated more, with the Wall Street Journal mostly at #9, reaching #8 in September. The Guardian was #8 in October, coinciding with the start of the <a href=\"https://en.wikipedia.org/wiki/2023_Hamas-led_attack_on_Israel\">Hamas-Israel conflict</a> on October 7.</p><h3>Titan submersible implosion &amp; the Hamas-Israel conflict</h3><p>Notable news trends we identified in our larger Overall ranking include:</p><ul><li><p><b>CNN</b> had its 2023 peak on June 22, reaching #73, and was already higher than usual in the previous days. That was the day the United States Coast Guard announced that they had discovered debris from the <a href=\"https://en.wikipedia.org/wiki/Titan_submersible_implosion\">Titan submersible implosion</a>, confirming that the five people aboard were dead. The other peak of the year for CNN was February 14, Valentine’s Day.</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5hjaMWZXngtrAZ5yGWtMmv/e2034b66dbdf2c8bcb6c6cf0cb2166f6/pasted-image-0--4--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"541\" loading=\"lazy\"/>\n            \n            </figure><ul><li><p><b>The Daily Mail</b> (#127) and <b>The Indian Express</b> (#389) also peaked on June 22, with <b>Fox News</b> also reaching one of its highest ranks on that day, although it was higher in early January.</p></li><li><p><b>German</b> news outlet Bild also peaked on June 22, while <b>Der Spiegel</b>&#39;s highest point was the previous day, June 21.</p></li><li><p><b>BBC</b>, had a significant peak in our Overall list on October 8, following the Hamas attack on Israel, reaching #76. It also moved higher in the news category ranking on that day, as noted above.</p></li><li><p><b>RT</b>, the Russian news organization, showed a decline throughout the year but peaked on June 24 (#234) during the <a href=\"https://en.wikipedia.org/wiki/Wagner_Group_rebellion\">Wagner Group rebellion</a> in Russia.</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/zfMSyCHTCnD0mne5V0G4q/8bebec0d9811e1675264bda91154cbc4/pasted-image-0--5--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"538\" loading=\"lazy\"/>\n            \n            </figure><ul><li><p>Israeli newspapers <b>Times of Israel</b> and <b>Haaretz</b> jumped into our Overall ranking on October 7, the day of the Hamas attack on Israel. The former had its peak on October 9 at #275, the latter on October 8 at #393.</p></li><li><p><b>The Washington Post</b> peaked on April 4-5 (#117), coinciding with Finland joining NATO and Donald Trump&#39;s not guilty plea after becoming the first <a href=\"https://en.wikipedia.org/wiki/Prosecution_of_Donald_Trump_in_New_York\">US president to be indicted</a>.</p></li><li><p><b>China Daily</b> appeared in our top 500 in January, peaking on January 20 at #361, ahead of the <a href=\"https://en.wikipedia.org/wiki/Chinese_New_Year\">Chinese New Year</a> on January 22. A similar rise was seen in the <b>South China Morning Post</b>.</p></li><li><p><b>TMZ</b>&#39;s highest rank was on October 29 (#243), following the announcement of the TV star <a href=\"https://en.wikipedia.org/wiki/Matthew_Perry#Death\">Matthew Perry</a>&#39;s death.</p></li><li><p><b>BuzzFeed</b>, combining buzzfeed.com and buzzfeednews.com, declined in our Overall ranking, especially after the summer, falling to around #300 in November. In April 2023, it was announced that <a href=\"https://en.wikipedia.org/wiki/BuzzFeed_News\">BuzzFeed News</a> would be shutting down, and it did so in May.</p></li></ul><!--kg-card-begin: html--><h2 id=\"messaging\">Messaging: WhatsApp rules & Telegram rises</h2><!--kg-card-end: html--><p>Messaging is seen as a type of social media and remains as relevant as ever including for <a href=\"https://internetlab.org.br/en/news/new-research-indicates-that-the-impact-of-information-in-messaging-apps-has-a-deep-connection-with-other-media-habits/\">specific communication purposes</a>. Apple&#39;s iMessage is not included in this category, because it doesn’t have a unique domain name whose traffic can be analyzed. Keeping that in mind, WhatsApp remained the top messaging service in 2023, consistent with its position in 2022.</p><h3>Top — Messaging services 2023</h3><ol><li><p>WhatsApp</p></li><li><p>QQ</p></li><li><p>Viber</p></li><li><p>Telegram</p></li><li><p>LINE</p></li><li><p>Signal</p></li><li><p>WeChat</p></li><li><p>Messenger</p></li><li><p>GroupMe</p></li><li><p>Kik</p></li></ol><p>Following WhatsApp is the Chinese service QQ, also known as <a href=\"https://en.wikipedia.org/wiki/Tencent_QQ\">Tencent QQ</a>, which includes games and mobile payments and is popular in Asia, at #2. Viber, popular in Eastern Europe, Asia, and the Middle East, comes next. The top three are unchanged from 2022. Telegram, widely used in Eastern Europe and Asia, holds the #4 spot. LINE from Japan briefly contested this position early in 2023. Signal follows, and the Chinese app WeChat is at #7, ahead of Facebook&#39;s Messenger.</p><p>The list concludes with Microsoft&#39;s GroupMe and the Canadian service Kik Messenger. The standings are similar to 2022, but Telegram, WeChat, and Signal have shown improvements.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/c1EUDLa6UHetG9knbh83y/7f93da9b4b513cf6b2a075b1d7cb392e/Untitled--5-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"634\" loading=\"lazy\"/>\n            \n            </figure><p>Here are other messaging trends from our Overall ranking:</p><ul><li><p><b>WhatsApp</b>&#39;s was generally most popular between late May and early September, though its peak came on November 14th, when it reached #13 in our Overall ranking (a rank it shared that month with X/Twitter).</p></li><li><p><b>Telegram</b> rose to #79 overall on June 24, following the <a href=\"https://en.wikipedia.org/wiki/Wagner_Group_rebellion\">Wagner Group rebellion</a> in Russia, which occurred June 23-24.</p></li><li><p><b>WeChat</b> saw a significant spike the first quarter of the year on January 21-22, <a href=\"https://en.wikipedia.org/wiki/Chinese_New_Year#Dates_in_Chinese_lunisolar_calendar\">Chinese New Year</a>&#39;s Eve and respective New Year day. WeChat peaked in 2023 at #122 on August 19, coinciding with news regarding <a href=\"https://www.reuters.com/world/asia-pacific/china-says-military-held-naval-air-combat-readiness-patrol-around-taiwan-2023-08-19/\">China&#39;s military drills around Taiwan</a>.</p></li></ul><!--kg-card-begin: html--><h2 id=\"metaversegaming\">Metaverse & Gaming: Roblox leads, Oculus grows</h2><!--kg-card-end: html--><p>Is gaming part of the metaverse? In a sense, one could argue that it depends on the game, given that it is all about being immersed in another world. Concepts aside, we’ve included both in the same category since last year. Roblox was the uncontested winner of this category in 2023, followed by two services that are now much more than just popular gaming consoles, but also popular online gaming services: Microsoft’s Xbox and Sony’s PlayStation.</p><h3>Top 10 — Metaverse &amp; Gaming services 2023</h3><ol><li><p>Roblox</p></li><li><p>Xbox/Xbox Live</p></li><li><p>Epic Games/Fortnite</p></li><li><p>PlayStation</p></li><li><p>Oculus</p></li><li><p>Steam</p></li><li><p>Electronic Arts</p></li><li><p>Blizzard</p></li><li><p>Nintendo</p></li><li><p>Riot Games/League of Legends</p></li></ol><p>Xbox and PlayStation were at the podium of the list for most of the year. The top spots were similar to 2022, but PlayStation, which was #3 last year, was surpassed by Epic Games (known for Fortnite) during the last part of 2023.</p><p>Oculus, a VR headset and also metaverse experience service owned by Meta (we’re considering domains related to those two aspects provided by Meta’s <a href=\"https://en.wikipedia.org/wiki/Reality_Labs\">Reality Labs</a>), rose in the rankings to #5, continuing a trend from late 2022. It reached as high as #2 on June 29, and again on October 3-4 after the <a href=\"https://www.ign.com/articles/meta-connect-2023-everything-announced-at-the-meta-quest-3-event\">announcement</a> of Quest 3 at Meta Connect 2023.</p><p>Steam was more popular than Oculus from July to September, reaching #5. Electronic Arts was a solid #7 throughout the year, and Blizzard (famous for World of Warcraft and an Activision Blizzard subsidiary), was mostly in #8. The top 10 list ends with Nintendo and Riot Games/League of Legends ‘battling’ for the #9 and #10 spots, with the latter overtaking Nintendo since September.</p><p>Here’s the top 10 chart across 2023:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7LlZmFgQTpzkkHakZ8nT0J/4af3434333a6e72cf89baddca1d7e824/Untitled--6-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"630\" loading=\"lazy\"/>\n            \n            </figure><!--kg-card-begin: html--><h2 id=\"financialservices\">Financial services: Stripe takes the lead, Black Friday impact</h2><!--kg-card-end: html--><p>The financial services sector is diverse, ranging from traditional banking to cryptocurrency-only services to tax-related services. This year, Stripe, an Irish-American payment platform, dethroned PayPal as the top service in this category.</p><h3>Top 10 — Financial Services 2023</h3><ol><li><p>Stripe</p></li><li><p>PayPal</p></li><li><p>Alipay</p></li><li><p>TradingView</p></li><li><p>Nubank (BR)</p></li><li><p>Intuit</p></li><li><p>American Express</p></li><li><p>Binance</p></li><li><p>Bradesco Bank</p></li><li><p>CoinGecko</p></li></ol><p>PayPal started the year at #1 but was overtaken by Stripe on most days since March. PayPal still led on some weekends during the summer and on Black Friday. TradingView lost its #3 spot to Alipay in late July. Intuit was more popular early in the year, peaking on April 18, the <a href=\"https://en.wikipedia.org/wiki/Tax_Day\">Tax Day in the United States</a>, but ended mostly at #5 on weekdays (see our 2022 <a href=\"/us-tax-day-2022-how-leaving-it-to-the-last-day-impacts-tax-sites/\">blog post</a> on how Tax Day impacts related sites for more on this trend).</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/66AQHPReFLj4im1HP3yZ0h/76f7dbc3d9544045c83e0fb34c40df8b/pasted-image-0--6--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"656\" loading=\"lazy\"/>\n            \n            </figure><p>The Brazilian <a href=\"https://en.wikipedia.org/wiki/Nubank\">Nubank</a>, an online-only bank or <a href=\"https://en.wikipedia.org/wiki/Neobank\">neobank</a>, and the largest of its kind in Latin America, was a surprise at #6, often reaching higher ranks on weekends, especially on Saturdays, as it peaked on June 3 and July 1.</p><p>Focusing on specific crypto services in the Financial category (more on crypto below), we can see that Binance lost ground throughout 2023, especially after August moving between #8 and #9. This is a change from its trend in 2022, when Binance was on a growth trajectory and ranked #6. CoinGecko, a cryptocurrency data aggregation and tracking website, made a late appearance in 2023 with several days as #6 in November, and Coinbase appeared at #10 after late October. Here’s the crypto perspective in this Financial services category:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/nKPeExV37r9PbTB2STFoF/7a2abef6a67bad0a34da4b6c367e9f19/pasted-image-0--8--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"531\" loading=\"lazy\"/>\n            \n            </figure><p>Here are other financial services trends from our Overall ranking</p><ul><li><p><b>Investing.com</b>&#39;s peak at #199 occurred on March 13, three days after the collapse and seizure of Silicon Valley Bank (SVB), and the same day that <a href=\"https://www.reuters.com/markets/global-markets-wrapup-4-pix-2023-03-13/\">bank shares plunged</a> on contagion fears — a period known as the <a href=\"https://en.wikipedia.org/wiki/2023_United_States_banking_crisis\">2023 US banking crisis</a>. It was the same day MarketWatch also peaked (#293).</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/55la09T5hQW4CKQxmudBte/db180ef51cbb40228192ba3900751e02/pasted-image-0--9--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"542\" loading=\"lazy\"/>\n            \n            </figure><ul><li><p>Online-only financial services such as <b>PayPal</b> (#71) and <b>Klarna</b> (#211) reached their annual peak in our Overall ranking on Black Friday, November 24. <b>Stripe</b>, however, had a clear spike at #77 on that day, but its best day was on November 10, at #68.</p></li><li><p><b>Venmo</b>, an American mobile payment service owned by PayPal, had its best month in September.</p></li></ul><!--kg-card-begin: html--><h2 id=\"cryptocurrencyservices\">Crypto: Binance declines and CoinGecko rises</h2><!--kg-card-end: html--><p>In addition to our Financial Services category, we also evaluated cryptocurrency-related services in particular. Despite the disappearance of Sam Bankman-Fried&#39;s <a href=\"https://en.wikipedia.org/wiki/FTX_(company)\">FTX</a> from our rankings after its bankruptcy in November 2022, the crypto sector continues to show several changes this year. Binance, Coinbase, and CoinGecko (a provider of crypto data tools) remain at the top of the list, a trend similar to 2022. While Binance held on to its #1 position across most of 2023, in the last month it was overtaken by CoinGecko.</p><h3>Top 10 — Cryptocurrency services 2023</h3><ol><li><p>Binance</p></li><li><p>CoinGecko</p></li><li><p>Coinbase</p></li><li><p>CoinMarketCap</p></li><li><p>NiceHash</p></li><li><p>OKX</p></li><li><p>MEXC</p></li><li><p>CryptoCompare</p></li><li><p>Kraken</p></li><li><p>Crypto.com</p></li></ol><p>Throughout the year, CoinGecko gained momentum, surpassing the cryptocurrency exchange platforms Binance and Coinbase in November. CoinMarketCap and NiceHash were also prominent, with CoinMarketCap reaching #4 by October. OKX, MEXC, and Crypto.com were already in the top 10 in 2022, and CryptoCompare, Kraken, and Trust: Crypto &amp; Bitcoin, which also competed for the #10 position, were new inclusions in 2023. Kucoin and Etherscan fell out of the 2023 top 10 after being there in 2022.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/68Fm2TBebvOzR3F9LxnrFe/1bc6b187a262d5d1541b60feb155957e/Untitled--7-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"644\" loading=\"lazy\"/>\n            \n            </figure><p>What happened to Binance? In both the Financial Services and Cryptocurrency categories, we noticed Binance, a key cryptocurrency player, lost its leading position in 2023, dropping to #2 in November. The company faced challenges in July, with <a href=\"https://en.wikipedia.org/wiki/Binance#2020%E2%80%932023:_acquisitions_and_investments\">several top executives leaving</a>. Then, in November, US authorities filed a lawsuit against Binance, resulting in multiple charges and fines. In our Overall ranking, Binance&#39;s highest point was on April 19, the day after US Tax Day, ranking at #122. However, its rank fell later, though it slightly improved to around #140 by November.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6qLPb72qYBKXFtqPAz95zA/b5df3940e506f1b291af55b800492731/pasted-image-0--10--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"544\" loading=\"lazy\"/>\n            \n            </figure><h2>Other trends from our overall ranking: Taylor, Beyoncé, GitHub and Spotify&#39;s popularity</h2><p>Outside the categories we reviewed in the Year in Review, several notable trends emerged in our Overall ranking:</p><ul><li><p><b>Taylor Swift&#39;s</b> official site entered our top 500 on August 10 (#464), when she announced her album &#39;<a href=\"https://en.wikipedia.org/wiki/1989_(Taylor%27s_Version)\">1989 (Taylor&#39;s Version)</a>&#39; in Los Angeles and on <a href=\"https://twitter.com/taylorswift13/status/1689521888903786496\">social media</a>.</p></li></ul><blockquote><p>Surprise!! 1989 (Taylor’s Version) is on its way to you 🔜! The 1989 album changed my life in countless ways, and it fills me with such excitement to announce that my version of it will be out October 27th. To be perfectly honest, this is my most FAVORITE re-record I’ve ever done… <a href=\"https://t.co/JFYOWhBxhj\">pic.twitter.com/JFYOWhBxhj</a></p><p>— Taylor Swift (@taylorswift13) <a href=\"https://twitter.com/taylorswift13/status/1689521888903786496?ref_src=twsrc%5Etfw\">August 10, 2023</a></p></blockquote><ul><li><p><b>Beyoncé’s</b> official site went even higher on our overall ranking than Swift’s. It appeared only on June 15, but reached #346. In the news that day (and the day before), the Financial Times reported that economists at Danske Bank believed that Beyoncé&#39;s decision to start her world tour in Stockholm led to a surge in local hotel prices that resulted in inflation in Sweden, calling it &quot;astonishing for a single event&quot;. At the time, June 15, Beyoncé had a Cologne, Germany, concert, where a fan gender reveal also made the news.</p></li><li><p><b>GitHub</b> is a top 50 site in our Overall ranking, and it showed clear growth in 2023, moving from #49 to #42 in November. It reached its highest point at #36 on January 19, when it announced reaching <a href=\"https://github.blog/2023-01-25-100-million-developers-and-counting/\">100 million developers</a>, and had another peak on May 12 at #38. Have any guesses about what contributed to these peaks (or any of the others you see in our report)? Let us know at @<a href=\"https://twitter.com/CloudflareRadar\">CloudflareRadar</a>.</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2o1gx4n4TxYDXV2u333Ph7/6eab5bce65785b0737f8568888e2b7d0/pasted-image-0--11--1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"543\" loading=\"lazy\"/>\n            \n            </figure><ul><li><p><b>Spotify</b>’s best day in 2023 was on Black Friday, November 24, when it reached #57, after showing significant growth throughout November. However, our list ends on November 25, so we couldn&#39;t capture the impact of the recently launched Spotify Wrapped.</p></li><li><p><b>NASA</b>. This year, NASA continued to showcase images from the James Webb Space Telescope. The NASA website peaked in our ranking on October 12 at #160, the day before the scheduled launch of <a href=\"https://www.jpl.nasa.gov/missions/psyche\">NASA&#39;s Psyche mission</a>, aimed at exploring a unique metal-rich asteroid. Another peak occurred on April 28 at #172, coinciding with a broadcasted <a href=\"https://www.c-span.org/video/?527453-1/nasa-conducts-spacewalk-international-space-station\">spacewalk</a> at the International Space Station.</p></li><li><p><b>SpaceX</b>. SpaceX had its best and only notable days in our ranking (within the overall top 500) on April 17 (#412), followed by April 20 (#416). April 17 marked <a href=\"https://en.wikipedia.org/wiki/SpaceX_Starship_integrated_flight_test_1\">SpaceX’s Starship orbital flight</a>&#39;s first attempt, which was aborted just before launch and then resumed on April 20.</p></li><li><p><b>Craigslist</b>. The American classified ads website saw a decline in our ranking this year, with its lowest point in November and its worst day on Black Friday, when it fell to #268.</p></li><li><p><b>DHL</b>. The courier service improved its ranking in 2023, with its best performance in November, peaking on Thanksgiving Day, November 23,  in the US at #211.</p></li><li><p><b>NFL</b> (National Football League). The NFL site had its first significant peak on April 29 at #189, the day of the NFL Draft, surpassing even the Super Bowl&#39;s popularity. This peak was matched only by weekends after September 10, when it climbed as high as #160.</p></li><li><p><b>Flightradar24</b>’s most-trafficked day was April 23, when an American Airlines flight made an <a href=\"https://www.cbsnews.com/news/american-airlines-plane-catches-fire-bird-strike-emergency-landing/\">emergency landing</a> in Ohio due to an engine fire. It rose to #176 on that day.</p></li><li><p><b>Waze</b>. The traffic app had lower rankings between June and early September (summer in the Northern Hemisphere), peaking on March 19 at #142 and on October 2 at #145.</p></li><li><p><b>Tides &amp; Currents.</b> The US Weather Service peaked on August 29-30 at #215 during <a href=\"https://www.reuters.com/world/us/floridas-gulf-coast-braces-major-hurricane-idalia-nears-landfall-2023-08-30/\">Hurricane Idalia</a>, described as &quot;an unprecedented event,&quot; as the storm approached Florida&#39;s Gulf Coast.</p></li></ul><h2>Wrap up: 2023, shifting AI and e-commerce tides</h2><p>The Internet plays a role in socializing, entertaining, working, communicating, learning, and staying informed when you most need it. In our popular Internet services rankings, the dominance of giants like Google and Facebook, and the relevance of TikTok and others, underscore the continued influence of established players in shaping online interactions and content consumption. However, the rise of generative AI services, notably OpenAI’s ChatGPT, signals an exciting sector that is rapidly gaining traction. Let&#39;s see where generative AI services can go in 2024.</p><p>In the social media realm, X/Twitter seems to be losing some influence in our ranking but continues to be highly influential, and much higher than the direct competition. Mastodon, Threads, and others still have a long way to go to compete. Although not seen as direct microblogging competition, Discord and Reddit continue to show growth.</p><p>An emerging player, Temu, made significant strides in the E-commerce realm. In the cryptocurrency space, Binance lost momentum as CoinGecko gained traction. In the gaming and metaverse sectors, the highlights included Roblox’s consistency and Oculus&#39;s growth.</p><p>Looking ahead, the trends observed in 2023 set the stage for an even more interconnected and technologically advanced future. The growing importance of AI, the steadfast popularity of social media, and the evolving dynamics in e-commerce and financial services suggest a future where humans will have to continue to adapt to the opportunities and challenges that lie ahead.</p><p>Creating rankings is a team effort that comes with its own challenges and requires careful attention and frequent updates. If you want to help us make these categorical rankings better, you can. <a href=\"mailto:radar@cloudflare.com\">Feedback</a> is appreciated, including regarding other categories to include in the 2024 Year in Review.</p><p><i>(Our data scientist, Sabina Zejnilovic, played a crucial role in accurately gathering the Internet services data and contributed to this blog post, as did David Belson with his guidance, along with many others.)</i></p>",
		"id": "715qE6knwIxpUY4qD7WD6B",
		"localeList": {
			"name": "From Google to Generative AI: ranking top Internet services in 2023 Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "Translated for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Building on similar reports we’ve done over the past two years, we have compiled a ranking of the top Internet properties of 2023.",
		"metadata": {
			"title": "From Google to Generative AI: ranking top Internet services in 2023",
			"description": "Building on similar reports we’ve done over the past two years, we have compiled a ranking of the top Internet properties of 2023.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4pf9h7RvwbW1l4PBF68RaH/26245868bf9c891af72c8fbabf7d7a9f/radar-2023-year-in-review-internet-services-zcO7vB.png"
		},
		"primary_author": {},
		"published_at": "2023-12-12T14:00:34.000+00:00",
		"reading_time": 23,
		"slug": "radar-2023-year-in-review-internet-services",
		"tags": [
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "0kgHdg1ytbdWl5BNo6bEa",
				"name": "Internet Traffic",
				"slug": "internet-traffic"
			}
		],
		"title": "From Google to Generative AI: ranking top Internet services in 2023",
		"updated_at": "2024-08-27T01:02:16.326Z",
		"url": "https://blog.cloudflare.com/radar-2023-year-in-review-internet-services"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}