{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Omer Yoachimik",
				"slug": "omer",
				"bio": "Product Manager / Cloudflare's DDoS Protection Service",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6TXRnB1v4ZHGiL3nRlvRTZ/946efe152cca5f55320466c0d3208fc1/omer.png",
				"location": "London",
				"website": null,
				"twitter": "@OmerYoahimik",
				"facebook": null
			}
		],
		"excerpt": "Over the past 6 months, volumetric DDoS attacks decreased by 82%. However volumetric attacks are not gone yet, still peaking as high as 418 Gbps. In this post, we cover the changing attack landscape and how Cloudflare adapts and evolves to keep the internet safe.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5W5CsUO2RhnmyIeV5wFB44/31b3d17e283116c684761b71a8a20e44/rolling-with-the-punches-shifting-attack-tactics-dropping-packets-faster-cheaper-at-the-edge.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2DbqrXlpAyfEpTUETBMopm/287f7dc96d2f74bfde135e8be75eef82/rolling-with-the-punches-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"859\" loading=\"lazy\"/>\n            \n            </figure><p>On Cloudflare’s 8th birthday in 2017, we announced <a href=\"/unmetered-mitigation/\">free unmetered DDoS Protection</a> as part of <a href=\"https://www.cloudflare.com/plans/\">all of our plans</a>, regardless if you’re an independent blogger using WordPress on Cloudflare&#39;s Free plan or part of a large enterprise operating global network infrastructures. Our <a href=\"https://www.cloudflare.com/ddos/\">DDoS protection</a> covers attack vectors on Layers 3-7; whether highly distributed and volumetric (rate-intensive) or small and sneaky. We protect over 26 million Internet properties, and at this scale, identifying small and sneaky DDoS attacks can be challenging, especially at L7. In this post, we discuss this challenge along with trends that we’ve seen, interesting DDoS attacks, and how we’ve responded to them so that you don’t have to worry.</p><h2>Let’s Talk Trends</h2><p>When analyzing attacks on the Cloudflare network, we’ve seen a steady decline in the proportion of L3/L4 DDoS attacks that exceed a rate of 30 Gbps in recent months. From September 2019 to March 2020, attacks peaking over 30 Gbps decreased by 82%, and in March 2020, more than 95% of all network-layer DDoS attacks peaked below 30 Gbps. Over the same time period, the average size of a DDoS attack has also steadily decreased by 53%, to just 11.88 Gbps. Yet, very large attacks have not disappeared: we’re still seeing attacks with intensive rates peaking at 330 Gbps on average and up to 400 millions packets per second.  Some of our customers are being targeted with as many as 890 DDoS attacks in a single day and 1,750 DDoS attacks in a month.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3joAEdLWc8mB18dQprjzIc/a551be124e7c593635468e3e79338a52/q0i46QeULPVxWcAfuK4gTb0C9AQmChut2XKPJMRdZjL9ULD9KamNiRuKnIa62ZKTXCv1ras6-fDcgMcnbEWCeup_Ih84iXvtaeFRCfMpFm743Wc1fsx3vzawRhC7.png\" alt=\"\" class=\"kg-image\" width=\"1571\" height=\"1078\" loading=\"lazy\"/>\n            \n            </figure><p>As the average rate of these L3/L4 attacks has decreased, they have become more localized and less geographically distributed. Increasingly, we’re seeing attacks hit just one or two of our data centers, which means that these hyper-localized attacks were launched in the catchment of the data center, otherwise <a href=\"https://www.cloudflare.com/learning/cdn/glossary/anycast-network/\">our Anycast network</a> would have spread the <a href=\"https://www.cloudflare.com/learning/security/what-is-an-attack-surface/\">attack surface</a> across our global fleet of data centers. Counterintuitively, these hyper-localized floods can be more difficult to detect on a global scale as the attack samples get diluted when aggregated from all of our data centers in the core. Therefore we’ve had to change our tactics and systems to roll with the change in attacker behavior.</p><p>Keeping things interesting in the penthouse floor of the OSI Model, over the same time period we’ve also observed some of the most rate-intensive and highly distributed L7 HTTP DDoS attacks we’ve ever seen. These attacks have pushed our engineering teams to invent even more efficient and intelligent ways to defend our network and our customers at scale. Let’s take a look at some of these trends and attacks.</p><h2>Changing L3/L4 DDoS Attack Trends</h2>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5eG1CLhUz5kNCnZPmeyTrf/6f09a600eebfa74afd9678f304245752/CZwIpS_wb4cuUg9Sa2pWikr_Nr2YksgRhg7pAxBAYaUtvWU0l6qTTgR4yc3uHH_gWkDcCrycg6o5UEeXBfp8s5JOe4HE6yq5YoewItWh1XvUY5ofvBuBFNNIt-Y3.png\" alt=\"\" class=\"kg-image\" width=\"1583\" height=\"1168\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/59c88tefHpHC4dvLACrJJg/73dd8a650de3e52dd1b23d12eebb6b28/jcTdopGvRKB4E5PCMh8ryNd32ZZN_9iYktQD2_-Xg_WMenzt47sel7lJ4djamjN25BTZ4DMs7z36QdRXbTTIZYT8ntNdgJsqPOY1ogJgtHSM6_onzMi5nSqRbQfz.png\" alt=\"\" class=\"kg-image\" width=\"1351\" height=\"935\" loading=\"lazy\"/>\n            \n            </figure><h2>Centrally Analyzed, Edge Enforced DDoS Mitigations</h2><p>Before we <a href=\"/who-ddosd-austin/\">released dosd late last year</a>, the primary automated system responsible for protecting Cloudflare and our customers against distributed rate-intensive attacks was <a href=\"/meet-gatebot-a-bot-that-allows-us-to-sleep/\">Gatebot</a>. Gatebot works by ingesting samples of flow data from routers and samples of HTTP requests from servers. It then analyzes these samples for anomalies, and when attacks are detected, pushes mitigation instructions automatically to the edge.</p><p>Gatebot requires a lot of computational power to analyze these samples, and correlate them across all the data centers, so it runs centrally in our “core” data centers, rather than at the edge. It does a terrific job at mitigating large attacks, and on average stops over 4,000 L3/L4 DDoS attacks every month.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4TWY74dHHxzxhGYEcJmvUy/303842603950c91392ea8a84a97d3d58/JUNzyXDiUO7aoitETVp2UhDCsRvIoklS-dEX4n7N4uixjiko1YTNu0BOp-tcWcUivJKCW_c9MWmh7id7X4eQ7YmPVKTPv_ILikwc-lrRjNWprccszAYxVbtcgX0B.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1016\" loading=\"lazy\"/>\n            \n            </figure><h2>Edge Analyzed, Edge Enforced Mitigations</h2><p>The persistent increase we’ve observed in smaller, more localized attacks was one of the main factors that drove us to develop a new, complementary system to Gatebot. We call this new system our denial of service daemon, or “dosd”, and this past month alone it mitigated 281,746 L3/4 DDoS attacks. This figure is roughly 55 times greater than what Gatebot dropped over the same period, thanks to dosd’s ability to detect smaller network attacks that would previously have flown under the radar (or taken longer to mitigate).</p><p>To complement the computationally heavy, centralized deployments of Gatebot, dosd was architected as a decentralized system that runs on every single server in every one of our data centers. Each instance detects and mitigates attacks independent of the other instances, or any sort of centralized data center whatsoever. As a result, the system is much faster than Gatebot, and can detect and mitigate attacks within 0-3 seconds (and less than 10 seconds on average). The speed of dosd enables it to generate real-time rules to quickly protect our customers at the data center. Then Gatebot, which samples traffic globally, can determine a mitigation that applies to all data centers if needed. In such a case, Gatebot will push rules to the data centers which will take priority over dosd’s rules.</p><p>dosd is also a leaner piece of software, consumes less memory and CPU, and significantly improves the resiliency of our network by removing the need to communicate with our core data centers to mitigate attacks. dosd detects and mitigates attacks using a similar logic to Gatebot’s methods, but in the scope of a single server, across a subset of servers in the same data center, or even across the entire data center.</p><h2>Changing L7 Trends</h2><p>Our automated Gatebot system is also tasked with mitigating L7 HTTP floods using request attributes as anomaly indicators. Mitigations can come in the form of actions such as JavaScript challenges, <a href=\"/moving-from-recaptcha-to-hcaptcha/\">CAPTCHAs</a>, Rate Limits (429), or Blocks (403) which are served back to the client as an error or challenge page. This form of mitigation at L7 allows the request to pass through TCP and TLS to the HTTP web server. During very rate-intensive attacks our servers can waste a lot of CPU and bandwidth as seen in the attack examples below.</p><h4>Example #1 - Highly Distributed DDoS Attack Targeting A Customer Website</h4><p>In July 2019, Cloudflare mitigated an HTTP DDoS attack that peaked at 1.4M requests per second. While this isn’t the most rate-intensive attack that we’ve seen, what is interesting is that the attack originated from almost 1.1M unique IP addresses. These were actual clients with the ability to complete a TCP and HTTPS handshake, they were not spoofed IP addresses. As it turns out, responding (rather than dropping at the network level) to over a million clients at a max rate of 1.4M requests per second can be quite costly.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2UUvQ1d0uGOr7ILfBNIsts/b133e747a029d35be241a51e134aa289/wPpbtCFQ-gxCLJjqL60kk1aWKMhyj2lBRZ5hD6rpdpnNMArwjEb6_UVLVbDs7SHe3y6R8fT2dMy_wb83MyZlSNB2hC8GqXcK2MPBVjoQS_cqcMkD7OVJfkh2nRQQ.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"671\" loading=\"lazy\"/>\n            \n            </figure><h4>Example #2 - Rate-Intensive DDoS Attack Targeting A Customer Website</h4><p>The second attack took place in September 2019. We mitigated an HTTP DDoS attack that peaked and persisted just below 5M requests per second for a little over an hour. What’s interesting is the sustained capability of the attacker to reach those rates from only 371K unique IPs (also not spoofed).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2kn4Ce5I34tDLMof4JF0XB/f1ad63ecbdb5d35c01b82a0b16748b81/0OCBo0FSxoL4OfCzVdIwoHIw0iI_uAVFXW8xJzQwNRzWfdcbwmtKNnHNu9FXKCr6rmM5NxwgKodA5Eo9L786_jDkaI66jJhORRBzro5175DiJgd0UpMZEm20PGb1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"704\" loading=\"lazy\"/>\n            \n            </figure><p>These attacks highlighted to us what needed to be optimized and consequently drove us to improve our L7 mitigations even more so, and significantly reduced the cost of mitigating an attack.</p><!--kg-card-begin: html--><h2><a id=\"jails\"></a>Using IP Jails to Reduce the Cost of Mitigation</h2><!--kg-card-end: html--><p>With the goal of reducing the computational cost to Cloudflare of mitigating rate-intensive attacks, we recently rolled out a new Gatebot capability called <b>IP Jails.</b> IP Jails excels at efficiently mitigating extremely rate-intensive and distributed HTTP DDoS attacks. It is triggered when an attack exceeds a certain request rate and then pushes the mitigation from the application layer (L7 in the OSI model) to the transport layer (L4). Therefore instead of responding with an error or challenge page from the proxy, we simply drop the connection for that IP. Mitigating at L4 is more computationally efficient, it reduces our CPU and memory consumption in addition to saving bandwidth. It allows us to keep mitigating the largest of attacks without sacrificing performance.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7uJUe3Uu2VCS1gPl5XvIs7/1dd545c9357e13a9a27049f6049b8f5f/s7f7-xay1962IbV0gbNbjR2HoddldyaTLw-1Ui_MU88zUHlE1T8PGYA1iUaT_IiCpELXFxVtQYpsqDjoPcdct3RWCu14r81gaoKvga9Nu2eYXtz5aE6hyN0UbG8K.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"676\" loading=\"lazy\"/>\n            \n            </figure><h3>IP Jails in action</h3><p>In the first graph below, you can see an HTTP flood peaking just below 8M rps before the IPs are ‘jailed’ for misbehaving. In the second graph, you can see that same attack being dropped as packets at L4.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/39JeCq3IYIXIf0dKq20uql/6adb5e60723d1f5ee3051d64b03bffd2/jWNKL_NJ0g5a0KrTvJjkgaW8DtOJxFMYC0sV139BtFWLWCccWJCMbm6V17acvT6UTmq4kznxZ7yRaKFlMZ53VNRGMpTtwtOcZt9TBPHGyU6CHQIy-JIbedXZG2jq.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"800\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5pyvdq8pYKp8AaYasy0BBT/c203fcaeb0dc1c3b28e6f23fdd7fdbd5/tHqYSlYaM-enIfuA-4B9N6IwLtTRrjAsOnJiIQtEDadnJ60YtfgRPy89vxjJtu-7mn41vOuYZcpYKTjSpTkLZKg0gvs_xvuq_kFj_pdUiCixGEJ1qQ2lATnh5WGR.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"831\" loading=\"lazy\"/>\n            \n            </figure><p>The flood requests generated over 130 Gbps in responses. IP Jails slashed it by a factor of 10.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/37y3RHy6lwjf7ht7hOQ2mT/affaba5ab8a2adbab28786457a6bdd1e/YL8n_f5Q_eQ9aljVISS3c7q_8QsGxNJFgZDG3LOsZnyut-cbsRqFc4n1HN9k7Z6MXNPJLADR2P_VhFntyphMpRkzteyNxdqnbzDC30VWR1oCjmT-o_CUBzN9m6f4.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"793\" loading=\"lazy\"/>\n            \n            </figure><p>Similarly, you can see a spike in the attack mitigation CPU usage which then drops back to normal after IP Jails kicks in.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/ZtRrT93b0d4mCvG8tuE0W/cc8270d531f1072b2f7a0e2d086d3894/ykYO0ElkwVuz8-v85fCiPTzcIT2kvLYDY16cAF7n6erl3qqnpKn9-ymawbfEK5QXb3rSfP2ECmthdYF2aXf7SbCGFvlN8a5LMDm9k91YX5uk2JDZL0OMXv4AxrvM.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"799\" loading=\"lazy\"/>\n            \n            </figure><!--kg-card-begin: html--><h2><a id=\"low\"></a>Using Origin Errors to Catch Low-Rate Attacks</h2><!--kg-card-end: html--><p>We see one or two of these rate-intensive attacks every month. But the vast majority of attacks we observe are mostly of a lower request rate, trying to sneak under the radar. To tackle these low-rate attacks better, last month we completed the rollout of a new capability that synchronizes Gatebot’s detection sensitivity with our customers’ origin server health. Gatebot uses the origin’s error response codes as an additional adaptive feedback signal.</p><p>However, when we take a step back and think about what a DDoS attack is actually, we usually think of a malicious actor that targets traffic at a specific website or IP address with the intent to degrade performance or cause an outage. However, malicious attackers are not the only threats to your applications availability.</p><p>As the migration of functionality to the edge increases, the cloud becomes smarter and more powerful, which often allows administrators to scale down their origin servers and infrastructure leaving the origin server weaker and under-configured. Evidently, there are many cases where an origin was taken down by small floods of traffic that were neither malicious nor generated with bad intentions. These floods may be generated by an overly excited good bot or even faulty client applications calling home too frequently. Fixing a home-sick client application or strengthening a server can be lengthy and costly processes during which the origin remains susceptible. Consequently, if a website is taken offline, no matter the reason, the end-users still experience it as if it were an attack.</p><p>Therefore this new capability not only protects our customers against DDoS attacks, but also protects the origin against all kinds of unwanted floods. It is designed to protect every one of our customers; big or small. It&#39;s available on all of our plans including the Free plan.</p><p>When an origin responds to Cloudflare with an increasing rate of errors from the <a href=\"https://support.cloudflare.com/hc/en-us/articles/115003011431-Troubleshooting-Cloudflare-5XX-errors#500error\">500 range (Internal Server Error)</a>, Gatebot initiates automatically and analyzes traffic to reduce or eliminate the impact on the origin even faster than before. The current error rate is also compared to the average error rate to minimize false positives. Once an attack is detected, dynamically generated, ephemeral mitigation rules are propagated to Cloudflare’s edge data centers to mitigate the flood. Mitigation rules may use a block action (403), rate-limit (429), or even a challenge based on the fingerprint logic and confidence.</p><p>In March 2020, we mitigated 812 HTTP DDoS attacks on average every day, and approximately 20,000 HTTP DDoS attacks in total.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/bfXixOUm8kvnnOa1SZpbc/5b7b04cbac47d94ce700a594b0648103/L7ot8MjARYP5hZIbfIqfzvpDXDpGkr_eH0nF6UVANSSHc1UzffFpDRphu-RTDNcHNotFq4wTq0JzykrIhqNo8YCq84dBs-icBq6sZo70E9s4YIrTR4q9quw8l78u.png\" alt=\"\" class=\"kg-image\" width=\"1201\" height=\"763\" loading=\"lazy\"/>\n            \n            </figure><h2>Don’t Take Our Word For It, See For Yourself</h2><p>Whether it&#39;s Gatebot or dosd that mitigated L3/4 DDoS attacks, you can see both types of attack events for yourself in our new <a href=\"/announcing-network-analytics/\">Network Analytics dashboard</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/62V75gOCd05pgb2wjZ3u3/26f18f0c79020bd5fd283ed7976bd044/Pqgbs8yPSs-dy7BAmb8Ev23wGzaGcIvpCTJhYTkdidPQpHmQ_deHbfPzuSGISoPuEA86qaauD4YOmM-km7EKjrZts6S_zFxxkmt-NEAjMyLFwWOoCrldCGwg3pzk.png\" alt=\"\" class=\"kg-image\" width=\"1135\" height=\"564\" loading=\"lazy\"/>\n            \n            </figure><p>Today this dashboard provides Magic Transit &amp; BYOIP customers real-time visibility into L3/4 traffic and DDoS attacks, and in the future we plan to expand access to customers of our other products.</p><p>Visibility into L7 DDoS attacks is available to our WAF/CDN customers that have access to the <a href=\"/new-firewall-tab-and-analytics/\">Firewall Analytics dashboard</a>.</p><h2>Unmetered DDoS Protection For All</h2><p>Whether you’re part of a large global enterprise, or use Cloudflare for your personal site on the Free plan, we want to make sure that you’re protected and also have the visibility that you need.</p><p>DDoS Protection is included as part of every Cloudflare service; from <a href=\"https://www.cloudflare.com/en-gb/magic-transit/\">Magic Transit</a> at L3, through <a href=\"https://www.cloudflare.com/en-gb/products/cloudflare-spectrum/\">Spectrum</a> at L4, to the <a href=\"https://www.cloudflare.com/en-gb/waf/\">WAF/CDN service</a> at L7. Our mission is to help build a better Internet – and this means a safer, faster, and more reliable Internet. For everyone.</p><p>If you’re a Cloudflare customer of any plan (Free, Pro, Business or Enterprise), these new protections are now enabled by default at no additional charge.</p>",
		"id": "uDxBL74h0EGjigSDc99yP",
		"localeList": {
			"name": "Rolling With The Punches: Shifting Attack Tactics & Dropping Packets Faster & Cheaper At The Edge Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Over the past 6 months, volumetric DDoS attacks decreased by 82%. However volumetric attacks are not gone yet, still peaking as high as 418 Gbps.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2020-04-10T12:00:00.000+01:00",
		"reading_time": 9,
		"slug": "rolling-with-the-punches-shifting-attack-tactics-dropping-packets-faster-cheaper-at-the-edge",
		"tags": [
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "7qTIAO0WLKVKPVrj8q1vpD",
				"name": "Magic Transit",
				"slug": "magic-transit"
			},
			{
				"id": "3yArjf0gLKZy8ObEDxbNNi",
				"name": "Trends",
				"slug": "trends"
			}
		],
		"title": "Rolling With The Punches: Shifting Attack Tactics & Dropping Packets Faster & Cheaper At The Edge",
		"updated_at": "2024-08-27T02:03:30.146Z",
		"url": "https://blog.cloudflare.com/rolling-with-the-punches-shifting-attack-tactics-dropping-packets-faster-cheaper-at-the-edge"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}