{
	"initialReadingTime": "13",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Martin J Levy",
				"slug": "martin-levy",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1WFEW1m2I5kRmXiq1bAGLv/97bef2575960860f1d2fc20bad1e29ec/martin-levy.jpeg",
				"location": null,
				"website": null,
				"twitter": "@mahtin",
				"facebook": null
			}
		],
		"excerpt": "We have talked about the BGP Internet routing protocol before. We have talked about how we build a more resilient network and how we can see outages at a country-level via BGP. We have even talked about the network community that is vital to the operation of the global Internet.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3ascn9dfuDu4OpyTPkiyJ6/bc01c5077076e5690c3dc363e685f80a/rpki.jpg",
		"featured": false,
		"html": "<p>We have talked about the BGP Internet routing protocol before. We have talked about how we build a <a href=\"/the-internet-is-hostile-building-a-more-resilient-network/\">more resilient network</a> and how we can see <a href=\"/the-story-of-two-outages/\">outages at a country-level</a> via BGP. We have even talked about the <a href=\"/nanog-the-art-of-running-a-network-and-discussing-common-operational-issues/\">network community</a> that is vital to the operation of the global Internet.</p><p>Today we need to talk about why existing operational practices for BGP routing and filtering have to significantly improve in order to finally stop route leaks and hijacks; which are sadly pervasive in today’s Internet routing world. In fact, the subtle art of running a BGP network and the various tools (both online and within your a networks subsystems) that are vital to making the Internet routing world a safe and reliable place to operate need to improve.</p><p>Internet routing and BGP and security along with its operational expertise must improve globally.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5yV7wTNobUDVMktWwaoTPB/b27bab966fcd34c0ca549e3fd87aa7a4/33673974352_3085c34cb5_o.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1333\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://www.flickr.com/photos/30478819@N08/33673974352/\">photo</a> by <a href=\"https://www.flickr.com/photos/30478819@N08/\">Marco Verch</a> by/2.0</p><p>Nothing specific triggered today’s writing except the fact that Cloudflare has decided that it&#39;s high-time we took a leadership role to finally secure BGP routing. We believe that each and every network needs to change its mindset towards BGP security both on a day-by-day and a long-term basis.</p><p>It&#39;s time to stop BGP route leaks and hijacks by deploying operationally-excellent RPKI!</p><h3>Cloudflare commits to RPKI</h3><p>Resource Public Key Infrastructure (RPKI) is a cryptographic method of signing records that associate a BGP route announcement with the correct originating AS number. RPKI is defined in <a href=\"https://tools.ietf.org/html/rfc6480\">RFC6480</a> (An Infrastructure to Support Secure Internet Routing). Cloudflare commits to RPKI.</p><p>Because any route can be originated and announced by any random network, independent of its rights to announce that route, there needs to be an out-of-band method to help BGP manage which network can announce which route. That system exists today. It&#39;s part of the <a href=\"http://www.irr.net/\">IRR</a> (Internet Routing Registry) system. Many registries exist, some run by networks, some by RIRs (Regional Internet Registries) and the grand daddy of IRRs, Merit&#39;s <a href=\"https://radb.net\">RADB</a> service. This service provides a collective method to allow one network to filter another networks routes.</p><p>This works somewhat. An invalid announcement is normally squashed near-instantly as the route crosses an ASN boundary because one network is meant to filter the other network (based on rules created from the IRR database). This of course doesn’t happen perfectly - in fact, far from it. Route leaks or route hijacks happen more often than they should. A fact that is well documented. Here’s the highlights:</p><ul><li><p>1997 - AS7007 mistakenly (re)announces 72,000+ routes (becomes the poster-child for route filtering).</p></li><li><p>2008 - ISP in Pakistan <a href=\"https://www.wired.com/2008/02/pakistans-accid/\">accidentally</a> announces IP routes for YouTube by blackholing the video service internally to their network.</p></li><li><p>2017 - Russian ISP leaks 36 prefixes for payments services owned by Mastercard, Visa, and major banks.</p></li><li><p>2018 - BGP hijack of Amazon DNS to <a href=\"/bgp-leaks-and-crypto-currencies/\">steal crypto currency</a>.</p></li></ul><p>That’s just a partial list! Each route leak or hijack exposes a lack of route filtering by the network that peers or transits the offending network.</p><p>RPKI comes into the picture because the existing IRR system lacks any form of cryptographic signing for its data. In fact, today the IRR databases contain plenty of invalid data (both stale data and typo’ed data). There&#39;s very little control over the creation of invalid data.</p><p>Implementing RPKI is just the first step in better BGP route security because RPKI only secures the route origin; it doesn&#39;t secure the path. (Sadly the same is true for IRR data). When we want to secure the path; we are going to need something else; but that comes later.</p><h3>The RPKI TL;DR</h3><p>BGP routing isn’t secure. Its main hope, RPKI, uses a certificate system that’s akin to secure web browsing (or at-least its early days). While secure web browsing has moved on and is far more secure and is somewhat the <a href=\"/today-chrome-takes-another-step-forward-in-addressing-the-design-flaw-that-is-an-unencrypted-web/\">default</a> these days, the state of BGP route validation has not moved forward. To secure BGP routing, all networks would need to be embrace RPKI (and more). Cloudflare proposes to plot a course to improve BGP routing-security globally by setting an example and implementing best practices, installing operationally excellent software and promoting its RPKI effort worldwide. RPKI is one of our focuses in 2018 and beyond!</p><h3>The simplest introduction to BGP possible</h3><p>BGP isn’t simple. BGP on the global Internet doubly-so. This fact should not deter either the casual reader or the seasoned network engineer. What is important is to place the limit around what is worth knowing about and discarding all the minor items that make up the very complex world of BGP networking. In fact, to operate a BGP enabled network connected to a telco or ISP isn’t that complicated. It turns out that in the world of BGP, security is an afterthought.</p><p>Lets begin.</p><p>I’m going to pick a hypothetical example. The configuration of a single university within a country that operates an NREN (National Research &amp; Education Network) for all it&#39;s universities. This is not uncommon. The university in this case is connected via a single telecommunications link and (using BGP terminology) has a single upstream. The NREN provides all the connectivity to the local and global Internet for its countries universities, along with connectivity to other NRENs in other countries.</p><p>We start with some basics. BGP is about numbers. First off is a unique number called the Autonomous System Number or ASN. This number comes from a range of numbers that are managed by the RIRs (Regional Internet Registries). For example, Cloudflare has the AS number 13335 allocated for its network. ASNs were just 16-bit numbers, but are now 32-bit numbers (because the internet grew to the point of running out of the 65,536 or 2^16 initial allocation). For our university, we will use 65099 as our example ASN. This is from the reserved block of ASNs and used here for documentation reasons only.</p><p>The second number is the IP addresses allocated to the university. Most reader are familiar with IP addresses; however in the BGP world we use IP blocks called CIDRs (Classless Inter-Domain Routing). This is a range of IP addresses that are sequential and bonded on binary boundaries. Within Cloudflare, we have quite a few IP blocks allocated by the RIRs. For our example, we will assume the university has two blocks allocated. 10.0.0.0/8 and 2001:db8::/32 . Both these are private or documentation addresses and later-on you’ll see these show up again in a different manner when we talk about filtering.</p><p>This is enough for us to get this university ready to connect to the NREN. Or maybe not.</p><h3>Ready to connect</h3><p>Hold on a second - there’s paperwork to fill-in. Not actual paper; but close enough. While the internet is build on the concept of <a href=\"https://www.ietf.org/blog/2013/05/permissionless-innovation/\">permissionless innovation</a>, there’s still good practices that still need to be adhered too.</p><p>Before you can announce a route via your BGP speaking router, you need to setup either an IRR route object or an RPKI ROA (or both).</p><h3>Internet Routing Registries</h3><p>The IRR (Internet Routing Registries) is used to record a route that will be announced on the Internet and associate it with the ASN that will announce it. In this example we will use the private or documentation ranges of 10.0.0.0/8 and 2001:db8::/32 along with ASN 65099. The simplest IRR routing record looks like this:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">route:\t10.0.0.0/8\norigin:\tAS65099</pre></code>\n            <p>In reality, we need a lot more to make it fully-functional and we need a place to upload this routing record. You could use your RIR to host your IRR data, or you could use global services like <a href=\"https://radb.net/\">RADB</a> or <a href=\"https://altdb.net/\">ALTDB</a>. You can also use your transit provider in some cases. Once you have an account setup on one of these services, you will be ready to upload these routing record (how you upload it is very specific to the IRR chosen).</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">route:\t10.0.0.0/8\ndescr:\tUniversity of Blogging\ndescr:\tAnytown, USA\norigin:\tAS65099\nmnt-by:\tMNT-UNIVERSITY\nnotify:\tperson@example.com\nchanged:\tperson@example.com 20180101\nsource:\tRADB</pre></code>\n            <p>That last line reflects where you store your IRR routing record.</p><h3>IRR for your ASN</h3><p>Just like your IP network blocks, its also good to place a record for your ASN in the IRR. When you networking gets more complex, this will be solidly needed. It doesn’t hurt to add it now.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">aut-num:    AS65099\nas-name:    UNIVERSITY-OF-BLOGGING-AS\ndescr:      University of Blogging\ndescr:      Anytown, USA\nmnt-by:     MNT-UNIVERSITY\nnotify:     person@example.com\nchanged:    person@example.com 20180101\nsource:     RADB</pre></code>\n            <p>You can check for their existence using the classic command line whois command (or the RADB website).</p><p>One last item needs to be completed; but not by you.</p><p>Your ASN needs to be placed in the as-set of your upstream ISP (or service provider). The entry in there will provide the rest of the global Internet an indication that your ASN is allowed to be routed via your upstream (the NREN in this case). If all goes well, something like this will show up in the IRRs.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">as-set:     AS-NREN\ndescr:      NREN of country XX\nmembers:    ...\nmembers:    AS65099\nmembers:    ...\nmnt-by:     MNT-NREN\nnotify:     person@example.edu\nchanged:    person@example.edu 20180101\nsource:     RADB</pre></code>\n            <p>The members area of this as-set provides a list of ASNs that are announced by the upstream (the ASN). We have not defined the upstreams ASN yet, so lets pretend they are ASN 65001 (this ASN is still from the documentation range).</p><h3>Getting the university online</h3><p>BGP (like everything in networking) needs some configuration setup. This configuration would exist on a network router at the edge of your network, or whatever device is being used to connect the local network to the upstream (the NREN). We are using a very simple router config here to show the minimum configuration needed. Your configuration language could be different.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">router bgp 65099\nneighbor 192.168.0.2 remote-as 65001\nneighbor 192.168.0.2 prefix-list as65001-listen in\nneighbor 192.168.0.2 route-map as65001-listen in</pre></code>\n            <p>This is a very trivial example (it’s missing a complete filter configuration that’s normally required). The key point is that the router doesn’t contain any code or language regarding the IRR entries shown above. That’s because the IRR entries are out-of-band. They exist outside of the BGP protocol. In other words, it takes more than just configuring a BGP session in order to actually connect to the global Internet.</p><p>The key filtering comes into play on the upstream (the NREN in this example). It’s the job of that network to confirm everything heard from its customer.</p><h3>RPKI vs IRR - why is it so important?</h3><p>Two global databases are being discussed today. IRR &amp; RPKI. While IRR is clearly in use today; it’s not the primary focus herein. However, it’s the de-facto bridging option for route filtering today.</p><p>As stated above, Internet Routing Registries (IRRs) have a very loose security model. This has been known for a long time. Records exist within IRRs that are both clearly wrong and/or are clearly missing. There’s no cryptographic signing of records. There are multiple suppliers of IRR data; some better than others. IRR still has some proponents that want to clean up its operational data (including the author of this blog). Efforts like <a href=\"https://github.com/irrdnet/irrd4/\">IRRD4</a> (by Job Snijders @ NTT) could help clean-up IRR usage. IRR is not the main focus herein.</p><p>Resource Public Key Infrastructure (RPKI) is a cryptographic method of signing records that associate a route with an originating AS number. Presently the five RIRs (AFRINIC, APNIC, ARIN, LACNIC &amp; RIPE) provide a method for members to take an IP/ASN pair and sign a ROA (Route Origin Authorization) record. The ROA record is what we need to focus on.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5vo7EQoqPim1Fq7Qio5Wqg/b2e5c2beba86c8158b42e6f0ce7c8dcf/roas_3x-2.png\" alt=\"\" class=\"kg-image\" width=\"1471\" height=\"1032\" loading=\"lazy\"/>\n            \n            </figure><p>Once a route is signed; it can propagate to anyone that wants to use the data to filter routing or monitor this data as ROAs are public. A ROA is a digitally signed object that makes use of <a href=\"https://tools.ietf.org/html/rfc3852\">RFC3852</a> Cryptographic Message Syntax (CMS) as a standard encapsulation format. In fact ROAs are X.509 certificates as defined in <a href=\"https://tools.ietf.org/html/rfc5280\">RFC5280</a> (Internet X.509 Public Key Infrastructure Certificate) and <a href=\"https://tools.ietf.org/html/rfc3779\">RFC3779</a> (X.509 Extensions for IP Addresses and AS Identifiers).</p><p>As the ROA is a digitally signed object, it provides a means of verifying that an IP address block holder has authorized an AS (Autonomous System) to originate routes to that one or more prefixes within the address block. The RPKI system provides an attestation method for BGP routing.</p><blockquote><p>define attestation: ... the action of bearing witness ... something which bears witness, confirms or authenticates</p></blockquote><p>The existence of routing information (an IP block plus the matching ASN) within a valid certificate (i.e. something that can be validated against the RIRs authoritative data cryptographically) is the missing part of the BGP security system and something that the IRR system can&#39;t provide. You really know who should be doing what with a BGP route.</p><h3>Where are the certificates if they are not in the BGP protocol?</h3><p>Good question. As we said above, the routing databases are outside of the BGP protocol. Both IRR and RPKI use a third-party entities to hold the database information. The difference is that with RPKI the same entity that allocated or assigned a numeric resource (like an IP address or ASN) also holds the CA (Certificate Authority) used to validate the ROAs record.</p><p>In the RPKI world; CAs are called TAs, or Trust Anchors. However, if you are familiar with the web security model, then you are familiar with what a TA is.</p><h3>Who could operate a TA?</h3><p>Today the five RIRs are the TAs for RPKI. This makes sense. Only the RIRs know who is an owner of IP space (and ASs). The present day RPKI systems operate in conjunction with existing RIR login credentials. Once you can login to a portal and control your IP allocations and ASN allocations; then you can also create, edit, modify, and delete RPKI data in the forms of ROAs. This is the basis of how RPKI separates itself from the IRR. You can only sign your own resources. You can’t just randomly create data. If you lose your RIR allocation, then you lose the RPKI data.From a policy point of view, there are some interesting issues that become apparent pretty quickly. First off, an ISP with an allocation needs to keep its RIR membership up to date (i.e. pay its dues). Second, it needs to be aware that the RIR and the ISP could be legal entities based in different countries and hence international law plays a role in any dispute between the ISP and RIR or in fact any third party that gets involved in an IP address dispute. This has been a concern within the RIPE (Europe, the Middle East and parts of Central Asia) region as RIPE is based in The Netherlands. Similarly, ARIN (North America and parts of the Caribbean) is a US entity.</p><h3>Which RIR for which IP address?</h3><p>Presently, because of the large amount of IP address transfers occurring between some RIR regions, the RIRs changed their TA root certificates so that each RIR includes every available IP address (0.0.0.0/0 &amp; ::/0) and every available AS number (0-4,294,967,295). IP numeric space and ASN numeric space are well defined as follows:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">IPv4: 0.0.0.0 - 255.255.255.255\nIPv6: 0000:0000:0000:0000:0000:0000:0000:0000 - ffff:ffff:ffff:ffff:ffff:ffff:ffff:ffff\nASN:  1 - 4,294,967,295 (AS 0 is unused)</pre></code>\n            <p><a href=\"https://www.iana.org/\">IANA</a> (Internet Assigned Numbers Authority) holds the master list for this space and divvies it up the five RIRs as allocations or assignments. The IPv4 and IPv6 assignments can be seen <a href=\"https://www.iana.org/assignments/ipv4-address-space/ipv4-address-space.xhtml\">here</a> and  <a href=\"https://www.iana.org/assignments/ipv6-unicast-address-assignments/ipv6-unicast-address-assignments.xhtml\">here</a>. ASNs can be found <a href=\"https://www.iana.org/assignments/as-numbers/as-numbers.xhtml\">here</a>. For example, here’s an abbreviated overview into how IPv6 space is allocated to various RIRs.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Prefix         Designation    Date          WHOIS         Status\n2001:0000::/23 IANA        1999-07-01 whois.iana.org     ALLOCATED\n2001:0200::/23 APNIC       1999-07-01 whois.apnic.net    ALLOCATED\n2001:0400::/23 ARIN        1999-07-01 whois.arin.net     ALLOCATED\n...\n2001:1200::/23 LACNIC      2002-11-01 whois.lacnic.net   ALLOCATED\n...\n2001:4200::/23 AFRINIC     2004-06-01 whois.afrinic.net  ALLOCATED\n...\n2002:0000::/16 6to4        2001-02-01                    ALLOCATED\n...\n2a00:0000::/12 RIPE NCC    2006-10-03 whois.ripe.net     ALLOCATED\n2c00:0000::/12 AFRINIC     2006-10-03 whois.afrinic.net  ALLOCATED\n...</pre></code>\n            <p>As stated above; each RIR holds a root key (a TA, or Trust Anchor) that provides them the ability to create signed records below their root. Below that TA there is a certificate that covers the exact space allocated or assigned to the specific RIR. This allows the TA to be somewhat static (or stable) and the RIR to update the underlying records as-needed.</p><h3>Who is implementing RPKI today?</h3><p>Sadly not enough people or networks. While each RIR is supporting RPKI for its members; the toolset for successfully operating a network with RPKI enabled route filtering is still very limited.</p><p>It turns out that IXP (Internet Exchange Points) have started to realize that filtering using RPKI is a valid option for their route-servers.</p><p>In addition, a handful of networks are also participating in both signing IP routes and verifying IP routes via RPKI. This isn’t quite enough to secure the global Internet yet.</p><p>Then there&#39;s the Dutch!</p><p>In early September, the NLNOG technical meeting featured a non-trivial number of RPKI-related talks. It seems that local Dutch operators and software developers are taking RPKI seriously and it’s possible that The Netherlands may contain some of the more forward-thinking RPKI networks around. Read more <a href=\"https://nlnog.net/nlnog-day-2018/\">here</a>.</p><h3>Mutually Agreed Norms for Routing Security (MANRS)</h3><p>The Internet Society (Cloudflare is a strong supporter of this organization) has pushed an initiative called <a href=\"https://www.internetsociety.org/issues/manrs/\">MANRS</a> (Mutually Agreed Norms for Routing Security) in order to convince the network operator community to implement routing security. It focuses on Filtering, Anti-spoofing, Coordination, and Global Validation. The Internet Society is doing a good job in educating networks on the importance of better routing security. While they do educate networks about various aspects of running a healthy BGP environment; it&#39;s not an effort that creates any of the required new technologies. MANRS simply promotes best-practices, which is a good start and something Cloudflare can collaborate on. That all said, we think it’s simply too-polite an effort as it doesn’t have enough teeth to quickly change how networks behave.</p><p>Cloudflare also wants to move the BGP community further along the RPKI path. Our operational efforts can, and should, coexist with The Internet Society’s MANRS initiative; however, we&#39;re focusing on operationally viable solutions that help move the global network community much further along.</p><h3>How is RPKI deployed in a real operational network</h3><p>As network operators don’t want to run an cryptographic software on the control plane of a router (or even have RPKI data anywhere near the control plane), the normal deployment is to pair routers with a server.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5GM31tWc9wRdNWY9U631S7/2c70d2ae85ba7f54d3658a47268847cc/RPKI-diagram-_3x-3.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1043\" loading=\"lazy\"/>\n            \n            </figure><p>The server runs all the RPKI code (including the crypto processing of the TA, the certificate tree, and the ROAs). When the router sees a new route, the router send a simple message across a communications path (that includes the origin AS plus the IP route). The server, running a validator, responds with a yes/no answer that drives the filtering of that BGP route. This lightweight protocol is defined in <a href=\"https://tools.ietf.org/html/rfc6810\">RFC6810</a>, then updated later to include some BGPsec support in <a href=\"https://tools.ietf.org/html/rfc8210\">RFC8210</a> (The Resource Public Key Infrastructure (RPKI) to Router Protocol). This lightweight protocol is nicknamed “RTR”.</p><p>Present implementations include <a href=\"https://github.com/rtrlib/rtrlib\">https://github.com/rtrlib/rtrlib</a> (in ‘C’) and NIST’s package <a href=\"https://www.nist.gov/services-resources/software/bgp-secure-routing-extension-bgp-srx-prototype\">https://www.nist.gov/services-resources/software/bgp-secure-routing-extension-bgp-srx-prototype</a> which is based on quagga; hence not usable in production.</p><p>Operationally, neither are fully usable within production environments.The RIPE validator <a href=\"https://github.com/RIPE-NCC/rpki-validator-3\">https://github.com/RIPE-NCC/rpki-validator-3</a> (written in Java) can produce filter sets similar to IRR tools and seems to be the most prevalent tool for the limited number of RPKI setups found in networks today. There&#39;s recently a software release from NLnet Labs research group which is Rust-based. Their RPKI validator is called <a href=\"https://github.com/NLnetLabs/routinator\">Routinator 3000</a>.</p><p>The industry still needs some more operationally-focused software!</p><h3>Can everyone participate in RPKI routing filtering?</h3><p>Yes. No. Maybe. Ask your lawyers.</p><p>For many years there’s been a solid discussion about the role of the RIRs as holders of the private key of the CA at the top of their tree. Five trees. IANA was meant to run a single root above them (similar to how DNSSEC works with one key held at the DNS root - or dot); but that didn’t happen for many reasons including the fact that IANA/ICANN was essentially reporting to the US government back when this was all being setup. The RIR setup has stuck and at this point no-one expects IANA to ever hold a single root certificate, plus it’s all historic at this point and not worth rehashing here.</p><p>This is not a major operational issue; however it does have some slight consequences. While having five roots could be considered a messy setup, it actually matches the web space CA model.</p><p>Some RIR regions have special issues. <a href=\"https://arin.net/\">ARIN</a> (in North America and portions of the Caribbean) has a TA and ROAs; but wants full indemnification should the data be wrong or used incorrectly. In the <a href=\"https://ripe.net/\">RIPE</a> region (Europe, ME &amp; Russia), the members voted down full support for RPKI because they didn’t want to have a Dutch entity (RIPE NCC) hold a certificate for a non-Dutch entity and have a Dutch LEA letter shutdown a network by forcing that certificate to be invalidated. Read their respective terms of service:</p><ul><li><p>ARIN at <a href=\"https://www.arin.net/resources/rpki/tal.html\">https://www.arin.net/resources/rpki/tal.html</a> &amp; <a href=\"https://www.arin.net/resources/rpki/rpa.pdf\">https://www.arin.net/resources/rpki/rpa.pdf</a></p></li><li><p>RIPE at <a href=\"https://www.ripe.net/manage-ips-and-asns/resource-management/certification/legal/ripe-ncc-certification-repository-terms-and-conditions\">https://www.ripe.net/manage-ips-and-asns/resource-management/certification/legal/ripe-ncc-certification-repository-terms-and-conditions</a></p></li></ul><p>The legal issues aren’t the focus of this blog entry; but it will be obvious later when implementing RPKI as-to-why the legal issues become an impediment to successful global RPKI deployment.</p><h3>IRR - legacy or bridging solution?</h3><p>Everyone assumes that IRR will ultimately go away; however, that’s a long long way out. There’s efforts underway to make IRR data cleaner, and in some cases, to (finally) link the underlying RPKI &amp; IRR data together. They are very similar data; but with different security models.</p><p>This blog post was written with RPKI as the go-forward methodology in mind and hence does not need to address all the subtle issues around IRR brokenness. It would be a whole fresh blog post to address the legacy issues within IRR. That said, it’s clear that RPKI isn’t today a complete substitute for all the IRR data (and RPSL/RPSLng data) that exists today. The good news is that there’s work within the IETF and drafts in-flight to cover that. RPKI is a good protocol to base route filtering on and Cloudflare will be rolling out full support for RPKI enabled filtering and route announcements within its global network.</p><p>If you look back at the examples above of the university and its NREN, then realize that in the RPKI world the same information is being stored; however, the validity and attestation of the data increases n-fold once RPKI becomes the universal mechanism of choice.</p><p>Cloudflare wants to see this happen and will push for RPKI to become mainstream within the BGP world. We want to squash the existence of BGP route leaks and hijacks forever!</p><h3>Next steps</h3><p>Read the <a href=\"/rpki-details/\">RPKI and BGP: securing our part of the Internet</a> blog entry to follow what we are doing on the technical side for Cloudflare’s RPKI implementation.</p><p><a href=\"/subscribe/\"><i>Subscribe to the blog</i></a><i> for daily updates on our announcements.</i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/yhey6ViCRukh886HRpCSS/8dba09af1be1ab26a6fc9d646ce8c16b/Crypto-Week-1-1-2.png\" alt=\"\" class=\"kg-image\" width=\"1808\" height=\"925\" loading=\"lazy\"/>\n            \n            </figure>",
		"id": "4NOd59Z9YIyJ6Lq7qxXZ58",
		"localeList": {
			"name": "RPKI - The required cryptographic upgrade to BGP routing Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2018-09-19T13:00:00.000+01:00",
		"slug": "rpki",
		"tags": [
			{
				"id": "5grQBv96AL5Ck0c8I54a0f",
				"name": "Crypto Week",
				"slug": "crypto-week"
			},
			{
				"id": "5O7yCWW0RgXMAc5MVjwcGS",
				"name": "BGP",
				"slug": "bgp"
			},
			{
				"id": "WDGNmuLDEdkUgarnyuP8w",
				"name": "RPKI",
				"slug": "rpki"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			}
		],
		"title": "RPKI - The required cryptographic upgrade to BGP routing",
		"updated_at": "2024-08-27T02:18:58.524Z",
		"url": "https://blog.cloudflare.com/rpki"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}