{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Sam Howson",
				"slug": "sam-howson",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1FlPblLla45mMnAKDsLrGL/45e6f1a9e3228e4e1cd09dcdd6b44d29/sam-howson.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Engineers at Cloudflare have written a replacement in Rust for one of the oldest and least-well understood parts of the Cloudflare infrastructure, cf-html, which is an NGINX module. In doing so we learned a lot about how NGINX works, and paved the way to move away from NGINX entirely.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7Lvl62fhVqhaZBHf0NReLu/cf3eca6e7176371b678b9e98669bfb35/rust-nginx-module.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/FA5J1NlU3N4hakq0et4EV/b50c1771828bacdaaf2938b6ed3557cb/ROFL-with-a-LOL--rewriting-an-NGINX-module-in-Rust-OG.png\" alt=\"ROFL with a LOL: rewriting an NGINX module in Rust\" class=\"kg-image\" width=\"1600\" height=\"900\" loading=\"lazy\"/>\n            \n            </figure><p>At Cloudflare, engineers spend a great deal of time refactoring or rewriting existing functionality. When your company doubles the amount of traffic it handles every year, what was once an elegant solution to a problem can quickly become outdated as the engineering constraints change. Not only that, but when you&#39;re averaging 40 million requests a second, issues that might affect 0.001% of requests flowing through our network are big incidents which may impact millions of users, and one-in-a-trillion events happen several times a day.</p><p>Recently, we&#39;ve been working on a replacement to one of our oldest and least-well-known components called cf-html, which lives inside the core reverse web proxy of Cloudflare known as FL (Front Line). Cf-html is the framework in charge of parsing and rewriting HTML as it streams back through from the website origin to the website visitor. Since the early days of Cloudflare, we’ve offered features which will rewrite the response body of web requests for you on the fly. The first ever feature we wrote in this way was to replace email addresses with chunks of JavaScript, which would then load the email address when viewed in a web browser. Since bots are often unable to evaluate JavaScript, this helps to prevent scraping of email addresses from websites. You can see this in action if you view the source of this page and look for this email address: <a href=\"mailto:foo@example.com\">foo@example.com</a>.</p><p>FL is where most of the application infrastructure logic for Cloudflare runs, and largely consists of code written in the Lua scripting language, which runs on top of NGINX as part of <a href=\"https://openresty.org/en/\">OpenResty</a>. In order to interface with NGINX directly, some parts (like cf-html) are written in lower-level languages like C and C++. In the past, there were many such OpenResty services at Cloudflare, but these days FL is one of the few left, as we move other components to <a href=\"/introducing-cloudflare-workers/\">Workers</a> or <a href=\"/how-we-built-pingora-the-proxy-that-connects-cloudflare-to-the-internet/\">Rust-based proxies</a>. The platform that once was the best possible blend of developer ease and speed has more than started to show its age for us.</p><p>When discussing what happens to an HTTP request passing through our network and in particular FL, nearly all the attention is given to what happens up until the request reaches the customer&#39;s origin. That’s understandable as this is where most of the business logic happens: firewall rules, Workers, and routing decisions all happen on the request. But it&#39;s not the end of the story. From an engineering perspective, much of the more interesting work happens on the response, as we stream the HTML response back from the origin to the site visitor.</p><p>The logic to handle this is contained in a static NGINX module, and runs in the <a href=\"http://nginx.org/en/docs/dev/development_guide.html#http_response_body_filters\">Response Body Filters</a>  phase in NGINX, as chunks of the HTTP response body are streamed through. Over time, more features were added, and the system became known as cf-html. cf-html uses a streaming HTML parser to match on specific HTML tags and content, called <a href=\"https://github.com/cloudflare/lazyhtml\">Lazy HTML</a> or lhtml, with much of the logic for both it and the cf-html features written using the <a href=\"http://www.colm.net/open-source/ragel/\">Ragel</a> state machine engine.</p><h3>Memory safety</h3><p>All the cf-html logic was written in C, and therefore was susceptible to memory corruption issues that plague many large C codebases. In 2017 this led to a security bug as the team was trying to replace part of cf-html. FL was reading arbitrary data from memory and appending it to response bodies. This could potentially include data from other requests passing through FL at the same time. This security event became known widely as <a href=\"https://en.wikipedia.org/wiki/Cloudbleed\">Cloudbleed</a>.</p><p>Since this episode, Cloudflare implemented a number of policies and safeguards to ensure something like that never happened again. While work has been carried out on cf-html over the years, there have been few new features implemented on the framework, and we’re now hyper-sensitive to crashes happening in FL (and, indeed, any other process running on our network), especially in parts that can reflect data back with a response.</p><p>Fast-forward to 2022 into 2023, and the FL Platform team have been getting more and more requests for a system they can easily use to look at and rewrite response body data. At the same time, another team has been working on a new response body parsing and rewriting framework for Workers called <a href=\"https://github.com/cloudflare/lol-html\">lol-html</a> or Low Output Latency HTML. Not only is lol-html faster and more efficient than Lazy HTML, but it’s also currently in full production use as part of the Worker interface, and written in Rust, which is much safer than C in terms of its handling of memory. It’s ideal, therefore, as a replacement for the ancient and creaking HTML parser we’ve been using in FL up until now.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3EU3AILSqI8QLOqouiXA9z/1be49b1b87ff36a6c6d23300936bf7fa/image1-8.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1138\" loading=\"lazy\"/>\n            \n            </figure><p>So we started working on a new framework, written in Rust, that would incorporate lol-html and allow other teams to write response body parsing features without the threat of causing massive security issues. The new system is called ROFL or Response Overseer for FL, and it’s a brand-new NGINX module written completely in Rust. As of now, ROFL is running in production on millions of responses a second, with comparable performance to cf-html. In building ROFL, we’ve been able to deprecate one of the scariest bits of code in Cloudflare’s entire codebase, while providing teams at Cloudflare with a robust system they can use to write features which need to parse and rewrite response body data.</p><h3>Writing an NGINX module in Rust</h3><p>While writing the new module, we learned a lot about how NGINX works, and how we can get it to talk to Rust. NGINX doesn’t provide much documentation on writing modules written in languages other than C, and so there was some work which needed to be done to figure out how to write an NGINX module in our language of choice. When starting out, we made heavy use of parts of the code from the <a href=\"https://github.com/dcoles/nginx-rs\">nginx-rs</a> project, particularly around the handling of buffers and memory pools. While writing a full NGINX module in Rust is a long process and beyond the scope of this blog post, there are a few key bits that make the whole thing possible, and that are worth talking about.</p><p>The first one of these is generating the Rust bindings so that NGINX can communicate with it. To do that, we used Rust’s library <a href=\"https://rust-lang.github.io/rust-bindgen/\">Bindgen</a> to build the FFI bindings for us, based on the symbol definitions in NGINX’s header files. To add this to an existing Rust project, the first thing is to pull down a copy of NGINX and configure it. Ideally this would be done in a simple script or Makefile, but when done by hand it would look something like this:</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">$ git clone --depth=1 https://github.com/nginx/nginx.git\n$ cd nginx\n$ ./auto/configure --without-http_rewrite_module --without-http_gzip_module</pre></code>\n            <p>With NGINX in the right state, we need to create a <code>build.rs</code> file in our Rust project to auto-generate the bindings at build-time of the module. We’ll now add the necessary arguments to the build, and use Bindgen to generate us the <code>bindings.rs</code> file. For the arguments, we just need to include all the directories that may contain header files for clang to do its thing. We can then feed them into Bindgen, along with some allowlist arguments, so it knows for what things it should generate the bindings, and which things it can ignore. Adding a little boilerplate code to the top, the whole file should look something like this:</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">use std::env;\nuse std::path::PathBuf;\n\nfn main() {\n    println!(&quot;cargo:rerun-if-changed=build.rs&quot;);\n\n    let clang_args = [\n        &quot;-Inginx/objs/&quot;,\n        &quot;-Inginx/src/core/&quot;,\n        &quot;-Inginx/src/event/&quot;,\n        &quot;-Inginx/src/event/modules/&quot;,\n        &quot;-Inginx/src/os/unix/&quot;,\n        &quot;-Inginx/src/http/&quot;,\n        &quot;-Inginx/src/http/modules/&quot;\n    ];\n\n    let bindings = bindgen::Builder::default()\n        .header(&quot;wrapper.h&quot;)\n        .layout_tests(false)\n        .allowlist_type(&quot;ngx_.*&quot;)\n        .allowlist_function(&quot;ngx_.*&quot;)\n        .allowlist_var(&quot;NGX_.*|ngx_.*|nginx_.*&quot;)\n        .parse_callbacks(Box::new(bindgen::CargoCallbacks))\n        .clang_args(clang_args)\n        .generate()\n        .expect(&quot;Unable to generate bindings&quot;);\n\n    let out_path = PathBuf::from(env::var(&quot;OUT_DIR&quot;).unwrap());\n\n    bindings.write_to_file(out_path.join(&quot;bindings.rs&quot;))\n        .expect(&quot;Unable to write bindings.&quot;);\n}</pre></code>\n            <p>Hopefully this is all fairly self-explanatory. Bindgen traverses the NGINX source and generates equivalent constructs in Rust in a file called <code>bindings.rs</code>, which we can import into our project. There’s just one more thing to add- Bindgen has trouble with a couple of symbols in NGINX, which we’ll need to fix in a file called <code>wrapper.h</code>. It should have the following contents:</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">#include &lt;ngx_http.h&gt;\n\nconst char* NGX_RS_MODULE_SIGNATURE = NGX_MODULE_SIGNATURE;\nconst size_t NGX_RS_HTTP_LOC_CONF_OFFSET = NGX_HTTP_LOC_CONF_OFFSET;</pre></code>\n            <p>With this in place and <a href=\"https://crates.io/crates/bindgen\">Bindgen</a> set in the <code>[build-dependencies]</code> section of the Cargo.toml file, we should be ready to build.</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">$ cargo build\n   Compiling rust-nginx-module v0.1.0 (/Users/sam/cf-repos/rust-nginx-module)\n    Finished dev [unoptimized + debuginfo] target(s) in 4.70s</pre></code>\n            <p>With any luck, we should see a file called bindings.rs in the target/debug/build directory, which contains Rust definitions of all the NGINX symbols.</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">$ find target -name &#039;bindings.rs&#039; \ntarget/debug/build/rust-nginx-module-c5504dc14560ecc1/out/bindings.rs\n\n$ head target/debug/build/rust-nginx-module-c5504dc14560ecc1/out/bindings.rs\n/* automatically generated by rust-bindgen 0.61.0 */\n[...]</pre></code>\n            <p>To be able to use them in the project, we can include them in a new file under the <code>src</code> directory which we’ll call <code>bindings.rs</code>.</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">$ cat &gt; src/bindings.rs\ninclude!(concat!(env!(&quot;OUT_DIR&quot;), &quot;/bindings.rs&quot;));</pre></code>\n            <p>With that set, we just need to add the usual imports to the top of the <code>lib.rs</code> file, and we can access NGINX constructs from Rust. Not only does this make bugs in the interface between NGINX and our Rust module much less likely than if these values were hand-coded, but it’s also a fantastic reference we can use to check the structure of things in NGINX when building modules in Rust, and it takes a lot of the leg-work out of setting everything up. It’s really a testament to the quality of a lot of Rust libraries such as Bindgen that something like this can be done with so little effort, in a robust way.</p><p>Once the Rust library has been built, the next step is to hook it into NGINX. Most NGINX modules are compiled statically. That is, the module is compiled as part of the compilation of NGINX as a whole. However, since NGINX 1.9.11, it has supported dynamic modules, which are compiled separately and then loaded using the <code>load_module</code> directive in the <code>nginx.conf</code> file. This is what we needed to use to build ROFL, so that the library could be compiled separately and loaded-in at the time NGINX starts up. Finding the right format so that the necessary symbols could be found from the documentation was tricky, though, and although it is possible to use a separate config file to set some of this metadata, it’s better if we can load it as part of the module, to keep things neat. Luckily, it doesn’t take much spelunking through the NGINX codebase to find where <code>dlopen</code> is called.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5RGvw7xRYp02IHS5CZyjPh/53e5c17efacc568daa7185e6294ac1b4/image2-3.png\" alt=\"\" class=\"kg-image\" width=\"1246\" height=\"1999\" loading=\"lazy\"/>\n            \n            </figure><p>So after that it’s just a case of making sure the relevant symbols exist.</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">use std::os::raw::c_char;\nuse std::ptr;\n\n#[no_mangle]\npub static mut ngx_modules: [*const ngx_module_t; 2] = [\n    unsafe { rust_nginx_module as *const ngx_module_t },\n    ptr::null()\n];\n\n#[no_mangle]\npub static mut ngx_module_type: [*const c_char; 2] = [\n    &quot;HTTP_FILTER\\0&quot;.as_ptr() as *const c_char,\n    ptr::null()\n];\n\n#[no_mangle]\npub static mut ngx_module_names: [*const c_char; 2] = [\n    &quot;rust_nginx_module\\0&quot;.as_ptr() as *const c_char,\n    ptr::null()\n];</pre></code>\n            <p>When writing an NGINX module, it’s crucial to get its order relative to the other modules correct. Dynamic modules get loaded as NGINX starts, which means they are (perhaps counterintuitively) the first to run on a response. Ensuring your module runs after gzip decompression by specifying its order relative to the gunzip module is essential, otherwise you can spend lots of time staring at streams of unprintable characters, wondering why you aren’t seeing the response you expected. Not fun. Fortunately this is also something that can be solved by looking at the NGINX source, and making sure the relevant entities exist in your module. Here’s an example of what you might set-</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">pub static mut ngx_module_order: [*const c_char; 3] = [\n    &quot;rust_nginx_module\\0&quot;.as_ptr() as *const c_char,\n    &quot;ngx_http_headers_more_filter_module\\0&quot;.as_ptr() as *const c_char,\n    ptr::null()\n];</pre></code>\n            <p>We’re essentially saying we want our module <code>rust_nginx_module</code> to run just before the <code>ngx_http_headers_more_filter_module</code> module, which should allow it to run in the place we expect.</p><p>One of the quirks of NGINX and OpenResty is how it is really hostile to making calls to external services at the point that you’re dealing with the HTTP response. It’s something that isn’t provided as part of the OpenResty Lua framework, even though it would make working with the response phase of a request much easier. While we could do this anyway, that would mean having to fork NGINX and OpenResty, which would bring its own challenges. As a result, we’ve spent a lot of time over the years thinking about ways to pass state from the time when NGINX’s dealing with an HTTP request, over to the time when it’s streaming through the response, and much of our logic is built around this style of work.</p><p>For ROFL, that means in order to determine if we need to apply a certain feature for a response, we need to figure that out on the request, then pass that information over to the response so that we know which features to activate. To do that, we need to use one of the utilities that NGINX provides you with. With the help of the <code>bindings.rs</code> file generated earlier, we can take a look at the definition of the <code>ngx_http_request_s</code> struct, which contains all the state associated with a given request:</p>\n            <pre class=\"language-unset\"><code class=\"language-unset\">#[repr(C)]\n#[derive(Debug, Copy, Clone)]\npub struct ngx_http_request_s {\n    pub signature: u32,\n    pub connection: *mut ngx_connection_t,\n    pub ctx: *mut *mut ::std::os::raw::c_void,\n    pub main_conf: *mut *mut ::std::os::raw::c_void,\n    pub srv_conf: *mut *mut ::std::os::raw::c_void,\n    pub loc_conf: *mut *mut ::std::os::raw::c_void,\n    pub read_event_handler: ngx_http_event_handler_pt,\n    pub write_event_handler: ngx_http_event_handler_pt,\n    pub cache: *mut ngx_http_cache_t,\n    pub upstream: *mut ngx_http_upstream_t,\n    pub upstream_states: *mut ngx_array_t,\n    pub pool: *mut ngx_pool_t,\n    pub header_in: *mut ngx_buf_t,\n    pub headers_in: ngx_http_headers_in_t,\n    pub headers_out: ngx_http_headers_out_t,\n    pub request_body: *mut ngx_http_request_body_t,\n[...]\n}</pre></code>\n            <p>As we can see, there’s a member called <code>ctx</code>. As the <a href=\"http://nginx.org/en/docs/dev/development_guide.html#http_request\">NGINX Development Guide mentions</a>, it’s a place where you’re able to store any value associated with a request, which should live for as long as the request does. In OpenResty this is used heavily for the storing of state to do with a request over its lifetime in a Lua context. We can do the same thing for our module, so that settings initialised during the request phase are there when our HTML parsing and rewriting is run in the response phase. Here’s an example function which can be used to get the request <code>ctx</code>:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">pub fn get_ctx(request: &amp;ngx_http_request_t) -&gt; Option&lt;&amp;mut Ctx&gt; {\n    unsafe {\n        match *request.ctx.add(ngx_http_rofl_module.ctx_index) {\n            p if p.is_null() =&gt; None,\n            p =&gt; Some(&amp;mut *(p as *mut Ctx)),\n        }\n    }\n}</pre></code>\n            <p>Notice that <code>ctx</code> is at the offset of the <code>ctx_index</code> member of <code>ngx_http_rofl_module</code> - this is the structure of type <code>ngx_module_t</code> that’s part of the module definition needed to make an NGINX module. Once we have this, we can point it to a structure containing any setting we want. For example, here’s the actual function we use to enable the Email Obfuscation feature from Lua, via FFI to the Rust module using LuaJIT’s FFI tools:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">#[no_mangle]\npub extern &quot;C&quot; fn rofl_module_email_obfuscation_new(\n    request: &amp;mut ngx_http_request_t,\n    dry_run: bool,\n    decode_script_url: *const u8,\n    decode_script_url_len: usize,\n) {\n    let ctx = context::get_or_init_ctx(request);\n    let decode_script_url = unsafe {\n        std::str::from_utf8(std::slice::from_raw_parts(decode_script_url, decode_script_url_len))\n            .expect(&quot;invalid utf-8 string for decode script&quot;)\n    };\n\n    ctx.register_module(EmailObfuscation::new(decode_script_url.to_owned()), dry_run);\n}</pre></code>\n            <p>The function is called <code>get_or_init_ctx</code> here- it performs the same job as <code>get_ctx</code>, but also initialises the structure if it doesn’t exist yet. Once we’ve set whatever data we need in <code>ctx</code> during the request, we can then check what features need to be run in the response, without having to make any calls to external databases, which might slow us down.</p><p>One of the nice things about storing state on <code>ctx</code> in this way, and working with NGINX in general, is that it relies heavily on memory pools to store request content. This largely removes any need for the programmer to have to think about freeing memory after use- the pool is automatically allocated at the start of a request, and is automatically freed when the request is done. All that’s needed is to allocate the memory using NGINX’s built-in functions for <a href=\"https://www.nginx.com/resources/wiki/extending/api/alloc/#c.ngx_palloc\">allocating memory to the pool</a> and then <a href=\"http://www.nginx.com/resources/wiki/extending/api/alloc/#c.ngx_pool_cleanup_add\">registering a callback</a> that will be called to free everything. In Rust, that would look something like the following:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">pub struct Pool&lt;&#039;a&gt;(&amp;&#039;a mut ngx_pool_t);\n\nimpl&lt;&#039;a&gt; Pool&lt;&#039;a&gt; {    \n    /// Register a cleanup handler that will get called at the end of the request.\n    fn add_cleanup&lt;T&gt;(&amp;mut self, value: *mut T) -&gt; Result&lt;(), ()&gt; {\n        unsafe {\n            let cln = ngx_pool_cleanup_add(self.0, 0);\n            if cln.is_null() {\n                return Err(());\n            }\n            (*cln).handler = Some(cleanup_handler::&lt;T&gt;);\n            (*cln).data = value as *mut c_void;\n            Ok(())\n        }\n    }\n\n    /// Allocate memory for a given value.\n    pub fn alloc&lt;T&gt;(&amp;mut self, value: T) -&gt; Option&lt;&amp;&#039;a mut T&gt; {\n        unsafe {\n            let p = ngx_palloc(self.0, mem::size_of::&lt;T&gt;()) as *mut _ as *mut T;\n            ptr::write(p, value);\n            if let Err(_) = self.add_cleanup(p) {\n                ptr::drop_in_place(p);\n                return None;\n            };\n            Some(&amp;mut *p)\n        }\n    }\n}\n\nunsafe extern &quot;C&quot; fn cleanup_handler&lt;T&gt;(data: *mut c_void) {\n    ptr::drop_in_place(data as *mut T);\n}</pre></code>\n            <p>This should allow us to allocate memory for whatever we want, safe in the knowledge that NGINX will handle it for us.</p><p>It is regrettable that we have to write a lot of <code>unsafe</code> blocks when dealing with NGINX’s interface in Rust. Although we’ve done a lot of work to minimise them where possible, unfortunately this is often the case with writing Rust code which has to manipulate C constructs through FFI. We have plans to do more work on this in the future, and remove as many lines as possible from <code>unsafe</code>.</p><h3>Challenges encountered</h3><p>The NGINX module system allows for a massive amount of flexibility in terms of the way the module itself works, which makes it very accommodating to specific use-cases, but that flexibility can also lead to problems. One that we ran into had to do with the way the response data is handled between Rust and FL. In NGINX, response bodies are chunked, and these chunks are then linked together into a list. Additionally, there may be more than one of these linked lists per response, if the response is large.</p><p>Efficiently handling these chunks means processing them and passing them on as quickly as possible. When writing a Rust module for manipulating responses, it’s tempting to implement a Rust-based view into these linked lists. However, if you do that, you must be sure to update both the Rust-based view and the underlying NGINX data structures when mutating them, otherwise this can lead to serious bugs where Rust becomes out of sync with NGINX. Here’s a small function from an early version of ROFL that caused headaches:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">fn handle_chunk(&amp;mut self, chunk: &amp;[u8]) {\n    let mut free_chain = self.chains.free.borrow_mut();\n    let mut out_chain = self.chains.out.borrow_mut();\n    let mut data = chunk;\n\n    self.metrics.borrow_mut().bytes_out += data.len() as u64;\n\n    while !data.is_empty() {\n        let free_link = self\n            .pool\n            .get_free_chain_link(free_chain.head, self.tag, &amp;mut self.metrics.borrow_mut())\n            .expect(&quot;Could not get a free chain link.&quot;);\n\n        let mut link_buf = unsafe { TemporaryBuffer::from_ngx_buf(&amp;mut *(*free_link).buf) };\n        data = link_buf.write_data(data).unwrap_or(b&quot;&quot;);\n        out_chain.append(free_link);\n    }\n}</pre></code>\n            <p>What this code was supposed to do is take the output of lol-html’s HTMLRewriter, and write it to the output chain of buffers. Importantly, the output can be larger than a single buffer, so you need to take new buffers off the chain in a loop until you’ve written all the output to buffers. Within this logic, NGINX is supposed to take care of popping the buffer off the free chain and appending the new chunk to the output chain, which it does. However, if you’re only thinking in terms of the way NGINX handles its view of the linked list, you may not notice that Rust never changes which buffer its <code>free_chain.head</code> points to, causing the logic to loop forever and the NGINX worker process to lock-up completely. This sort of issue can take a long time to track down, especially since we couldn’t reproduce it on our personal machines until we understood it was related to the response body size.</p><p>Getting a coredump to perform some analysis with gdb was also hard because once we noticed it happening, it was already too late and the process memory had grown to the point the server was in danger of falling over, and the memory consumed was too large to be written to disk. Fortunately, this code never made it to production. As ever, while Rust’s compiler can help you to catch a lot of common mistakes, it can’t help as much if the data is being shared via FFI from another environment, even without much direct use of <code>unsafe</code>, so extra care must be taken in these cases, especially when NGINX allows the kind of flexibility that might lead to a whole machine being taken out of service.</p><p>Another major challenge we faced had to do with backpressure from incoming response body chunks. In essence, if ROFL increased the size of the response due to having to inject some large amount of code into the stream (such as replacing an email address with a large chunk of JavaScript), NGINX can feed the output from ROFL to the other downstream modules faster than they could push it along, potentially leading to data being dropped and HTTP response bodies being truncated if the <code>EAGAIN</code> error from the next module is left unhandled. This was another case where the issue was really hard to test, because most of the time the response would be flushed fast enough for backpressure never to be a problem. To handle this, we had to create a special chain to store these chunks called <code>saved_in</code>, which required a special method for appending to it.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">#[derive(Debug)]\npub struct Chains {\n    /// This saves buffers from the `in` chain that were not processed for any reason (most likely\n    /// backpressure for the next nginx module).\n    saved_in: RefCell&lt;Chain&gt;,\n    pub free: RefCell&lt;Chain&gt;,\n    pub busy: RefCell&lt;Chain&gt;,\n    pub out: RefCell&lt;Chain&gt;,\n    [...]\n}</pre></code>\n            <p>Effectively we’re ‘queueing’ the data for a short period of time so that we don’t overwhelm the other modules by feeding them data faster than they can handle it. The <a href=\"https://nginx.org/en/docs/dev/development_guide.html\">NGINX Developer Guide</a> has a lot of great information, but many of its examples are trivial to the point where issues like this don’t come up. Things such as this are the result of working in a complex NGINX-based environment, and need to be discovered independently.</p><h3>A future without NGINX</h3><p>The obvious question a lot of people might ask is: why are we still using NGINX? As already mentioned, Cloudflare is well on its way to replacing components that either used to run NGINX/OpenResty proxies, or would have done without heavy investment in home-grown platforms. That said, some components are easier to replace than others and FL, being where most of the logic for Cloudflare’s <a href=\"https://www.cloudflare.com/application-services/\">application services</a> runs, is definitely on the more challenging end of the spectrum.</p><p>Another motivating reason for doing this work is that whichever platform we eventually migrate to, we’ll need to run the features that make up cf-html, and in order to do that we’ll want to have a system that is less heavily integrated and dependent on NGINX. ROFL has been specifically designed with the intention of running it in multiple places, so it will be easy to move it to another Rust-based web proxy (or indeed our Workers platform) without too much trouble. That said it’s hard to imagine we’d be in the same place without a language like Rust, which offers speed at the same time as a high degree of safety, not to mention high-quality libraries like Bindgen and Serde. More broadly, the FL team are working to migrate other aspects of the platform over to Rust, and while cf-html and the features of which make it up are a key part of our infrastructure that needed work, there are many others.</p><p>Safety in programming languages is often seen as beneficial in terms of preventing bugs, but as a company we’ve found that it also allows you to do things which would be considered very hard, or otherwise impossible to do safely. Whether it be providing a <a href=\"https://developers.cloudflare.com/firewall/cf-firewall-rules/\">Wireshark-like filter language for writing firewall rules</a>, <a href=\"https://workers.cloudflare.com/\">allowing millions of users to write arbitrary JavaScript code and run it directly on our platform</a> or rewriting HTML responses on the fly, having strict boundaries in place allows us to provide services we wouldn’t be able to otherwise, all while safe in the knowledge that the kind of memory-safety issues that used to plague the industry are increasingly a thing of the past.</p><p>If you enjoy rewriting code in Rust, solving challenging application infrastructure problems and want to help maintain the busiest web server in the world, we’re <a href=\"https://www.cloudflare.com/careers/jobs/\">hiring</a>!</p>",
		"id": "1YXnWdBwvbFuEaSaQi6qxC",
		"localeList": {
			"name": "ROFL with a LOL: rewriting an NGINX module in Rust Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Engineers at Cloudflare have written a replacement in Rust for one of the oldest and least-well understood parts of the Cloudflare infrastructure, cf-html, which is an NGINX module. In doing so we learned a lot about how NGINX works, and paved the way for the Front Line team at Cloudflare to move away from NGINX entirely.",
		"metadata": {
			"title": "ROFL with a LOL: rewriting an NGINX module in Rust",
			"description": "Engineers at Cloudflare have written a replacement in Rust for one of the oldest and least-well understood parts of the Cloudflare infrastructure, cf-html, which is an NGINX module. In doing so we learned a lot about how NGINX works, and paved the way for the Front Line team at Cloudflare to move away from NGINX entirely.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7wzsNH27eIdAE4rLwShCzp/40136fbc8943292314fea7bd82c9419e/rust-nginx-module-UPyjKT.png"
		},
		"primary_author": {},
		"published_at": "2023-02-24T14:00:00.000+00:00",
		"reading_time": 15,
		"slug": "rust-nginx-module",
		"tags": [
			{
				"id": "3FBpuRfF7HUFga2Z5jgAFf",
				"name": "NGINX",
				"slug": "nginx"
			}
		],
		"title": "ROFL with a LOL: rewriting an NGINX module in Rust",
		"updated_at": "2024-08-27T01:16:15.722Z",
		"url": "https://blog.cloudflare.com/rust-nginx-module"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}