{
	"initialReadingTime": "13",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Ignat Korchagin",
				"slug": "ignat",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6l12U0uchJemRRwVMR9hDn/3c2bc0d267507f4f246623756909aca5/ignat.jpg",
				"location": null,
				"website": null,
				"twitter": "@ignatkn",
				"facebook": null
			}
		],
		"excerpt": "In this post we will review Linux seccomp and learn how to sandbox any (even a proprietary) application without writing a single line of code.",
		"feature_image": "https:undefined",
		"featured": false,
		"html": "<p>Modern Linux operating systems provide many tools to run code more securely. There are <a href=\"https://www.man7.org/linux/man-pages/man7/namespaces.7.html\">namespaces</a> (the basic building blocks for containers), <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/LSM/index.html\">Linux Security Modules</a>, <a href=\"https://wiki.gentoo.org/wiki/Integrity_Measurement_Architecture\">Integrity Measurement Architecture</a> etc.</p><p>In this post we will review <a href=\"https://www.kernel.org/doc/html/latest/userspace-api/seccomp_filter.html\">Linux seccomp</a> and learn how to sandbox any (even a proprietary) application without writing a single line of code.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4I6LYA0Qq7KBBc5vj9LDV0/300e61632f3969156de1197c2c046419/linux-sandbox-1.jpg\" alt=\"linux-sandbox-1\" class=\"kg-image\" width=\"1500\" height=\"800\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://www.deviantart.com/qubodup/art/Tux-Flat-SVG-607655623\">Tux by Iwan Gabovitch, GPL</a><a href=\"https://pixabay.com/vectors/sandpit-sandbox-container-sand-35536/\">Sandbox, Simplified Pixabay License</a></p><h2>Linux system calls</h2><p>System calls (syscalls) is a well-defined interface between <a href=\"https://en.wikipedia.org/wiki/User_space\">userspace applications</a> and the <a href=\"https://en.wikipedia.org/wiki/Kernel_(operating_system)\">operating system (OS) kernel</a>. On modern operating systems most applications provide only application-specific logic as code. Applications do not, and most of the time cannot, directly access low-level hardware or networking, when they need to store data or send something over the wire. Instead they use system calls to ask the OS kernel to do specific hardware and networking tasks on their behalf:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2t6kOXlTPfyGwZ5IEPq07g/79b1d35aa376c4cc03e9b8fc7b497b4b/image2-2.png\" alt=\"image2-2\" class=\"kg-image\" width=\"1280\" height=\"772\" loading=\"lazy\"/>\n            \n            </figure><p>Apart from providing a generic high level way for applications to interact with the low level hardware, the system call architecture allows the OS kernel to manage available resources between applications as well as enforce policies, like application permissions, networking access control lists etc.</p><h2>Linux seccomp</h2><p>Linux seccomp is <a href=\"https://www.man7.org/linux/man-pages/man2/seccomp.2.html\">yet another syscall</a> on Linux, but it is a bit special, because it influences how the OS kernel will behave when the application uses other system calls. By default, the OS kernel has almost no insight into userspace application logic, so it provides all the possible services it can. But not all applications require all services. Consider an application which converts image formats: it needs the ability to read and write data from disk, but in its simplest form probably does not need any network access. Using seccomp an application can declare its intentions in advance to the Linux kernel. For this particular case it can notify the kernel that it will be using the <a href=\"https://www.man7.org/linux/man-pages/man2/read.2.html\">read</a> and <a href=\"https://www.man7.org/linux/man-pages/man2/write.2.html\">write</a> system calls, but never the <a href=\"https://www.man7.org/linux/man-pages/man2/send.2.html\">send</a> and <a href=\"https://www.man7.org/linux/man-pages/man2/recv.2.html\">recv</a> system calls (because its intent is to work with local files and never with the network). It’s like establishing a contract between the application and the OS kernel:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6X06iaPGGtyi9O1geWqZq8/458dd8f61e10791cdc46c4f1eb19f8f7/image1-4.png\" alt=\"image1-4\" class=\"kg-image\" width=\"1602\" height=\"752\" loading=\"lazy\"/>\n            \n            </figure><p>But what happens if the application later breaks the contract and tries to use one of the system calls it promised not to use? The kernel will “penalise” the application, usually by immediately terminating it. Linux seccomp also <a href=\"https://www.man7.org/linux/man-pages/man2/seccomp.2.html\">allows less restrictive actions</a> for the kernel to take:</p><ul><li><p>instead of terminating the whole application, the kernel can be requested to terminate only the thread, which issued the prohibited system call</p></li><li><p>the kernel may just send a <code>SIGSYS</code> <a href=\"https://man7.org/linux/man-pages/man7/signal.7.html\">signal</a> to the calling thread</p></li><li><p>the seccomp policy can specify an error code, which the kernel will then return to the calling application instead of executing the prohibited system call</p></li><li><p>if the violating process is under <a href=\"https://man7.org/linux/man-pages/man2/ptrace.2.html\">ptrace</a> (for example executing under a debugger), the kernel can notify the tracer (the debugger) that a prohibited system call is about to happen and let the debugger decide what to do</p></li><li><p>the kernel may be instructed to allow and execute the system call, but log the attempt: this is useful, when we want to verify that our seccomp policy is not too tight without the risk of terminating the application and potentially creating an outage</p></li></ul><p>Although there is a lot of flexibility in defining the potential penalty for the application, from a security perspective it is usually best to stick with the complete application termination upon seccomp policy violation. The reason for that will be described later in the examples in the post.</p><p>So why would the application take the risk of being abruptly terminated and declare its intentions beforehand, if it can just be “silent” and the OS kernel will allow it to use any system call by default? Of course, for a normal behaving application it makes no sense, but it turns out this feature is quite effective to protect from rogue applications and <a href=\"https://en.wikipedia.org/wiki/Arbitrary_code_execution\">arbitrary code execution</a> exploits.</p><p>Imagine our image format converter is written in some unsafe language and <a href=\"https://imagetragick.com/\">an attacker was able to take control of the application by making it process some malformed image</a>. What the attacker might do is to try to steal some sensitive information from the machine running our converter and send it to themselves via the network. By default, the OS kernel will most likely allow it and a data leak will happen. But if our image converter “confined” (or sandboxed) itself beforehand to only read and write local data the kernel will terminate the application when the latter tries to leak the data over the network thus preventing the leak and locking out the attacker from our system!</p><h2>Integrating seccomp into the application</h2><p>To see how seccomp can be used in practice, let’s consider a toy example program</p><p><i>myos.c:</i></p>\n            <pre class=\"language-c\"><code class=\"language-c\">#include &lt;stdio.h&gt;\n#include &lt;sys/utsname.h&gt;\n\nint main(void)\n{\n    struct utsname name;\n\n    if (uname(&amp;name)) {\n        perror(&quot;uname failed: &quot;);\n        return 1;\n    }\n\n    printf(&quot;My OS is %s!\\n&quot;, name.sysname);\n    return 0;\n}</pre></code>\n            <p></p><p>This is a simplified version of the <a href=\"https://www.man7.org/linux/man-pages/man1/uname.1.html\">uname command line tool</a>, which just prints your operating system name. Like its full-featured counterpart, it uses the <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">uname system call</a> to actually get the name of the current operating system from the kernel. Let’s see it action:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ gcc -o myos myos.c\n$ ./myos\nMy OS is Linux!</pre></code>\n            <p></p><p>Great! We’re on Linux, so can further experiment with <a href=\"https://www.man7.org/linux/man-pages/man2/seccomp.2.html\">seccomp</a> (it is a Linux-only feature). Notice that we’re properly handling the error code after invoking the <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">uname system call</a>. However, according to the <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">man page</a> it can only fail, when the passed in buffer pointer is invalid. And in this case the set error number will be “EINVAL”, which translates to invalid parameter. In our case, the “struct utsname” structure is being allocated on the stack, so our pointer will always be valid. In other words, in normal circumstances the <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">uname system call</a> should never fail in this particular program.</p><p>To illustrate seccomp capabilities we will add a “sandbox” function to our program before the main logic</p><p><i>myos_raw_seccomp.c:</i></p>\n            <pre class=\"language-c\"><code class=\"language-c\">#include &lt;linux/seccomp.h&gt;\n#include &lt;linux/filter.h&gt;\n#include &lt;linux/audit.h&gt;\n#include &lt;sys/ptrace.h&gt;\n#include &lt;sys/prctl.h&gt;\n\n#include &lt;stdlib.h&gt;\n#include &lt;stdio.h&gt;\n#include &lt;stddef.h&gt;\n#include &lt;sys/utsname.h&gt;\n#include &lt;errno.h&gt;\n#include &lt;unistd.h&gt;\n#include &lt;sys/syscall.h&gt;\n\nstatic void sandbox(void)\n{\n    struct sock_filter filter[] = {\n        /* seccomp(2) says we should always check the arch */\n        /* as syscalls may have different numbers on different architectures */\n        /* see https://fedora.juszkiewicz.com.pl/syscalls.html */\n        /* for simplicity we only allow x86_64 */\n        BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, arch))),\n        /* if not x86_64, tell the kernel to kill the process */\n        BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, AUDIT_ARCH_X86_64, 0, 4),\n        /* get the actual syscall number */\n        BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, nr))),\n        /* if &quot;uname&quot;, tell the kernel to return EPERM, otherwise just allow */\n        BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, SYS_uname, 0, 1),\n        BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ERRNO | (EPERM &amp; SECCOMP_RET_DATA)),\n        BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ALLOW),\n        BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_KILL),\n    };\n\n    struct sock_fprog prog = {\n        .len = (unsigned short) (sizeof(filter) / sizeof(filter[0])),\n        .filter = filter,\n    };\n\n    /* see seccomp(2) on why this is needed */\n    if (prctl(PR_SET_NO_NEW_PRIVS, 1, 0, 0, 0)) {\n        perror(&quot;PR_SET_NO_NEW_PRIVS failed&quot;);\n        exit(1);\n    };\n\n    /* glibc does not have a wrapper for seccomp(2) */\n    /* invoke it via the generic syscall wrapper */\n    if (syscall(SYS_seccomp, SECCOMP_SET_MODE_FILTER, 0, &amp;prog)) {\n        perror(&quot;seccomp failed&quot;);\n        exit(1);\n    };\n}\n\nint main(void)\n{\n    struct utsname name;\n\n    sandbox();\n\n    if (uname(&amp;name)) {\n        perror(&quot;uname failed&quot;);\n        return 1;\n    }\n\n    printf(&quot;My OS is %s!\\n&quot;, name.sysname);\n    return 0;\n}</pre></code>\n            <p></p><p>To sandbox itself the application defines a <a href=\"https://www.kernel.org/doc/Documentation/networking/filter.txt\">BPF program</a>, which implements the desired sandboxing policy. Then the application passes this program to the kernel via the <a href=\"https://www.man7.org/linux/man-pages/man2/seccomp.2.html\">seccomp</a> system call. The kernel does some validation checks to ensure the BPF program is OK and then runs this program on every system call the application makes. The results of the execution of the program is used by the kernel to determine if the current call complies with the desired policy. In other words the BPF program is the “contract” between the application and the kernel.</p><p>In our toy example above, the BPF program simply checks which system call is about to be invoked. If the application is trying to use the <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">uname system call</a> we tell the kernel to just return a EPERM (which stands for “operation not permitted”) error code. We also tell the kernel to allow any other system call. Let’s see if it works now:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ gcc -o myos myos_raw_seccomp.c\n$ ./myos\nuname failed: Operation not permitted</pre></code>\n            <p><code></code></p><p><code>uname</code> failed now with the EPERM error code and EPERM is not even described as a potential failure code in the <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">uname manpage</a>! So we know now that this happened because we “told” the kernel to prohibit us using the uname syscall and to return EPERM instead. We can double check this by replacing EPERM with some other error code, which is totally inappropriate for this context, for example ENETDOWN (“network is down”). Why would we need the network to be up to just get the currently executing OS? Yet, recompiling and rerunning the program we get:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ gcc -o myos myos_raw_seccomp.c\n$ ./myos\nuname failed: Network is down</pre></code>\n            <p></p><p>We can also verify the other part of our “contract” works as expected. We told the kernel to allow any other system call, remember? In our program, when uname fails, we convert the error code to a human readable message and print it on the screen with the <a href=\"https://www.man7.org/linux/man-pages/man3/perror.3.html\">perror</a> function. To print on the screen <a href=\"https://www.man7.org/linux/man-pages/man3/perror.3.html\">perror</a> uses the <a href=\"https://www.man7.org/linux/man-pages/man2/write.2.html\">write system call</a> under the hood and since we can actually see the printed error message, we know that the kernel allowed our program to make the <a href=\"https://www.man7.org/linux/man-pages/man2/write.2.html\">write system call</a> in the first place.</p><h3>seccomp with libseccomp</h3><p>While it is possible to use seccomp directly, as in the examples above, BPF programs are cumbersome to write by hand and hard to debug, review and update later. That’s why it is usually a good idea to use a more high-level library, which abstracts away most of the low-level details. Luckily <a href=\"https://github.com/seccomp/libseccomp\">such a library exists</a>: it is called libseccomp and is even recommended by the <a href=\"https://www.man7.org/linux/man-pages/man2/seccomp.2.html\">seccomp man page</a>.</p><p>Let’s rewrite our program’s <code>sandbox()</code> function to use this library instead:</p><p><i>myos_libseccomp.c:</i></p>\n            <pre class=\"language-c\"><code class=\"language-c\">#define _GNU_SOURCE\n#include &lt;stdio.h&gt;\n#include &lt;stdlib.h&gt;\n#include &lt;sys/utsname.h&gt;\n#include &lt;seccomp.h&gt;\n#include &lt;err.h&gt;\n\nstatic void sandbox(void)\n{\n    /* allow all syscalls by default */\n    scmp_filter_ctx seccomp_ctx = seccomp_init(SCMP_ACT_ALLOW);\n    if (!seccomp_ctx)\n        err(1, &quot;seccomp_init failed&quot;);\n\n    /* kill the process, if it tries to use &quot;uname&quot; syscall */\n    if (seccomp_rule_add_exact(seccomp_ctx, SCMP_ACT_KILL, seccomp_syscall_resolve_name(&quot;uname&quot;), 0)) {\n        perror(&quot;seccomp_rule_add_exact failed&quot;);\n        exit(1);\n    }\n\n    /* apply the composed filter */\n    if (seccomp_load(seccomp_ctx)) {\n        perror(&quot;seccomp_load failed&quot;);\n        exit(1);\n    }\n\n    /* release allocated context */\n    seccomp_release(seccomp_ctx);\n}\n\nint main(void)\n{\n    struct utsname name;\n\n    sandbox();\n\n    if (uname(&amp;name)) {\n        perror(&quot;uname failed: &quot;);\n        return 1;\n    }\n\n    printf(&quot;My OS is %s!\\n&quot;, name.sysname);\n    return 0;\n}</pre></code>\n            <p></p><p>Our <code>sandbox()</code> function not only became shorter and much more readable, but also provided the ability to reference syscalls in our rules by names and not internal numbers as well as not having to deal with other quirks, like setting <code>PR_SET_NO_NEW_PRIVS</code> bit and dealing with system architectures.</p><p>It is worth noting we have modified our seccomp policy a bit. In the raw seccomp example above we instructed the kernel to return an error code when the application tries to execute a prohibited syscall. This is good for demonstration purposes, but in most cases a stricter action is required. Just returning an error code and allowing the application to continue gives the potentially malicious code a chance to bypass the policy. There are many syscalls in Linux and some of them do the same or similar things. For example, we might want to prohibit the application to read data from disk, so we deny the <a href=\"https://www.man7.org/linux/man-pages/man2/read.2.html\">read</a> syscall in our policy and tell the kernel to return an error code instead. However, if the application does get exploited, the exploit code/logic might look like below:</p>\n            <pre class=\"language-c\"><code class=\"language-c\">…\nif (-1 == read(fd, buf, count)) {\n    /* hm… read failed, but what about pread? */\n    if (-1 == pread(fd, buf, count, offset) {\n        /* what about readv? */ ...\n    }\n    /* bypassed the prohibited read(2) syscall */\n}\n…</pre></code>\n            <p></p><p>Wait what?! There is more than one read system call? Yes, there are <a href=\"https://www.man7.org/linux/man-pages/man2/read.2.html\">read</a>, <a href=\"https://man7.org/linux/man-pages/man2/pread.2.html\">pread</a>, <a href=\"https://man7.org/linux/man-pages/man2/readv.2.html\">readv</a> as well as more obscure ones, like <a href=\"https://blog.cloudflare.com/io_submit-the-epoll-alternative-youve-never-heard-about/\">io_submit</a> and <code>io_uring_enter</code>. Of course, it is our fault for providing incomplete seccomp policy, which does not block all possible read syscalls. But if at least we had instructed the kernel to terminate the process immediately upon violation of the first plain <code>read</code>, the malicious code above would not have the chance to be clever and try other options.</p><p>Given the above in the libseccomp example we have a stricter policy now, which tells the kernel to terminate the process upon the policy violation. Let’s see if it works:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ gcc -o myos myos_libseccomp.c -lseccomp\n$ ./myos\nBad system call</pre></code>\n            <p></p><p>Notice that we need to link against <a href=\"https://github.com/seccomp/libseccomp\">libseccomp</a> when compiling the application. Also, when we run the application, we don’t see the <code>uname failed: Operation not permitted</code> error output anymore, because we don’t give the application the ability to even print a failure message. Instead, we see a <code>Bad system call</code> message from the shell, which tells us that the application was terminated with a <code>SIGSYS</code> <a href=\"https://man7.org/linux/man-pages/man7/signal.7.html\">signal</a>. Great!</p><h2>zero code seccomp</h2><p>The previous examples worked fine, but both of them have one disadvantage: we actually needed to modify the source code to embed our desired seccomp policy into the application. This is because <a href=\"https://www.man7.org/linux/man-pages/man2/seccomp.2.html\">seccomp syscall</a> affects the calling process and its children, but there is no interface to inject the policy from “outside”. It is expected that developers will sandbox their code themselves as part of the application logic, but in practice this rarely happens. When developers are starting a new project, most of the time the focus is on primary functionality and security features are usually either postponed or omitted altogether. Also, most real-world software is usually written using some high-level programming language and/or a framework, where the developers do not deal with the system calls directly and probably are even unaware which system calls are being used by their code.</p><p>On the other hand we have system operators, sysadmins, SRE and other folks, who run the above code in production. They are more incentivized to keep production systems secure, thus would probably want to sandbox the services as much as possible. But most of the time they don’t have access to the source code. So there are mismatched expectations: developers have the ability to sandbox their code, but are usually not incentivized to do so and operators have the incentive to sandbox the code, but don’t have the ability.</p><p>This is where “zero code seccomp” might help, where an external operator can inject the desired sandbox policy into any process without needing to modify any source code. <a href=\"https://www.freedesktop.org/wiki/Software/systemd/\">Systemd</a> is one of the popular implementations of a “zero code seccomp” approach. Systemd-managed services can have a <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.exec.html#SystemCallFilter=\"><code>SystemCallFilter=</code></a> directive defined in their <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.service.html\">unit files</a> listing all the system calls the managed service is allowed to make. As an example, let’s go back to our toy application without any sandboxing code embedded:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ gcc -o myos myos.c\n$ ./myos\nMy OS is Linux!</pre></code>\n            <p></p><p>Now we can run the same code with systemd, but prohibit the application for using <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">uname</a> without changing or recompiling any code (we’re using <a href=\"https://www.freedesktop.org/software/systemd/man/systemd-run.html\">systemd-run</a> to create an ephemeral systemd service unit for us):</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ systemd-run --user --pty --same-dir --wait --collect --service-type=exec --property=&quot;SystemCallFilter=~uname&quot; ./myos\nRunning as unit: run-u0.service\nPress ^] three times within 1s to disconnect TTY.\nFinished with result: signal\nMain processes terminated with: code=killed/status=SYS\nService runtime: 6ms</pre></code>\n            <p></p><p>We don’t see the normal <code>My OS is Linux!</code> output anymore and systemd conveniently tells us that the managed process was terminated with a <code>SIGSYS</code> signal. We can even go further and use another directive <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.exec.html#SystemCallErrorNumber=\"><code>SystemCallErrorNumber=</code></a> to configure our seccomp policy not to terminate the application, but return an error code instead as in our first seccomp raw example:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ systemd-run --user --pty --same-dir --wait --collect --service-type=exec --property=&quot;SystemCallFilter=~uname&quot; --property=&quot;SystemCallErrorNumber=ENETDOWN&quot; ./myos\nRunning as unit: run-u2.service\nPress ^] three times within 1s to disconnect TTY.\nuname failed: Network is down\nFinished with result: exit-code\nMain processes terminated with: code=exited/status=1\nService runtime: 6ms</pre></code>\n            <p></p><h3>systemd small print</h3><p>Great! We can now inject almost any seccomp policy into any process without the need to write any code or recompile the application. However, there is an interesting statement in the <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.exec.html#SystemCallFilter=\">systemd documentation</a>:</p><blockquote><p>...Note that the <code>execve, exit, exit_group, getrlimit, rt_sigreturn, sigreturn</code> system calls and the system calls for querying time and sleeping are implicitly whitelisted and do not need to be listed explicitly...</p></blockquote><p>Some system calls are implicitly allowed and we don’t have to list them. This is mostly related to the way how systemd manages processes and injects the seccomp policy. We established earlier that seccomp policy applies to the current process and its children. So, to inject the policy, systemd <a href=\"https://www.man7.org/linux/man-pages/man2/fork.2.html\">forks</a> itself, calls <a href=\"https://www.man7.org/linux/man-pages/man2/seccomp.2.html\">seccomp</a> in the forked process and then <a href=\"https://www.man7.org/linux/man-pages/man2/execve.2.html\">execs</a> the forked process into the target application. That’s why always allowing the <a href=\"https://www.man7.org/linux/man-pages/man2/execve.2.html\">execve</a> system call is necessary in the first place, because otherwise systemd cannot do its job as a service manager.</p><p>But what if we want to explicitly prohibit some of these system calls? If we continue with the <a href=\"https://www.man7.org/linux/man-pages/man2/execve.2.html\">execve</a> as an example, that can actually be a dangerous system call most applications would want to prohibit. Seccomp is an effective tool to protect the code from arbitrary code execution exploits, remember? If a malicious actor takes over our code, most likely the first thing they will try is to get a shell (or replace our code with any other application which is easier to control) by directing our code to call <a href=\"https://www.man7.org/linux/man-pages/man2/execve.2.html\">execve</a> with the desired binary. So, if our code does not need <a href=\"https://www.man7.org/linux/man-pages/man2/execve.2.html\">execve</a> for its main functionality, it would be a good idea to prohibit it. Unfortunately, it is not possible with the systemd <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.exec.html#SystemCallFilter=\"><code>SystemCallFilter=</code></a> approach...</p><h2>Introducing Cloudflare sandbox</h2><p>We really liked the “zero code seccomp” approach with systemd <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.exec.html#SystemCallFilter=\"><code>SystemCallFilter=</code></a> directive, but were not satisfied with its limitations. We decided to take it one step further and make it possible to prohibit any system call in any process externally without touching its source code, so came up with the <a href=\"https://github.com/cloudflare/sandbox\">Cloudflare sandbox</a>. It’s a simple standalone toolkit consisting of a shared library and an executable. The shared library is supposed to be used with dynamically linked applications and the executable is for statically linked applications.</p><h3>sandboxing dynamically linked executables</h3><p>For dynamically linked executables it is possible to inject custom code into the process by utilizing the <a href=\"https://www.man7.org/linux/man-pages/man8/ld.so.8.html\"><code>LD_PRELOAD</code></a> environment variable. The <code>libsandbox.so</code> shared library from our toolkit also contains a so-called <a href=\"https://gcc.gnu.org/onlinedocs/gccint/Initialization.html\">initialization routine</a>, which should be executed before the main logic. This is how we make the target application sandbox itself:</p><ul><li><p><a href=\"https://www.man7.org/linux/man-pages/man8/ld.so.8.html\"><code>LD_PRELOAD</code></a> tells the dynamic loader to load our <code>libsandbox.so</code> as part of the application, when it starts</p></li><li><p>the runtime executes the <a href=\"https://gcc.gnu.org/onlinedocs/gccint/Initialization.html\">initialization routine</a> from the <code>libsandbox.so</code> before most of the main logic</p></li><li><p>our initialization routine configures the sandbox policy described in special environment variables</p></li><li><p>by the time the main application logic begin executing, the target process has the configured seccomp policy enforced</p></li></ul><p>Let’s see how it works with our <code>myos</code> toy tool. First, we need to make sure it is actually a dynamically linked application:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ ldd ./myos\n\tlinux-vdso.so.1 (0x00007ffd8e1e3000)\n\tlibc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007f339ddfb000)\n\t/lib64/ld-linux-x86-64.so.2 (0x00007f339dfcf000)</pre></code>\n            <p></p><p>Yes, it is . Now, let’s prohibit it from using the <a href=\"https://www.man7.org/linux/man-pages/man2/uname.2.html\">uname</a> system call with our toolkit:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ LD_PRELOAD=/usr/lib/x86_64-linux-gnu/libsandbox.so SECCOMP_SYSCALL_DENY=uname ./myos\nadding uname to the process seccomp filter\nBad system call</pre></code>\n            <p></p><p>Yet again, we’ve managed to inject our desired seccomp policy into the <code>myos</code> application without modifying or recompiling it. The advantage of this approach is that it doesn’t have the shortcomings of the systemd’s <a href=\"https://www.freedesktop.org/software/systemd/man/systemd.exec.html#SystemCallFilter=\"><code>SystemCallFilter=</code></a> and we can block any system call (luckily <a href=\"https://www.gnu.org/software/bash/\">Bash</a> is a dynamically linked application as well):</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ /bin/bash -c &#039;echo I will try to execve something...; exec /usr/bin/echo Doing arbitrary code execution!!!&#039;\nI will try to execve something...\nDoing arbitrary code execution!!!\n$ LD_PRELOAD=/usr/lib/x86_64-linux-gnu/libsandbox.so SECCOMP_SYSCALL_DENY=execve /bin/bash -c &#039;echo I will try to execve something...; exec /usr/bin/echo Doing arbitrary code execution!!!&#039;\nadding execve to the process seccomp filter\nI will try to execve something...\nBad system call</pre></code>\n            <p></p><p>The only problem here is that we may accidentally forget to <code>LD_PRELOAD</code> our <code>libsandbox.so</code> library and potentially run unprotected. Also, as described in the <a href=\"https://www.man7.org/linux/man-pages/man8/ld.so.8.html\">man page</a>, <code>LD_PRELOAD</code> has some limitations. We can overcome all these problems by making <code>libsandbox.so</code> a permanent part of our target application:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ patchelf --add-needed /usr/lib/x86_64-linux-gnu/libsandbox.so ./myos\n$ ldd ./myos\n\tlinux-vdso.so.1 (0x00007fff835ae000)\n\t/usr/lib/x86_64-linux-gnu/libsandbox.so (0x00007fc4f55f2000)\n\tlibc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007fc4f5425000)\n\t/lib64/ld-linux-x86-64.so.2 (0x00007fc4f5647000)</pre></code>\n            <p></p><p>Again, we didn’t need access to the source code here, but patched the compiled binary instead. Now we can just configure our seccomp policy as before without the need of <code>LD_PRELOAD</code>:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ ./myos\nMy OS is Linux!\n$ SECCOMP_SYSCALL_DENY=uname ./myos\nadding uname to the process seccomp filter\nBad system call</pre></code>\n            <p></p><h3>sandboxing statically linked executables</h3><p>The above method is quite convenient and easy, but it doesn’t work for statically linked executables:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ gcc -static -o myos myos.c\n$ ldd ./myos\n\tnot a dynamic executable\n$ LD_PRELOAD=/usr/lib/x86_64-linux-gnu/libsandbox.so SECCOMP_SYSCALL_DENY=uname ./myos\nMy OS is Linux!</pre></code>\n            <p></p><p>This is because there is no <a href=\"https://www.man7.org/linux/man-pages/man8/ld.so.8.html\">dynamic loader</a> involved in starting a statically linked executable, so <code>LD_PRELOAD</code> has no effect. For this case our toolkit contains a special application launcher, which will inject the seccomp rules similarly to the way systemd does it:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sandboxify ./myos\nMy OS is Linux!\n$ SECCOMP_SYSCALL_DENY=uname sandboxify ./myos\nadding uname to the process seccomp filter</pre></code>\n            <p></p><p>Note that we don’t see the <code>Bad system call</code> shell message anymore, because our target executable is being started by the launcher instead of the shell directly. Unlike systemd however, we can use this launcher to block dangerous system calls, like <a href=\"https://www.man7.org/linux/man-pages/man2/execve.2.html\">execve</a>, as well:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sandboxify /bin/bash -c &#039;echo I will try to execve something...; exec /usr/bin/echo Doing arbitrary code execution!!!&#039;\nI will try to execve something...\nDoing arbitrary code execution!!!\nSECCOMP_SYSCALL_DENY=execve sandboxify /bin/bash -c &#039;echo I will try to execve something...; exec /usr/bin/echo Doing arbitrary code execution!!!&#039;\nadding execve to the process seccomp filter\nI will try to execve something...</pre></code>\n            <p></p><h3>sandboxify vs libsandbox.so</h3><p>From the examples above you may notice that it is possible to use <code>sandboxify</code> with dynamically linked executables as well, so why even bother with <code>libsandbox.so</code>? The difference becomes visible, when we start using not the “denylist” policy as in most examples in this post, but rather the preferred “allowlist” policy, where we explicitly allow only the system calls we need, but prohibit everything else.</p><p>Let’s convert our toy application back into the dynamically-linked one and try to come up with the minimal list of allowed system calls it needs to function properly:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ gcc -o myos myos.c\n$ ldd ./myos\n\tlinux-vdso.so.1 (0x00007ffe027f6000)\n\tlibc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007f4f1410a000)\n\t/lib64/ld-linux-x86-64.so.2 (0x00007f4f142de000)\n$ LD_PRELOAD=/usr/lib/x86_64-linux-gnu/libsandbox.so SECCOMP_SYSCALL_ALLOW=exit_group:fstat:uname:write ./myos\nadding exit_group to the process seccomp filter\nadding fstat to the process seccomp filter\nadding uname to the process seccomp filter\nadding write to the process seccomp filter\nMy OS is Linux</pre></code>\n            <p></p><p>So we need to allow 4 system calls: <code>exit_group:fstat:uname:write</code>. This is the tightest “sandbox”, which still doesn’t break the application. If we remove any system call from this list, the application will terminate with the <code>Bad system call</code> message (try it yourself!).</p><p>If we use the same allowlist, but with the <code>sandboxify</code> launcher, things do not work anymore:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ SECCOMP_SYSCALL_ALLOW=exit_group:fstat:uname:write sandboxify ./myos\nadding exit_group to the process seccomp filter\nadding fstat to the process seccomp filter\nadding uname to the process seccomp filter\nadding write to the process seccomp filter</pre></code>\n            <p></p><p>The reason is <code>sandboxify</code> and <code>libsandbox.so</code> inject seccomp rules at different stages of the process lifecycle. Consider the following very high level diagram of a process startup:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1gnqXj5b3tLBdG5pG9b9yH/282855c2bce863e295f96429e21c736a/image3-2.png\" alt=\"image3-2\" class=\"kg-image\" width=\"1646\" height=\"774\" loading=\"lazy\"/>\n            \n            </figure><p>\nIn a nutshell, every process has two runtime stages: “runtime init” and the “main logic”. The main logic is basically the code, which is located in the program <code>main()</code> function and other code put there by the application developers. But the process usually needs to do some work before the code from the <code>main()</code> function is able to execute - we call this work the “runtime init” on the diagram above. Developers do not write this code directly, but most of the time this code is automatically generated by the compiler toolchain, which is used to compile the source code.</p><p>To do its job, the “runtime init” stage uses a lot of different system calls, but most of them are not needed later at the “main logic” stage. If we’re using the “allowlist” approach for our sandboxing, it does not make sense to allow these system calls for the whole duration of the program, if they are only used once on program init. This is where the difference between <code>libsandbox.so</code> and <code>sandboxify</code> comes from: <code>libsandbox.so</code> enforces the seccomp rules usually after the “runtime init” stage has already executed, so we don’t have to allow most system calls from that stage. <code>sandboxify</code> on the other hand enforces the policy before the “runtime init” stage, so we have to allow all the system calls from both stages, which usually results in a bigger allowlist, thus wider attack surface.</p><p>Going back to our toy <code>myos</code> example, here is the minimal list of all the system calls we need to allow to make the application work under our sandbox:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ SECCOMP_SYSCALL_ALLOW=access:arch_prctl:brk:close:exit_group:fstat:mmap:mprotect:munmap:openat:read:uname:write sandboxify ./myos\nadding access to the process seccomp filter\nadding arch_prctl to the process seccomp filter\nadding brk to the process seccomp filter\nadding close to the process seccomp filter\nadding exit_group to the process seccomp filter\nadding fstat to the process seccomp filter\nadding mmap to the process seccomp filter\nadding mprotect to the process seccomp filter\nadding munmap to the process seccomp filter\nadding openat to the process seccomp filter\nadding read to the process seccomp filter\nadding uname to the process seccomp filter\nadding write to the process seccomp filter\nMy OS is Linux!</pre></code>\n            <p></p><p>It is 13 syscalls vs 4 syscalls, if we’re using the <code>libsandbox.so</code> approach!</p><h2>Conclusions</h2><p>In this post we discussed how to easily sandbox applications on Linux without the need to write any additional code. We introduced the <a href=\"https://github.com/cloudflare/sandbox\">Cloudflare sandbox toolkit</a> and discussed the different approaches we take at sandboxing dynamically linked applications vs statically linked applications.</p><p>Having safer code online helps to build a Better Internet and we would be happy if you find our <a href=\"https://github.com/cloudflare/sandbox\">sandbox toolkit</a> useful. Looking forward to the feedback, improvements and other contributions!</p>",
		"id": "62KzlmtEZD97kzQlvdKaNN",
		"localeList": {
			"name": "Sandboxing in Linux with zero lines of code Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "In this post we will review Linux seccomp and learn how to sandbox any (even a proprietary) application without writing a single line of code.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2020-07-08T12:00:00.000+01:00",
		"slug": "sandboxing-in-linux-with-zero-lines-of-code",
		"tags": [
			{
				"id": "383iv0UQ6Lp0GZwOAxGq2p",
				"name": "Linux",
				"slug": "linux"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "2UVIYusJwlvsmPYl2AvSuR",
				"name": "Deep Dive",
				"slug": "deep-dive"
			}
		],
		"title": "Sandboxing in Linux with zero lines of code",
		"updated_at": "2024-09-04T16:21:22.272Z",
		"url": "https://blog.cloudflare.com/sandboxing-in-linux-with-zero-lines-of-code"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}