{
	"initialReadingTime": "11",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Alex Fattouche",
				"slug": "alex-fattouche",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6yn7x5vl3Mx87V0s83LuNG/3c6008c4442b8b7b1de6c445abc96d29/alex-fattouche.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "The goal of Cloudflare operated Secondary DNS is to allow our customers with custom DNS solutions, be it on-premise or some other DNS provider, to be able to take advantage of Cloudflare's DNS performance and more recently, through Secondary Override, our proxying and security capabilities too.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1muUHhV8ymC3QqF4RBGST3/833356a545df94bbed6a2296fec46d75/secondary-dns-deep-dive.png",
		"featured": false,
		"html": "<h2>How Does Secondary DNS Work?</h2><p>If you already understand how Secondary DNS works, please feel free to skip this section. It does not provide any Cloudflare-specific information.</p><p>Secondary DNS has many use cases across the Internet; however, traditionally, it was used as a synchronized backup for when the primary DNS server was unable to respond to queries. A more modern approach involves focusing on redundancy across many different nameservers, which in many cases broadcast the same anycasted IP address.</p><p>Secondary DNS involves the unidirectional transfer of DNS zones from the primary to the Secondary DNS server(s). One primary can have any number of Secondary DNS servers that it must communicate with in order to keep track of any zone updates. A zone update is considered a change in the contents of a  zone, which ultimately leads to a Start of Authority (SOA) serial number increase. The zone’s SOA serial is one of the key elements of Secondary DNS; it is how primary and secondary servers synchronize zones. Below is an example of what an SOA record might look like during a dig query.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">example.com\t3600\tIN\tSOA\tashley.ns.cloudflare.com. dns.cloudflare.com. \n2034097105  // Serial\n10000 // Refresh\n2400 // Retry\n604800 // Expire\n3600 // Minimum TTL</pre></code>\n            <p>Each of the numbers is used in the following way:</p><ol><li><p>Serial - Used to keep track of the status of the zone, must be incremented at every change.</p></li><li><p>Refresh - The maximum number of seconds that can elapse before a Secondary DNS server must check for a SOA serial change.</p></li><li><p>Retry - The maximum number of seconds that can elapse before a Secondary DNS server must check for a SOA serial change, after previously failing to contact the primary.</p></li><li><p>Expire - The maximum number of seconds that a Secondary DNS server can serve stale information, in the event the primary cannot be contacted.</p></li><li><p>Minimum TTL - Per <a href=\"https://tools.ietf.org/html/rfc2308\">RFC 2308</a>, the number of seconds that a DNS negative response should be cached for.</p></li></ol><p>Using the above information, the Secondary DNS server stores an SOA record for each of the zones it is tracking. When the serial increases, it knows that the zone must have changed, and that a zone transfer must be initiated.  </p><h2>Serial Tracking</h2><p>Serial increases can be detected in the following ways:</p><ol><li><p>The fastest way for the Secondary DNS server to keep track of a serial change is to have the primary server NOTIFY them any time a zone has changed using the DNS protocol as specified in <a href=\"https://www.ietf.org/rfc/rfc1996.txt\">RFC 1996</a>, Secondary DNS servers will instantly be able to initiate a zone transfer.</p></li><li><p>Another way is for the Secondary DNS server to simply poll the primary every “Refresh” seconds. This isn’t as fast as the NOTIFY approach, but it is a good fallback in case the notifies have failed.</p></li></ol><p>One of the issues with the basic NOTIFY protocol is that anyone on the Internet could potentially notify the Secondary DNS server of a zone update. If an initial SOA query is not performed by the Secondary DNS server before initiating a zone transfer, this is an easy way to perform an <a href=\"https://www.cloudflare.com/learning/ddos/dns-amplification-ddos-attack/\">amplification attack</a>. There is two common ways to prevent anyone on the Internet from being able to NOTIFY Secondary DNS servers:</p><ol><li><p>Using transaction signatures (TSIG) as per <a href=\"https://tools.ietf.org/html/rfc2845\">RFC 2845</a>. These are to be placed as the last record in the extra records section of the DNS message. Usually the number of extra records (or ARCOUNT) should be no more than two in this case.</p></li><li><p>Using IP based access control lists (ACL). This increases security but also prevents flexibility in server location and IP address allocation.</p></li></ol><p>Generally NOTIFY messages are sent over UDP, however TCP can be used in the event the primary server has reason to believe that TCP is necessary (i.e. firewall issues).</p><h2>Zone Transfers</h2><p>In addition to serial tracking, it is important to ensure that a standard protocol is used between primary and Secondary DNS server(s), to efficiently transfer the zone. DNS zone transfer protocols do not attempt to solve the confidentiality, authentication and integrity triad (CIA); however, the use of TSIG on top of the basic zone transfer protocols can provide integrity and authentication. As a result of <a href=\"https://www.cloudflare.com/learning/dns/what-is-dns/\">DNS</a> being a public protocol, confidentiality during the zone transfer process is generally not a concern.</p><h3>Authoritative Zone Transfer (AXFR)</h3><p>AXFR is the original zone transfer protocol that was specified in <a href=\"https://tools.ietf.org/html/rfc1034\">RFC 1034</a> and <a href=\"https://tools.ietf.org/html/rfc1035\">RFC 1035</a> and later further explained in <a href=\"https://tools.ietf.org/html/rfc5936\">RFC 5936</a>. AXFR is done over a TCP connection because a reliable protocol is needed to ensure packets are not lost during the transfer. Using this protocol, the primary DNS server will transfer all of the zone contents to the Secondary DNS server, in one connection, regardless of the serial number. AXFR is recommended to be used for the first zone transfer, when none of the records are propagated, and IXFR is recommended after that.</p><h3>Incremental Zone Transfer (IXFR)</h3><p>IXFR is the more sophisticated zone transfer protocol that was specified in <a href=\"https://tools.ietf.org/html/rfc1995\">RFC 1995</a>. Unlike the AXFR protocol, during an IXFR, the primary server will only send the secondary server the records that have changed since its current version of the zone (based on the serial number). This means that when a Secondary DNS server wants to initiate an IXFR, it sends its current serial number to the primary DNS server. The primary DNS server will then format its response based on previous versions of changes made to the zone. IXFR messages must obey the following pattern:</p><ol><li><p><b><i>Current latest SOA</i></b></p></li><li><p><b><i>Secondary server current SOA</i></b></p></li><li><p><b><i>DNS record deletions</i></b></p></li><li><p><b><i>Secondary server current SOA + changes</i></b></p></li><li><p><b><i>DNS record additions</i></b></p></li><li><p><b><i>Current latest SOA</i></b></p></li></ol><p>Steps 2,3,4,5,6 can be repeated any number of times, as each of those represents one change set of deletions and additions, ultimately leading to a new serial.</p><p>IXFR can be done over UDP or TCP, but again TCP is generally recommended to avoid packet loss.</p><h2>How Does Secondary DNS Work at Cloudflare?</h2><p>The DNS team loves microservice architecture! When we initially implemented Secondary DNS at Cloudflare, it was done using <a href=\"https://mesosphere.github.io/marathon/\">Mesos Marathon</a>. This allowed us to separate each of our services into several different marathon apps, individually scaling apps as needed. All of these services live in our core data centers. The following services were created:</p><ol><li><p>Zone Transferer - responsible for attempting IXFR, followed by AXFR if IXFR fails.</p></li><li><p>Zone Transfer Scheduler - responsible for periodically checking zone SOA serials for changes.</p></li><li><p>Rest API - responsible for registering new zones and primary nameservers.</p></li></ol><p>In addition to the marathon apps, we also had an app external to the cluster:</p><ol><li><p>Notify Listener - responsible for listening for notifies from primary servers and telling the Zone Transferer to initiate an AXFR/IXFR.</p></li></ol><p>Each of these microservices communicates with the others through <a href=\"https://kafka.apache.org/\">Kafka</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6cS9HY6kpiqdrdyD3tqQjI/035e886584658b3d1996f2d20e515b0d/image8-1.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"776\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 1: Secondary DNS Microservice Architecture‌‌</p><p>Once the zone transferer completes the AXFR/IXFR, it then passes the zone through to our zone builder, and finally gets pushed out to our edge at each of our <a href=\"https://www.cloudflare.com/en-gb/network/\">200 locations.</a></p><p>Although this current architecture worked great in the beginning, it left us open to many vulnerabilities and scalability issues down the road. As our Secondary DNS product became more popular, it was important that we proactively scaled and reduced the technical debt as much as possible. As with many companies in the industry, Cloudflare has recently migrated all of our core data center services to <a href=\"https://kubernetes.io/docs/concepts/overview/what-is-kubernetes/\">Kubernetes</a>, moving away from individually managed apps and Marathon clusters.</p><p>What this meant for Secondary DNS is that all of our Marathon-based services, as well as our NOTIFY Listener, had to be migrated to Kubernetes. Although this long migration ended up paying off, many difficult challenges arose along the way that required us to come up with unique solutions in order to have a seamless, zero downtime migration.</p><h2>Challenges When Migrating to Kubernetes</h2><p>Although the entire DNS team agreed that kubernetes was the way forward for Secondary DNS, it also introduced several challenges. These challenges arose from a need to properly scale up across many distributed locations while also protecting each of our individual data centers. Since our core does not rely on anycast to automatically distribute requests, as we introduce more customers, it opens us up to denial-of-service attacks.</p><p>The two main issues we ran into during the migration were:</p><ol><li><p>How do we create a distributed and reliable system that makes use of kubernetes principles while also making sure our customers know which IPs we will be communicating from?</p></li><li><p>When opening up a public-facing UDP socket to the Internet, how do we protect ourselves while also preventing unnecessary spam towards primary nameservers?.</p></li></ol><h3>Issue 1:</h3><p>As was previously mentioned, one form of protection in the Secondary DNS protocol is to only allow certain IPs to initiate zone transfers. There is a fine line between primary servers allow listing too many IPs and them having to frequently update their IP ACLs. We considered several solutions:</p><ol><li><p><a href=\"https://github.com/nirmata/kube-static-egress-ip\">Open source k8s controllers</a></p></li><li><p>Altering <a href=\"https://en.wikipedia.org/wiki/Network_address_translation\">Network Address Translation(NAT)</a> entries</p></li><li><p>Do not use k8s for zone transfers</p></li><li><p>Allowlist all Cloudflare IPs and dynamically update</p></li><li><p>Proxy egress traffic</p></li></ol><p>Ultimately we decided to proxy our egress traffic from k8s, to the DNS primary servers, using static proxy addresses. <a href=\"https://github.com/shadowsocks/shadowsocks-libev\">Shadowsocks-libev</a> was chosen as the <a href=\"https://en.wikipedia.org/wiki/SOCKS\">SOCKS5</a> implementation because it is fast, secure and known to scale. In addition, it can handle both UDP/TCP and IPv4/IPv6.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2JcJoxa44FoxHtMrWBXCP5/a38eceacbe063b32e05f2eb0c6638cb2/image1-8.png\" alt=\"\" class=\"kg-image\" width=\"1740\" height=\"895\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 2: Shadowsocks proxy Setup</p><p>The partnership of k8s and Shadowsocks combined with a large enough IP range brings many benefits:</p><ol><li><p>Horizontal scaling</p></li><li><p>Efficient load balancing</p></li><li><p>Primary server ACLs only need to be updated once</p></li><li><p>It allows us to make use of kubernetes for both the Zone Transferer and the Local ShadowSocks Proxy.</p></li><li><p>Shadowsocks proxy can be reused by many different Cloudflare services.</p></li></ol><h3>Issue 2:</h3><p>The Notify Listener requires listening on static IPs for NOTIFY Messages coming from primary DNS servers. This is mostly a solved problem through the use of <a href=\"https://kubernetes.io/docs/tutorials/services/source-ip/#source-ip-for-services-with-typeloadbalancer\">k8s services of type loadbalancer</a>, however exposing this service directly to the Internet makes us uneasy because of its susceptibility to <a href=\"https://www.cloudflare.com/learning/ddos/dns-flood-ddos-attack/\">attacks</a>. Fortunately <a href=\"https://www.cloudflare.com/ddos/\">DDoS protection</a> is one of Cloudflare&#39;s strengths, which lead us to the likely solution of <a href=\"https://en.wikipedia.org/wiki/Eating_your_own_dog_food\">dogfooding</a> one of our own products, <a href=\"https://www.cloudflare.com/products/cloudflare-spectrum/\">Spectrum</a>.</p><p>Spectrum provides the following features to our service:</p><ol><li><p>Reverse proxy TCP/UDP traffic</p></li><li><p>Filter out Malicious traffic</p></li><li><p>Optimal routing from edge to core data centers</p></li><li><p><a href=\"https://www.cisco.com/c/dam/en_us/solutions/industries/docs/gov/IPV6at_a_glance_c45-625859.pdf\">Dual Stack</a> technology</p></li></ol>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1S3Ha1uEWxV2bbrzSJY9y2/0febbda1ee4fb722a744595db30af419/image5-3.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"639\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 3: Spectrum interaction with Notify Listener</p><p>Figure 3 shows two interesting attributes of the system:</p><ol><li><p><b>Spectrum &lt;-&gt; k8s IPv4 only:</b></p></li><li><p>This is because our custom k8s load balancer currently only supports IPv4; however, Spectrum has no issue terminating the IPv6 connection and establishing a new IPv4 connection.</p></li><li><p><b>Spectrum &lt;-&gt; k8s routing decisions based of L4 protocol</b>:</p></li><li><p>This is because k8s only supports one of TCP/UDP/SCTP per service of type load balancer. Once again, spectrum has no issues proxying this correctly.</p></li></ol><p>One of the problems with using a L4 proxy in between services is that source IP addresses get changed to the source IP address of the proxy (Spectrum in this case). Not knowing the source IP address means we have no idea who sent the NOTIFY message, opening us up to attack vectors. Fortunately, Spectrum’s <a href=\"https://developers.cloudflare.com/spectrum/getting-started/proxy-protocol/\">proxy protocol</a> feature is capable of adding custom headers to TCP/UDP packets which contain source IP/Port information.</p><p>As we are using <a href=\"https://github.com/miekg/dns\">miekg/dns</a> for our Notify Listener, adding proxy headers to the DNS NOTIFY messages would cause failures in validation at the DNS server level. Alternatively, we were able to implement custom <a href=\"https://github.com/miekg/dns/blob/master/server.go#L156-L162\">read and write decorators</a> that do the following:</p><ol><li><p><b>Reader:</b> Extract source address information on inbound NOTIFY messages. Place extracted information into new DNS records located in the additional section of the message.</p></li><li><p><b>Writer:</b> Remove additional records from the DNS message on outbound NOTIFY replies. Generate a new reply using proxy protocol headers.</p></li></ol><p>There is no way to spoof these records, because the server only permits two extra records, one of which is the optional TSIG. Any other records will be overwritten.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5pg2MCnr4MUQapXAtQRLeK/17b6e3c82d4da758986e7172941c63da/image4-6.png\" alt=\"\" class=\"kg-image\" width=\"1460\" height=\"1053\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 4: Proxying Records Between Notifier and Spectrum‌‌</p><p>This custom decorator approach abstracts the proxying away from the Notify Listener through the use of the DNS protocol.  </p><p>Although knowing the source IP will block a significant amount of bad traffic, since NOTIFY messages can use both UDP and TCP, it is prone to <a href=\"/the-root-cause-of-large-ddos-ip-spoofing/\">IP spoofing</a>. To ensure that the primary servers do not get spammed, we have made the following additions to the Zone Transferer:</p><ol><li><p>Always ensure that the SOA has actually been updated before initiating a zone transfer.</p></li><li><p>Only allow at most one working transfer and one scheduled transfer per zone.</p></li></ol><h2>Additional Technical Challenges</h2><h3>Zone Transferer Scheduling</h3><p>As shown in figure 1, there are several ways of sending Kafka messages to the Zone Transferer in order to initiate a zone transfer. There is no benefit in having a large backlog of zone transfers for the same zone. Once a zone has been transferred, assuming no more changes, it does not need to be transferred again. This means that we should only have at most one transfer ongoing, and one scheduled transfer at the same time, for any zone.</p><p>If we want to limit our number of scheduled messages to one per zone, this involves ignoring Kafka messages that get sent to the Zone Transferer. This is not as simple as ignoring specific messages in any random order. One of the benefits of Kafka is that it holds on to messages until the user actually decides to acknowledge them, by committing that messages offset. Since Kafka is just a queue of messages, it has no concept of order other than first in first out (FIFO). If a user is capable of reading from the Kafka topic concurrently, it is entirely possible that a message in the middle of the queue be committed before a message at the end of the queue.</p><p>Most of the time this isn’t an issue, because we know that one of the concurrent readers has read the message from the end of the queue and is processing it. There is one Kubernetes-related catch to this issue, though: pods are ephemeral. The kube master doesn’t care what your concurrent reader is doing, it will kill the pod and it’s up to your application to handle it.</p><p>Consider the following problem:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2LbPUGXSdf0uzNeI68U06Q/c21959b1bf7b4ca5ab51c3cf58378f9c/image2-2.png\" alt=\"\" class=\"kg-image\" width=\"1483\" height=\"486\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 5: Kafka Partition‌‌</p><ol><li><p>Read offset 1. Start transferring zone 1.</p></li><li><p>Read offset 2. Start transferring zone 2.</p></li><li><p>Zone 2 transfer finishes. Commit offset 2, essentially also marking offset 1.</p></li><li><p>Restart pod.</p></li><li><p>Read offset 3 Start transferring zone 3.</p></li></ol><p>If these events happen, zone 1 will never be transferred. It is important that zones stay up to date with the primary servers, otherwise stale data will be served from the Secondary DNS server. The solution to this problem involves the use of a list to track which messages have been read and completely processed. In this case, when a zone transfer has finished, it does not necessarily mean that the kafka message should be immediately committed. The solution is as follows:</p><ol><li><p>Keep a list of Kafka messages, sorted based on offset.</p></li><li><p>If finished transfer, remove from list:</p></li><li><p>If the message is the oldest in the list, commit the messages offset.</p></li></ol>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1g6Ku6Is2fixeHyiTIoEwC/32bf48f615987d67d56146208dc999e3/image9-2.png\" alt=\"\" class=\"kg-image\" width=\"1721\" height=\"1999\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 6: Kafka Algorithm to Solve Message Loss</p><p>This solution is essentially soft committing Kafka messages, until we can confidently say that all other messages have been acknowledged. It’s important to note that this only truly works in a distributed manner if the Kafka messages are keyed by zone id, this will ensure the same zone will always be processed by the same Kafka consumer.</p><h2>Life of a Secondary DNS Request</h2><p>Although Cloudflare has a <a href=\"https://www.cloudflare.com/en-gb/network/\">large global network</a>, as shown above, the zone transferring process does not take place at each of the edge datacenter locations (which would surely overwhelm many primary servers), but rather in our core data centers. In this case, how do we propagate to our edge in seconds? After transferring the zone, there are a couple more steps that need to be taken before the change can be seen at the edge.</p><ol><li><p>Zone Builder - This interacts with the Zone Transferer to build the zone according to what Cloudflare edge understands. This then writes to <a href=\"/introducing-quicksilver-configuration-distribution-at-internet-scale/\">Quicksilver</a>, our super fast, distributed KV store.</p></li><li><p>Authoritative Server - This reads from Quicksilver and serves the built zone.</p></li></ol>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3INig0h7w1oSks6FwirZls/234548723a6de8eac8004ba5264e3a57/image3-6.png\" alt=\"\" class=\"kg-image\" width=\"1200\" height=\"758\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 7: End to End Secondary DNS‌‌</p><h2>What About Performance?</h2><p>At the time of writing this post, according to <a href=\"http://dnsperf.com\">dnsperf.com</a>, Cloudflare leads in global performance for both <a href=\"https://www.dnsperf.com/\">Authoritative</a> and <a href=\"https://www.dnsperf.com/#!dns-resolvers\">Resolver</a> DNS. Here, Secondary DNS falls under the authoritative DNS category here. Let’s break down the performance of each of the different parts of the Secondary DNS pipeline, from the primary server updating its records, to them being present at the Cloudflare edge.</p><ol><li><p>Primary Server to Notify Listener - Our most accurate measurement is only precise to the second, but we know UDP/TCP communication is likely much faster than that.</p></li><li><p>NOTIFY to Zone Transferer - This is negligible</p></li><li><p>Zone Transferer to Primary Server - 99% of the time we see ~800ms as the average latency for a zone transfer.</p></li></ol>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/70uQkuuFtfY5UPVrza1ZpK/a44d3c567a5ff04ee6e36a07242bce3b/image7-2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"746\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 8: Zone XFR latency</p><p>4. Zone Transferer to Zone Builder - 99% of the time we see ~10ms to build a zone.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3cfNN2ilrDOES8QwG5ok4I/dff8def77bf9182df3ee2242290e1468/image11-1.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"354\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 9: Zone Build time</p><p>5. Zone Builder to Quicksilver edge: 95% of the time we see less than 1s propagation.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1imVuigo0GB7gLug2ISqL7/308cbd2349561ab029712c301ac3c8d1/image6-2.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"878\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 10: Quicksilver propagation time</p><p>End to End latency: less than 5 seconds on average. Although we have several external probes running around the world to test propagation latencies, they lack precision due to their sleep intervals, location, provider and number of zones that need to run. The actual propagation latency is likely much lower than what is shown in figure 10. Each of the different colored dots is a separate data center location around the world.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5BjcchQWzBqyYbX6ksIYMj/b58b93fe2a505cef309271661aa5a1a4/image10.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"433\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 11: End to End Latency</p><p>An additional test was performed manually to get a real world estimate, the test had the following attributes:</p><p>Primary server: NS1Number of records changed: 1Start test timer event: Change record on NS1Stop test timer event: Observe record change at Cloudflare edge using digRecorded timer value: 6 seconds</p><h2>Conclusion</h2><p>Cloudflare serves 15.8 trillion DNS queries per month, operating within 100ms of 99% of the Internet-connected population. The goal of Cloudflare operated Secondary DNS is to allow our customers with custom DNS solutions, be it on-premise or some other DNS provider, to be able to take advantage of Cloudflare&#39;s DNS performance and more recently, through <a href=\"/orange-clouding-with-secondary-dns/\">Secondary Override</a>, our proxying and security capabilities too. Secondary DNS is currently available on the Enterprise plan, if you’d like to take advantage of it, please let your account team know. For additional documentation on Secondary DNS, please refer to our <a href=\"https://support.cloudflare.com/hc/en-us/articles/360001356152-How-do-I-setup-and-manage-Secondary-DNS-\">support article</a>.</p>",
		"id": "2W2no7YfwWXkJXtgYtK4CU",
		"localeList": {
			"name": "Secondary DNS - Deep Dive Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Secondary DNS is currently available on the Enterprise plan, if you’d like to take advantage of it, please let your account team know.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2020-09-15T12:00:00.000+01:00",
		"slug": "secondary-dns-deep-dive",
		"tags": [
			{
				"id": "5fZHv2k9HnJ7phOPmYexHw",
				"name": "DNS",
				"slug": "dns"
			},
			{
				"id": "J6TBSPnIpZiSBD5OIBxBf",
				"name": "Growth",
				"slug": "growth"
			},
			{
				"id": "3Qpksw30KF5bmGKLdvbsm1",
				"name": "Kubernetes",
				"slug": "kubernetes"
			},
			{
				"id": "48r7QV00gLMWOIcM1CSDRy",
				"name": "Speed & Reliability",
				"slug": "speed-and-reliability"
			},
			{
				"id": "2UVIYusJwlvsmPYl2AvSuR",
				"name": "Deep Dive",
				"slug": "deep-dive"
			}
		],
		"title": "Secondary DNS - Deep Dive",
		"updated_at": "2024-08-27T01:58:49.546Z",
		"url": "https://blog.cloudflare.com/secondary-dns-deep-dive"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}