{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Henry de Valence",
				"slug": "henry",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/28Kmog7MLC2ecOGDwlVa7h/de65e5ee7c37fbd43c57ffa29e9aff3a/henry.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Most of today's cryptography is designed to be secure against an adversary with enormous amounts of computational power. This means estimating how much work certain computations require, and choosing cryptographic parameters based on our best estimates.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6SbWVx8lx9LMBcht8AgwwR/6a21b8cf24db3e3e7983a5dd95ffb3da/sidh-go.jpg",
		"featured": false,
		"html": "<p><i>This blog post presents a new cryptography primitive that we open sourced: </i><a href=\"https://github.com/cloudflare/p751sidh\"><i>p751sidh</i></a><i>.</i></p><h3>The Quantum Threat</h3><p>Most of today&#39;s cryptography is designed to be secure against an adversary with enormous amounts of computational power. This means estimating how much work certain computations (such as factoring a number, or finding a discrete logarithm) require, and choosing cryptographic parameters based on our best estimate of how much work would be required to break the system.</p><p>If it were possible to build a large-scale <a href=\"https://en.wikipedia.org/wiki/Quantum_computing\">quantum computer</a>, many of the problems whose difficulty we rely on for security would no longer be difficult to solve. While it remains unknown whether large-scale quantum computers are possible (see <a href=\"http://www.ams.org/journals/notices/201605/rnoti-p508.pdf\">this article</a> for a good overview), it&#39;s a sufficient risk that there&#39;s wide interest in developing <i>quantum-resistant</i> (or <i>post-quantum</i>) cryptography: cryptography that works on ordinary computers we have today, but which is secure against a possible quantum computer.</p><p>At Cloudflare, our biggest use of cryptography is TLS, which we use both for serving our customers&#39; websites (all Cloudflare sites get free HTTPS), as well as for internal inter-datacenter communication on our backend.</p><p>In the TLS context, we want to create a secure connection between a client and a server. There are basically three cryptographic problems here:</p><ol><li><p>Authenticity: the server needs to prove to the client that it is the real server (and optionally, the client can prove to the server that it&#39;s the real client);</p></li><li><p>Key agreement: the server and client need to agree, over an insecure connection, on a temporary shared secret known only to them;</p></li><li><p>Symmetric encryption: the server and client need to use their shared secret to encrypt the data they want to send over a secure connection.</p></li></ol><p>Authenticity protects against active attackers, but because quantum computers aren&#39;t yet believed to exist, the main risk is a retroactive attack: for instance, a nation-state adversary (let&#39;s say, &quot;NSA&quot; for short) could record encrypted traffic, wait to build a quantum computer, and try to decrypt past traffic. Moreover, quantum algorithms seem to give only a small speedup against symmetric encryption, so the &quot;key&quot; problem to solve is #2, <i>quantum-resistant key agreement</i>.</p><p>This is an active area of research, both in the design of new cryptosystems and in their implementation and deployment. For instance, last year, Google <a href=\"https://security.googleblog.com/2016/07/experimenting-with-post-quantum.html\">concluded an experiment</a> using a lattice-based key exchange in Chrome. Lattice-based cryptosystems are an extremely promising family of quantum-resistant algorithms. Their security relies on well-studied computational problems, and they are computationally efficient. However, they have large key sizes and can require extra communication (which can necessitate additional round-trips in protocols like TLS).</p><p>Another family of cryptosystems are <i>supersingular isogeny</i> systems, in particular <i>supersingular isogeny Diffie-Hellman</i> (SIDH). In contrast to lattice-based systems, they rely on more exotic computational problems and are much more computationally expensive. However, they have much smaller key sizes and do not require extra communication: SIDH fits perfectly into TLS 1.3&#39;s key agreement mechanism.</p><p>TLS 1.3 is the latest version of the TLS protocol. This summer, I&#39;ve been working at Cloudflare on an experiment for a <i>quantum-resistant</i> version of TLS 1.3 using a hybrid key agreement combining X25519 and supersingular isogeny Diffie-Hellman (SIDH). To achieve this, I implemented a TLS 1.3 client in Go (as part of Cloudflare&#39;s <a href=\"https://github.com/cloudflare/tls-tris\">tls-tris</a>), implemented SIDH in Go for the <code>amd64</code> architecture, and combined the SIDH implementation with the TLS 1.3 key agreement mechanism to perform a quantum-resistant TLS 1.3 handshake. This extends previous work by Microsoft Research on a SIDH-based key exchange for TLS 1.2, discussed below.</p><h3>Diffie-Hellman key agreement in TLS 1.3</h3><p>In the most recent version of TLS, TLS 1.3, the key agreement mechanism (part 2) is cleanly separated from the authentication mechanism (part 1). TLS 1.3 does key agreement using <a href=\"https://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange\">Diffie-Hellman</a>, usually with an elliptic curve group. Before diving into the quantum-resistant version, let&#39;s review how Diffie-Hellman (DH) works, and how it works in the context of TLS 1.3.</p><p>In Diffie-Hellman, we have two parties, Alice and Bob, wishing to establish a shared secret. They fix an <a href=\"https://en.wikipedia.org/wiki/Abelian_group\">abelian group</a> <code>G</code> of prime order <code>p</code>, written additively, as well as a generator <code>P</code> of <code>G</code> (the basepoint). Alice then selects a uniformly random integer <code>a</code> in the range <code>[0,p]</code>. This determines a multiplication-by-<code>a</code> map, usually denoted <code>[a] : G -&gt; G</code>. Alice computes the <code>[a]P</code>, the image of the basepoint under her map, and sends it to Bob. Similarly, Bob chooses a random integer <code>b</code> in the range <code>[0,p]</code>, determining the map <code>[b]</code>, computes <code>[b]P</code>, and sends it to Alice. Alice and Bob then agree on a shared secret <code>[ab]P</code>, which Alice computes as <code>[a]([b]P)</code> and Bob computes as <code>[b]([a]P)</code>:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2ylTypDJrBnx7ePlqXUy9z/15fec958ab98e8e2fabef7087b41ecd7/dh_diagram_1024.jpg\" alt=\"DH diagram\" class=\"kg-image\" width=\"1024\" height=\"768\" loading=\"lazy\"/>\n            \n            </figure><p>(Here I&#39;m describing the process in terms of maps, in order to show similarity with SIDH later).</p><p>In the TLS 1.3 context, this works as follows. A client initiates a connection by sending a TLS ClientHello message, which contains (among other data) a list of DH groups supported by the client, as well as &quot;keyshares&quot; (i.e., the <code>[a]P</code> values) for some (or all) of these groups.</p><p>The server selects one of the DH groups supported by both the server and the client. In the happy case, the server selects a group the client provided a keyshare for, and sends back a ServerHello message containing the server&#39;s keyshare. From this point on, all handshake messages between the client and server, such as certificates, extensions, etc., are encrypted using a &quot;handshake secret&quot; derived from the keyshares. (In the unhappy case, where the client did not provide an acceptable keyshare, the server asks the client to retry, forcing an extra round-trip).</p><p>Application data is later encrypted with a key derived from the handshake secret, as well as other data, so the security of the application data depends on the security of the key agreement. However, all existing DH groups in TLS are vulnerable to quantum algorithms.</p><h3>Supersingular-isogeny Diffie-Hellman</h3><p>SIDH, proposed in 2011 by Luca De Feo and David Jao, is a relatively recent proposal for using elliptic curves to build a quantum-resistant Diffie-Hellman scheme.</p><p>Roughly speaking, rather than working within a single elliptic curve group, SIDH works within a family of related, &quot;isogenous&quot; elliptic curves.</p><p>An <i>isogeny</i> is a map <code>phi : E_1 -&gt; E_2</code> of elliptic curves which sends the identity element of the source curve <code>E_1</code> to the identity of the target curve <code>E_2</code>. It turns out that for every isogeny <code>phi: E_1 -&gt; E_2</code>, there&#39;s a dual isogeny <code>psi: E_2 -&gt; E_1</code>, so we can say that two curves are <i>isogenous</i> if they&#39;re linked by an isogeny.</p><p>Now we can consider an <i>isogeny graph</i>, whose edges are isogenies and whose vertices are elliptic curves. Instead of choosing secret multiplication-by-<code>n</code> maps to move around inside one elliptic curve, Alice and Bob choose secret isogenies to move around inside a family of isogenous curves (i.e., they choose a random path through the isogeny graph), and the security of the system is related to the difficulty of computing isogenies between arbitrary curves.</p><p>The resulting diagram is slightly more complicated, but structurally similar to the one above:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6yH9scwz585cUkMWgFT5Pa/d3dc3f97fdd5d92ec7093776fb1d955d/sidh_phi_prim_kernel.jpg\" alt=\"sidh_phi_prim_kernel\" class=\"kg-image\" width=\"1024\" height=\"768\" loading=\"lazy\"/>\n            \n            </figure><p>What exactly is going on here? The starting curve <code>E_0</code>, as well as the points <code>P_A, Q_A, P_B, Q_B</code>, are system parameters.</p><p>An isogeny is uniquely determined by its kernel (the subgroup of points on the source curve which the isogeny maps to the identity point of the target curve). To choose an secret isogeny <code>phi_A</code>, Alice chooses secret scalars <code>m_A, n_A</code>, which determine a secret point <code>[m_A]P_A + [n_A]Q_A</code>, which generates the kernel subgroup <code>&lt;[m_A]P_A + [n_A]Q_A&gt;</code> and hence determines her secret isogeny <code>phi_A</code>. Alice evaluates <code>phi_A</code> at the points <code>P_B</code>, <code>Q_B</code>, and sends <code>E_A</code>, <code>phi_A(P_B)</code>, <code>phi_A(Q_B)</code> to Bob, who does the same steps with <code>A</code> and <code>B</code> swapped.</p><p>Next, Alice uses <code>E_B</code>, <code>phi_B(P_A)</code>, <code>phi_B(Q_A)</code> to construct an isogeny <code>phi&#39;_A</code> with kernel <code>&lt;[m_A]phi_B(P_A) + [n_A]phi_B(Q_A)&gt;</code>, while Bob uses <code>E_A</code>, <code>phi_A(P_B)</code>, <code>phi_A(Q_B)</code> to construct an isogeny <code>phi&#39;_B</code> with kernel <code>&lt;[m_B]phi_A(P_B) + [n_B]phi_A(Q_B)&gt;</code>.</p><p>Now <code>phi&#39;_A</code> maps to the curve <code>E_AB</code>, while <code>phi&#39;_B</code> maps to the curve <code>E_BA</code>. The curves <code>E_AB</code> and <code>E_BA</code> are isomorphic. Since elliptic curves are classified by a number called the <i>j-invariant</i>, <code>j(E_AB) = j(E_BA)</code>, and this is the shared secret between Alice and Bob.</p><p>A detailed technical explanation of this process can be found in the <a href=\"https://eprint.iacr.org/2011/506\">expansion to the SIDH paper</a> by Luca De Feo, David Jao, and Jérôme Plût (the diagram above is Figure 1 of that paper), and an explanation in terms of rocket ships traveling through supersingular space-time can be found in <a href=\"https://gist.github.com/defeo/163444a53252ba90cca6a3b550e6dd31\">this article</a> by Luca De Feo. Alternately, there&#39;s <a href=\"https://www.youtube.com/watch?v=ctP24WKusX0\">a recording here</a> of Deirdre Connolly&#39;s talk at the February 2017 Cloudflare Crypto Meetup.</p><p>In 2016, Craig Costello, Patrick Longa, and Michael Naehrig, at Microsoft Research, published a paper on <a href=\"https://eprint.iacr.org/2016/413\">efficient algorithms for SIDH</a>, applying optimization techniques from high-speed ECC to the original SIDH proposal.</p><p>They also published a constant-time, optimized <a href=\"https://github.com/Microsoft/PQCrypto-SIDH\">implementation</a> written in C and assembly, and a <a href=\"https://github.com/dconnolly/sidh-for-openssl-patch\">patch to OpenSSL</a> to create SIDH ciphersuites for TLS 1.2. My Go implementation builds on their work (both algorithms and code), as discussed below.</p><h3>SIDH key agreement in Go TLS</h3><p>The SIDH implementation in the <a href=\"https://github.com/cloudflare/p751sidh\"><code>p751sidh</code> package</a> has two parts: an outer <code>p751sidh</code> package containing SIDH functionality, and an inner <code>p751toolbox</code> package providing low-level functionality.</p><p>Because SIDH is implemented in terms of operations in a large finite field, the performance of the field arithmetic is critical to the performance of the protocol. Unfortunately, this requires writing assembly, because writing high-performance arithmetic is not possible in Go — it&#39;s simply not a design goal of the language. (There are a few reasons, most notably that there&#39;s no way to directly compute the (128-bit) product of 64-bit integers.)</p><p>The code is partially derived from the Microsoft Research implementation mentioned above. In particular, the field arithmetic is ported from the MSR assembly, and the implementation strategy follows their paper. (I experimented with a prototype implementation of field arithmetic using AVX2 and unsaturated limbs, but decided not to use it, since it got similar performance at the cost of less portability and more power use).</p><p>The assembly code for the lowest level field arithmetic is oriented around pointers to fixed-size buffers; this is wrapped in a Go API modeled after the <code>big.Int</code> API. To test that the code behaves correctly, I used Go&#39;s <code>testing/quick</code> package to write property-based tests, which generate random field elements and compare the results of various operations against the same operations using <code>big.Int</code>.</p><p>Curve and isogeny functions are implemented using the Go API, and the outer-level SIDH functions achieve comparable performance as compared to the MSR implementation. In rough benchmarks, the Go implementation appears to be within 2-6% of the MSR implementation. The entire implementation is constant-time.</p><p>Concretely, on a T460s, Skylake i7-6600U @2.6GHz<a href=\"#fn1\">[1]</a>, key generation and shared secret computations take 11-13ms. Note that unlike classic Diffie-Hellman, Alice and Bob&#39;s computations are slightly different, so they have different timings.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">BenchmarkAliceKeyGen             \t     11,709,778 ns/op\nBenchmarkBobKeyGen               \t     13,073,380 ns/op\nBenchmarkSharedSecretAlice       \t     11,256,985 ns/op\nBenchmarkSharedSecretBob         \t     12,984,817 ns/op</pre></code>\n            <p>This is much more computationally expensive than a conventional ECDH key agreement, or a lattice-based key agreement. However, from the point of view of latency, this might not be so bad. For example, 12 milliseconds is the round-trip distance between Paris and Amsterdam, and so a key agreement requiring extra communication could easily take longer, even if the computations were less expensive.</p><p>Because SIDH is still new and unproven, the TLS integration performs a hybrid key exchange: it sends both an X25519 keyshare and an SIDH keyshare, performs both X25519 and SIDH shared secret computations, and feeds both shared secrets into the TLS key derivation mechanism. This ensures that even if SIDH turns out to be broken, the key agreement is at least as secure as X25519.</p><p>The TLS component is implemented as part of <a href=\"https://github.com/cloudflare/tls-tris\"><code>tls-tris</code></a>, Cloudflare&#39;s fork of Go&#39;s <code>crypto/tls</code> package, which has a partial implementation of TLS 1.3, Draft 18. Because <code>tris</code> didn&#39;t support client functionality, I implemented a basic TLS 1.3 client before working on SIDH.</p><p>The hybrid key exchange is specified using the group identifier <code>0xFE24</code>. The <code>0xFE</code> places it in the private-use reserved codeblock <code>0xFE00..0xFEFF</code>, since standardizing SIDH would be premature at this time; the number <code>24</code> was chosen due to its deep <a href=\"https://en.wikipedia.org/wiki/24_(number)#In_mathematics\">mathematical</a> <a href=\"http://math.ucr.edu/home/baez/numbers/24.pdf\">significance</a> and connection to <a href=\"https://en.wikipedia.org/wiki/Monstrous_moonshine\">moonshine</a>.</p><p>The entire SIDH integration takes <a href=\"https://github.com/cloudflare/tls-tris/commit/e47a4e7e1a5e11d1a3adab392248399ae7426695\">less than 100 lines of code.</a></p><h3>Misassembly hazards in Go assembly</h3><p>The Microsoft Research SIDH implementation provides x64 assembly for field arithmetic, but Go&#39;s assembler uses <a href=\"https://golang.org/doc/asm\">a bespoke syntax derived from Plan 9</a>, so reusing their assembly meant porting it to Go assembly.</p><p>When I first did this, the code produced incorrect results, even though all the instructions should have been exactly the same. I was eventually able to find the problem by dissassembling the generated Go binary, and comparing to the original assembly.</p><p>The original assembly was roughly of the form</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">  ...\n  sbb    r10, rax\n  movq   rax, 0\n  sbb    rax, 0\n  ...</pre></code>\n            <p>The <code>sbb dst, src</code> instruction is &quot;subtract with borrow&quot;; this instruction reads the carry flag <code>CF</code> and sets <code>dst = dst - (src + CF)</code>, <code>CF = 1</code> if <code>dst &lt; src+CF</code>. So, this code is supposed to set the <code>rax</code> register to <code>0</code> if the first subtraction did not underflow, and to <code>1111...11</code> if it did. (This value is used later in the computation as a mask). However, writing</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">  ...\n  SBBQ    AX, R10\n  MOVQ    $0, AX\n  SBBQ    $0, AX\n  ...</pre></code>\n            <p>does not have the same result. The reason is that the Go assembler misassembles the <code>MOVQ $0, AX</code> instruction to <code>xor eax, eax</code>. This instruction has a shorter encoding. Unfortunately, it also has different behaviour: it clears the carry flag, breaking the program.</p><p>The reason this happens is that <code>MOV</code> in Go assembly is declared to be a &quot;pseudoinstruction&quot;, which does not necessarily correspond to a literal <code>mov</code> instruction. Unfortunately, there&#39;s no specification of which instructions are pseudoinstructions, and what their behaviour is — <code>MOV</code> in Go assembly is defined to clobber flags, but this isn&#39;t documented outside of compiler internals.</p><p>To work around this issue, we can drop literal bytes into the instruction stream. In this case, we write</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">  #define ZERO_AX_WITHOUT_CLOBBERING_FLAGS BYTE   $0xB8; BYTE $0; BYTE $0; BYTE $0; BYTE $0;\n  ...\n  SBBQ    AX, R10\n  ZERO_AX_WITHOUT_CLOBBERING_FLAGS\n  SBBQ    $0, AX</pre></code>\n            <p>to insert the bytes encoding the <code>mov eax, 0</code> instruction, which leaves the carry flag intact.</p><h3>Source Code</h3><p>This implementation is still experimental, and should not be used in production without review. The computational cost of SIDH may keep it from being practical for short-lived client connections (at least in the near term). However, it may be suitable for long-lived connections, such as inter-datacenter connections, where the cost of the handshake is amortized over the length of the connection.</p><p>To find out more, the SIDH implementation can be found on GitHub as the <a href=\"https://github.com/cloudflare/p751sidh\"><code>p751sidh</code> package</a>. The TLS integration can be found on my <a href=\"https://github.com/cloudflare/tls-tris/tree/hdevalence/sidh\"><code>hdevalence/sidh</code> branch</a> of <a href=\"https://github.com/cloudflare/tls-tris\"><code>tls-tris</code></a>.</p><p>Thanks to Craig Costello, Diego Aranha, Deirdre Connolly, Nick Sullivan, Watson Ladd, Filippo Valsorda, and George Tankersley for their advice, comments, and discussions.</p><hr/><ol><li><p>Unfortunately, Lenovo&#39;s BIOS does not allow disabling Turbo Boost. <a href=\"#fnref1\">↩︎</a></p></li></ol>",
		"id": "Q8E7P5bXIbEbdoK0zOdXR",
		"localeList": {
			"name": "SIDH in Go for quantum-resistant TLS 1.3 Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Most of today's cryptography is designed to be secure against an adversary with enormous amounts of computational power.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-09-01T21:48:00.000+01:00",
		"reading_time": 9,
		"slug": "sidh-go",
		"tags": [
			{
				"id": "14zCAfc7F9ROKtNbSxs2Pe",
				"name": "TLS 1.3",
				"slug": "tls-1-3"
			},
			{
				"id": "56vA0Z6hqev6QaJBQmO2J8",
				"name": "TLS",
				"slug": "tls"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "6lhzEBz2B56RKa4nUEAGYJ",
				"name": "Programming",
				"slug": "programming"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			}
		],
		"title": "SIDH in Go for quantum-resistant TLS 1.3",
		"updated_at": "2024-08-27T02:28:47.652Z",
		"url": "https://blog.cloudflare.com/sidh-go"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}