{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Bas Westerbaan",
				"slug": "bas",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4KeBG8XO1ADZHuEV9v5Hwz/0d13b2a495e2c758c90ca80b3eed1860/bas.png",
				"location": "The Netherlands",
				"website": "https://bas.westerbaan.name",
				"twitter": "@bwesterb",
				"facebook": null
			}
		],
		"excerpt": "How much room does TLS have for the big post-quantum signatures? We had a look: it’s tight.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2FKeyuwSu6FcYMAG7Jglla/9f87b62f1b28a9a880deb0f6b64ad825/sizing-up-post-quantum-signatures.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3vOvxNmO1CVHGmn09PDspE/28e7bcf0acd089fb63dbe3f70dbb1885/image4-6.png\" alt=\"Sizing Up Post-Quantum Signatures\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Quantum computers are a boon and a bane. Originally <a href=\"https://link.springer.com/chapter/10.1007%2F978-3-030-23922-0_2\">conceived</a> by Manin and Feynman to simulate nature efficiently, large-scale quantum computers will speed-up innovation in material sciences by orders of magnitude. Consider the technical advances enabled by the discovery of new materials (with bronze, iron, steel and silicon each ascribed their own age!); quantum computers could help to unlock the next age of innovation. Unfortunately, they will also break the majority of the cryptography that’s currently used in TLS to protect our web browsing. They fall in two categories:</p><ol><li><p><b>Digital signatures,</b> such as RSA, which ensure you’re talking to the right server.</p></li><li><p><b>Key exchanges,</b> such as Diffie–Hellman, which are used to agree on encryption keys.</p></li></ol><p>A moderately-sized stable quantum computer will easily break the signatures and key exchanges currently used in TLS using <a href=\"https://en.wikipedia.org/wiki/Shor%27s_algorithm\">Shor’s algorithm</a>. Luckily this can be fixed: over the last two decades, there has been great progress in so-called <b>post-quantum cryptography</b>. “Post quantum”, abbreviated <b>PQ</b>, means secure against quantum computers. Five years ago, the standards institute NIST started a <a href=\"https://csrc.nist.gov/projects/post-quantum-cryptography\">public process</a> to standardise post-quantum signature schemes and key exchanges. The outcome is expected to be announced early 2022.</p><p>At Cloudflare, we’re not just following this process closely, but are also testing the real-world performance of PQ cryptography. In our <a href=\"/the-tls-post-quantum-experiment/\">2019 experiment</a> with Google, we saw that we can switch to a PQ key exchange with little performance impact. Among the NIST finalists, there are many with even better performance. This is good news, as we would like to switch to PQ key exchanges as soon as possible — indeed, an attacker could intercept sensitive data today, then keep and decrypt it years into the future using a quantum computer.</p><h2>Why worry about PQ signatures today</h2><p>One would think we can take it easy with signatures for TLS: we only need to have them replaced before a large quantum computer is built. The situation, however, is more complicated.</p><ul><li><p>The <b>lead time</b> to change signatures is higher. Not only do we need to change the browsers and servers, we also need to change certificate authorities (CAs) and everyone’s certificate management.</p></li><li><p><b>TLS is addicted to small and fast signatures</b>. For this page that you’re viewing we sent six signatures: two in the certificate chain; one handshake signature; one <a href=\"/high-reliability-ocsp-stapling/\">OCSP staple</a> and finally two SCTs used for <a href=\"/introducing-certificate-transparency-and-nimbus/\">certificate transparency</a>.</p></li><li><p>PQ signature schemes have wildly <b>varying performance trade-offs and quirks</b> (as we’ll see below) which stack up quickly with six signatures, which all have slightly different requirements.</p></li></ul><p>One might ask: can’t we be clever and get rid of some of these signatures? We think so! For instance, we can replace the handshake signature with a smaller <a href=\"/kemtls-post-quantum-tls-without-signatures/\">key exchange</a> or suppress <a href=\"https://www.amazon.science/publications/speeding-up-post-quantum-tls-handshakes-by-suppressing-intermediate-ca-certificates\">intermediate certificates</a>. Such fundamental changes take years to be adopted. That is why we are also investigating the performance of plain TLS with <b>drop-in</b> <b>PQ signatures</b>.</p><p>So, what are our options?</p><h2>The zoo of PQ signatures</h2><p>The three finalists of the NIST competition are <a href=\"https://pq-crystals.org/dilithium/index.shtml\">Dilithium</a>, <a href=\"https://falcon-sign.info/\">Falcon</a> and <a href=\"https://www.pqcrainbow.org/\">Rainbow</a>. In the table below we compare them against RSA and ECDSA, both of which are in common use today, and a selection of other PQ schemes that might see standardisation in the future.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3jWjoMzawYpHGELyZHZYxl/2420cbd2ae3c7309f8369c10cb12f982/Screenshot-2021-11-22-at-13.17.20.png\" alt=\"(* There are many caveats to this table. We compare instances of PQC security level 1. Signing and verification times vary considerably by hardware platform and implementation constraints. They should be taken as a rough indication only. The signing time of Falcon512 is discussed later on. We do not list all relevant variants of the NIST alternates or promising schemes. This instance of XMSS can only sign a million messages, is stateful, requires quite a bit of storage for quick signing, is not standardised and thus far from a drop-in replacement. Rainbow has one other variant, which has smaller private keys.)\" class=\"kg-image\" width=\"1616\" height=\"936\" loading=\"lazy\"/>\n            \n            </figure><p>(* There are many caveats to this table. We compare instances of PQC security level 1. Signing and verification times vary considerably by hardware platform and implementation constraints. They should be taken as a rough indication only. The signing time of Falcon512 is discussed later on. We do not list all relevant variants of the NIST alternates or promising schemes. This instance of XMSS can only sign a million messages, is stateful, requires quite a bit of storage for quick signing, is not standardised and thus far from a drop-in replacement. Rainbow has one other variant, which has smaller private keys.)</p><p>None of these PQ signatures are a clear-cut drop-in replacement. To start, all have (much) larger signatures, except for Rainbow, GeMMS and SQISign. Rainbow and GeMMS have huge public keys and SQISign is very slow.</p><h3>TLS signatures</h3><p>To confuse matters even more, the signatures within TLS are not all the same:</p><ul><li><p><b>Online</b>. Only the handshake signature is created with every incoming TLS connection, and so signing needs to be fast. Dilithium fits this role well.</p></li><li><p><b>Offline</b>. All other signatures are made months/years in advance, and so signing time is not that important. This group splits in two:</p><ul><li><p><b>With a public key</b>. The certificate chain includes signatures and their public keys. Here Falcon seems most suited.</p></li><li><p><b>Without a public key</b>. The remaining three (SCTs and OCSP staple) are just signatures. For these, Rainbow seems optimal, as its large public keys are not transmitted.</p></li></ul></li></ul><p>Using Dilithium, Falcon, and Rainbow, together, allows optimization for both speed and size simultaneously, which seems like a great idea. However, combining different signatures at the same time has disadvantages:</p><ul><li><p>A security issue in the design or implementation of one of the signatures compromises the whole.</p></li><li><p>Clients need to implement multiple cryptographic algorithms, in this case three of them, which is troublesome for smaller devices — especially if separate hardware support is needed for each of them.</p></li></ul><p>So do we really need to eke out every byte and every cycle of performance? Or can we stick to a single signature scheme for simplicity and security?</p><h3>Can we pick just one?</h3><p>If we stick to one signature scheme, looking just at the numbers, Falcon512 seems like a reasonable option. It needs 5KB of extra space (compared to a classical handshake), about the same as the Dilithium–Falcon–Rainbow chimera of before. Unfortunately Falcon comes with a caveat: creating signatures efficiently requires constant-time 64-bit floating point arithmetic. Without it, signing is 20x slower. But speed alone is not enough; it <i>has to</i> run in constant time. Without that, one can slowly learn the secret key by measuring the time it takes to create a signature.</p><p>Although PCs typically have a sufficiently constant-time floating-point unit, many smaller devices do not. Thus, Falcon seems ill-suited for general purpose online signatures.</p><p>What about Dilithium2? It needs 17KB extra — let’s find out if that makes a big difference.</p><h2>Evidence by Experiment</h2><p>All the different variables and constraints clearly complicate an already challenging puzzle. The best thing is to just try the options. Over the last few years several interesting papers have appeared studying the various options, such as <a href=\"#skd20\">SKD20</a>, <a href=\"#pst20\">PST20</a>, <a href=\"#skd21\">SKD21</a> and <a href=\"#pknln22\">PKNLN22</a>. These are great starts, but don’t provide a complete picture:</p><ul><li><p>SCTs and OCSP staples have yet to be considered. Leaving half (three) of the signatures out changes the results significantly.</p></li><li><p>The networks tested or emulated offer insights, but are far from representative of real-world conditions. All tests were conducted between two datacenters (which does not include real-world last-mile conditions such as Wi-Fi or spotty mobile connections); <i>or</i> a network was simulated with unrealistic packet loss rates.</p></li></ul><p>Here, Cloudflare can contribute. One of the things we like to do is to put new ideas in the community <a href=\"/cloudflare-research-two-years-in/\">to the test</a> on a global scale.</p><p>In this case we’re just taking a first step. Setting up a real-world experiment with a modified browser is quite involved, especially when we consider the many possible variations. Instead, as a first step, we decided first to investigate the most striking variable, the size, and try to answer the question:</p><p><i>How do larger signatures affect the TLS handshake?</i></p><p>There are two parts to this: how fast are they, and, more importantly, do they work at all?</p><h3>Experimental setup</h3><p>We need some way to emulate bigger signatures without having to modify the clients. We considered several options. The first idea we had was to pad a valid certificate with a dummy extension. That would require a custom certificate for each size to test, which is cumbersome. Then we considered responding with a dummy <i>ServerHello extension</i>. This is, however, not allowed by TLS 1.2 without a corresponding <i>ClientHello extension</i>. In the end, we went for <b>adding dummy certificates</b>.</p><h3>Dummy certificates</h3><p>These dummy certificates are 1kB self-signed invalid certificates that have nothing to do with the certificate chain. To vary the size to test, we simply add more copies. Adding unrelated certificates to the certificate chain is a common misconfiguration and clients have learnt to ignore them. In fact, TLS 1.3 stipulates that these (in <a href=\"https://datatracker.ietf.org/doc/html/rfc2119\">rfc-speak</a>) <i>SHOULD</i> be ignored by the client. Testing out hundreds of browsers, we saw no issues.</p><p>Standards and reality don’t always agree: when inserting dummy certificates on actual traffic, we saw issues with a small, but not insignificant number of clients. We don’t want to ruin anyone’s connection, and so we decided to use separate connections for this purpose.</p><h3>Using challenge pages to launch probes</h3><p>So what did we actually do? On a small percentage of the challenge pages (those with the CAPTCHA), we pick a number <i>n</i> and a random key and send this key in two separate background requests to:</p><ul><li><p><code>0.tls-size-experiment-c.cloudflareresearch.com</code></p></li><li><p><code>_**[n]**_.tls-size-experiment-1.cloudflareresearch.com</code></p></li></ul><p>The first, <b>the control</b>, is a normal webpage that stores the TLS handshake time under the key that’s been sent. The real action happens at the second, <b>the live</b>, which adds the <i>n</i> dummy certificates to its chain. The live also stores handshake time under the given key. We could call it “experimental” instead of “live”, but the benign control connection is also an important part of the experiment. Indeed, it allows us to see if live connections are missing. These endpoints were a breeze to write using <a href=\"/workers-kv-is-ga/\">Cloudflare Workers and KV</a>.</p><h3>How much dummy data to test?</h3><p>Before launching the experiment, we tested several libraries and browsers on the live endpoint to see whether they would error due to the dummy certificates. None rejected a single certificate, but how far can we go? TLS 1.3 theoretically allows a certificate chain of 16MB, but in practice many clients reject a much shorter chain. OpenSSL, for instance, rejects one of 102kB. The most stingy we found is Go’s TLS client, which rejects a handshake larger than 64kB. Because of this, we tested with between 1 and 59 dummy certificates.</p><h3>Intermezzo: TCP’s congestion window</h3><p>So, what did we find? The graphs are in the next section, have a peek! Before diving right in, we would like to explain a crucial concept, the TCP <b>congestion window</b>, that helps us read the results.</p><p>Data sent over the Internet is broken down in packets of around 1.4kB that traverse many routers to reach their destination. Sometimes a router has more incoming packets than it can handle and it has to drop them — this is called <b>congestion</b>. To avoid causing congestion, TCP initially sends just a few packets (typically ten, so ~14kB). Then, with every acknowledgement received in return, the TCP sender will very quickly ramp up the number of packets that it keeps <i>in flight</i>. This number is called the <b>congestion window</b> (<b>cwnd</b>). When it gets too high, congestion occurs, packets are dropped and in response the sender backs off by dialing down the congestion window. Any dropped packet is seen as a sign of congestion by TCP. For this reason, Wi-Fi has its own retransmission mechanism transparent to TCP.</p><p>Considering all this, we would expect to see two effects with larger signatures:</p><ul><li><p><b>Gentle slope.</b> Every single packet needs some extra time to transmit, due to limited bandwidth and possible physical-layer retransmissions. This slope isn’t so gentle if your internet connection is slow or spotty.</p></li><li><p><b>cwnd wall.</b> Once we fill the congestion window, we have to wait for a whole roundtrip before we can continue. This effect is stronger if the <a href=\"https://www.cloudflare.com/learning/cdn/glossary/round-trip-time-rtt/\">roundtrip time (RTT)</a> is higher.</p></li></ul><p>The strength of the two effects can differ. With a fast connection and high RTT we expect to see the graph below on the left. With a slow connection and low RTT, we expect the one on the right.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5jCdECcIdSmu6J04h85L0Y/69a737b1c3aab7e360b659a905d141dd/image2.jpg\" alt=\"illustration of the gentle slope and cwnd wall with different strengths.\" class=\"kg-image\" width=\"1999\" height=\"782\" loading=\"lazy\"/>\n            \n            </figure><p>There might be other unknown effects. The best thing is to have a look.</p><p>In PQ research, the second effect has gained the most attention. The larger signatures simply do not fit in the initial congestion windows used today. A common suggestion in response has been to simply increase the initial congestion window to accommodate the larger signatures. This is far from a <a href=\"https://static.googleusercontent.com/media/research.google.com/en//pubs/archive/36640.pdf\">simple</a> <a href=\"https://datatracker.ietf.org/doc/html/rfc6928\">change</a> to make globally, and we have to understand if this solves the problem to begin with.</p><h2>Results</h2><p>Over 24 days we’ve received 964,499 live connections from 454,218 different truncated IPs (to 24 bits, “/24”, for IPv4 and 48 bits for IPv6) and 11,239 different <a href=\"https://en.wikipedia.org/wiki/Autonomous_system_(Internet)\">ASNs</a>. First, let’s check how many clients had trouble with the bigger handshakes.</p><h3>Can clients handle the larger handshakes?</h3><p>The control connection was missing for 2.4% of the live connections. This is not alarming: we expect some connections to be missing for harmless reasons, such as the user browsing away from the challenge page. There are, however, significantly more control connections without live connection at 3.6%.</p><p>In the graph below on the left we break the number of received live connections down by the number of dummy certificates added. Because we pick the number of certificates randomly, the graph is noisy. To get a clearer picture, we started storing the number of certificates added in the corresponding control request, which gives us the graph on the right. The bumps at 10kB and 30kB suggest that there are clients or middleboxes that cannot handle these handshake sizes.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4AIbHQImRIWL8z1KMW8h05/78a11d4673c0a4f4b7d50a92cc4da82b/image3-13.png\" alt=\"a graph of missing live connections against dummy data added\" class=\"kg-image\" width=\"1999\" height=\"1000\" loading=\"lazy\"/>\n            \n            </figure><h3>Handshake times with larger signatures</h3><p>What is the effect on the handshake time? The graph on the left shows the <a href=\"https://en.wikipedia.org/wiki/Weighted_median\">weighted</a> median and 75th percentile TLS handshake times for different amounts of dummy data added. We use the weight so that every truncated IP contributes equally. On the right we show the slowdowns for each size, relative to the handshake time of the control connection.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1boFkI4HQ2uOqmp3yb0gL5/ab9cd7c3ced910b55d0434e5c3c5c3d7/image1-8.png\" alt=\"A graph of TLS handshake time against kB of dummy data added.\" class=\"kg-image\" width=\"1999\" height=\"1000\" loading=\"lazy\"/>\n            \n            </figure><p>We can see the <i>not-so-gentle slope</i> until 40kB, where we hit a <i>little</i> <i>wall</i> that corresponds to Cloudflare’s default initial congestion window of 30 packets.</p><p>Adding 35kB fits within <i>our</i> initial congestion window. Nonetheless, the median handshake with 35kB extra is 40% slower. The slowest 10% are even worse off, taking 60% as much time. Thus even though we stay within the congestion window, the added data is not for free at all.</p><p>We can now translate these insights back to concrete PQ signatures. For example, using Dilithium2 as a drop-in replacement, we need around 17kB extra. That also fits within <i>our</i> initial congestion window with a median slowdown of 20%, which gets worse for the tail-end of users. For the normal initial congestion window of ten, we expect the slowdown to be much worse — around 60–80%.</p><p>There are several caveats to point out:</p><ul><li><p>These experiments used an initial congestion window of 30 packets instead of ten. With a smaller initial congestion window of ten, which is the default for most systems, we would expect the wall to move from 40kB to around 10kB.</p></li><li><p>Because of our presence all across the world, our RTTs are <a href=\"/cdn-latency-passive-measurement/\">fairly low</a>. Thus the effect of the <i>cwnd wall</i> is smaller for us.</p></li><li><p>Challenge pages are served, by design, to those clients that we expect to be bots. This adds a significant bias because bots are generally hosted at well-connected providers, and so are closer than users.</p></li><li><p>HTTP/3 was not supported by the server we used for the endpoint. Support for IPv6 was only added ten days into the experiment and accounts for 10.9% of the measurements.</p></li><li><p>Actual TLS handshakes differ in size much more than tested in this setup due to differences in certificate sizes and extensions and other factors.</p></li></ul><h2>What have we learned?</h2><p>The TLS handshake is just one step (~5–20%) in a long chain required to show you a webpage. Casually browsing, it would be hard to notice a TLS handshake that’s 60% slower. But such differences add up. To make a website really fast, you need many seemingly insignificant speedups. Browser developers take this seriously: <a href=\"https://chromium.googlesource.com/chromium/src/+/refs/heads/main/docs/speed/addressing_performance_regressions.md#if-you-believe-the-regression-is-justified\">only in exceptional cases</a> does Chrome allow a change that slows down any microbenchmark by even a percent.</p><p>Because of the many parties and complexities involved, we should avoid waiting too long to adopt post-quantum signatures in TLS. That’s a hard sell if it comes at the price of a double-digit slowdown, not least to content servers but also to browser vendors and clients.</p><p>A timely adoption of PQ signatures on the web would be great. Our evidence so far suggests that this will be easiest, if six signatures and two public keys would fit in 9kB.</p><p>We will continue our efforts to help build a post-quantum secure Internet. To follow along, keep an eye on this blog or have a look at <a href=\"https://research.cloudflare.com\">research.cloudflare.com</a>.</p><p><i>Bas Westerbaan is co-submitter of the SPHINCS+ signature scheme.</i></p><h2>References</h2><p>SKD20: Sikeridis, Kampanakis, Devetsikiotis. <a href=\"https://dl.acm.org/doi/10.1145/3386367.3431305\">Assessing the overhead of post-quantum cryptography in TLS 1.3 and SSH</a>. CoNEXT’20.PST20: Paquin, Stebila, Tamvada. <a href=\"https://eprint.iacr.org/2019/1447.pdf\">Benchmarking Post-Quantum Cryptography in TLS</a>. PQCrypto 2020.SKD21: Sikeridis, Kampanakis, Devetsikiotis. <a href=\"https://eprint.iacr.org/2020/071.pdf\">Post-Quantum Authentication in TLS 1.3: A Performance Study</a>. NDSS2020.PKNLN22: Paul, Kuzovkova, Lahr, Niederhagen. <a href=\"https://eprint.iacr.org/2021/1447\">Mixed Certificate Chains for the Transition to Post-Quantum Authentication in TLS 1.3</a>. To appear in AsiaCCS 2022.</p>",
		"id": "6xYdKtiClxjcuIintFLYgJ",
		"localeList": {
			"name": "Sizing Up Post-Quantum Signatures Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "How much room does TLS have for the big post-quantum signatures? We had a look: it’s tight.",
		"metadata": {
			"title": "Sizing Up Post-Quantum Signatures",
			"description": "How much room does TLS have for the big post-quantum signatures? We had a look: it’s tight.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/24SMPY5KgYCObNvVIZvfoK/fcd37be30801c02a711937e641e4aeab/sizing-up-post-quantum-signatures-AwX6SI.png"
		},
		"primary_author": {},
		"published_at": "2021-11-08T15:39:18.000+00:00",
		"reading_time": 11,
		"slug": "sizing-up-post-quantum-signatures",
		"tags": [
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "56vA0Z6hqev6QaJBQmO2J8",
				"name": "TLS",
				"slug": "tls"
			},
			{
				"id": "6bIo7ayy56Fzdrtf9z2EWy",
				"name": "Post-Quantum",
				"slug": "post-quantum"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			}
		],
		"title": "Sizing Up Post-Quantum Signatures",
		"updated_at": "2024-08-27T01:41:54.994Z",
		"url": "https://blog.cloudflare.com/sizing-up-post-quantum-signatures"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}