{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "16",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Ignat Korchagin",
				"slug": "ignat",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6l12U0uchJemRRwVMR9hDn/cd1bcd051874dbe6bd3a3de78daef984/ignat.jpg",
				"location": null,
				"website": null,
				"twitter": "@ignatkn",
				"facebook": null
			}
		],
		"excerpt": "Encrypting data at rest is vital for Cloudflare with more than 200 data centres across the world. In this post, we will investigate the performance of disk encryption on Linux and explain how we made it at least two times faster for ourselves and our customers!",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5EMvAGGgjUtuYprycYpn7Q/607c0b4e8ed38febcda4f1d21ab5c0cc/speeding-up-linux-disk-encryption.png",
		"featured": false,
		"html": "<p>Data encryption at rest is a must-have for any modern Internet company. Many companies, however, don&#39;t encrypt their disks, because they fear the potential performance penalty caused by encryption overhead.</p><p>Encrypting data at rest is vital for Cloudflare with <a href=\"https://www.cloudflare.com/network/\">more than 200 data centres across the world</a>. In this post, we will investigate the performance of disk encryption on Linux and explain how we made it at least two times faster for ourselves and our customers!</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"encrypting-data-at-rest\">Encrypting data at rest</h3>\n            <a href=\"#encrypting-data-at-rest\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>When it comes to encrypting data at rest there are several ways it can be implemented on a modern operating system (OS). Available techniques are tightly coupled with a <a href=\"https://en.wikibooks.org/wiki/The_Linux_Kernel/Storage\">typical OS storage stack</a>. A simplified version of the storage stack and encryption solutions can be found on the diagram below:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1IM596LYKyiKGoM8dQv0a2/459b3d6be1edf9328914470ed9eee925/storage-stack.png\" alt=\"storage-stack\" class=\"kg-image\" width=\"1510\" height=\"740\" loading=\"lazy\"/>\n            \n            </figure><p>On the top of the stack are applications, which read and write data in files (or streams). The file system in the OS kernel keeps track of which blocks of the underlying block device belong to which files and translates these file reads and writes into block reads and writes, however the hardware specifics of the underlying storage device is abstracted away from the filesystem. Finally, the block subsystem actually passes the block reads and writes to the underlying hardware using appropriate device drivers.</p><p>The concept of the storage stack is actually similar to the <a href=\"https://www.cloudflare.com/learning/ddos/glossary/open-systems-interconnection-model-osi/\">well-known network OSI model</a>, where each layer has a more high-level view of the information and the implementation details of the lower layers are abstracted away from the upper layers. And, similar to the OSI model, one can apply encryption at different layers (think about <a href=\"https://www.cloudflare.com/learning/ssl/transport-layer-security-tls/\">TLS</a> vs <a href=\"https://en.wikipedia.org/wiki/IPsec\">IPsec</a> or <a href=\"https://www.cloudflare.com/learning/access-management/what-is-a-vpn/\">a VPN</a>).</p><p>For data at rest we can apply encryption either at the block layers (either in hardware or in software) or at the file level (either directly in applications or in the filesystem).</p><h4>Block vs file encryption</h4><p>Generally, the higher in the stack we apply encryption, the more flexibility we have. With application level encryption the application maintainers can apply any encryption code they please to any particular data they need. The downside of this approach is they actually have to implement it themselves and encryption in general is not very developer-friendly: one has to know the ins and outs of a specific cryptographic algorithm, properly generate keys, nonces, IVs etc. Additionally, application level encryption does not leverage OS-level caching and <a href=\"https://en.wikipedia.org/wiki/Page_cache\">Linux page cache</a> in particular: each time the application needs to use the data, it has to either decrypt it again, wasting CPU cycles, or implement its own decrypted “cache”, which introduces more complexity to the code.</p><p>File system level encryption makes data encryption transparent to applications, because the file system itself encrypts the data before passing it to the block subsystem, so files are encrypted regardless if the application has crypto support or not. Also, file systems can be configured to encrypt only a particular directory or have different keys for different files. This flexibility, however, comes at a cost of a more complex configuration. File system encryption is also considered less secure than block device encryption as only the contents of the files are encrypted. Files also have associated metadata, like file size, the number of files, the directory tree layout etc., which are still visible to a potential adversary.</p><p>Encryption down at the block layer (often referred to as <a href=\"https://en.wikipedia.org/wiki/Disk_encryption\">disk encryption</a> or full disk encryption) also makes data encryption transparent to applications and even whole file systems. Unlike file system level encryption it encrypts all data on the disk including file metadata and even free space. It is less flexible though - one can only encrypt the whole disk with a single key, so there is no per-directory, per-file or per-user configuration. From the crypto perspective, not all cryptographic algorithms can be used as the block layer doesn&#39;t have a high-level overview of the data anymore, so it needs to process each block independently. Most <a href=\"https://en.wikipedia.org/wiki/Block_cipher_mode_of_operation#Common_modes\">common algorithms require some sort of block chaining</a> to be secure, so are not applicable to disk encryption. Instead, <a href=\"https://en.wikipedia.org/wiki/Disk_encryption_theory#Block_cipher-based_modes\">special modes were developed</a> just for this specific use-case.</p><p>So which layer to choose? As always, it depends... Application and file system level encryption are usually the preferred choice for client systems because of the flexibility. For example, each user on a multi-user desktop may want to encrypt their home directory with a key they own and leave some shared directories unencrypted. On the contrary, on server systems, managed by SaaS/PaaS/IaaS companies (including Cloudflare) the preferred choice is configuration simplicity and security - with full disk encryption enabled any data from any application is automatically encrypted with no exceptions or overrides. We believe that all data needs to be protected without sorting it into &quot;important&quot; vs &quot;not important&quot; buckets, so the selective flexibility the upper layers provide is not needed.</p><h4>Hardware vs software disk encryption</h4><p>When encrypting data at the block layer it is possible to do it directly in the storage hardware, if the hardware <a href=\"https://en.wikipedia.org/wiki/Hardware-based_full_disk_encryption\">supports it</a>. Doing so usually gives better read/write performance and consumes less resources from the host. However, since most hardware firmware is proprietary, it does not receive as much attention and review from the security community. In the past this led to <a href=\"https://www.us-cert.gov/ncas/current-activity/2018/11/06/Self-Encrypting-Solid-State-Drive-Vulnerabilities\">flaws in some implementations of hardware disk encryption</a>, which render the whole security model useless. Microsoft, for example, <a href=\"https://support.microsoft.com/en-us/help/4516071/windows-10-update-kb4516071\">started to prefer software-based disk encryption</a> since then.</p><p>We didn&#39;t want to put our data and our customers&#39; data to the risk of using potentially insecure solutions and we <a href=\"/helping-to-build-cloudflare-part-4/\">strongly believe in open-source</a>. That&#39;s why we rely only on software disk encryption in the Linux kernel, which is open and has been audited by many security professionals across the world.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"linux-disk-encryption-performance\">Linux disk encryption performance</h3>\n            <a href=\"#linux-disk-encryption-performance\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>We aim not only to save bandwidth costs for our customers, but to deliver content to Internet users as fast as possible.</p><p>At one point we noticed that our disks were not as fast as we would like them to be. Some profiling as well as a quick A/B test pointed to Linux disk encryption. Because not encrypting the data (even if it is supposed-to-be a public Internet cache) is not a sustainable option, we decided to take a closer look into Linux disk encryption performance.</p><h4>Device mapper and dm-crypt</h4><p>Linux implements transparent disk encryption via a <a href=\"https://en.wikipedia.org/wiki/Dm-crypt\">dm-crypt module</a> and <code>dm-crypt</code> itself is part of <a href=\"https://en.wikipedia.org/wiki/Device_mapper\">device mapper</a> kernel framework. In a nutshell, the device mapper allows pre/post-process IO requests as they travel between the file system and the underlying block device.</p><p><code>dm-crypt</code> in particular encrypts &quot;write&quot; IO requests before sending them further down the stack to the actual block device and decrypts &quot;read&quot; IO requests before sending them up to the file system driver. Simple and easy! Or is it?</p><h4>Benchmarking setup</h4><p>For the record, the numbers in this post were obtained by running specified commands on an idle <a href=\"/a-tour-inside-cloudflares-g9-servers/\">Cloudflare G9 server</a> out of production. However, the setup should be easily reproducible on any modern x86 laptop.</p><p>Generally, benchmarking anything around a storage stack is hard because of the noise introduced by the storage hardware itself. Not all disks are created equal, so for the purpose of this post we will use the fastest disks available out there - that is no disks.</p><p>Instead Linux has an option to emulate a disk directly in <a href=\"https://en.wikipedia.org/wiki/Random-access_memory\">RAM</a>. Since RAM is much faster than any persistent storage, it should introduce little bias in our results.</p><p>The following command creates a 4GB ramdisk:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo modprobe brd rd_nr=1 rd_size=4194304\n$ ls /dev/ram0</pre></code>\n            <p>Now we can set up a <code>dm-crypt</code> instance on top of it thus enabling encryption for the disk. First, we need to generate the disk encryption key, &quot;format&quot; the disk and specify a password to unlock the newly generated key.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ fallocate -l 2M crypthdr.img\n$ sudo cryptsetup luksFormat /dev/ram0 --header crypthdr.img\n\nWARNING!\n========\nThis will overwrite data on crypthdr.img irrevocably.\n\nAre you sure? (Type uppercase yes): YES\nEnter passphrase:\nVerify passphrase:</pre></code>\n            <p>Those who are familiar with <code>LUKS/dm-crypt</code> might have noticed we used a <a href=\"http://man7.org/linux/man-pages/man8/cryptsetup.8.html\">LUKS detached header</a> here. Normally, LUKS stores the password-encrypted disk encryption key on the same disk as the data, but since we want to compare read/write performance between encrypted and unencrypted devices, we might accidentally overwrite the encrypted key during our benchmarking later. Keeping the encrypted key in a separate file avoids this problem for the purposes of this post.</p><p>Now, we can actually &quot;unlock&quot; the encrypted device for our testing:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo cryptsetup open --header crypthdr.img /dev/ram0 encrypted-ram0\nEnter passphrase for /dev/ram0:\n$ ls /dev/mapper/encrypted-ram0\n/dev/mapper/encrypted-ram0</pre></code>\n            <p>At this point we can now compare the performance of encrypted vs unencrypted ramdisk: if we read/write data to <code>/dev/ram0</code>, it will be stored in <a href=\"https://en.wikipedia.org/wiki/Plaintext\">plaintext</a>. Likewise, if we read/write data to <code>/dev/mapper/encrypted-ram0</code>, it will be decrypted/encrypted on the way by <code>dm-crypt</code> and stored in <a href=\"https://en.wikipedia.org/wiki/Ciphertext\">ciphertext</a>.</p><p>It&#39;s worth noting that we&#39;re not creating any file system on top of our block devices to avoid biasing results with a file system overhead.</p><h4>Measuring throughput</h4><p>When it comes to storage testing/benchmarking <a href=\"https://fio.readthedocs.io/en/latest/fio_doc.html\">Flexible I/O tester</a> is the usual go-to solution. Let&#39;s simulate simple sequential read/write load with 4K block size on the ramdisk without encryption:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo fio --filename=/dev/ram0 --readwrite=readwrite --bs=4k --direct=1 --loops=1000000 --name=plain\nplain: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1\nfio-2.16\nStarting 1 process\n...\nRun status group 0 (all jobs):\n   READ: io=21013MB, aggrb=1126.5MB/s, minb=1126.5MB/s, maxb=1126.5MB/s, mint=18655msec, maxt=18655msec\n  WRITE: io=21023MB, aggrb=1126.1MB/s, minb=1126.1MB/s, maxb=1126.1MB/s, mint=18655msec, maxt=18655msec\n\nDisk stats (read/write):\n  ram0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%</pre></code>\n            <p>The above command will run for a long time, so we just stop it after a while. As we can see from the stats, we&#39;re able to read and write roughly with the same throughput around <code>1126 MB/s</code>. Let&#39;s repeat the test with the encrypted ramdisk:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo fio --filename=/dev/mapper/encrypted-ram0 --readwrite=readwrite --bs=4k --direct=1 --loops=1000000 --name=crypt\ncrypt: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1\nfio-2.16\nStarting 1 process\n...\nRun status group 0 (all jobs):\n   READ: io=1693.7MB, aggrb=150874KB/s, minb=150874KB/s, maxb=150874KB/s, mint=11491msec, maxt=11491msec\n  WRITE: io=1696.4MB, aggrb=151170KB/s, minb=151170KB/s, maxb=151170KB/s, mint=11491msec, maxt=11491msec</pre></code>\n            <p>Whoa, that&#39;s a drop! We only get <code>~147 MB/s</code> now, which is more than 7 times slower! And this is on a totally idle machine!</p><h4>Maybe, crypto is just slow</h4><p>The first thing we considered is to ensure we use the fastest crypto. <code>cryptsetup</code> allows us to benchmark all the available crypto implementations on the system to select the best one:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo cryptsetup benchmark\n# Tests are approximate using memory only (no storage IO).\nPBKDF2-sha1      1340890 iterations per second for 256-bit key\nPBKDF2-sha256    1539759 iterations per second for 256-bit key\nPBKDF2-sha512    1205259 iterations per second for 256-bit key\nPBKDF2-ripemd160  967321 iterations per second for 256-bit key\nPBKDF2-whirlpool  720175 iterations per second for 256-bit key\n#  Algorithm | Key |  Encryption |  Decryption\n     aes-cbc   128b   969.7 MiB/s  3110.0 MiB/s\n serpent-cbc   128b           N/A           N/A\n twofish-cbc   128b           N/A           N/A\n     aes-cbc   256b   756.1 MiB/s  2474.7 MiB/s\n serpent-cbc   256b           N/A           N/A\n twofish-cbc   256b           N/A           N/A\n     aes-xts   256b  1823.1 MiB/s  1900.3 MiB/s\n serpent-xts   256b           N/A           N/A\n twofish-xts   256b           N/A           N/A\n     aes-xts   512b  1724.4 MiB/s  1765.8 MiB/s\n serpent-xts   512b           N/A           N/A\n twofish-xts   512b           N/A           N/A</pre></code>\n            <p>It seems <code>aes-xts</code> with a 256-bit data encryption key is the fastest here. But which one are we actually using for our encrypted ramdisk?</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo dmsetup table /dev/mapper/encrypted-ram0\n0 8388608 crypt aes-xts-plain64 0000000000000000000000000000000000000000000000000000000000000000 0 1:0 0</pre></code>\n            <p>We do use <code>aes-xts</code> with a 256-bit data encryption key (count all the zeroes conveniently masked by <code>dmsetup</code> tool - if you want to see the actual bytes, add the <code>--showkeys</code> option to the above command). The numbers do not add up however: <code>cryptsetup benchmark</code> tells us above not to rely on the results, as &quot;Tests are approximate using memory only (no storage IO)&quot;, but that is exactly how we&#39;ve set up our experiment using the ramdisk. In a somewhat worse case (assuming we&#39;re reading all the data and then encrypting/decrypting it sequentially with no parallelism) doing <a href=\"https://en.wikipedia.org/wiki/Back-of-the-envelope_calculation\">back-of-the-envelope calculation</a> we should be getting around <code>(1126 * 1823) / (1126 + 1823) =~696 MB/s</code>, which is still quite far from the actual <code>147 * 2 = 294 MB/s</code> (total for reads and writes).</p><h4>dm-crypt performance flags</h4><p>While reading the <a href=\"http://man7.org/linux/man-pages/man8/cryptsetup.8.html\">cryptsetup man page</a> we noticed that it has two options prefixed with <code>--perf-</code>, which are probably related to performance tuning. The first one is <code>--perf-same_cpu_crypt</code> with a rather cryptic description:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Perform encryption using the same cpu that IO was submitted on.  The default is to use an unbound workqueue so that encryption work is automatically balanced between available CPUs.  This option is only relevant for open action.</pre></code>\n            <p>So we enable the option</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo cryptsetup close encrypted-ram0\n$ sudo cryptsetup open --header crypthdr.img --perf-same_cpu_crypt /dev/ram0 encrypted-ram0</pre></code>\n            <p>Note: according to the <a href=\"http://man7.org/linux/man-pages/man8/cryptsetup.8.html\">latest man page</a> there is also a <code>cryptsetup refresh</code> command, which can be used to enable these options live without having to &quot;close&quot; and &quot;re-open&quot; the encrypted device. Our <code>cryptsetup</code> however didn&#39;t support it yet.</p><p>Verifying if the option has been really enabled:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo dmsetup table encrypted-ram0\n0 8388608 crypt aes-xts-plain64 0000000000000000000000000000000000000000000000000000000000000000 0 1:0 0 1 same_cpu_crypt</pre></code>\n            <p>Yes, we can now see <code>same_cpu_crypt</code> in the output, which is what we wanted. Let&#39;s rerun the benchmark:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo fio --filename=/dev/mapper/encrypted-ram0 --readwrite=readwrite --bs=4k --direct=1 --loops=1000000 --name=crypt\ncrypt: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1\nfio-2.16\nStarting 1 process\n...\nRun status group 0 (all jobs):\n   READ: io=1596.6MB, aggrb=139811KB/s, minb=139811KB/s, maxb=139811KB/s, mint=11693msec, maxt=11693msec\n  WRITE: io=1600.9MB, aggrb=140192KB/s, minb=140192KB/s, maxb=140192KB/s, mint=11693msec, maxt=11693msec</pre></code>\n            <p>Hmm, now it is <code>~136 MB/s</code> which is slightly worse than before, so no good. What about the second option <code>--perf-submit_from_crypt_cpus</code>:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">Disable offloading writes to a separate thread after encryption.  There are some situations where offloading write bios from the encryption threads to a single thread degrades performance significantly.  The default is to offload write bios to the same thread.  This option is only relevant for open action.</pre></code>\n            <p>Maybe, we are in the &quot;some situation&quot; here, so let&#39;s try it out:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo cryptsetup close encrypted-ram0\n$ sudo cryptsetup open --header crypthdr.img --perf-submit_from_crypt_cpus /dev/ram0 encrypted-ram0\nEnter passphrase for /dev/ram0:\n$ sudo dmsetup table encrypted-ram0\n0 8388608 crypt aes-xts-plain64 0000000000000000000000000000000000000000000000000000000000000000 0 1:0 0 1 submit_from_crypt_cpus</pre></code>\n            <p>And now the benchmark:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo fio --filename=/dev/mapper/encrypted-ram0 --readwrite=readwrite --bs=4k --direct=1 --loops=1000000 --name=crypt\ncrypt: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1\nfio-2.16\nStarting 1 process\n...\nRun status group 0 (all jobs):\n   READ: io=2066.6MB, aggrb=169835KB/s, minb=169835KB/s, maxb=169835KB/s, mint=12457msec, maxt=12457msec\n  WRITE: io=2067.7MB, aggrb=169965KB/s, minb=169965KB/s, maxb=169965KB/s, mint=12457msec, maxt=12457msec</pre></code>\n            <p><code>~166 MB/s</code>, which is a bit better, but still not good...</p><h4>Asking the community</h4><p>Being desperate we decided to seek support from the Internet and <a href=\"https://www.spinics.net/lists/dm-crypt/msg07516.html\">posted our findings to the <code>dm-crypt</code> mailing list</a>, but the response we got was not very encouraging:</p><blockquote><p>If the numbers disturb you, then this is from lack of understanding on your side. You are probably unaware that encryption is a heavy-weight operation...</p></blockquote><p>We decided to make a scientific research on this topic by typing &quot;is encryption expensive&quot; into Google Search and one of the top results, which actually contains meaningful measurements, is... <a href=\"/how-expensive-is-crypto-anyway/\">our own post about cost of encryption</a>, but in the context of <a href=\"https://www.cloudflare.com/learning/ssl/transport-layer-security-tls/\">TLS</a>! This is a fascinating read on its own, but the gist is: modern crypto on modern hardware is very cheap even at Cloudflare scale (doing millions of encrypted HTTP requests per second). In fact, it is so cheap that Cloudflare was the first provider to offer <a href=\"https://www.cloudflare.com/application-services/products/ssl/\">free SSL/TLS for everyone</a>.</p><h4>Digging into the source code</h4><p>When trying to use the custom <code>dm-crypt</code> options described above we were curious why they exist in the first place and what is that &quot;offloading&quot; all about. Originally we expected <code>dm-crypt</code> to be a simple &quot;proxy&quot;, which just encrypts/decrypts data as it flows through the stack. Turns out <code>dm-crypt</code> does more than just encrypting memory buffers and a (simplified) IO traverse path diagram is presented below:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4UenGQJyEiOzxwISPhhGR1/bdeae8ae7c9d331f4ca4d1cc75bbfb15/dm-crypt.png\" alt=\"dm-crypt\" class=\"kg-image\" width=\"1610\" height=\"792\" loading=\"lazy\"/>\n            \n            </figure><p>When the file system issues a write request, <code>dm-crypt</code> does not process it immediately - instead it puts it into a <a href=\"https://www.kernel.org/doc/html/v4.19/core-api/workqueue.html\">workqueue</a> <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L3124\">named &quot;kcryptd&quot;</a>. In a nutshell, a kernel workqueue just schedules some work (encryption in this case) to be performed at some later time, when it is more convenient. When &quot;the time&quot; comes, <code>dm-crypt</code> <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L1940\">sends the request</a> to <a href=\"https://www.kernel.org/doc/html/v4.19/crypto/index.html\">Linux Crypto API</a> for actual encryption. However, modern Linux Crypto API <a href=\"https://www.kernel.org/doc/html/v4.19/crypto/api-skcipher.html#symmetric-key-cipher-api\">is asynchronous</a> as well, so depending on which particular implementation your system will use, most likely it will not be processed immediately, but queued again for &quot;later time&quot;. When Linux Crypto API will finally <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L1980\">do the encryption</a>, <code>dm-crypt</code> may try to <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L1909-L1910\">sort pending write requests by putting each request</a> into a <a href=\"https://en.wikipedia.org/wiki/Red%E2%80%93black_tree\">red-black tree</a>. Then a <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L1819\">separate kernel thread</a> again at &quot;some time later&quot; actually takes all IO requests in the tree and <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L1864\">sends them down the stack</a>.</p><p>Now for read requests: this time we need to get the encrypted data first from the hardware, but <code>dm-crypt</code> does not just ask for the driver for the data, but queues the request into a different <a href=\"https://www.kernel.org/doc/html/v4.19/core-api/workqueue.html\">workqueue</a> <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L3122\">named &quot;kcryptd_io&quot;</a>. At some point later, when we actually have the encrypted data, we <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L1742\">schedule it for decryption</a> using the now familiar &quot;kcryptd&quot; workqueue. &quot;kcryptd&quot; <a href=\"https://github.com/torvalds/linux/blob/0d81a3f29c0afb18ba2b1275dcccf21e0dd4da38/drivers/md/dm-crypt.c#L1970\">will send the request</a> to Linux Crypto API, which may decrypt the data asynchronously as well.</p><p>To be fair the request does not always traverse all these queues, but the important part here is that write requests may be queued up to 4 times in <code>dm-crypt</code> and read requests up to 3 times. At this point we were wondering if all this extra queueing can cause any performance issues. For example, there is a <a href=\"https://www.usenix.org/conference/srecon19asia/presentation/plenz\">nice presentation from Google</a> about the relationship between queueing and tail latency. One key takeaway from the presentation is:</p><blockquote><p>A significant amount of tail latency is due to queueing effects</p></blockquote><p>So, why are all these queues there and can we remove them?</p><h4>Git archeology</h4><p>No-one writes more complex code just for fun, especially for the OS kernel. So all these queues must have been put there for a reason. Luckily, the Linux kernel source is managed by <a href=\"https://en.wikipedia.org/wiki/Git\">git</a>, so we can try to retrace the changes and the decisions around them.</p><p>The &quot;kcryptd&quot; workqueue was in the source <a href=\"https://github.com/torvalds/linux/blob/1da177e4c3f41524e886b7f1b8a0c1fc7321cac2/drivers/md/dm-crypt.c\">since the beginning of the available history</a> with the following comment:</p><blockquote><p>Needed because it would be very unwise to do decryption in an interrupt context, so bios returning from read requests get queued here.</p></blockquote><p>So it was for reads only, but even then - why do we care if it is interrupt context or not, if Linux Crypto API will likely use a dedicated thread/queue for encryption anyway? Well, back in 2005 Crypto API <a href=\"https://github.com/torvalds/linux/blob/1da177e4c3f41524e886b7f1b8a0c1fc7321cac2/Documentation/crypto/api-intro.txt\">was not asynchronous</a>, so this made perfect sense.</p><p>In 2006 <code>dm-crypt</code> <a href=\"https://github.com/torvalds/linux/commit/23541d2d288cdb54f417ba1001dacc7f3ea10a97\">started to use</a> the &quot;kcryptd&quot; workqueue not only for encryption, but for submitting IO requests:</p><blockquote><p>This patch is designed to help dm-crypt comply with the new constraints imposed by the following patch in -mm: md-dm-reduce-stack-usage-with-stacked-block-devices.patch</p></blockquote><p>It seems the goal here was not to add more concurrency, but rather reduce kernel stack usage, which makes sense again as the kernel has a common stack across all the code, so it is a quite limited resource. It is worth noting, however, that the <a href=\"https://github.com/torvalds/linux/commit/6538b8ea886e472f4431db8ca1d60478f838d14b\">Linux kernel stack has been expanded</a> in 2014 for x86 platforms, so this might not be a problem anymore.</p><p>A <a href=\"https://github.com/torvalds/linux/commit/cabf08e4d3d1181d7c408edae97fb4d1c31518af\">first version of &quot;kcryptd_io&quot; workqueue was added</a> in 2007 with the intent to avoid:</p><blockquote><p>starvation caused by many requests waiting for memory allocation...</p></blockquote><p>The request processing was bottlenecking on a single workqueue here, so the solution was to add another one. Makes sense.</p><p>We are definitely not the first ones experiencing performance degradation because of extensive queueing: in 2011 a change was introduced to <a href=\"https://github.com/torvalds/linux/commit/20c82538e4f5ede51bc2b4795bc6e5cae772796d\">conditionally revert some of the queueing for read requests</a>:</p><blockquote><p>If there is enough memory, code can directly submit bio instead queuing this operation in a separate thread.</p></blockquote><p>Unfortunately, at that time Linux kernel commit messages were not as verbose as today, so there is no performance data available.</p><p>In 2015 <a href=\"https://github.com/torvalds/linux/commit/dc2676210c425ee8e5cb1bec5bc84d004ddf4179\">dm-crypt started to sort writes</a> in a separate &quot;dmcrypt_write&quot; thread before sending them down the stack:</p><blockquote><p>On a multiprocessor machine, encryption requests finish in a different order than they were submitted. Consequently, write requests would be submitted in a different order and it could cause severe performance degradation.</p></blockquote><p>It does make sense as sequential disk access used to be much faster than the random one and <code>dm-crypt</code> was breaking the pattern. But this mostly applies to <a href=\"https://en.wikipedia.org/wiki/Hard_disk_drive\">spinning disks</a>, which were still dominant in 2015. It may not be as important with modern fast <a href=\"https://en.wikipedia.org/wiki/Solid-state_drive\">SSDs (including NVME SSDs)</a>.</p><p>Another part of the commit message is worth mentioning:</p><blockquote><p>...in particular it enables IO schedulers like CFQ to sort more effectively...</p></blockquote><p>It mentions the performance benefits for the <a href=\"https://www.kernel.org/doc/Documentation/block/cfq-iosched.txt\">CFQ IO scheduler</a>, but Linux schedulers have improved since then to the point that <a href=\"https://github.com/torvalds/linux/commit/f382fb0bcef4c37dc049e9f6963e3baf204d815c\">CFQ scheduler has been removed</a> from the kernel in 2018.</p><p>The same patchset <a href=\"https://github.com/torvalds/linux/commit/b3c5fd3052492f1b8d060799d4f18be5a5438\">replaces the sorting list with a red-black tree</a>:</p><blockquote><p>In theory the sorting should be performed by the underlying disk scheduler, however, in practice the disk scheduler only accepts and sorts a finite number of requests. To allow the sorting of all requests, dm-crypt needs to implement its own sorting.</p><p>The overhead associated with rbtree-based sorting is considered negligible so it is not used conditionally.</p></blockquote><p>All that make sense, but it would be nice to have some backing data.</p><p>Interestingly, in the same patchset we see <a href=\"https://github.com/torvalds/linux/commit/0f5d8e6ee758f7023e4353cca75d785b2d4f6abe\">the introduction of our familiar &quot;submit_from_crypt_cpus&quot; option</a>:</p><blockquote><p>There are some situations where offloading write bios from the encryption threads to a single thread degrades performance significantly</p></blockquote><p>Overall, we can see that every change was reasonable and needed, however things have changed since then:</p><ul><li><p>hardware became faster and smarter</p></li><li><p>Linux resource allocation was revisited</p></li><li><p>coupled Linux subsystems were rearchitected</p></li></ul><p>And many of the design choices above may not be applicable to modern Linux.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"the-clean-up\">The \"clean-up\"</h3>\n            <a href=\"#the-clean-up\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Based on the research above we decided to try to remove all the extra queueing and asynchronous behaviour and revert <code>dm-crypt</code> to its original purpose: simply encrypt/decrypt IO requests as they pass through. But for the sake of stability and further benchmarking we ended up not removing the actual code, but rather adding yet another <code>dm-crypt</code> option, which bypasses all the queues/threads, if enabled. The flag allows us to switch between the current and new behaviour at runtime under full production load, so we can easily revert our changes should we see any side-effects. The resulting patch can be found on the <a href=\"https://github.com/cloudflare/linux/blob/12a61de6dd06408f4f3c27f8019beb66366e98e3/patches/0023-Add-DM_CRYPT_FORCE_INLINE-flag-to-dm-crypt-target.patch\">Cloudflare GitHub Linux repository</a>.</p><h4>Synchronous Linux Crypto API</h4><p>From the diagram above we remember that not all queueing is implemented in <code>dm-crypt</code>. Modern Linux Crypto API may also be asynchronous and for the sake of this experiment we want to eliminate queues there as well. What does &quot;may be&quot; mean, though? The OS may contain different implementations of the same algorithm (for example, <a href=\"https://en.wikipedia.org/wiki/AES_instruction_set\">hardware-accelerated AES-NI on x86 platforms</a> and generic C-code AES implementations). By default the system chooses the &quot;best&quot; one based on <a href=\"https://www.kernel.org/doc/html/v4.19/crypto/architecture.html#crypto-api-cipher-references-and-priority\">the configured algorithm priority</a>. <code>dm-crypt</code> allows overriding this behaviour and <a href=\"https://gitlab.com/cryptsetup/cryptsetup/-/wikis/DMCrypt#mapping-table-for-crypt-target\">request a particular cipher implementation</a> using the <code>capi:</code> prefix. However, there is one problem. Let us actually check the available AES-XTS (this is our disk encryption cipher, remember?) implementations on our system:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ grep -A 11 &#039;xts(aes)&#039; /proc/crypto\nname         : xts(aes)\ndriver       : xts(ecb(aes-generic))\nmodule       : kernel\npriority     : 100\nrefcnt       : 7\nselftest     : passed\ninternal     : no\ntype         : skcipher\nasync        : no\nblocksize    : 16\nmin keysize  : 32\nmax keysize  : 64\n--\nname         : __xts(aes)\ndriver       : cryptd(__xts-aes-aesni)\nmodule       : cryptd\npriority     : 451\nrefcnt       : 1\nselftest     : passed\ninternal     : yes\ntype         : skcipher\nasync        : yes\nblocksize    : 16\nmin keysize  : 32\nmax keysize  : 64\n--\nname         : xts(aes)\ndriver       : xts-aes-aesni\nmodule       : aesni_intel\npriority     : 401\nrefcnt       : 1\nselftest     : passed\ninternal     : no\ntype         : skcipher\nasync        : yes\nblocksize    : 16\nmin keysize  : 32\nmax keysize  : 64\n--\nname         : __xts(aes)\ndriver       : __xts-aes-aesni\nmodule       : aesni_intel\npriority     : 401\nrefcnt       : 7\nselftest     : passed\ninternal     : yes\ntype         : skcipher\nasync        : no\nblocksize    : 16\nmin keysize  : 32\nmax keysize  : 64</pre></code>\n            <p>We want to explicitly select a synchronous cipher from the above list to avoid queueing effects in threads, but the only two supported are <code>xts(ecb(aes-generic))</code> (the generic C implementation) and <code>__xts-aes-aesni</code> (the <a href=\"https://en.wikipedia.org/wiki/AES_instruction_set\">x86 hardware-accelerated implementation</a>). We definitely want the latter as it is much faster (we&#39;re aiming for performance here), but it is suspiciously marked as internal (see <code>internal: yes</code>). If we <a href=\"https://github.com/torvalds/linux/blob/fb33c6510d5595144d585aa194d377cf74d31911/include/linux/crypto.h#L91\">check the source code</a>:</p><blockquote><p>Mark a cipher as a service implementation only usable by another cipher and never by a normal user of the kernel crypto API</p></blockquote><p>So this cipher is meant to be used only by other wrapper code in the Crypto API and not outside it. In practice this means, that the caller of the Crypto API needs to explicitly specify this flag, when requesting a particular cipher implementation, but <code>dm-crypt</code> does not do it, because by design it is not part of the Linux Crypto API, rather an &quot;external&quot; user. We already patch the <code>dm-crypt</code> module, so we could as well just add the relevant flag. However, there is another problem with <a href=\"https://en.wikipedia.org/wiki/AES_instruction_set\">AES-NI</a> in particular: <a href=\"https://en.wikipedia.org/wiki/X87\">x86 FPU</a>. &quot;Floating point&quot; you say? Why do we need floating point math to do symmetric encryption which should only be about bit shifts and XOR operations? We don&#39;t need the math, but AES-NI instructions use some of the CPU registers, which are dedicated to the FPU. Unfortunately the Linux kernel <a href=\"https://github.com/torvalds/linux/blob/fb33c6510d5595144d585aa194d377cf74d31911/arch/x86/kernel/fpu/core.c#L77\">does not always preserve these registers in interrupt context</a> for performance reasons (saving/restoring FPU is expensive). But <code>dm-crypt</code> may execute code in interrupt context, so we risk corrupting some other process data and we go back to &quot;it would be very unwise to do decryption in an interrupt context&quot; statement in the original code.</p><p>Our solution to address the above was to create another somewhat <a href=\"https://github.com/cloudflare/linux/blob/master/patches/0024-Add-xtsproxy-Crypto-API-module.patch\">&quot;smart&quot; Crypto API module</a>. This module is synchronous and does not roll its own crypto, but is just a &quot;router&quot; of encryption requests:</p><ul><li><p>if we can use the FPU (and thus AES-NI) in the current execution context, we just forward the encryption request to the faster, &quot;internal&quot; <code>__xts-aes-aesni</code> implementation (and we can use it here, because now we are part of the Crypto API)</p></li><li><p>otherwise, we just forward the encryption request to the slower, generic C-based <code>xts(ecb(aes-generic))</code> implementation</p></li></ul><h4>Using the whole lot</h4><p>Let&#39;s walk through the process of using it all together. The first step is to <a href=\"https://github.com/cloudflare/linux/blob/master/patches/\">grab the patches</a> and recompile the kernel (or just compile <code>dm-crypt</code> and our <code>xtsproxy</code> modules).</p><p>Next, let&#39;s restart our IO workload in a separate terminal, so we can make sure we can reconfigure the kernel at runtime under load:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo fio --filename=/dev/mapper/encrypted-ram0 --readwrite=readwrite --bs=4k --direct=1 --loops=1000000 --name=crypt\ncrypt: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1\nfio-2.16\nStarting 1 process\n...</pre></code>\n            <p>In the main terminal make sure our new Crypto API module is loaded and available:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo modprobe xtsproxy\n$ grep -A 11 &#039;xtsproxy&#039; /proc/crypto\ndriver       : xts-aes-xtsproxy\nmodule       : xtsproxy\npriority     : 0\nrefcnt       : 0\nselftest     : passed\ninternal     : no\ntype         : skcipher\nasync        : no\nblocksize    : 16\nmin keysize  : 32\nmax keysize  : 64\nivsize       : 16\nchunksize    : 16</pre></code>\n            <p>Reconfigure the encrypted disk to use our newly loaded module and enable our patched <code>dm-crypt</code> flag (we have to use low-level <code>dmsetup</code> tool as <code>cryptsetup</code> obviously is not aware of our modifications):</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo dmsetup table encrypted-ram0 --showkeys | sed &#039;s/aes-xts-plain64/capi:xts-aes-xtsproxy-plain64/&#039; | sed &#039;s/$/ 1 force_inline/&#039; | sudo dmsetup reload encrypted-ram0</pre></code>\n            <p>We just &quot;loaded&quot; the new configuration, but for it to take effect, we need to suspend/resume the encrypted device:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">$ sudo dmsetup suspend encrypted-ram0 &amp;&amp; sudo dmsetup resume encrypted-ram0</pre></code>\n            <p>And now observe the result. We may go back to the other terminal running the <code>fio</code> job and look at the output, but to make things nicer, here&#39;s a snapshot of the observed read/write throughput in <a href=\"https://grafana.com/\">Grafana</a>:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/gU4JU2MqSRwllckZS17O0/eb5ce828cbd3e9a84bfa12411def3455/read-throughput-annotated.png\" alt=\"read-throughput-annotated\" class=\"kg-image\" width=\"2032\" height=\"972\" loading=\"lazy\"/>\n            \n            </figure><p></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6jxXWkIyojMU4AfFA3BVGm/223478d25385f5dbb18385074fa9d60e/write-throughput-annotated.png\" alt=\"write-throughput-annotated\" class=\"kg-image\" width=\"2056\" height=\"944\" loading=\"lazy\"/>\n            \n            </figure><p>Wow, we have more than doubled the throughput! With the total throughput of <code>~640 MB/s</code> we&#39;re now much closer to the expected <code>~696 MB/s</code> from above. What about the IO latency? (The <code>await</code> statistic from the <a href=\"http://man7.org/linux/man-pages/man1/iostat.1.html\">iostat reporting tool</a>):</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3gewP8Uml8nprMoLHFTeCR/5f559ee898a438446b8cbccf962290c9/await-annotated.png\" alt=\"await-annotated\" class=\"kg-image\" width=\"2024\" height=\"688\" loading=\"lazy\"/>\n            \n            </figure><p>The latency has been cut in half as well!</p><h4>To production</h4><p>So far we have been using a synthetic setup with some parts of the full production stack missing, like file systems, real hardware and most importantly, production workload. To ensure we’re not optimising imaginary things, here is a snapshot of the production impact these changes bring to the caching part of our stack:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6efmOs555BLNsL8xsxw7YP/7c43e23c6c93013511e06fd191cab393/prod.png\" alt=\"prod\" class=\"kg-image\" width=\"2000\" height=\"329\" loading=\"lazy\"/>\n            \n            </figure><p>This graph represents a three-way comparison of the worst-case response times (99th percentile) for a <a href=\"/how-we-scaled-nginx-and-saved-the-world-54-years-every-day/\">cache hit in one of our servers</a>. The green line is from a server with unencrypted disks, which we will use as baseline. The red line is from a server with encrypted disks with the default Linux disk encryption implementation and the blue line is from a server with encrypted disks and our optimisations enabled. As we can see the default Linux disk encryption implementation has a significant impact on our cache latency in worst case scenarios, whereas the patched implementation is indistinguishable from not using encryption at all. In other words the improved encryption implementation does not have any impact at all on our cache response speed, so we basically get it for free! That’s a win!</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"were-just-getting-started\">We're just getting started</h3>\n            <a href=\"#were-just-getting-started\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>This post shows how an architecture review can double the performance of a system. Also we <a href=\"/how-expensive-is-crypto-anyway/\">reconfirmed that modern cryptography is not expensive</a> and there is usually no excuse not to protect your data.</p><p>We are going to submit this work for inclusion in the main kernel source tree, but most likely not in its current form. Although the results look encouraging we have to remember that Linux is a highly portable operating system: it runs on powerful servers as well as small resource constrained IoT devices and on <a href=\"/arm-takes-wing/\">many other CPU architectures</a> as well. The current version of the patches just optimises disk encryption for a particular workload on a particular architecture, but Linux needs a solution which runs smoothly everywhere.</p><p>That said, if you think your case is similar and you want to take advantage of the performance improvements now, you may <a href=\"https://github.com/cloudflare/linux/blob/master/patches/\">grab the patches</a> and hopefully provide feedback. The runtime flag makes it easy to toggle the functionality on the fly and a simple A/B test may be performed to see if it benefits any particular case or setup. These patches have been running across our <a href=\"https://www.cloudflare.com/network/\">wide network of more than 200 data centres</a> on five generations of hardware, so can be reasonably considered stable. Enjoy both performance and security from Cloudflare for all!</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2QGDkwHsSsWOJBpiZYunWH/81406719438a6797a82752855ee57cdd/perf-sec.png\" alt=\"perf-sec\" class=\"kg-image\" width=\"1024\" height=\"512\" loading=\"lazy\"/>\n            \n            </figure>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"update-october-11-2020\">Update (October 11, 2020)</h3>\n            <a href=\"#update-october-11-2020\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>The main patch from this blog (in a slightly updated form) has been <a href=\"https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/drivers/md/dm-crypt.c?id=39d42fa96ba1b7d2544db3f8ed5da8fb0d5cb877\">merged</a> into mainline Linux kernel and is available since version 5.9 and onwards. The main difference is the mainline version exposes two flags instead of one, which provide the ability to bypass dm-crypt workqueues for reads and writes independently. For details, see <a href=\"https://www.kernel.org/doc/html/latest/admin-guide/device-mapper/dm-crypt.html\">the official dm-crypt documentation</a>.</p>",
		"id": "2jUxkv277c7kroisM2311O",
		"localeList": {
			"name": "Speeding up Linux disk encryption Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "In this post, we will investigate the performance of disk encryption on Linux and explain how we made it at least two times faster for ourselves and our customers!",
		"metadata": {
			"title": "Speeding up Linux disk encryption",
			"description": "In this post, we will investigate the performance of disk encryption on Linux and explain how we made it at least two times faster for ourselves and our customers!",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6VaIzy0TDEncDVfxGX3YkJ/243b4f4f4f5fec44bc64a3783cbc5a3d/speeding-up-linux-disk-encryption-vwytKU.png"
		},
		"primary_author": {},
		"published_at": "2020-03-25T12:00:00.000+00:00",
		"slug": "speeding-up-linux-disk-encryption",
		"tags": [
			{
				"id": "383iv0UQ6Lp0GZwOAxGq2p",
				"name": "Linux",
				"slug": "linux"
			},
			{
				"id": "73alK6sbtKLS6uB7ZrYrjj",
				"name": "Kernel",
				"slug": "kernel"
			},
			{
				"id": "4gN0ARax0fHxjtZL07THOe",
				"name": "Performance",
				"slug": "performance"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			}
		],
		"title": "Speeding up Linux disk encryption",
		"updated_at": "2024-10-09T23:11:04.951Z",
		"url": "https://blog.cloudflare.com/speeding-up-linux-disk-encryption"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}