{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Alex Krivit",
				"slug": "alex",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1e9gtWsffhoAWG0rTN45cR/4acc93f498ebe57bca2563c4c6c0ffc7/alex.jpg",
				"location": null,
				"website": null,
				"twitter": "@ackriv",
				"facebook": null
			},
			{
				"name": "Patrick Meenan (Guest Author)",
				"slug": "patrick-meenan",
				"bio": "Web performance @cloudflare; Chrome committer; Formerly web performance @google; Created WebPageTest.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5OFD5PuooMhKh9sjxnIcN9/b2755cdcc69d5e3b9133ad11f6734e07/patrick-meenan.jpg",
				"location": "South Riding, VA",
				"website": "https://www.webpagetest.org/",
				"twitter": "@patmeenan",
				"facebook": null
			}
		],
		"excerpt": "In this blog, we will explain where the opportunities exist to improve website performance, how to check if a specific site can improve performance, and provide a small JavaScript snippet which can be used with Cloudflare Workers to do this optimization for you",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7D3BvQswgLLCTzrWcZVGzN/63c8bd4526e140a6fc09170f46fb8e38/speeding-up-your-website-in-a-few-clicks.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/h8hH7qWrYChGMYyrktaXj/bdf984c65eceade004c754f0210559f3/image1-31.png\" alt=\"Speeding up your (WordPress) website is a few clicks away\" class=\"kg-image\" width=\"1801\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Every day, website visitors spend far too much time waiting for websites to load in their browsers. This waiting is partially due to browsers not knowing which resources are critically important so they can prioritize them ahead of less-critical resources. In this blog we will outline how millions of websites across the Internet can improve their performance by specifying which critical content loads first with Cloudflare Workers and what Cloudflare will do to make this easier by default in the future.</p><p>Popular Content Management Systems (CMS) like WordPress have made attempts to influence website resource priority, for example through techniques like <a href=\"https://make.wordpress.org/core/2020/07/14/lazy-loading-images-in-5-5/\">lazy loading images</a>. When done correctly, the results are magical. Performance is optimized between the CMS and browser without needing to implement any changes or coding new prioritization strategies. However, we’ve seen that these default priorities have opportunities to improve greatly.</p><p>In this co-authored blog with Google’s Patrick Meenan we will explain where the opportunities exist to improve website performance, how to check if a specific site can improve performance, and provide a small JavaScript snippet which can be used with Cloudflare Workers to do this optimization for you.</p><h3>What happens when a browser receives the response?</h3><p>Before we dive into where the opportunities are to <a href=\"https://www.cloudflare.com/learning/performance/speed-up-a-website/\">improve website performance</a>, let’s take a step back to understand how browsers load website assets by default.</p><p>After the browser sends a <a href=\"https://www.cloudflare.com/learning/ddos/glossary/hypertext-transfer-protocol-http/\">HTTP request</a> to a server, it receives a HTTP response containing information like status codes, headers, and the requested content. The browser carefully analyzes the response&#39;s status code and response headers to ensure proper handling of the content.</p><p>Next, the browser processes the content itself. For HTML responses, the browser extracts important information from the  section of the HTML, such as the page title, stylesheets, and scripts. Once this information is parsed, the browser moves on to the response  which has the actual page content. During this stage, the browser begins to present the webpage to the visitor.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/QXSvFomT1av14RMVga2Qf/04aa9ddb0f11e7494e0b387b79617cf2/image2-28.png\" alt=\"\" class=\"kg-image\" width=\"1443\" height=\"873\" loading=\"lazy\"/>\n            \n            </figure><p>If the response includes additional 3rd party resources like CSS, JavaScript, or other content, the browser may need to fetch and integrate them into the webpage. Typically, browsers like Google Chrome delay loading images until after the resources in the HTML  have loaded. This is also known as “<a href=\"https://developer.chrome.com/en/docs/lighthouse/performance/render-blocking-resources/\">blocking</a>” the render of the webpage. However, developers can override this blocking behavior using <a href=\"https://web.dev/fetch-priority/\">fetch priority</a> or other methods to boost other content’s priority in the browser. By adjusting an important image&#39;s fetch priority, it can be loaded earlier, which can lead to significant improvements in crucial performance metrics like LCP (<a href=\"https://web.dev/optimize-lcp/#:~:text=LCP%20measures%20the%20time%20from%20when%20the%20user%20initiates%20loading%20the%20page%20until%20the%20largest%20image\">Largest Contentful Paint</a>).</p><p>Images are so central to web pages that they have become an essential element in measuring website performance from <a href=\"https://www.cloudflare.com/learning/performance/what-are-core-web-vitals/\">Core Web Vitals</a>. LCP measures the time it takes for the largest visible element, often an image, to be fully rendered on the screen. Optimizing the loading of critical images (like <a href=\"https://web.dev/optimize-lcp/#:~:text=LCP%20measures%20the%20time%20from%20when%20the%20user%20initiates%20loading%20the%20page%20until%20the%20largest%20image\">LCP images</a>) can greatly enhance performance, improving the overall user experience and page performance.</p><p>But here&#39;s the challenge – a browser may not know which images are the most important for the visitor experience (like the LCP image) until rendering begins. If the developer can identify the LCP image or critical elements before it reaches the browser, its priority can be increased at the server to boost website performance instead of waiting for the browser to naturally discover the critical images.</p><p>In our Smart Hints <a href=\"/smart-hints\">blog</a>, we describe how Cloudflare will soon be able to automatically prioritize content on behalf of website developers, but what happens if there’s a need to optimize the priority of the images right now? How do you know if a website is in a suboptimal state and what can you do to improve?</p><p>Using Cloudflare, developers should be able to improve image performance with heuristics that identify likely-important images before the browser parses them so these images can have increased priority and be loaded sooner.</p><h3>Identifying Image Priority opportunities</h3><p>Just increasing the fetch priority of all images won&#39;t help if they are lazy-loaded or not critical/LCP images. <a href=\"https://www.cloudflare.com/learning/performance/what-is-lazy-loading/\">Lazy-loading</a> is a method that developers use to generally improve the initial load of a webpage if it includes numerous out-of-view elements. For example, on Instagram, when you continually scroll down the application to see more images, it would only make sense to load those images when the user arrives at them otherwise the performance of the page load would be needlessly delayed by the browser eagerly loading these out-of-view images. Instead the highest priority should be given to the LCP image in the viewport to improve performance.</p><p>So developers are left in a situation where they need to know which images are on users&#39; screens/viewports to increase their priority and which are off their screens to lazy-load them.</p><p>Recently, we’ve seen attempts to influence image priority on behalf of developers. For example, by <a href=\"https://make.wordpress.org/core/2020/07/14/lazy-loading-images-in-5-5/\">default</a>, in WordPress 5.5 all images with an <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/img\">IMG tag</a> and <a href=\"https://en.wikipedia.org/wiki/Aspect_ratio_(image)\">aspect ratios</a> were directed to be lazy-loaded. While there are plugins and other methods WordPress developers can use to boost the priority of LCP images, lazy-loading all images in a default manner and not knowing which are LCP images can cause artificial performance delays in website performance (they’re <a href=\"https://make.wordpress.org/core/2023/05/02/proposal-for-enhancing-lcp-image-performance-with-fetchpriority/\">working on this</a> though, and have partially resolved this for <a href=\"https://make.wordpress.org/core/2023/04/05/wordpress-6-2-performance-improvements-for-all-themes/\">block themes</a>).</p><p><i>So how do we identify the LCP image and other critical assets before they get to the browser?</i></p><p>To evaluate the opportunity to improve image performance, we turned to the <a href=\"https://httparchive.org/\">HTTP Archive</a>. Out of the approximately 22 million desktop pages tested in February 2023, 46% had an <a href=\"https://web.dev/optimize-lcp/\">LCP element</a> with an <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/img\">IMG tag</a>. Meaning that for page load metrics, LCP had an image included about half the time. Though, among these desktop pages, 8.5 million had the image in the <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML\">static HTML</a> delivered with the page, indicating a <b>total potential improvement opportunity of approximately 39% of the desktop pages</b> within the dataset.</p><p>In the case of mobile pages, out of the ~28.5 million tested, 40% had an LCP element as an IMG tag. Among these mobile pages, 10.3 million had the image in the static HTML delivered with the page, suggesting a potential <b>improvement opportunity in around 36% of the mobile pages</b> within the dataset.</p><p>However, as previously discussed, prioritizing an image won&#39;t be effective if the image is lazy-loaded because the directives are contradictory. In the dataset,  approximately 1.8 million LCP desktop images and 2.4 million LCP mobile images were lazy-loaded.</p><p>Therefore, across the Internet, the opportunity to improve image performance would be about ~30% of pages that have an LCP image in the original HTML markup that weren’t lazy-loaded, but with a more advanced Cloudflare Worker, the additional 9% of lazy-loaded LCP images can also be improved improved by removing the lazy-load attribute.</p><p>If you’d like to determine which element on your website serves as the <a href=\"https://web.dev/lcp/#what-elements-are-considered\">LCP element</a> so you can increase the priority or remove any lazy-loading, you can use browser <a href=\"https://developer.chrome.com/docs/devtools/\">developer tools</a>, or <a href=\"https://www.cloudflare.com/learning/performance/test-the-speed-of-a-website/\">speed tests</a> like <a href=\"https://www.webpagetest.org/\">Webpagetest</a> or <a href=\"https://dash.cloudflare.com?to=/:account/:zone/speed/test\">Cloudflare Observatory</a>.</p><p>39% of desktop images seems like a lot of opportunity to improve image performance. So the next question is how can Cloudflare determine the LCP image across our network and automatically prioritize them?</p><h3>Image Index</h3><p>We thought that how soon the LCP image showed up in the HTML would serve as a useful indicator. So we analyzed the HTTP Archive dataset to see where the cumulative percentage of LCP images are discovered based on their position in the HTML, including lazy-loaded images.</p><p>We found that approximately 25% of the pages had the LCP image as the first image in the HTML (around 10% of all pages). Another 25% had the LCP image as the second image. WordPress seemed to arrive at a similar conclusion and recently <a href=\"https://make.wordpress.org/core/2023/04/05/wordpress-6-2-performance-improvements-for-all-themes/\">released</a> a development to remove the default lazy-load attribute from the first image on block themes, but there are opportunities to go further.</p><p>Our analysis revealed that implementing a straightforward rule like &quot;do not lazy-load the first four images,&quot; either through the browser, a content management system (CMS), or a Cloudflare Worker could address approximately 75% of the issue of lazy-loading LCP images (example Worker below).</p><h3>Ignoring small images</h3><p>In trying to find other ways to identify likely LCP images we next turned to the size of the image. To increase the likelihood of getting the LCP image early in the HTML, we looked into ignoring “small” images as they are unlikely to be big enough to be a LCP element. We explored several sizes and 10,000 pixels (less than 100x100) was a pretty reliable threshold that didn’t skip many LCP images and avoided a good chunk of the non-LCP images.</p><p>By ignoring small images (&lt;10,000px), we found that the first image became the LCP image in approximately 30-34% of cases. Adding the second image increased this percentage to 56-60% of pages.</p><p>Therefore, to improve image priority, a potential approach could involve assigning a higher priority to the first four &quot;not-small&quot; images.</p><h3>Chrome 114 Image Prioritization Experiment</h3><p>An experiment running in Chrome 114 does exactly what we described above. Within the browser there are a few different prioritization knobs to play with that aren’t web-exposed so we have the opportunity to assign a “medium” priority to images that we want to boost automatically (directly controlling priority with “fetch priority” lets you set high or low). This will let us move the images ahead of other images, async scripts and parser-blocking scripts late in the body but still keep the boosted image priority below any high-priority requests, particularly dynamically-injected blocking scripts.</p><p>We are experimenting with boosting the priority of varying numbers of images (2, 5 and 10) and with allowing one of those medium-priority images to load at a time during Chromes “tight” mode (when it is loading the render-blocking resources in the head) to increase the likelihood that the LCP image will be available when the first paint is done.</p><p>The data is still coming in and no “ship” decisions have been made yet but the early results are very promising, improving the LCP time across the entire web for all arms of the experiment (not by massive amounts but moving the metrics of the whole web is notoriously difficult).</p><h3>How to use Cloudflare Workers to boost performance</h3><p>Now that we’ve seen that there is a large opportunity across the Internet for helping prioritize images for performance and how to identify images on individual pages that are likely LCP images, the question becomes, what would the results be of implementing a network-wide rule that could boost image priority from this study?</p><p>We built a test worker and deployed it on some WordPress test sites with our friends at <a href=\"https://rocket.net/\">Rocket.net</a>, a WordPress hosting platform focused on performance. This worker boosts the priority of the first four images while removing the lazy-load attribute, if present. When deployed we saw good performance results and the expected image prioritization.</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">export default {\n  async fetch(request) {\n    const response = await fetch(request);\n \n    // Check if the response is HTML\n    const contentType = response.headers.get(&#039;Content-Type&#039;);\n    if (!contentType || !contentType.includes(&#039;text/html&#039;)) {\n      return response;\n    }\n \n    const transformedResponse = transformResponse(response);\n \n    // Return the transformed response with streaming enabled\n    return transformedResponse;\n  },\n};\n \nasync function transformResponse(response) {\n  // Create an HTMLRewriter instance and define the image transformation logic\n  const rewriter = new HTMLRewriter()\n    .on(&#039;img&#039;, new ImageElementHandler());\n \n  const transformedBody = await rewriter.transform(response).text()\n \n  const transformresponse = new Response(transformedBody, response)\n \n  // Return the transformed response with streaming enabled\n  return transformresponse\n}\n \nclass ImageElementHandler {\n  constructor() {\n    this.imageCount = 0;\n    this.processedImages = new Set();\n  }\n \n  element(element) {\n    const imgSrc = element.getAttribute(&#039;src&#039;);\n \n    // Check if the image is small based on Chrome&#039;s criteria\n    if (imgSrc &amp;&amp; this.imageCount &lt; 4 &amp;&amp; !this.processedImages.has(imgSrc) &amp;&amp; !isImageSmall(element)) {\n      element.removeAttribute(&#039;loading&#039;);\n      element.setAttribute(&#039;fetchpriority&#039;, &#039;high&#039;);\n      this.processedImages.add(imgSrc);\n      this.imageCount++;\n    }\n  }\n}\n \nfunction isImageSmall(element) {\n  // Check if the element has width and height attributes\n  const width = element.getAttribute(&#039;width&#039;);\n  const height = element.getAttribute(&#039;height&#039;);\n \n  // If width or height is 0, or width * height &lt; 10000, consider the image as small\n  if ((width &amp;&amp; parseInt(width, 10) === 0) || (height &amp;&amp; parseInt(height, 10) === 0)) {\n    return true;\n  }\n \n  if (width &amp;&amp; height) {\n    const area = parseInt(width, 10) * parseInt(height, 10);\n    if (area &lt; 10000) {\n      return true;\n    }\n  }\n \n  return false;\n}</pre></code>\n            <p>When testing the Worker, we saw that default image priority was boosted into “high” for the first four images and the fifth image remained “low.” This resulted in an LCP range of “<a href=\"https://web.dev/lcp/#:~:text=first%20started%20loading.-,What%20is%20a%20good%20LCP%20score%3F,across%20mobile%20and%20desktop%20devices.\">good</a>” from a speed test. While this initial test is not a dispositive indicator that the Worker will boost performance in every situation, the results are promising and we look forward to continuing to experiment with this idea.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4jHIrp0orKEbGAppkSWVXq/a8caddd869f7dd82988152480ebdc3f8/image3-21.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"629\" loading=\"lazy\"/>\n            \n            </figure><p>While we’ve experimented with WordPress sites to illustrate the issues and potential performance benefits, this issue is present across the Internet.</p><p>Website owners can help us experiment with the Worker above to improve the priority of images on their websites or edit it to be more specific by targeting likely LCP elements. Cloudflare will continue experimenting using a very similar process to understand how to safely implement a network-wide rule to ensure that images are correctly prioritized across the Internet and performance is boosted without the need to configure a specific Worker.</p><h3>Automatic Platform Optimization</h3><p>Cloudflare’s <a href=\"https://developers.cloudflare.com/automatic-platform-optimization/\">Automatic Platform Optimization</a> (APO) is a plugin for WordPress which allows Cloudflare to deliver your entire WordPress site from our network ensuring consistent, fast performance for visitors. By serving cached sites, APO can improve performance metrics. APO does not currently have a way to prioritize images over other assets to improve browser render metrics or dynamically rewrite HTML, techniques we’ve discussed in this post. Although this presents a potential opportunity for future development, it requires thorough testing to ensure safe and reliable support.</p><p>In the future we’ll look to include the techniques discussed today as part of APO, however in the meantime we recommend using <a href=\"/snippets-announcement/\">Snippets</a> (and <a href=\"/performance-experiments-with-cloudflare/\">Experiments</a>) to test with the code example above to see the performance impact on your website.</p><h3>Get in touch!</h3><p>If you are interested in using the JavaScript above, we recommended testing with <a href=\"https://workers.cloudflare.com/\">Workers</a> or using <a href=\"/snippets-announcement/\">Cloudflare Snippets</a>. We’d love to hear from you on what your results were. Get in touch via social media and share your experiences.</p>",
		"id": "5VIbkWZzUAIMJDqTVlKR8i",
		"localeList": {
			"name": "Speeding up your (WordPress) website is a few clicks away Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"title": "Speeding up your (WordPress) website is a few clicks away",
			"description": null,
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3N01DhDQJXAPHxfpGIZeDD/9e20285e1b80b1a91c4709eb32ee5d3b/speeding-up-your-website-in-a-few-clicks-VQhm9f.png"
		},
		"primary_author": {},
		"published_at": "2023-06-22T14:00:58.000+01:00",
		"reading_time": 9,
		"slug": "speeding-up-your-website-in-a-few-clicks",
		"tags": [
			{
				"id": "7a1NuQRjeZo9DhGt97wDwe",
				"name": "Speed Week",
				"slug": "speed-week"
			},
			{
				"id": "52Vt8cZCu4PayvIlpclZS0",
				"name": "Automatic Platform Optimization",
				"slug": "automatic-platform-optimization"
			},
			{
				"id": "2KrU49OQiwcLHqnSYCy9As",
				"name": "WordPress",
				"slug": "wordpress"
			}
		],
		"title": "Speeding up your (WordPress) website is a few clicks away",
		"updated_at": "2024-08-27T01:09:02.231Z",
		"url": "https://blog.cloudflare.com/speeding-up-your-website-in-a-few-clicks"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}