{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Suleman Ahmad",
				"slug": "suleman",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1WnbvI0pMk4oVLXHdvpIqH/a4c2ea010af4e690203f996a1d876a0b/suleman.png",
				"location": "Austin, TX",
				"website": null,
				"twitter": "@sulemanahmadd",
				"facebook": null
			},
			{
				"name": "Talha Paracha",
				"slug": "talha",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6NFYvpB2PxARyxbZJKdJd8/4c9975f6343a9730710a7928a4958e74/talha.jpeg",
				"location": null,
				"website": "https://talhaparacha.com/",
				"twitter": "@paraacha",
				"facebook": null
			},
			{
				"name": "Luke Valenta",
				"slug": "luke",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2FfvsynZPyK2w2lJSIXdqr/97bbef977e5ebbbc8e20cbecf3b5372a/luke.jpg",
				"location": "Austin, TX",
				"website": "https://lukevalenta.com/",
				"twitter": "@lukevalenta",
				"facebook": null
			}
		],
		"excerpt": "Introducing customized recommendations to improve the security of your website.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3FnlyXIka77HZOwp4XurDS/e10c5f95d446190c71f6f6192b84295f/ssl-tls-recommender.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1BysfjbOFZcKKNifXsGrE8/2fd7bce6f0731e4b92bf413ffe3408a7/image1-25.png\" alt=\"Introducing SSL/TLS Recommender\" class=\"kg-image\" width=\"1200\" height=\"625\" loading=\"lazy\"/>\n            \n            </figure><p>Seven years ago, Cloudflare made HTTPS availability for any Internet property easy and free with <a href=\"/introducing-universal-ssl/\">Universal SSL</a>. At the time, few websites — other than those that processed sensitive data like passwords and credit card information — were using HTTPS because of how difficult it was to set up.</p><p>However, as we all started using the Internet for more and more private purposes (communication with loved ones, financial transactions, shopping, healthcare, etc.) the need for encryption became apparent. Tools like <a href=\"https://en.wikipedia.org/wiki/Firesheep\">Firesheep</a> demonstrated how easily attackers could snoop on people using public Wi-Fi networks at coffee shops and airports. The <a href=\"https://blog.cryptographyengineering.com/2019/09/24/looking-back-at-the-snowden-revelations/\">Snowden revelations</a> showed the ease with which governments could listen in on unencrypted communications at scale. We have seen attempts by browser vendors to increase HTTPS adoption such as the <a href=\"https://blog.chromium.org/2021/07/increasing-https-adoption.html\">recent announcement by Chromium</a> for loading websites on HTTPS by default. Encryption has become a vital part of the modern Internet, not just to keep your information safe, but to keep you safe.</p><p>When it was launched, Universal SSL <a href=\"/introducing-universal-ssl/\">doubled</a> the number of sites on the Internet using HTTPS. We are building on that with <a href=\"https://developers.cloudflare.com/ssl/origin-configuration/ssl-tls-recommender\">SSL/TLS Recommender</a>, a tool that guides you to stronger configurations for the backend connection from Cloudflare to origin servers. Recommender has been available in the SSL/TLS tab of the Cloudflare dashboard since August 2020 for self-serve customers. Over 500,000 zones are currently signed up. <b>As of today, it is available for all customers!</b></p><h2>How Cloudflare connects to origin servers</h2><p>Cloudflare operates as a reverse proxy between clients (“visitors”) and customers’ web servers (“origins”), so that Cloudflare can protect origin sites from attacks and improve site performance. This happens, in part, because visitor requests to websites proxied by Cloudflare are processed by an “edge” server located in a data center close to the client. The edge server either responds directly back to the visitor, if the requested content is cached, or creates a new request to the origin server to retrieve the content.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/oClT8gZN3TtQjhYiJr464/b478b7a2b20c55ff64ea9797cb8fc56e/image6-12.png\" alt=\"Cloudflare proxies requests from end users to customer origin servers\" class=\"kg-image\" width=\"1200\" height=\"675\" loading=\"lazy\"/>\n            \n            </figure><p>The backend connection to the origin can be made with an unencrypted HTTP connection or with an HTTPS connection where requests and responses are encrypted using the <a href=\"https://www.cloudflare.com/learning/ssl/transport-layer-security-tls/\">TLS</a> protocol (historically known as <a href=\"https://www.cloudflare.com/learning/ssl/what-is-ssl/\">SSL</a>). HTTPS is the secured form of HTTP and should be used <a href=\"https://www.cloudflare.com/learning/ssl/why-is-http-not-secure/\">whenever possible</a> to avoid leaking information or allowing content tampering by third-party entities. The origin server can further authenticate itself by presenting a valid TLS certificate to prevent active <a href=\"/monsters-in-the-middleboxes/\">monster-in-the-middle</a> attacks. Such a certificate can be obtained from a certificate authority such as <a href=\"https://letsencrypt.org/\">Let’s Encrypt</a> or <a href=\"https://developers.cloudflare.com/ssl/origin-configuration/origin-ca\">Cloudflare’s Origin CA</a>. Origins can also set up <a href=\"https://developers.cloudflare.com/ssl/origin-configuration/authenticated-origin-pull\">authenticated origin pull</a>, which ensures that any HTTPS requests outside of Cloudflare will not receive a response from your origin.</p><p><a href=\"/tunnel-for-everyone/\">Cloudflare Tunnel</a> provides an even more secure option for the connection between Cloudflare and origins. With Tunnel, users run a lightweight daemon on their origin servers that proactively establishes secure and private tunnels to the nearest Cloudflare data centers. With this configuration, users can completely lock down their origin servers to only receive requests routed through Cloudflare. While we encourage customers to set up tunnels if feasible, it&#39;s important to encourage origins with more traditional configurations to adopt the strongest possible security posture.</p><h3>Detecting HTTPS support</h3><p>You might wonder, why doesn’t Cloudflare always connect to origin servers with a secure TLS connection? To start, some origin servers have no TLS support at all (for example, certain <a href=\"https://community.letsencrypt.org/t/web-hosting-who-support-lets-encrypt/6920\">shared hosting providers</a> and even <a href=\"https://kurti.sh/pubs/IMC_2020___Long_Tail_of_the_Internet.pdf\">government sites</a> have been slow adopters) and rely on Cloudflare to ensure that the client request is at least encrypted over the Internet from the browser to Cloudflare’s edge.</p><p>Then why don’t we simply probe the origin to determine if TLS is supported? It turns out that many sites only <i>partially</i> support HTTPS, making the problem non-trivial. A single customer site can be served from multiple separate origin servers with differing levels of TLS support. For instance, some sites support HTTPS on their landing page but serve certain resources only over unencrypted HTTP. Further, site content can differ when accessed over HTTP versus HTTPS (for example, <a href=\"http://example.com\">http://example.com</a> and <a href=\"https://example.com\">https://example.com</a> can return different results).</p><p>Such content differences can arise due to misconfiguration on the origin server, accidental mistakes by developers when migrating their servers to HTTPS, or can even be intentional depending on the use case.</p><p>A <a href=\"https://www.cs.umd.edu/~dml/papers/https_tma20.pdf\">study</a> by researchers at Northeastern University, the Max Planck Institute for Informatics, and the University of Maryland highlights reasons for some of these inconsistencies. They found that 1.5% of surveyed sites had at least one page that was unavailable over HTTPS — despite the protocol being supported on other pages — and 3.7% of sites served different content over HTTP versus HTTPS for at least one page. Thus, always using the most secure TLS setting detected on a particular resource could result in unforeseen side effects and usability issues for the entire site.</p><p>We wanted to tackle all such issues and maximize the number of TLS connections to origin servers, but without compromising a website’s functionality and performance.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/J0sdbGlU6cKVkaWJaR6nC/9172e25e5d167dbeb7c9f1456ead4609/Screenshot-2021-10-11-at-16.17.39.png\" alt=\"Content differences on sites when loaded over HTTPS vs HTTP; images taken from https://www.cs.umd.edu/~dml/papers/https_tma20.pdf with author permission\" class=\"kg-image\" width=\"1612\" height=\"610\" loading=\"lazy\"/>\n            \n            </figure><p>Content differences on sites when loaded over HTTPS vs HTTP; images taken from <a href=\"https://www.cs.umd.edu/~dml/papers/https_tma20.pdf\">https://www.cs.umd.edu/~dml/papers/https_tma20.pdf</a> with author permission</p><h3>Configuring the SSL/TLS encryption mode</h3><p>Cloudflare relies on customers to indicate the level of TLS support at their origins via the zone’s <a href=\"https://developers.cloudflare.com/ssl/origin-configuration/ssl-modes\">SSL/TLS encryption mode</a>. The following SSL/TLS encryption modes can be configured from the Cloudflare dashboard:</p><ul><li><p><b>Off</b> indicates that client requests reaching Cloudflare as well as Cloudflare’s requests to the origin server should only use unencrypted HTTP. This option is never recommended, but is still in use by a handful of customers for legacy reasons or testing.</p></li><li><p><b>Flexible</b> allows clients to connect to Cloudflare’s edge via HTTPS, but requests to the origin are over HTTP only. This is the most common option for origins that do not support TLS. However, we encourage customers to upgrade their origins to support TLS whenever possible and only use <b>Flexible</b> as a <b>last resort</b>.</p></li><li><p><b>Full</b> enables encryption for requests to the origin when clients connect via HTTPS, but Cloudflare <i>does not attempt to validate the certificate</i>. This is useful for origins that have a self-signed or otherwise invalid certificate at the origin, but leaves open the possibility for an active attacker to impersonate the origin server with a fake certificate. Client HTTP requests result in HTTP requests to the origin.</p></li><li><p><b>Full (strict)</b> indicates that Cloudflare should validate the origin certificate to fully secure the connection. The origin certificate can either be issued by a public CA or by <a href=\"https://developers.cloudflare.com/ssl/origin-configuration/origin-ca\">Cloudflare Origin CA</a>. HTTP requests from clients result in HTTP requests to the origin, exactly the same as in <b>Full</b> mode. We <b>strongly</b> recommend <b>Full (strict)</b> over weaker options if supported by the origin.</p></li><li><p><b><b><b>Strict (SSL-Only Origin Pull)</b></b></b> causes all traffic to the origin to go over HTTPS, even if the client request was HTTP. This differs from <b><b><b>Full (strict)</b></b></b> in that HTTP client requests will result in an <i>HTTPS</i> request to the origin, not HTTP. Most customers do not need to use this option, and it is available only to Enterprise customers. The preferred way to ensure that no HTTP requests reach your origin is to enable <a href=\"/how-to-make-your-site-https-only/\">Always Use HTTPS</a> in conjunction with <b>Full</b> or <b>Full (strict)</b> to redirect visitor HTTP requests to the HTTPS version of the content.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6aX0Vn2QoaVooEamreEEha/d0a3aa915e66020135eb90437a7cf739/image3-17.png\" alt=\"SSL/TLS encryption modes determine how Cloudflare connects to origins\" class=\"kg-image\" width=\"1222\" height=\"1210\" loading=\"lazy\"/>\n            \n            </figure><p>SSL/TLS encryption modes determine how Cloudflare connects to origins</p><p>The SSL/TLS encryption mode is a zone-wide setting, meaning that Cloudflare applies the same policy to all subdomains and resources. If required, you can configure this setting more granularly via <a href=\"https://support.cloudflare.com/hc/en-us/articles/218411427-Understanding-and-Configuring-Cloudflare-Page-Rules-Page-Rules-Tutorial-\">Page Rules</a>. Misconfiguring this setting can make site resources unavailable. For instance, suppose your website loads certain assets from an HTTP-only subdomain. If you set your zone to <b>Full</b> or <b>Full (strict)</b>, you might make these assets unavailable for visitors that request the content over HTTPS, since the HTTP-only subdomain lacks HTTPS support.</p><h3>Importance of secure origin connections</h3><p>When an end-user visits a site proxied by Cloudflare, there are two connections to consider: the front-end connection between the visitor and Cloudflare and the back-end connection between Cloudflare and the customer origin server. The front-end connection typically presents the largest attack surface (for example, think of the classic example of an attacker snooping on a coffee shop’s Wi-Fi network), but securing the back-end connection is equally important. While all SSL/TLS encryption modes (except <b>Off</b>) secure the front-end connection, less secure modes leave open the possibility of malicious activity on the backend.</p><p>Consider a zone set to <b>Flexible</b> where the origin is connected to the Internet via an untrustworthy ISP. In this case, spyware deployed by the customer’s ISP in an on-path middlebox could inspect the plaintext traffic from Cloudflare to the origin server, potentially resulting in privacy violations or leaks of confidential information. Upgrading the zone to <b>Full</b> or a stronger mode to encrypt traffic to the ISP would help prevent this basic form of snooping.</p><p>Similarly, consider a zone set to <b>Full</b> where the origin server is hosted in a shared hosting provider facility. An attacker colocated in the same facility could generate a fake certificate for the origin (since the certificate isn’t validated for <b>Full</b>) and deploy an attack technique such as <a href=\"https://en.wikipedia.org/wiki/ARP_spoofing\">ARP spoofing</a> to direct traffic intended for the origin server to an attacker-owned machine instead. The attacker could then leverage this setup to inspect and filter traffic intended for the origin, resulting in site breakage or content unavailability. The attacker could even inject malicious JavaScript into the response served to the visitor to carry out other nefarious goals. Deploying a valid Cloudflare-trusted certificate on the origin and configuring the zone to use <b>Full (strict)</b> would prevent Cloudflare from trusting the attacker’s fake certificate in this scenario, preventing the hijack.</p><p>Since a secure backend only improves your <a href=\"https://www.cloudflare.com/learning/security/how-to-secure-a-website/\">website security</a>, we strongly encourage setting your zone to the highest possible SSL/TLS encryption mode whenever possible.</p><h3>Balancing functionality and security</h3><p>When Universal SSL was launched, Cloudflare’s goal was to get as many sites away from the status quo of HTTP as possible. To accomplish this, Cloudflare provisioned TLS certificates for all customer domains to secure the connection between the browser and the edge. Customer sites that did not already have TLS support were defaulted to <b>Flexible,</b> to preserve existing site functionality. Although <b>Flexible</b> is <b>not recommended</b> for most zones, we continue to support this option as some Cloudflare customers still rely on it for origins that do not yet support TLS. Disabling this option would make these sites unavailable. Currently, the default option for newly onboarded zones is <b>Full</b> if we detect a TLS certificate on the origin zone, and <b>Flexible</b> otherwise.</p><p>Further, the SSL/TLS encryption mode configured at the time of zone sign-up can become suboptimal as a site evolves. For example, a zone might switch to a hosting provider that supports origin certificate installation. An origin server that is able to serve all content over TLS should at least be on <b>Full</b>. An origin server that has a valid TLS certificate installed should use <b>Full (strict)</b> to ensure that communication between Cloudflare and the origin server is not susceptible to monster-in-the-middle attacks.</p><p>The Research team combined lessons from academia and our engineering efforts to make encryption easy, while ensuring the highest level of security possible for our customers. Because of that goal, we’re proud to introduce SSL/TLS Recommender.</p><h2>SSL/TLS Recommender</h2><p>Cloudflare’s mission is to help build a better Internet, and that includes ensuring that requests from visitors to our customers’ sites are as secure as possible. To that end, we began by asking ourselves the following question: how can we detect when a customer is able to use a more secure SSL/TLS encryption mode without impacting site functionality?</p><p>To answer this question, we built the <a href=\"https://developers.cloudflare.com/ssl/origin-configuration/ssl-tls-recommender\">SSL/TLS Recommender</a>. Customers can enable Recommender for a zone via the SSL/TLS tab of the Cloudflare dashboard. Using a zone’s currently configured SSL/TLS option as the baseline for expected site functionality, the Recommender performs a series of checks to determine if an upgrade is possible. If so, we email the zone owner with the recommendation. If a zone is currently misconfigured — for example, an HTTP-only origin configured on <b>Full</b> — Recommender will not recommend a downgrade.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3nc5iSzjUtxNTAjNF0g8Kz/2d10f995093325df1ac6617f4abfa0fe/image9-8.png\" alt=\"SSL/TLS Recommender in Cloudflare Dashboard\" class=\"kg-image\" width=\"1999\" height=\"1407\" loading=\"lazy\"/>\n            \n            </figure><p>The checks that Recommender runs are determined by the site’s currently configured SSL/TLS option.</p><p>The simplest check is to determine if a customer can upgrade from <b>Full</b> to <b>Full (strict)</b>. In this case, all site resources are already served over HTTPS, so the check comprises a few simple tests of the validity of the TLS certificate for the domain and all subdomains (which can be on separate origin servers).</p><p>The check to determine if a customer can upgrade from <b>Off</b> or <b>Flexible</b> to <b>Full</b> is more complex. A site can be upgraded if all resources on the site are available over HTTPS and the content <i>matches</i> when served over HTTP versus HTTPS. Recommender carries out this check as follows:</p><ul><li><p>Crawl customer sites to collect links. For large sites where it is impractical to scan every link, Recommender tests only a subset of links (up to some threshold), leading to a trade-off between performance and potential false positives. Similarly, for sites where the crawl turns up an insufficient number of links, we augment our results with a sample of links from recent visitors requests to the zone to provide a high-confidence recommendation. The crawler uses the user agent <i>Cloudflare-SSLDetector</i> and has been added to Cloudflare’s list of <a href=\"https://developers.cloudflare.com/firewall/known-issues-and-faq#bots-currently-detected\">known good bots</a>. Similar to <a href=\"https://developers.cloudflare.com/cache/about/always-online\">other Cloudflare crawlers</a>, Recommender ignores robots.txt (except for rules explicitly targeting the crawler’s user agent) to avoid negatively impacting the accuracy of the recommendation.</p></li><li><p>Download the content of each link over both HTTP and HTTPS. Recommender makes only idempotent GET requests when scanning origin servers to avoid modifying server resource state.</p></li><li><p>Run a content similarity algorithm to determine if the content matches. The algorithm is adapted from a research paper called &quot;<a href=\"https://www.cs.umd.edu/~dml/papers/https_tma20.pdf\">A Deeper Look at Web Content Availability and Consistency over HTTP/S</a>&quot; (TMA Conference 2020) and is designed to provide an accurate similarity score even for sites with dynamic content.</p></li></ul><p>Recommender is conservative with recommendations, erring on the side of maintaining current site functionality rather than risking breakage and usability issues. If a zone is non-functional, the zone owner blocks all types of bots, or if misconfigured SSL-specific Page Rules are applied to the zone, then Recommender will not be able to complete its scans and provide a recommendation. Therefore, it is not intended to resolve issues with website or domain functionality, but rather maximize your zone’s security when possible.</p><p>Please send questions and feedback to <a href=\"mailto:ask-research@cloudflare.com\">ask-research@cloudflare.com</a>. We’re excited to continue this line of work to improve the security of customer origins!</p><h2>Mentions</h2><p>While this work is led by the Research team, we have been extremely privileged to get support from all across the company!</p><p>Special thanks to the incredible team of interns that contributed to SSL/TLS Recommender. Suleman Ahmad (now full-time), Talha Paracha, and Ananya Ghose built the current iteration of the project and Matthew Bernhard helped to lay the groundwork in a previous iteration of the project.</p>",
		"id": "6WBTTN7lG2fbQfdx6Z4eq8",
		"localeList": {
			"name": "Introducing SSL/TLS Recommender Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Introducing customized recommendations to improve the security of your website.",
		"metadata": {
			"title": "Introducing SSL/TLS Recommender",
			"description": "Introducing customized recommendations to improve the security of your website.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6AveoLb3zQNGPBELcDG19Y/f38c2d6f748c4223046ccfdefbceab21/ssl-tls-recommender-PyzPGd.png"
		},
		"primary_author": {},
		"published_at": "2021-10-12T14:01:00.000+01:00",
		"slug": "ssl-tls-recommender",
		"tags": [
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "1HblPaFreDjetoJDJPjTAi",
				"name": "SSL",
				"slug": "ssl"
			},
			{
				"id": "56vA0Z6hqev6QaJBQmO2J8",
				"name": "TLS",
				"slug": "tls"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			}
		],
		"title": "Introducing SSL/TLS Recommender",
		"updated_at": "2024-08-27T01:43:10.750Z",
		"url": "https://blog.cloudflare.com/ssl-tls-recommender"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}