{
	"initialReadingTime": "16",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Matthew Prince",
				"slug": "matthew-prince",
				"bio": "A little bit geek, wonk, and nerd. Repeat entrepreneur, recovering lawyer, and former ski instructor. Co-founder & CEO of Cloudflare (NYSE: NET).",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VD9WePJ1jvjFwuSRF0IfQ/4867307860761eb8209f67f2a9dd771f/matthew-prince.jpeg",
				"location": "San Francisco, CA",
				"website": null,
				"twitter": "@eastdakota",
				"facebook": null
			}
		],
		"excerpt": "On March 20th, Cloudflare received our first patent infringement claim: Blackbird Tech LLC v. Cloudflare, Inc. Today we’re filing our Answer to that claim in a federal court in Delaware. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7p0p4NLd4rJoXlmp7EtiCw/961dfc94324be9ae380a3b0ce64549b7/standing-up-to-a-dangerous-new-breed-of-patent-troll.jpg",
		"featured": false,
		"html": "<p>On March 20th, Cloudflare received our first patent infringement claim: <i>Blackbird Tech LLC v. Cloudflare, Inc.</i> Today we’re filing our Answer to that claim in a federal court in Delaware. We have very strong arguments we will present in the litigation, mostly because the patent asserted against us does not have anything to do with our technology.</p><ul><li><p>The infringement claim is not a close one. The <a href=\"https://www.google.com/patents/US6453335\">asserted patent</a>, US 6453335 (‘335 patent) was filed in 1998, and describes a system for monitoring an existing data channel and inserting error pages when transmission rates fall below a certain level. Nothing from 1998—including the ’335 patent—comes close to describing our state-of-the-art product that is provisioned via DNS, speeds up internet content delivery, and protects against malicious attackers. Our technology is innovative and different, and Cloudflare’s technology has about 150 patents issued or in process.</p></li><li><p>We also expect to show that the patent itself is invalid. For example, if the ’335 patent is read broadly enough to cover our system (which shouldn’t happen), it would also cover any system where electronic communications are examined and redacted or modified. But this is not new. Filtering products performing similar functions were around long before the time of the ‘335 patent. Blackbird’s claims under the ‘335 patent are much, much broader than what is justified in light of the prior art.</p></li></ul><p>This claim is a nuisance for us. The lawsuit will take our time, distract us from our work, and it will cost us money to fight. Patent trolls like <a href=\"http://www.blackbird-tech.com/\">Blackbird Technologies</a> (<a href=\"https://twitter.com/bbirdtech\">@bbird_tech</a>) exist to create these headaches so companies will play along and give them money to go away.</p><p>There’s no social value here. There’s no support for a maligned inventor. There’s no competing business or product. There’s no validation of an incentive structure that supports innovation. This is a shakedown where a patent troll, Blackbird Technologies, creates as much nuisance as it can so its attorney-principals can try to grab some cash.</p><p>Worse still, Blackbird is a new, especially dangerous breed of patent troll. Like the dinosaur in the latest <i>Jurassic Park</i> movie, a synthetic combination of Tyrannosaurs and Velociraptor, Blackbird combines both a law firm and intellectual property rights holder into a single entity. In doing so, they remove legal fees from their cost structure and can bring lawsuits of potentially dubious merit without having to bear any meaningful cost. In other words, Blackbird’s new breed of entity is specifically designed to add leverage and amplify the already widely maligned problem of patent trolling.</p><p>Cloudflare does not intend to play along. As explained later in this blog post, we plan to (i) contest the patent lawsuit vigorously, (ii) fund an award for a crowdsourced search for prior art that can be used to invalidate Blackbird patents, and (iii) ask the relevant bar associations to investigate what we consider to be violations of the rules of professional conduct by Blackbird and its attorneys.</p><h3>Part I — The Patent Troll Problem and Blackbird Tech</h3><p>A troll is a creature that lives in a cave, under a bridge, or in the hills and serves no productive purpose—other than to be threatening, ugly, and malodorous. In modern parlance, the term is used for someone who merely seeks to annoy others to get a rise out of them, either in the comments section of an Internet page or by making nuisance legal claims. A patent troll is a company formed for only one purpose—to purchase patents and assert them broadly against real, productive companies that are actively engaged and making and selling products. The point isn’t whether their patents are infringed and/or invalid. A perverse incentive structure encourages trolls to bring lawsuits against numerous companies and demand nuisance settlements—settlements well below the millions of dollars it can take a company to protect themselves and defend a patent infringement case.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5q5LbpKvkam8H1cKISL6rg/7bc67dc6f78d07119e5141aed423adda/troll.jpg\" alt=\"Freemont Troll\" class=\"kg-image\" width=\"640\" height=\"426\" loading=\"lazy\"/>\n            \n            </figure><p>&quot;Freemont Troll&quot; by Esther Lee (<a href=\"https://www.flickr.com/photos/47096398@N08/5521406802/in/photolist-9pUDT1-4fCCQ-mqEop-4Zpfbh-8vcqtZ-8iBqJ4-8p96QD-SMNCFQ-dpCsKX-dSBVA8-3YPDgW-arkhTT-ScJLs8-7MXfLR-RqZeX9-FD1BF-a3a62P-4fCoi-8p9pg2-hcFhRs-5Zu58r-8jjPD2-4Zk3dV-4fCCR-4VfFUW-9fBSq6-cTyhC-4Zk5JF-4ZpdJN-dhNy3p-fHq7nu-4fCCP-4fCog-4Zk5dM-4rRswj-4rMo38-gAc2o8-7VNQv9-bNM4Bp-aR4gxt-3ELUU-4Zk6cD-7GhCZy-4fCof-orgs1f-8AqjCu-N6q1G-6XfjPX-2f6La2-55sxqv\">Flickr</a>)</p><p>Although the case against patent trolls is well known, it is worth reviewing.</p><p>Patent trolls serve no productive purpose. They don’t make products, conduct research and development, hire employees, or add value to society. This is why they are often called non-practicing entities (NPE). They merely take existing, and largely unexercised patents, and assert them widely against numerous successful companies to try and pry some money for themselves. Often, the trolls lie in wait until after those companies have made irreversible investments in their technology to maximize their leverage. They buy patents solely for the purpose of initiating litigation, and benefit from their non-practicing status to limit their costs in litigation discovery and to limit counterclaims of patent infringement that could be raised if they were actually engaged in productive activity. And increasingly in the world of software or tech patents, the trolls rely on the broadest possible interpretation of vague or generalized patents to sow as much uncertainty as possible.</p><p>The social and economic costs of patent trolls are staggering, no matter how you measure them. Estimates in recent years suggest that the number of cases brought by patent trolls have increased more than 500% over the past ten years. And about 70% of all patent infringement claims are filed by patent trolls, a share that has more than doubled in recent years. It is estimated that litigation initiated by patent trolls in U.S. courts cost companies as much as $30 billion in direct costs, a number that has increased more than four-fold over the last ten years. And those direct costs are only the tip of the iceberg, as losses in company value and foregone economic opportunity may be as many as five or ten times that amount.</p><p>[See, generally, Chien, Colleen. “Startups and Patent Trolls.” Santa Clara University Legal Studies Research Paper No. 09-12 Working Paper Series, 2012. Bessen, James E. Michael J. Meurer. “The Direct Costs from NPE Disputes.” Boston University School of Law, Law and Economics Research Paper No. 12-34, June 28, 2012. RPX. 2015 Report: NPE Litigation, Patent Marketplace, and NPE Cost.]</p><h4>Cloudflare’s Support for the Patent System</h4><p>Make no mistake, Cloudflare is a strong supporter of the patent system. The value and stability of our company is supported by the nearly 150 patents awarded or in process on our technology. We wouldn’t be able to exist, and wouldn’t be able to invest to bring our company to scale, if we didn’t have the security of a well-functioning patent system.</p><p>In a fair fight, we’d be able to defend ourselves by pushing back against a practicing entity with the technology set forth in our own patents. If the other entity was actually applying its patent to commercial products and felt hindered in the marketplace because of our operations, we might be able to raise countering arguments that a practicing entity was closer to infringing on our patents than we are to infringing theirs. It would help us to defend the lines around our use of own patented technology and demonstrate whether the infringement was actually happening.</p><p>But patent trolls get to live in a fictional world without a business or operations that can be compared or challenged.</p><p>And the value of the patent system isn’t one limited to recent developments or to the tech boom. It has supported the innovative spirit of the American people since America’s founding.</p><p>It has been <a href=\"http://www.myoutbox.net/pobere.htm\">reported</a> that during the ransacking of Washington by British soldiers in the War of 1812, then Superintendent of Patents, William Thorton, put himself in front of a British cannon and declared, “Are you Englishmen or only Goths and Vandals? This is the Patent Office, a depository of the ingenuity of the American nation, in which the whole civilized world is interested. Would you destroy it? If so, fire away, and let the charge pass through my body.” Whether or not the result of Superintendent Thorton’s bold stance, the patent building was one of the few government buildings spared by the British army in that attack.</p><p>When he redecorated the <a href=\"http://www.cbsnews.com/news/obama-has-made-the-oval-office-his-own/\">Oval Office</a> early in his administration, President Barack Obama’s addition of a bust of Martin Luther King, Jr. garnered the most attention. But he also brought in three mechanical devices from the National Museum of American History’s patent collection (models of the telegraph, paddle wheel, and gear-cutter) to reflect the importance of technology and the creative spirit. In that spirit, he later took aggressive action issuing five executive orders to challenge patent trolls (“History Will Remember Barack Obama as the Great Slayer of Patent Trolls,” <a href=\"https://www.wired.com/2014/03/obama-legacy-patent-trolls/\">Wired</a>, 3/20/14).</p><p>We are fighting back against patent trolls not because we don’t like the patent system. To the contrary, it’s due to our deep appreciation and need for the patent system that the actions of patent trolls are so offensive to us. Rather than appreciating the economic and social value of an effective patent system, these trolls distort and manipulate the patent system and the court system merely to line their own pockets. Those actions call into question the legitimacy of both systems in a way that is unacceptable to Cloudflare.</p><h4>Blackbird Technologies</h4><p>Even though Blackbird Tech is a pure patent troll, which has no operations aside from using patents it purchased to bring litigation against legitimate companies, they have specifically designed their business to create a new breed which poses serious additional concern.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5EEkiU6xLQJNiXLxBPEdsS/d28641b3ede57eb5ef97f405fd61cf3e/Wendy-Verlander-and-Chris-Freeman-of-Blackbird-Technologies-1.png\" alt=\"Wendy Verlander and Chris Freeman, the Founders of the Blackbird Technologies Law Firm\" class=\"kg-image\" width=\"336\" height=\"221\" loading=\"lazy\"/>\n            \n            </figure><p>Blackbird was formed three years ago by two attorneys who left law firms where they had been engaged in patent defense work — Wendy Verlander (<a href=\"https://twitter.com/bbirdtech_CEO\">@bbirdtech_CEO</a>; <a href=\"https://www.linkedin.com/in/wendy-verlander-9a27341/\">LinkedIn</a>) at WilmerHale, and Chris Freeman (<a href=\"https://www.linkedin.com/in/chris-freeman-316ab3/\">LinkedIn</a>) at Kirkland &amp; Ellis. Notably, both of those firms promote themselves as ready to protect companies from patent trolls. Kirkland <a href=\"https://www.kirkland.com/siteFiles/News/Law360%20(Practice%20Group%20of%20the%20Year_%20IP)%202015.pdf\">trumpets</a> that its IP practice group scored a victory against the “original patent troll,” while WilmerHale has a <a href=\"https://www.wilmerhale.com/pages/publicationsandnewsdetail.aspx?NewsPubId=17179872084\">Patent Troll Initiative</a> that aims to help businesses deal comprehensively with patent trolls.</p><p>Having gained valuable experience and training by working for clients who paid their firms handsomely to fight suits brought by patent trolls, Verlander and Freeman were well aware of the harm done to their clients by patent trolls. Yet, Verlander and Freeman decided to cast their lot with the other side and formed a patent troll for themselves.</p><p>Blackbird Technologies has filed 107 cases since September of 2014, making it one of the most prolific trolls in the United States. Its website links to a “News” item titled “4 Frequent Filers of IP Suits to Watch this Year” which highlights Blackbird as “a newer entrant on the list of top patent plaintiffs, coming in at fourth place with 48 suits last year in the District of Delaware spanning a wide range of technologies.” Some of the patents at issue include: <a href=\"https://www.google.com/patents/US6425349\">Bicycle Pet Carrier</a>, <a href=\"https://www.google.com/patents/US7081036\">Buttock Lift Support</a>, <a href=\"https://www.google.com/patents/US7867058\">Sports Bra</a>, and <a href=\"https://www.google.com/patents/US6816085\">Method for Managing a Parking Lot</a>. A complete list of Blackbird&#39;s patents is <a href=\"https://cloudflare.com/blackbirdpatents/\">available here</a>. Although they have been very aggressive about filing such claims, they have still not taken a single case through trial. And only a couple of those cases made it to the claim construction phase, where the Court defines the meaning of the patents at issue. Instead, many of Blackbird’s cases have been resolved shortly after filing, suggesting that these cases were never about legal rights or claims but were instead about creating the impetus for a nuisance settlement in the face of significant litigation costs.</p><p>In the Cloudflare case, Blackbird is asserting a 1998 patent filed by Oliver Kaufmann. Based on an <a href=\"https://assignment.uspto.gov/patent/index.html#/patent/search/resultAssignment?id=39923-226\">assignment agreement</a> filed with the USPTO, Blackbird purchased the ‘335 patent from Mr. Kaufmann in October 2016 for \\$1 plus “other good and valuable consideration.” Because a mere five months later Blackbird used the ‘335 patent as the sole basis for lawsuits against Cloudflare and Fastly, we think the actual but undisclosed compensation between the parties is something considerably more than $1, and may very well involve a contingency arrangement for Mr. Kaufmann.</p><p>Mr. Kaufmann appears to be the head of a group of four small IT companies in Augsburg, Germany that share a website — <a href=\"http://www.exklusiv.de\">www.exklusiv.de</a>. The companies provide services such as on premise networking and phone, ISP, database design and management, and 3D printing. If Mr. Kauffman ever tried to commercialize the ‘335 patent (in the U.S. or otherwise), we would expect to see some evidence of that on the website. We don’t. Of course, the patent troll system attempts to shield Mr. Kaufmann and his companies’ operations from the lawsuit by having Blackbird become the owner of the patent — even if Mr. Kaufmann maintains an interest in the litigation.</p><h3>Part II — Cloudflare’s Response</h3><p>Cloudflare’s mission has always been to help build a better Internet. So it won’t be surprising to frequent readers of this blog that Cloudflare isn’t interested in a short term and narrow resolution of our own interests. We’re not going to reach a settlement that would pay tens of thousands of dollars to Blackbird to avoid millions in legal fees. That would only allow patent trolls to keep playing their game and preying upon other innovative companies that share our interest in making the Internet work better, especially newer and more vulnerable companies.</p><p>We are pursuing a four-pronged approach to challenge Blackbird’s actions in this case.</p><h4>Step 1 — Cloudflare will fight this case in the courts</h4><p>Cloudflare will not settle this case, and doesn’t plan to settle any patent troll case, ever.</p><p>We will litigate this claim as vigorously and expeditiously as possible. Because it is clear to us after even minimal search that there is likely considerable evidence of prior art, we expect to file an Inter Parties Review of the ‘335 patent with the USPTO. If appropriate, we will seek sanctions and fee awards against Blackbird for bringing this case.</p><h4>Step 2 — Cloudflare will fund a crowdsourced effort to find evidence to invalidate Blackbird’s patents… all of them</h4><p>In a <a href=\"/project-jengo/\">separate blog post today</a>, Cloudflare is announcing that it will award up to $50,000 to support a search for prior art that can be used to invalidate Blackbird’s patents. Patent trolls like Blackbird have demonstrated that they can’t be trusted to act responsibly or take the public good into account when asserting patents against practicing companies.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/XdpOe21wSFHiQBbnrrxWN/fdbe2e45a1e643f6c3df2fd0a1bd799b/crowd.jpg\" alt=\"The Crowd\" class=\"kg-image\" width=\"640\" height=\"427\" loading=\"lazy\"/>\n            \n            </figure><p>Crowd by Hamaz Butt (<a href=\"https://www.flickr.com/photos/141735806@N08/34334054481/in/photolist-UiZ1dz-nP3Rob-5pCtii-6qFvbn-6qLJkL-cF9pBh-Wd54U-dBvZA8-bCDeQi-JSoWr-9SJLio-bpH9BC-nULmFB-4YHDDh-ndrQnx-hG6i5P-8v8Bmg-73XJtd-7Jknc2-beBtLK-5oaePC-9dYDDD-5cLuvP-6UyjZU-bSNnKp-beBrb2-hZF26c-8RFNTi-dgeVoF-81jhAU-BQjUZ-4cdz51-hDs4dL-b7R8LX-qbgBz8-c9hyWf-a3CCzr-nUCZwy-mwKFdB-8RLpiu-54dLFX-cxSgD9-ea36Gz-a6q16c-4JtEDh-w8xxR-ak1koZ-5TXvNe-9XNPnw-4NZuH6\">Flickr</a>)</p><p>Patent trolls take advantage of a system they assume is tilted in their favor, where they can take vague technology patents issued years ago and apply them as broadly as imaginable to the latest technology. Patent trolls think they can sit back and pick off settlements from companies because their lawsuits are a nuisance and the costs of defending those suits are considerable.</p><p>Changing this dynamic and leveling the playing field is going to require an entirely new way of approaching these challenges. Fighting such strong, though perverse, economic incentives is going to require a groundswell. It calls for a broad and active group of innovative folks who are willing to join the cause of helping expose the weaknesses in the patents held by these patent trolls, most of which were issued so long ago and are so broad that they never should have been issued in the first place.</p><p>Exposing the weakness of these patents means finding prior art that demonstrates the patents were issued improperly and working to have the USPTO invalidate those patents before they can be weaponized against legitimate companies that are working to innovate, to provide a livelihood to their employees and their families, and to make good products. We aim to invalidate every one of Blackbird’s patents and need your help. <a href=\"https://www.cloudflare.com/priorartsearch/\">Come join us in this effort!</a></p><p>Prior art is any evidence that a patented invention was already known at the time the patent application was filed. Prior art does not need to be a competing patent, it does not necessarily need to exist physically or be commercially available. It is enough that there is evidence that the innovation was publicly known at any point when or before the patent application was filed. Though certainly the more formal and specific the prior art, the better.</p><p>As described in more detail in the other blog post, Cloudflare will award up to $20,000 to be shared among the participants who provide us the most useful prior art that can be used in our invalidity challenge to the ‘335 patent in the pending litigation. We will use our outside patent counsel to evaluate the responses and divide the award based on relevance and usefulness. We will also accept information and arguments which invalidate Blackbird patents such as a showing of obviousness or material defects in the patent application.</p><p>In addition, we are <a href=\"https://www.cloudflare.com/priorartsearch/\">seeking prior art</a> information on any of the <a href=\"https://www.cloudflare.com/blackbirdpatents/\">37 other patents or patent applications owned by Blackbird</a>.</p><p>We have a pool of up to $30,000 that we will distribute to people who submit information on any Blackbird patent. Again, the money will be awarded based on relevance and usefulness of the prior art. We will publish all the information that we receive on these patents, so that others may benefit from the information and file challenges on Blackbird’s patents. And where justified, Cloudflare may institute patent office proceedings of any Blackbird patent when there is sufficient prior art to call into question its validity.</p><p>These opportunities remain open as long as Blackbird’s case against Cloudflare is still active. If interested, you should go over to the other blog post <a href=\"/project-jengo/\">here</a>, join the cause and be one of a group of talented and motivated experts who will push back against lazy trolls who try to take advantage of innovators by exploiting bugs in the judicial system.</p><h4>Step 3 — Cloudflare will investigate Blackbird’s operations to develop facts that support our arguments in the litigation and expose how patent trolls really operate</h4><p>Because patent trolls do not have operations beyond their ownership and litigation of patents for inventions they did not create, it can often be difficult to litigate against them. In addition, because of the unique organization of Blackbird, which appears to actually be a law firm that brings lawsuits on its own behalf and without a real client, there are important facts about this dispute that are difficult or impossible for us to determine at present.</p><p>As a result, we expect to investigate and to use the discovery process in this case and to retain a group of private investigators to look into Blackbird’s operations and attorneys to determine what counterclaims and arguments may be available to us in defense of the case. At a minimum, Blackbird suggests that it is engaged in a new and even more ingenious way of operating as a patent troll with maximum leverage and minimal inefficiencies in their operation. At a time when the economic evidence and public sentiment against the work of patent trolls is strong, it is important to bring their operations to the light of day and understand exactly how they work.</p><h4>Step 4 — File complaints against Blackbird attorneys by bar association disciplinary counsel in Massachusetts and Illinois</h4><p>The practice of law is supposed to be different from business, with lawyers held to a higher ethical standard. In most states, it is illegal for those who have not been admitted to the bar to provide legal services. This often gives lawyers a privileged position when it comes to handling things like real estate transactions, tax matters, and estate planning that might also be handled by other professionals, and it gives them a near monopoly on access to and use of the court system. In exchange, the legal profession is strictly governed by a series of ethical rules and other rules of professional conduct to make sure the profession sufficiently self-regulates to maintain public confidence and therefore secure the advantages of its monopoly. That’s why admission of new lawyers to the bar is generally premised not only on proof of competence (the bar exam), but also an investigation of character and fitness, and an oath committing to the principles of the profession. Importantly, the rules support the notion that the practice of law is a profession and not a mere business endeavor, this distinction is seen as essential to distinguishing the legal profession and maintaining the monopoly. See, generally Richard L. Abel, American Lawyers (1989).</p><p>Specifically, the American Bar Association established its Model Rules of Professional Conduct in 1983, which have subsequently been adopted by bar associations in almost every state, including the two states where Blackbird has its offices, Massachusetts and Illinois. The rules set forth a series of responsibilities that each lawyer must undertake, including duties to the profession generally and duties of candor to the court, which may require actions that run counter to the attorney’s self-interest.</p><p>For example, attorneys have an affirmative obligation to disclose when they have knowledge of adverse controlling legal authority (a rule or controlling court opinion that invalidates their proposed outcome), even if such disclosure runs counter to the interests of the attorney’s client. This disclosure is required even if both opposing counsel and the court are otherwise unaware of that authority (Model Rule 3.3(a)(2)). So attorneys are not allowed to take advantage of the judicial system just because they have an opening to do so.</p><p>Most of the rules address the extensive obligations owed to a client, to make sure lawyers don’t leverage their monopoly position to take advantage of the client. Among other things, the special nature of the Attorney-Client relationship involves a number of controls on the business relationship between the two — the attorney is to strictly avoid a conflict of interest with her work for the client (Rules 1.6-1.10), and should avoid self-dealing or commingling of funds (Rules 1.8 and 1.15).</p><p>As made clear in this blog post, Blackbird’s founders made the decision to leave law firms that were engaged in the defense of clients who were faced with patent lawsuits, and formed a new law firm focused on bringing law suits as a patent troll. The only services promoted on its website (<a href=\"http://www.blackbird-tech.com/\">http://www.blackbird-tech.com/</a>) are legal services; the website notes that Blackbird represents a “new model” which provides the benefits of “top law firm experience” offering clients the ability to “litigate at reduced costs.”</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5T9gZLAfo0bEyOam6qljgI/efe70d0f6ed53819cbd7586cc53e83f3/blackbird_value_prop.png\" alt=\"Blackbird holding themselves out as a law firm\" class=\"kg-image\" width=\"758\" height=\"176\" loading=\"lazy\"/>\n            \n            </figure><p>Of 12 total employees listed on the Blackbird website, 7 are attorneys. The remaining 5 are very junior employees described as “analysts” (3 are current undergraduate students and 2 received Bachelor&#39;s degrees last May). As far as we can determine, Blackbird produces no products or services which it makes available to the public. Rather, it offers litigation services and is in the business of filing lawsuits. And its output in that regard is prolific, as it has filed a total of 107 lawsuits since September 2014.</p><p>As final confirmation that Blackbird is a law firm marketing legal services, its own website includes a disclaimer about “<a href=\"http://www.blackbird-tech.com/attorney-advertising/\">Attorney Advertising</a>,” which states explicitly “[p]lease note that this website may contain attorney advertising.”</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/481Kvmll9ijMnbhhAZMEcC/ad3674d79280d04150ad3b2a4a0d24ba/blackbird_attorney_advertising.png\" alt=\"Blackbird Technologies says they advertise as a law firm\" class=\"kg-image\" width=\"992\" height=\"594\" loading=\"lazy\"/>\n            \n            </figure><p>Blackbird’s “new model” seems to be only that its operations set out to distort the traditional Attorney-Client relationship. Blackbird’s website makes a direct pitch of its legal services to recruit clients with potential claims and then, instead of taking them on as a client, purchases their claims and provides additional consideration that likely gives the client an ongoing interest in the resulting litigation. In doing so, Blackbird is flouting its ethical obligations meant to protect clients and distorting the judicial process by obfuscating and limiting potential counterclaims against the real party in interest.</p><p>As a result, we think Blackbird may be engaged in several activities that violate the rules of professional responsibility in the jurisdictions where they have been admitted as members of the bar. So, Cloudflare is submitting today letters with the bar disciplinary committees in Massachusetts and Illinois asking them to look into the following practices of Blackbird Tech:</p><ol><li><p><b>Blackbird may have acquired a proprietary interest in the subject matter of the litigation in violation of Rule 1.8(i)</b> — Attorneys have a near monopoly of representing clients in the judicial system. Rule of Professional Conduct 1.8(i) explicitly prohibits an attorney from “acquir[ing] a proprietary interest in a cause of action or subject matter of litigation.” But that is exactly what Blackbird does. Blackbird’s website contains a pitch to recruit clients with potential legal claims under their patents, but then buys those claims and brings them on their own behalf. Wouldn’t that be a violation of Rule 1.8(i)? Doesn’t Blackbird’s attempt to pitch this as a “new model” of being a patent troll ignore the fact that the only non-law firm activity in which they are engaged (buying patents to bring lawsuits) is the exact thing prohibited by Rule 1.8(i)? They shouldn’t be able to use creative contractual or corporate structures to avoid its responsibility under the rules.</p></li><li><p><b>Blackbird may be sharing fees or firm equity with non-lawyers in violation of Rule 5.4(a) or 5.4(d)</b> — In order to preserve the integrity of the Attorney-Client relationship, Rule of Professional Conduct 5.4(a) prohibits attorneys from splitting legal fees in individual matters with non-lawyers, and Rule 5.4(d) prohibits providing an equity interest in a firm to non-lawyers. We think Blackbird may be violating both provisions. Although he no longer owns the patent and is not a party to the case, the assignment agreement’s terms (specifying payment of only $1) makes it possible that Mr. Kaufman has a contingency interest in the lawsuit. If that is the case, wouldn’t Blackbird be in violation of Rule 5.4(a)? Similarly, Blackbird has moved very quickly since its founding to file lawsuits against a great number of companies — 107 complaints since September 2014. So far, none of those cases have gone to trial. We intend to examine whether they have used financial support from non-lawyers to fund the very fast start to their operations in exchange for an impermissible equity interest, or have shared an equity interest with patent holders like Mr. Kaufmann, either of which would be in violation of Rule 5.4(d).</p></li></ol><h3>In Closing</h3><p>We&#39;ve always advised our customers not to pay threatened DDoS attackers&#39; ransom requests but, instead, to mount a real defense. There are a lot of analogies here and we believe it&#39;s important to stand up for what is right and against this new breed of patent troll.</p><p>If you’ve read this far, then you must share Cloudflare’s passion on this issue. So join us! Write about and talk about these issues. Contact your political representatives and ask them to support all the legislative reform efforts that are out there. And most importantly, take some time and join our crowdsourced effort to identify prior art that will <a href=\"https://www.cloudflare.com/priorartsearch/\">invalidate all of the Blackbird patents</a>.</p><p>Watch this space. We’re just getting started.</p>",
		"id": "6YZM1XI6YLE4vhgOlbgT1f",
		"localeList": {
			"name": "Standing Up to a Dangerous New Breed of Patent Troll Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-05-11T16:00:44.000+01:00",
		"slug": "standing-up-to-a-dangerous-new-breed-of-patent-troll",
		"tags": [
			{
				"id": "16yk8DVbNNifxov5cWvAov",
				"name": "Legal",
				"slug": "legal"
			},
			{
				"id": "1AyqklWs7kExQEHm1fe6po",
				"name": "Community",
				"slug": "community"
			},
			{
				"id": "6Mfeneq15Xpvfczf1vVoll",
				"name": "Jengo",
				"slug": "jengo"
			}
		],
		"title": "Standing Up to a Dangerous New Breed of Patent Troll",
		"updated_at": "2024-08-27T02:30:01.078Z",
		"url": "https://blog.cloudflare.com/standing-up-to-a-dangerous-new-breed-of-patent-troll"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}