{
	"initialReadingTime": "9",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Michael Wolf",
				"slug": "michael-wolf",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/Oq2ALOxADHLYIUvVRx6Bc/bf28753d1498cd3075ac6c58cfe0de3b/michael-wolf.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "David Haynes",
				"slug": "dhaynes",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4q1D3h1TNHkhejK2KkqxkB/e89158bd31e140e23bf18b938560c773/dhaynes.jpg",
				"location": null,
				"website": "http://dhaynes.io",
				"twitter": "@dhaynesplz",
				"facebook": null
			}
		],
		"excerpt": "Cloudflare uses the Cloudflare Terraform provider extensively to make changes to our internal accounts as easy as opening a pull request.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7j5qaDGpP3F81sVmclFmUC/9dfea8f065a6db5fa8badd7c92f99cf1/terraforming-cloudflare-at-cloudflare.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/RxLlGL9T3FygYK0GXDXoK/a063afa4892818e97c6ec04d1e41a99e/image3-35.png\" alt=\"How Cloudflare uses Terraform to manage Cloudflare\" class=\"kg-image\" width=\"1800\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>Configuration management is far from a solved problem. As organizations scale beyond a handful of administrators, having a secure, auditable, and self-service way of updating system settings becomes invaluable. Managing a Cloudflare account is no different. With <a href=\"https://www.cloudflare.com\">dozens of products</a> and <a href=\"https://api.cloudflare.com/\">hundreds of API endpoints</a>, keeping track of current configuration and making bulk updates across multiple zones can be a challenge. While the Cloudflare Dashboard is great for analytics and feature exploration, any changes that could potentially impact users really should get a code review before being applied!</p><p>This is where <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs\">Cloudflare&#39;s Terraform provider</a> can come in handy. Built as a layer on top of the <a href=\"https://github.com/cloudflare/cloudflare-go\">cloudflare-go</a> library, the provider allows users to interface with the Cloudflare API using stateful <a href=\"https://developer.hashicorp.com/terraform\">Terraform</a> resource declarations. Not only do we actively support this provider for customers, we make extensive use of it internally! In this post, we hope to provide some best practices we&#39;ve learned about managing complex Cloudflare configurations in Terraform.</p><h2>Why Terraform</h2><p>Unsurprisingly, we find Cloudflare&#39;s products to be pretty useful for securing and enhancing the performance of services we deploy internally. We use <a href=\"https://www.cloudflare.com/dns/\">DNS</a>, <a href=\"https://www.cloudflare.com/waf/\">WAF</a>, <a href=\"https://www.cloudflare.com/products/zero-trust/\">Zero Trust</a>, <a href=\"https://www.cloudflare.com/products/zero-trust/email-security/\">Email Security</a>, <a href=\"https://www.cloudflare.com/developer-platform-hub/\">Workers</a>, and all manner of <a href=\"https://www.cloudflare.com/whats-new/\">experimental new features</a> throughout the company. This <a href=\"https://en.wikipedia.org/wiki/Eating_your_own_dog_food\">dog-fooding</a> allows us to battle-harden the services we provide to users and feed our desired features back to the product teams all while running the backend of Cloudflare. But, as Cloudflare grew, so did the complexity and importance of our configuration.</p><p>When we were a much smaller company, we only had a handful of accounts with designated administrators making changes on behalf of their colleagues. However, over time this handful of accounts grew into hundreds with each managed by separate teams. Independent accounts are useful in that they allow service-owners to make modifications that can&#39;t impact others, but it comes with overhead.</p><p>We faced the challenge of ensuring consistent security policies, up-to-date account memberships, and change visibility. While our  accounts were still administered by kind human stewards, we had numerous instances of account members not being removed after they transferred to a different team. While this never became a security incident, it demonstrated the shortcomings of manually provisioning account memberships. In the case of a production service migration, the administrator executing the change would often hop on a video call and ask for others to triple-check an IP address, ruleset, or access policy update. It was an era of looking through the audit logs to see what broke a service.</p><p>We wanted to make it easier for developers and users to make the changes they wanted without having to reach out to an administrator. Defining our configuration in code using Terraform has allowed us to keep tabs on the complexity of configuration while improving visibility and change management practices. By dogfooding the Cloudflare Terraform provider, we&#39;ve been able to ensure:</p><ul><li><p>Modifications to accounts are peer reviewed by the team that owns an account.</p></li><li><p>Each change is tied to a user, commit, and a ticket explaining the rationale for the change.</p></li><li><p>API Tokens are tied to service accounts rather than individual human users, meaning they survive team changes and offboarding.</p></li><li><p>Account configuration can be audited by anyone at the company for current state, accuracy, and security without needing to add everyone as a member of every account.</p></li><li><p>Large changes, such as <a href=\"/how-cloudflare-implemented-fido2-and-zero-trust/\">enforcing hard keys</a> can be done rapidly– even in a single pull request.</p></li><li><p>Configuration can be easily copied and reused across accounts to promote best practices and speed up development.</p></li><li><p>We can use and iterate on our awesome provider and provide a better experience to other users (shoutout in particular to <a href=\"https://github.com/jacobbednarz\">Jacob</a>!).</p></li></ul><h2>Terraform in CI/CD</h2><p><a href=\"https://github.com/hashicorp/terraform\">Terraform</a> has a fairly mature open source ecosystem, built from years of running-in-production experience. Thus, there are a number of ways to make interacting with the system feel as comfortable to developers as git. One of these tools is <a href=\"https://www.runatlantis.io/\">Atlantis</a>.</p><p>Atlantis acts as <a href=\"https://en.wikipedia.org/wiki/CI/CD\">continuous integration/continuous delivery (CI/CD)</a> for Terraform; fitting neatly into version control workflows, and giving visibility into the changes being deployed in each code change. We use Atlantis to display Terraform plans (effectively a diff in configuration) within pull requests and apply the changes after the pull request has been approved. Having all the output from the terraform provider in the comments of a pull request means there&#39;s no need to fiddle with the state locally or worry about where a state lock is coming from. Using Terraform CI/CD like this makes configuration management approachable to developers and non-technical folks alike.</p><p>In this example pull request, I&#39;m adding a user to the cloudflare-cool-account (see the code in the next section). Once the PR is opened, Bitbucket posts a webhook to Atlantis, telling it to run a `terraform plan` using this branch. The resulting comment is placed in the pull request. Notice that this pull request can&#39;t be applied or merged yet as it doesn&#39;t have an approval! Once the pull request is approved, I would comment &quot;atlantis apply&quot;, wait for Atlantis to post a comment containing the output of the command, and merge the pull request if that output looks correct.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6OqbJjxYbT2Dw4qpvFltng/dc17fd68514938762a382d0fefb5e5a1/image4-25.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1537\" loading=\"lazy\"/>\n            \n            </figure><p>Our Terraforming Cloudflare architecture consists of a monorepo with one directory (and tfstate) for each internally-owned Cloudflare account. This keeps all of our Cloudflare configuration centralized for easier oversight while remaining neatly organized.</p><p>It will be possible in a future (<a href=\"https://github.com/cloudflare/terraform-provider-cloudflare/issues/1646\">as of this writing</a>) release to manage multiple Cloudflare accounts in the same tfstate, but we&#39;ve found that accounts in our use generally map fairly neatly onto teams. Teams can be configured as <a href=\"https://docs.github.com/en/repositories/managing-your-repositorys-settings-and-features/customizing-your-repository/about-code-owners\">CODEOWNERS</a> for a given directory and be tagged on any pull requests to that account. With teams owning separate accounts and each account having a separate tfstate, it&#39;s rare for pull requests to get stuck waiting for a lock on the tfstate. Team-account-sized states remain relatively small, meaning that they also build quickly. Later on, we&#39;ll share some of the other optimizations we&#39;ve made to keep the repo user-friendly.</p><p>Each of our terraform states, given that they <a href=\"https://developer.hashicorp.com/terraform/language/settings/backends/configuration#credentials-and-sensitive-data\">include secrets (including the API key!)</a>, is stored encrypted in an internal datastore. When a pull request is opened, Atlantis reaches out to a piece of middleware (that we may open source once it&#39;s cleaned up a bit) that retrieves and decrypts the state for processing. Once the pull request is applied, the state is encrypted and put away again.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2WMBQIoo8yaKC6RLz75E1T/df07b1c980049bb61570d8a20c49cb72/image2-44.png\" alt=\"Atlantis Plan Workflow Diagram\" class=\"kg-image\" width=\"1999\" height=\"741\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/76bxQk0hlFPFOHRyscuObV/7d68c71970ed1635d00abae26161dfab/image5-14.png\" alt=\"Atlantis Apply Workflow Diagram\" class=\"kg-image\" width=\"1999\" height=\"741\" loading=\"lazy\"/>\n            \n            </figure><p>We execute a daily Terraform apply across all tfstates to capture any unintended config drift and rotate certificates when they approach expiration. This prevents unrelated changes from popping up in pull request diffs and causing confusion. While we could run more frequent state applies to ensure Terraform remains firmly up to date, once-a-day rectification strikes a balance between code enforcement and avoiding state locks while users are running Terraform plans in pull requests.</p><p>One of the problems that we encountered during our transition to Terraform is that folks were in the habit of making updates to configuration in the Dashboard and were still able to edit settings there. Thus, we didn&#39;t always have a single source of truth for our configuration in code. It also meant the change would get mysteriously (to them) reverted the next day! So that&#39;s why I&#39;m excited to share a new Zero Trust Dashboard toggle that we&#39;ve been turning on for our accounts internally: API/Terraform read-only mode.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7Ks2CZ0OxPwNbV5Kal95Tj/c30dee92d8207c0a917a11b6698f250d/image1-59.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"926\" loading=\"lazy\"/>\n            \n            </figure><p>Easily one of my favorite new features</p><p>With this button, we&#39;re able to politely prevent manual changes to your Cloudflare account’s Zero Trust configuration without removing permissions from the set of users who can fix settings manually in a break-glass emergency scenario. <a href=\"https://api.cloudflare.com/#zero-trust-organization-update-your-zero-trust-organization\">Check out how you can enable this setting in your Zero Trust organization</a>.</p><h2>Slick Snippets and Terraforming Recommendations</h2><p>As our Terraform repository has matured, we&#39;ve refined how we define Cloudflare resources in code. By finding a sweet spot between code reuse and readability, we&#39;ve been able to minimize operational overhead and generally let users get their work done. Here&#39;s a couple of useful snippets that have been particularly valuable to us.</p><h3>Account Membership</h3><p>This allows for defining a fairly straightforward mapping of user emails to account privileges without code duplication or complex modules. We pull the list of human-friendly names of <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/data-sources/account_roles\">account roles</a> from the API to show <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/account_member\">user</a> permission assignments at a glance. Note: <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/account_member#status\">status</a> is a new argument that allows for accounts to be added without sending an email to the user; perfect for when an organization is using SSO. (Thanks <a href=\"https://github.com/patrobinson\">patrobinson</a> for the <a href=\"https://github.com/cloudflare/terraform-provider-cloudflare/issues/1654\">feature request</a> and <a href=\"https://github.com/markblackman\">mblackman</a> for the <a href=\"https://github.com/cloudflare/terraform-provider-cloudflare/pull/1920\">PR</a>!)</p>\n            <pre class=\"language-hcl\"><code class=\"language-hcl\">variables.tf\n—-\ndata &quot;cloudflare_account_roles&quot; &quot;my_account&quot; {\n\taccount_id = var.account_id\n}\n\nlocals {\n  roles = {\n\tfor role in data.cloudflare_account_roles.my_account.roles :\n  \trole.name =&gt; role\n  }\n}\n\nmembers.tf\n—-\nlocals {\n  users = {\n    emerson = {\n      roles = [\n        local.roles[&quot;Administrator&quot;].id\n      ]\n    }\n    lucian = {\n      roles = [\n        local.roles[&quot;Super Administrator - All Privileges&quot;].id\n      ]\n    }\n    walruto = {\n      roles = [\n        local.roles_by_name[&quot;Audit Logs Viewer&quot;].id,\n        local.roles_by_name[&quot;Cloudflare Access&quot;].id,\n        local.roles_by_name[&quot;DNS&quot;].id\n      ]\n  }\n}\n\nresource &quot;cloudflare_account_member&quot; &quot;account_member&quot; {\n  for_each  \t= local.users\n  account_id\t= var.account_id\n  email_address = &quot;${each.key}@cloudflare.com&quot;\n  role_ids  \t= each.value.roles\n  status            = &quot;accepted&quot;\n}</pre></code>\n            <h3>Defining Auto-Refreshing Access Service Tokens</h3><p>The <a href=\"https://github.com/cloudflare/terraform-provider-cloudflare/issues/1866\">GitHub issue</a> and <a href=\"https://github.com/cloudflare/terraform-provider-cloudflare/pull/1872\">provider change</a> that enabled automatic Access service token refreshes actually came from a need inside Cloudflare. Here&#39;s how we ended up implementing it. We begin by defining a set of services that need to connect to our hostnames that are protected by Access. Each of these <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/access_service_token\">tokens</a> are created and stored in a secret key value store. Next, we reference those access tokens by ID in the target <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/access_policy\">Access policies</a>. Once this has run, the service owner or the service itself can retrieve the credentials from the data store. (Note: we&#39;re using Vault here, but any storage provider could be used in its place).</p>\n            <pre class=\"language-hcl\"><code class=\"language-hcl\">tokens.tf\n—\nlocals {\n  service_tokens = toset([\n    &quot;customer-service&quot;,     # TICKET-120\n    &quot;full-service&quot;,               # TICKET-128\n    &quot;quality-of-service&quot;      # TICKET-420 \n    &quot;room-service&quot;            # TICKET-927\n  ])\n}\n\nresource &quot;cloudflare_access_service_token&quot; &quot;token&quot; {\n  for_each   = local.service_tokens\n  account_id = var.account_id\n  name   \t= each.key\n  min_days_for_renewal = 30\n}\n\nresource &quot;vault_generic_secret&quot; &quot;access_service_token&quot; {\n  for_each   = local.service_tokens\n  path = &quot;kv/secrets/${each.key}/access_service_token&quot;\n  disable_read = true\n\n  data_json = jsonencode({\n\tclient_id        = cloudflare_access_service_token.token[&quot;${each.key}&quot;].client_id,\nclient_secret = cloudflare_access_service_token.token[&quot;${each.key}&quot;].client_secret\n  })\n}\n\nsuper_cool_hostname.tf\n—\nresource &quot;cloudflare_access_application&quot; &quot;super_cool_hostname&quot; {\n  account_id             \t            = var.account_id\n  name                   \t            = &quot;Super Cool Hostname&quot;\n  domain                 \t            = &quot;supercool.hostname.tld&quot;\n}\n\nresource &quot;cloudflare_access_policy&quot; &quot;super_cool_hostname_service_access&quot; {\n  application_id = cloudflare_access_application.super_cool_hostname.id\n  zone_id    \t= data.cloudflare_zone.hostname_tld.id\n  name       \t= &quot;TICKET-927 Allow Room Service &quot;\n  decision   \t= &quot;non_identity&quot;\n  precedence \t= 1\n  include {\n\tservice_token = [cloudflare_access_service_token.token[&quot;room-service&quot;].id]\n  }\n}</pre></code>\n            <h3>mTLS (Authenticated Origin Pulls) certificate creation and rotation</h3><p>To further defense-in-depth objectives, we&#39;ve been rolling out mTLS throughout our internal systems. One of the places where we can take advantage of our Terraform provider is in defining <a href=\"/protecting-the-origin-with-tls-authenticated-origin-pulls/\">AOP (Authenticated Origin Pulls)</a> certificates to lock down the Cloudflare-edge-to-origin connection. Anyone who has managed certificates of any kind can speak to the headaches they can cause. Having certificate configurations in Terraform takes out the manual work of rotation and expiration.</p><p>In this example we&#39;re defining <a href=\"https://api.cloudflare.com/#per-hostname-authenticated-origin-pull-properties\">hostname-level AOP</a> as opposed to <a href=\"https://api.cloudflare.com/#zone-level-authenticated-origin-pulls-properties\">zone-level AOP</a>. We start by cutting a certificate for each hostname. Once again we&#39;re using Vault for certificate creation, but other backends could be used just as well. This certificate is created with a (not-shown) 30 day expiration, but set to renew automatically. This means once the time-to-expiration is equal to <a href=\"https://registry.terraform.io/providers/hashicorp/vault/latest/docs/resources/pki_secret_backend_cert#min_seconds_remaining\">min_seconds_remaining</a>, the resource will be automatically tainted and replaced on the next Terraform run. We like to give this automation plenty of room before expiration to take into account holiday seasons and avoid sending alerts to humans when the alerts hit seven days to expiration. For the rest of this snippet, the <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/authenticated_origin_pulls_certificate\">certificate is uploaded to Cloudflare</a> and the ID from that upload is then <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/authenticated_origin_pulls\">placed in the AOP configuration</a> for the given hostname. The <a href=\"https://developer.hashicorp.com/terraform/language/meta-arguments/lifecycle#create_before_destroy\">create_before_destroy</a> meta-argument ensures that the replacement certificate is uploaded successfully before we remove the certificate that&#39;s currently in place.</p>\n            <pre class=\"language-hcl\"><code class=\"language-hcl\">locals {\n  hostnames = toset([\n\t&quot;supercool.hostname.tld&quot;,\n            &quot;thatsafinelooking.hostname.tld&quot;\n  ])\n}\n\nresource &quot;vault_pki_secret_backend_cert&quot; &quot;vault_cert&quot; {\n  for_each          \t      = local.hostnames\n  backend           \t      = &quot;pki-aop&quot;\n  name              \t      = &quot;default&quot;\n  auto_renew         \t      = true\n  common_name       \t      = &quot;${each.key}.aop.pki.vault.cfdata.org&quot;\n  min_seconds_remaining = 864000 // renew when there are 10 days left before expiration\n}\n\nresource &quot;cloudflare_authenticated_origin_pulls_certificate&quot; &quot;aop_cert&quot; {\n  for_each  = local.hostnames\n  zone_id   = data.cloudflare_zone.hostname_tld.id\n  type \t      = &quot;per-hostname&quot;\n\n  certificate = vault_pki_secret_backend_cert.vault_cert[&quot;${each.key}&quot;].certificate\n  private_key = vault_pki_secret_backend_cert.vault_cert[&quot;${each.key}&quot;].private_key\n\n  lifecycle {\n\tcreate_before_destroy = true\n  }\n}\n\nresource &quot;cloudflare_authenticated_origin_pulls&quot; &quot;aop_config&quot; {\n  for_each                           \t= local.hostnames\n  zone_id    \t                        = data.cloudflare_zone.hostname_tld.id\n  authenticated_origin_pulls_certificate = cloudflare_authenticated_origin_pulls_certificate.aop_cert[&quot;${each.key}&quot;].id\n  hostname                           \t= &quot;${each.key}&quot;\n  enabled                            \t= true\n}</pre></code>\n            <h3>Terraform recommendations</h3><p>The comfortable automation that we&#39;ve achieved thus far did not come without some hair-pulling. Below are a few of the learnings that have allowed us to maintain the repository as a side project run by two engineers (shoutout <a href=\"https://github.com/dhaynespls\">David</a>).</p><h4><b>Store your state somewhere safe</b></h4><p>It feels worth repeating that the tfstate <a href=\"https://developer.hashicorp.com/terraform/language/settings/backends/configuration#credentials-and-sensitive-data\"><b>contains secrets</b></a> <b>including any API keys you&#39;re using with providers</b> and <b>the default location of the tfstate is in the current working directory.</b> It&#39;s very easy to accidentally commit this to source control. By defining a <a href=\"https://developer.hashicorp.com/terraform/language/settings/backends/configuration\">backend</a>, the state can be stored with a cloud storage provider, <a href=\"https://developer.hashicorp.com/terraform/language/settings/backends/local\">in a secure location on a filesystem</a>, <a href=\"https://developer.hashicorp.com/terraform/language/settings/backends/pg\">in a database</a>, or even <a href=\"https://mirio.dev/2022/09/18/implementing-a-terraform-state-backend/\">Cloudflare Workers</a>! Wherever the state is stored, make sure it is encrypted.</p><h5><b>Choose simplicity, avoid modules</b></h5><p><a href=\"https://developer.hashicorp.com/terraform/language/modules\">Modules</a> are intended to reduce code repetition for well-defined chunks of systems such as &quot;I want three clusters of whizz-bangs in locations A, C, and F.&quot; If cloud-computing was like <a href=\"https://wiki.factorio.com/Blueprint\">Factorio</a>, this would be amazing. However, financial, technical, and physical constraints mean subtle differences in systems develop over time such as &quot;I want fewer whizz-bangs in C and the whizz-bangs in F should get a different network topology.&quot; In Terraform, implementation logic of these requirements is moved to the module code. <a href=\"https://github.com/hashicorp/hcl\">HCL</a> is absolutely not the place to write decipherable conditionals. While module versioning prevents having to make every change backwards-compatible, keeping module usage up-to-date becomes another chore for repository maintainers.</p><p>An understandable code base is a user-friendly codebase. It&#39;s rare that a deeply cryptic error will return from a misconfigured resource definition. Conversely, modules, especially custom ones, can lead users on a head-scratching adventure. This kind of system can&#39;t scale with confused users.</p><p>A few well-designed <a href=\"https://developer.hashicorp.com/terraform/language/meta-arguments/for_each\">for_each</a> loops (we&#39;re obviously fans) can achieve similar objectives as modules without the complexity. It&#39;s fine to use plain old resources too! Especially when there are more than a handful of varying arguments, it&#39;s more valuable for the configuration to be clear than to be eloquent. For example: an <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/account_member\">account_member</a> resource makes sense to be in a for_loop, but a <a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/resources/page_rule\">page_rule</a> probably doesn&#39;t.</p><h5><b>Keep tfstates small</b></h5><p>Maintaining quick pull-request-to-plan turnaround keeps Terraform from feeling like a burden on users&#39; time. Furthermore, if a plan is taking 30 minutes to run, a rollback in the case of an issue would also take 30 minutes! This post describes our single-account-to-tfstate model.</p><p>However, after noticing slow-downs coming from the large number of AOP certificate configurations in a big zone, we moved that code to a separate tfstate. We were able to make this change because AOP configuration is fairly self-contained. To ensure there would be no fighting between the states, we kept the API token permissions for each tfstate mutually exclusive of each other. Our Atlantis Terraform plans typically finish under five minutes. If it feels impossible to keep the size of a tfstate down to a reasonable amount of time, it may be worth considering a different tool for that bit of configuration management.</p><h5><b>Know when to use a Different tool</b></h5><p>Terraform isn&#39;t a panacea. We generally don&#39;t use Terraform to manage DNS records, for example. We use <a href=\"/improving-the-resiliency-of-our-infrastructure-dns-zone/\">OctoDNS</a> which integrates more neatly into our infrastructure automation. DNS records can quickly add up to long state-rendering times and are often dynamically generated from systems that Terraform doesn&#39;t know about. To avoid conflicts, there should only ever be one system publishing changes to DNS records.</p><p>We also haven&#39;t figured out a maintainable way of managing Workers scripts in Terraform. When a .js script in the Terraform directory changes, Terraform isn&#39;t aware of it. This means a change needs to occur somewhere else in a .tf file before the plan diff is generated. It likely isn&#39;t an unsolvable issue, but doesn&#39;t seem particularly worth cramming into Terraform when there are better options for Worker management like <a href=\"https://developers.cloudflare.com/workers/wrangler/\">Wrangler</a>.</p><h2>Looking forward</h2><p>We&#39;re continuing to invest in the Cloudflare Terraforming experience both for our own use and for the benefit of our users. With the provider, we hope to offer a comfortable and scalable method of interacting with Cloudflare products. Hopefully this post has presented some useful suggestions to anyone interested in adopting Cloudflare-configuration-as-code. Don&#39;t hesitate to reach out on the <a href=\"https://github.com/cloudflare/terraform-provider-cloudflare\">GitHub project</a> for troubleshooting, bug reports, or feature requests. For more in depth documentation on using Terraform to manage your Cloudflare account, <a href=\"https://developers.cloudflare.com/terraform/\">read on here</a>. And if you don&#39;t have a Cloudflare account already, <a href=\"https://dash.cloudflare.com/sign-up/teams\">click here</a> to get started.</p>",
		"id": "13LOJFjSYZuMAEcqDWYnk0",
		"localeList": {
			"name": "How Cloudflare uses Terraform to manage Cloudflare Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Cloudflare uses the Cloudflare Terraform provider extensively to make changes to our internal accounts as easy as opening a pull request.",
		"metadata": {
			"title": "How Cloudflare uses Terraform to manage Cloudflare",
			"description": "Cloudflare uses the Cloudflare Terraform provider extensively to make changes to our internal accounts as easy as opening a pull request.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/23IrBQvvSjd5MIGOklrN85/0490c66598476af11a183438553f8f75/terraforming-cloudflare-at-cloudflare-lqIvc6.png"
		},
		"primary_author": {},
		"published_at": "2022-11-17T14:00:00.000+00:00",
		"slug": "terraforming-cloudflare-at-cloudflare",
		"tags": [
			{
				"id": "2xCnBweKwOI3VXdYsGVbMe",
				"name": "Developer Week",
				"slug": "developer-week"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "5x72ei67SoD11VQ0uqFtpF",
				"name": "API",
				"slug": "api"
			},
			{
				"id": "4PjcrP7azfu8cw8rGcpYoM",
				"name": "Terraform",
				"slug": "terraform"
			}
		],
		"title": "How Cloudflare uses Terraform to manage Cloudflare",
		"updated_at": "2024-08-27T01:21:51.405Z",
		"url": "https://blog.cloudflare.com/terraforming-cloudflare-at-cloudflare"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}