{
	"initialReadingTime": "12",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Zack Bloom",
				"slug": "zack-bloom",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3ptAECKtpn049gpOBg7rzq/04936d9589cc55d2285ce1dee44added/zack-bloom.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "When Tim Berners-Lee announced HTML in 1991 there was no method of styling pages. How a given HTML tag was rendered was determined by the browser, often with significant input from the user’s preferences",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/71NdgB9fVZa6qg9xSH8dxY/8bfc568bcb63b7b5d791ad1042468f99/viola.png",
		"featured": false,
		"html": "<p>This was adapted from a post which originally appeared on the Eager blog. Eager has now become the new <a href=\"https://www.cloudflare.com/apps\">Cloudflare Apps</a>.</p><blockquote><p><i>In fact, it has been a constant source of delight for me over the past year to get to continually tell hordes (literally) of people who want to – strap yourselves in, here it comes – control what their documents look like in ways that would be trivial in TeX, Microsoft Word, and every other common text processing environment: “</i><i><b>Sorry, you’re screwed.</b></i><i>”</i></p><p><i>— Marc Andreessen </i><a href=\"http://1997.webhistory.org/www.lists/www-talk.1994q1/0648.html\"><i><code><u>1994</u></code></i></a></p></blockquote><p>When Tim Berners-Lee announced HTML in 1991 there was no method of styling pages. How a given HTML tag was rendered was determined by the browser, often with significant input from the user’s preferences. To many, it seemed like a good idea to create a standard way for pages to ‘suggest’ how they might prefer to be rendered stylistically.</p><p>But CSS wouldn’t be introduced for five years, and wouldn’t be fully implemented for ten. This was a period of intense work and innovation which resulted in more than a few competing styling methods that just as easily could have become the standard.</p><p>While these languages are obviously not in common use today, we find it fascinating to think about the world that might have been. Even more surprisingly, it happens that many of these other options include features which developers would love to see appear in CSS even today.</p><h3>The First Proposal</h3><p>In early 1993 the Mosaic browser had not yet reached 1.0. Those browsers that did exist dealt solely with HTML. There was no method of specifying the style of HTML whatsoever, meaning whatever the browser decided an <code>&lt;h1&gt;</code> should look like, that’s what you got.</p><p>In June of that year, Robert Raisch made <a href=\"http://1997.webhistory.org/www.lists/www-talk.1993q2/0445.html\">a proposal</a> to the www-talk mailing list to create a “an easily parsable format to deliver stylistic information along with Web documents” which would be called RRP.</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">@BODY fo(fa=he,si=18)</pre></code>\n            <p>If you have no idea what this code is doing you are forgiven. This particular rule is setting the font family (<code>fa</code>) to helvetica (<code>he</code>), and the font size (<code>si</code>) to 18 points. It made sense to make the content of this new format as terse as was possible as it was born in the era before gzipping and when connection speeds hovered around 14.4k.</p><p>Some interesting things missing from this proposal were any mention of units, all numbers being interpreted based on their context (font sizes were always in points for example). This could be attributed to RRP being designed more as a “set of HINTS or SUGGESTIONS to the renderer” rather than a specification. This was considered necessary because the same stylesheet needed to function for both the common line-mode browsers (like <a href=\"https://en.wikipedia.org/wiki/Lynx_(web_browser)\">Lynx</a>, and the graphical browsers which were becoming increasingly popular.</p>\n          <figure class=\"kg-card kg-image-card\">\n          <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4H46tOPb64GwmtjWtuZa4P/6812bcfde8f9f0d012c04cfe18bf23e9/lynx.png\" alt=\"\" class=\"kg-image\" width=\"1100\" height=\"799\" loading=\"lazy\"/>\n          </figure><p>Interestingly, RRP did include a method of specifying a columnar layout, a feature which wouldn’t make it to CSS until 2011. For example, three columns, each of width ‘80 units’ would look like this:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">@P co(nu=3,wi=80)</pre></code>\n            <p>It’s a little hard to parse, but not much worse than <code>white-space: nowrap</code> perhaps.</p><p>It’s worth noting that RRP did not support any of the ‘cascading’ we associate with stylesheets today. A given document could only have one active stylesheet at a time, which is a logical way to think about styling a document, even if it’s foreign to us today.</p><p>Marc Andreessen (the creator of Mosaic, which would become the most popular browser) was <a href=\"http://www.webhistory.org/www.lists/www-talk.1993q4/0266.html\">aware</a> of the RRP proposal, but it was never implemented by Mosaic. Instead, Mosaic quickly moved (somewhat tragically) down the path of using HTML tags to define style, introducing tags like <code>&lt;FONT&gt;</code> and <code>&lt;CENTER&gt;</code>.</p><h3>Viola and the Proto-Browser Wars</h3><blockquote><p><i>Then why don&#39;t you just implement one of the many style sheet\nproposals that are on the table. This would pretty much solve the\nproblem if done correctly.</i></p><p><i>So then I get to tell people, &quot;Well, you get to learn this language\nto write your document, and then you get to learn that language for\nactually making your document look like you want it to.&quot; Oh, they&#39;ll\nlove that.</i></p><p><i>— Marc Andreessen </i><a href=\"http://1997.webhistory.org/www.lists/www-talk.1994q1/0683.html\"><i><code><u>1994</u></code></i></a></p></blockquote><p>Contrary to popular perception, Mosaic was not the first graphical browser. It was predated by <a href=\"https://en.wikipedia.org/wiki/ViolaWWW\">ViolaWWW</a>, a graphical browser originally written by Pei-Yuan Wei in just four days.</p><p>[IMAGE]</p><p>Pei-Yuan created a <a href=\"http://1997.webhistory.org/www.lists/www-talk.1993q4/0264.html\">stylesheet language</a> which supports a form of the nested structure we are used to in CSS today:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">(BODY fontSize=normal\n      BGColor=white\n      FGColor=black\n  (H1   fontSize=largest\n        BGColor=red\n        FGColor=white)\n)</pre></code>\n            <p>In this case we are applying color selections to the body and specifically styling <code>H1</code>s which appear within the body. Rather than using repeated selectors to handle the nesting, PWP used a parenthesis system which is evocative of the indentation systems used by languages like Stylus and SASS which are preferred by some developers to CSS today. This makes PWP’s syntax potentially better in at least one way than the CSS language which would eventually become the lingua franca of the web.</p><p>PWP is also notable for introducing the method of referring to external stylesheets we still use today:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">&lt;LINK REL=&quot;STYLE&quot; HREF=&quot;URL_to_a_stylesheet&quot;&gt;</pre></code>\n            <p>ViolaWWW was unfortunately written to work chiefly with the <a href=\"https://en.wikipedia.org/wiki/X_Window_System\">X Windowing System</a> which was only popular on Unix systems. When Mosaic was ported to Windows it quickly left Viola in the dust.</p><h3>Stylesheets Before the Web</h3><blockquote><p><i>HTML is the kind of thing that can\nonly be loved by a computer scientist. Yes, it expresses the underlying\nstructure of a document, but documents are more than just structured text\ndatabases; they have visual impact. HTML totally eliminates any visual\ncreativity that a document’s designer might have.</i></p><p><i>— Roy Smith </i><a href=\"http://1997.webhistory.org/www.lists/www-talk.1993q3/0238.html\"><i><code><u>1993</u></code></i></a></p></blockquote><p>The need for a language to express the style of documents long predates the Internet.</p><p>As you may know, HTML as we know it was originally based on a pre-Internet language called SGML. In 1987 the US Department of Defense decided to study if SGML could be used to make it easier to store and transmit the huge volume of documentation they deal with. Like any good government project, they wasted no time coming up with a name. The team was originally called the Computer-Aided Logistics Support team, then the Computer-aided Acquisition and Logistics Support team, then finally the Continuous Acquisition and Life-cycle Support initiative. In any case, the initials were CALS.</p><p>The CALS team created a language for styling SGML documents called FOSI which is an initialism which undoubtedly stands for some combination of four words. They published <a href=\"http://people.opera.com/howcome/2006/phd/archive/www.dt.navy.mil/tot-shi-sys/tec-inf-sys/cal-std/doc/28001C.pdf\">a specification</a> for the language which is as comprehensive as it is incomprehensible. It also includes one of the best <a href=\"http://people.opera.com/howcome/2006/phd/i/fosi.png\">nonsensical infographics</a> to ever exist on the web.</p><p>One inviolate rule of the Internet is: more will always get done if you can prove someone wrong in the process. In 1993, just four days after Pei-Yuan’s proposal, Steven Heaney <a href=\"http://1997.webhistory.org/www.lists/www-talk.1993q4/0295.html\">proposed</a> that rather than “re-inventing the wheel,” it was best to use a variant of FOSI to style the web.</p><p>A FOSI document is itself written in SGML, which is actually a somewhat logical move given web developers existing familiarity with the SGML variant HTML. An example document looks like this:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">&lt;outspec&gt;\n  &lt;docdesc&gt;\n    &lt;charlist&gt;\n      &lt;font size=&quot;12pt&quot; bckcol=&quot;white&quot; fontcol=&quot;black&quot;&gt;\n    &lt;/charlist&gt;\n  &lt;/docdesc&gt;\n  &lt;e-i-c gi=&quot;h1&quot;&gt;&lt;font size=&quot;24pt&quot; bckcol=&quot;red&quot;, fontcol=&quot;white&quot;&gt;&lt;/e-i-c&gt;\n  &lt;e-i-c gi=&quot;h2&quot;&gt;&lt;font size=&quot;20pt&quot; bckcol=&quot;red&quot;, fgcol=&quot;white&quot;&gt;&lt;/e-i-c&gt;\n  &lt;e-i-c gi=&quot;a&quot;&gt;&lt;font fgcol=&quot;red&quot;&gt;&lt;/e-i-c&gt;\n  &lt;e-i-c gi=&quot;cmd kbd screen listing example&quot;&gt;&lt;font style=&quot;monoser&quot;&gt;&lt;/e-i-c&gt;\n&lt;/outspec&gt;</pre></code>\n            <p>If you’re a bit confused what a <code>docdesc</code> or <code>charlist</code> are, so were the\nmembers of <code>www-talk</code>. The only contextual information given was that <code>e-i-c</code> means ‘element in context’. FOSI is notable however for introducing the <code>em</code> unit which has now become the preferred method for people who know more about CSS than you to style things.</p><p>The language conflict which was playing out was actually as old as programming itself. It was the battle of functional ‘lisp-style’ syntax vs the syntax of more declarative languages. Pei-Yuan himself <a href=\"http://1997.webhistory.org/www.lists/www-talk.1993q4/0297.html\">described</a> his syntax as “LISP’ish,” but it was only a matter of time until a true LISP variant entered the stage.</p><h3>The Turing-Complete Stylesheet</h3><p>For all its complexity, FOSI was actually perceived to be an <a href=\"http://xml.coverpages.org/kennDSSSLInt.html\">interim solution</a> to the problem of formatting documents. The long-term plan was to create a language based on the functional programming language Scheme which could enable the most powerful document transformations you could imagine. This language was called DSSSL.</p><p>In the words of contributor Jon Bosak:</p><blockquote><p><i>It’s a mistake to put DSSSL into the same bag as scripting languages. Yes, DSSSL is Turing-complete; yes, it’s a programming language. But a script language (at least the way I use the term) is procedural; DSSSL very definitely is not. DSSSL is entirely functional and entirely side-effect-free. </i></p><p><i>Nothing ever happens in a DSSSL stylesheet. The stylesheet is one giant function whose value is an abstract, device-independent, nonprocedural description of the\nformatted document that gets fed as a specification (a declaration, if you will) of display areas to downstream rendering processes.</i></p></blockquote><p>At its simplest, DSSSL is actually a pretty reasonable styling language:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">(element H1\n  (make paragraph\n    font-size: 14pt\n    font-weight: &#039;bold))</pre></code>\n            <p>As it was a programming language, you could even define functions:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">(define (create-heading heading-font-size)\n  (make paragraph\n    font-size: heading-font-size\n    font-weight: &#039;bold))\n\n(element h1 (create-heading 24pt))\n(element h2 (create-heading 18pt))</pre></code>\n            <p>And use mathematical constructs in your styling, for example to ‘stripe’ the rows of a table:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">(element TR\n  (if (= (modulo (child-number) 2)\n        0)\n    ...   ;even-row\n    ...)) ;odd-row</pre></code>\n            <p>As a final way of kindling your jealousy, DSSSL could treat inherited values as\nvariables, and do math on them:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">(element H1\n  (make paragraph\n    font-size: (+ 4pt (inherited-font-size))))</pre></code>\n            <p>DSSSL did, unfortunately, have the fatal flaw which would plague all\nScheme-like languages: too many parenthesis. Additionally, it was arguably <i>too complete</i> of a spec when it was finally published which made it intimidating to browser developers. The DSSSL spec included over 210 separate styleable properties.</p><p>The team did go on to create <a href=\"https://en.wikipedia.org/wiki/XSL\">XSL</a>, a language for document transformation which is no less confusing, but which would be decidedly more popular.</p><h3>Why Did The Stylesheet Cross The Wire</h3><p>CSS does not include parent selectors (a method of styling a parent based on what children it contains). This fact has been <a href=\"http://stackoverflow.com/questions/1014861/is-there-a-css-parent-selector\">long</a> <a href=\"http://stackoverflow.com/questions/45004/complex-css-selector-for-parent-of-active-child?lq=1\">bemoaned</a> <a href=\"http://stackoverflow.com/questions/2000582/css-selector-for-foo-that-contains-bar?lq=1\">by</a> <a href=\"http://stackoverflow.com/questions/4220327/css-selector-element-with-a-given-child?lq=1\">Stack</a> <a href=\"http://stackoverflow.com/questions/21252551/apply-style-to-parent-if-it-has-child-with-css?lq=1\">Overflow</a> posters, but it turns out there is a very good reason for its absence. Particularly in the early days of the Internet, it was considered critically important that the page be renderable before the document has been fully loaded. In other words, we want to be able to render the beginning of the HTML to the page before the HTML which will form the bottom of the page has been fully downloaded.</p><p>A parent selector would mean that styles would have to be updated as the HTML document loads. Languages like DSSSL were completely out, as they could perform operations on the document itself, which would not be entirely available when the rendering is to begin.</p><p>The first contributor to bring up this issue and <a href=\"http://people.opera.com/howcome/2006/phd/archive/odur.let.rug.nl/~bert/stylesheets.html\">propose</a> a workable language was Bert Bos in March of 1995. His proposal also contains an early edition of the ‘smiley’ emoticon :-).</p><p>The language itself was somewhat ‘object-oriented’ in syntax:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">*LI.prebreak: 0.5\n*LI.postbreak: 0.5\n*OL.LI.label: 1\n*OL*OL.LI.label: A</pre></code>\n            <p>Using <code>.</code> to signify direct children, and <code>*</code> to specify ancestors.</p><p>His language also has the cool property of defining how features like links work in the stylesheet itself:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">*A.anchor: !HREF</pre></code>\n            <p>In this case we specified that the destination of the link element is the value of its <code>HREF</code> attribute. The idea that the behavior of elements like links should be controllable was popular in several proposals. In the era pre-JavaScript, there was not an existing way of controlling such things, so it seemed logical to include it in these new proposals.</p><p>One functional <a href=\"http://people.opera.com/howcome/2006/phd/archive/tigger.cc.uic.edu/~cmsmcq/style-primitives.html\">proposal</a>, introduced in 1994 by a gentleman with the name ‘C.M. Sperberg-McQueen’, includes the same behavior functionally:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">(style a\n  (block #f)     ; format as inline phrase\n  (color blue)   ; in blue if you’ve got it\n  (click (follow (attval &#039;href)))  ; and on click, follow url</pre></code>\n            <p>His language also introduced the <code>content</code> keyword as a way of controlling the content of an HTML element from the stylesheet, a concept which was later introduced into CSS 2.1.</p><h3>What Might Have Been</h3><p>Before I talk about the language which actually became CSS, it’s worth mentioning one other language proposal if only because it is in some ways the thing of an early web developer’s dreams.</p><p>PSL96 was, in the naming convention of the time, the 1996 edition of the “Presentation Specification Language.” At its core, PSL looks like CSS:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">H1 {\n  fontSize: 20;\n}</pre></code>\n            <p>It quickly gets more interesting. You could express element position based on not just the sizes specified for them (<code>Width</code>), but the actual (<code>Actual Width</code>) sizes the browser rendered them as:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">LI {\n  VertPos: Top = LeftSib . Actual Bottom;\n}</pre></code>\n            <p>You’ll also notice you can use the element’s left sibling as a constraint.</p><p>You can also add logical expressions to your styles. For example to style only anchor elements which have\n<code>hrefs</code>:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">A {\n  if (getAttribute(self, &quot;href&quot;) != &quot;&quot;) then\n    fgColor = &quot;blue&quot;;\n    underlineNumber = 1;\n  endif\n}</pre></code>\n            <p>That styling could be extended to do all manner of things we resort to classes today to accomplish:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">LI {\n  if (ChildNum(Self) == round(NumChildren(Parent) / 2 + 1)) then\n    VertPos: Top = Parent.Top;\n    HorizPos: Left = LeftSib.Left + Self.Width;\n  else\n    VertPos: Top = LeftSib.Actual Bottom;\n    HorizPos: Left = LeftSib.Left;\n  endif\n}</pre></code>\n            <p>Support for functionality like this could have perhaps truly enabled the dream of separating content from style. Unfortunately this language was plagued by being a bit too extensible, meaning it would have been very possible for its implementation to vary considerably from browser to browser. Additionally, it was published in a series of papers in the academic world, rather than on the www-talk mailing list where most of the functional work was being done. It was never integrated into a mainstream browser.</p><h3>The Ghost of CSS Past</h3><p>The language which, at least in name, would directly lead to CSS was called CHSS (Cascading HTML Style Sheets), <a href=\"http://people.opera.com/howcome/2006/phd/archive/www.w3.org/People/howcome/p/cascade.html\">proposed</a> in 1994 by Håkon W Lie.</p><p>Like most good ideas, the original proposal was pretty nutty.</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">h1.font.size = 24pt 100%\nh2.font.size = 20pt 40%</pre></code>\n            <p>Note the percentages at the end of rules. This percentage referred to how much ‘ownership’ the current stylesheet was taking over this value. If a previous stylesheet had defined the <code>h2</code> font size as <code>30pt</code>, with <code>60%</code> ownership, and this stylesheet styled <code>h2</code>s as <code>20px 40%</code>, the two values would be combined based on their ownership percentage to get some value around <code>26pt</code>.</p><p>It is pretty clear how this proposal was made in the era of document-based HTML pages, as there is no way compromise-based design would work in our app-oriented world. Nevertheless, it did include the fundamental idea that stylesheets should cascade. In other words, it should be possible for multiple stylesheets to be applied to the same page.</p><p>This idea, in its original formulation, was generally considered important because it gave the end user control over what they saw. The original page would have one stylesheet, and the web user would have his or her own stylesheet, and the two would be combined to render the page. Supporting multiple stylesheets was viewed as a method of maintaining the personal-freedom of the web, not as a way of supporting developers (who were still coding individual HTML pages by hand).</p><p>The user would even be able to control how much control they gave to the suggestions of the page’s author, as expressed in an ASCII diagram in the proposal:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">       User                   Author\nFont   o-----x--------------o 64%\nColor  o-x------------------o 90%\nMargin o-------------x------o 37%\nVolume o---------x----------o 50%</pre></code>\n            <p>Like many of these proposals, it included features which would not make it into CSS for decades, if ever. For example, it was possible to write logical expressions based on the user’s environment:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">AGE &gt; 3d ? background.color = pale_yellow : background.color = white\nDISPLAY_HEIGHT &gt; 30cm ? http://NYT.com/style : http://LeMonde.fr/style</pre></code>\n            <p>In a somewhat optimistic sci-fi vision of the future, it was believed your browser would know how relevant a given piece of content was to you, allowing it to show it to you at a larger size:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">RELEVANCE &gt; 80 ? h1.font.size *= 1.5</pre></code>\n            <h3>You Know What Happened Next</h3><blockquote><p><i>Microsoft is absolutely committed to open standards, especially on the Internet.</i></p><p><i>— John Ludeman </i><a href=\"http://1997.webhistory.org/www.lists/www-talk.1994q4/0003.html\"><i><code><u>1994</u></code></i></a></p></blockquote><p>Håkon Lie went on to simplify his proposal and, working with Bert Bos, published the first version of the CSS spec in December of 1996. Ultimately he would go on to write his doctoral thesis on the creation of CSS, <a href=\"http://people.opera.com/howcome/2006/phd/\">a document</a> which was heroically helpful to me in writing this.</p><p>Compared to many of the other proposals, one notable fact of CSS is its simplicity. It can be easily parsed, easily written, and easily read. As with many other examples over the history of the Internet, it was the technology which was easiest for a beginner to pick up which won, rather than those which were most powerful for an expert.</p><p>It is itself a reminder of how incidental much of this innovation can be. For example, support for contextual selectors (<code>body ol li</code>) was only added because Netscape already had a method for removing borders from images that were hyperlinks, and it seemed necessary to implement everything the popular browser could do. The functionality itself added a significant delay to the implementation of CSS, as at the time most browsers didn’t keep a ‘stack’ of tags as they parsed HTML. This meant the parsers had to be redesigned to support CSS fully.</p><p>Challenges like this (and the widespread use of non-standard HTML tags to define style) meant CSS was not usable until 1997, and was not fully supported by any single browser until March of 2000. As any developer can tell you, browser support wasn’t anywhere close to standards compliant until just a few years ago, more than fifteen years after CSS’ release.</p><h3>The Final Boss</h3><blockquote><p><i>If Netscape 4 ignored CSS rules applied to the </i><i><code>&lt;body&gt;</code></i><i> element and added random amounts of whitespace to every structural element on your page, and if IE4 got </i><i><code>&lt;body&gt;</code></i><i> right but bungled padding, what kind of CSS was safe to write? Some developers chose not to write CSS at all. Others wrote one style sheet to compensate for IE4’s flaws and a different style sheet to compensate for the blunders of Netscape 4.</i></p><p><i>— Jeffrey Zeldman</i></p></blockquote><p>Internet Explorer 3 famously launched with (somewhat terrible) CSS support. To compete, it was decided that Netscape 4 should also have support for the language. Rather than doubling down on this third (considering HTML and JavaScript) language though, it was decided it should be implemented by converting the CSS into JavaScript, and executing it. Even better, it was decided this ‘JavaScript Style Sheet’ intermediary language should be <a href=\"https://web.archive.org/web/19970709133056/http://home.netscape.com/comprod/products/communicator/guide.html\">accessible to web developers</a>.</p><p>The syntax is straight JavaScript, with the addition of some styling-specific APIs:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">tags.H1.color = &quot;blue&quot;;\ntags.p.fontSize = &quot;14pt&quot;;\nwith (tags.H3) {\n  color = &quot;green&quot;;\n}\n\nclasses.punk.all.color = &quot;#00FF00&quot;\nids.z098y.letterSpacing = &quot;0.3em&quot;</pre></code>\n            <p>You could even define functions which would be evaluated <i>every time the tag was encountered</i>:</p>\n            <pre class=\"language-undefined\"><code class=\"language-undefined\">evaluate_style() {\n  if (color == &quot;red&quot;){\n    fontStyle = &quot;italic&quot;;\n  } else {\n    fontWeight = &quot;bold&quot;;\n  }\n}\n\ntag.UL.apply = evaluate_style();</pre></code>\n            <p>The idea that we should simplify the dividing line between styles and scripts is certainly reasonable, and is now even experiencing a resurgence of sorts in the <a href=\"https://facebook.github.io/react/tips/inline-styles.html\">React community</a>.</p><p>JavaScript was itself a very new language at this time, but via some reverse engineering Internet Explorer had already added support for it into IE3 (as “JScript”). The bigger issue was the community had already rallied around CSS, and Netscape was, at this time, viewed as <a href=\"https://lists.w3.org/Archives/Public/www-style/1996Jun/0068.html\">bullies</a> by much of the standards community. When Netscape did <a href=\"https://www.w3.org/Submission/1996/1/WD-jsss-960822\">submit</a> JSSS to the standards committee, it fell on deaf ears. Three years later, Netscape 6 dropped support for JSSS and it died a (mostly) quiet death.</p><h3>What Might Have Been</h3><p>Thanks to some <a href=\"https://www.w3.org/Style/CSS/Test/CSS1/current/\">public shaming</a> by the W3C, Internet Explorer 5.5 launched with nearly complete CSS1 support in the year 2000. Of course, as we now know, browser CSS implementations were heroically buggy and difficult to work with for at least another decade.</p><p>Today the situation has fortunately improved dramatically, allowing developers to finally realize the dream of writing code once and trusting it will function (almost) the same from browser to browser.</p><p>Our conclusion from all of this is the realization of just how arbitrary and contextual many of the decisions which govern our current tools were. If CSS was designed the way it is just to satisfy the constraints of 1996, then maybe that gives us permission 20 years later to do things a little differently.</p>",
		"id": "5yG9u87wVPpb6PEdtTLyXy",
		"localeList": {
			"name": "blog-english-only",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-08-02T06:00+00:00",
		"slug": "the-languages-which-almost-became-css",
		"tags": [
			{
				"id": "2iLPezAh3dM2OI570IiXAc",
				"name": "Cloudflare Apps",
				"slug": "cloudflare-apps"
			},
			{
				"id": "546uBJtNvdfazwx1jzmH40",
				"name": "History",
				"slug": "history"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "6lhzEBz2B56RKa4nUEAGYJ",
				"name": "Programming",
				"slug": "programming"
			}
		],
		"title": "The Languages Which Almost Became CSS",
		"updated_at": "2024-08-27T02:29:13.922Z",
		"url": "https://blog.cloudflare.com/the-languages-which-almost-became-css"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}