{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "20",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Armando Faz-Hernández",
				"slug": "armfazh",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1KZECWa5TCEPjjcRmbx9iT/c62263899934ff326df2b6864e42b104/armfazh.png",
				"location": null,
				"website": "https://research.cloudflare.com/people/armando-faz/",
				"twitter": "@armfazh",
				"facebook": null
			}
		],
		"excerpt": "The impact of quantum computing on cryptography conducts research and development towards a Post-Quantum era.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4NUx5s2q56nglND3njogQP/9b176aa75a2f009701e08dc9f4c35945/the-quantum-menace.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/KggPUuIkHtwFroIgH08Px/a75cdd485a0c1db579c4cb8c5513bcdb/post-quantum--2.png\" alt=\"\" class=\"kg-image\" width=\"1042\" height=\"1041\" loading=\"lazy\"/>\n            \n            </figure><p>Over the last few decades, the word ‘quantum’ has become increasingly popular. It is common to find articles, reports, and many people interested in quantum mechanics and the new capabilities and improvements it brings to the scientific community. This topic not only concerns physics, since the development of quantum mechanics impacts on several other fields such as chemistry, economics, <a href=\"https://www.cloudflare.com/learning/ai/what-is-artificial-intelligence/\">artificial intelligence</a>, operations research, and undoubtedly, cryptography.</p><p>This post begins a trio of blogs describing the impact of quantum computing on cryptography, and how to use stronger algorithms resistant to the power of quantum computing.</p><ul><li><p>This post introduces quantum computing and describes the main aspects of this new computing model and its devastating impact on security standards; it summarizes some approaches to securing information using quantum-resistant algorithms.</p></li><li><p>Due to the relevance of this matter, we present <a href=\"/towards-post-quantum-cryptography-in-tls\">our experiments</a> on a large-scale deployment of quantum-resistant algorithms.</p></li><li><p>Our third <a href=\"/introducing-circl\">post introduces CIRCL</a>, open-source Go library featuring optimized implementations of quantum-resistant algorithms and elliptic curve-based primitives.</p></li></ul><p>All of this is part of Cloudflare’s <a href=\"/welcome-to-crypto-week-2019/\">Crypto Week 2019</a>, now fasten your seat-belt and get ready to make a quantum leap.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-is-quantum-computing\">What is Quantum Computing?</h3>\n            <a href=\"#what-is-quantum-computing\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Back in 1981, <a href=\"https://link.springer.com/article/10.1007/BF02650179\">Richard Feynman</a> raised the question about what kind of computers can be used to simulate physics. Although some physical systems can be simulated in a classical computer, the amount of resources used by such a computer can grow exponentially. Then, he conjectured the existence of a computer model that behaves under quantum mechanics rules, which opened a field of research now called <i>quantum computing</i>. To understand the basics of quantum computing, it is necessary to recall how classical computers work, and from that shine a spotlight on the differences between these computational models.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6wIvGjwtPsLAbIreCKjZ8X/117e122adf81acd22ad6724fbec528a4/pasted-image-0--2--1.png\" alt=\"\" class=\"kg-image\" width=\"600\" height=\"365\" loading=\"lazy\"/>\n            \n            </figure><p>Fellows of the <a href=\"http://blogs.royalsociety.org/history-of-science/2012/07/24/art-of-finding-inspiration/\">Royal Society</a>: John Maynard Smith, Richard Feynman &amp; Alan Turing</p><p>In 1936, Alan Turing and Emil Post independently described models that gave rise to the foundation of the computing model known as the Post-Turing machine, which describes how computers work and allowed further determination of limits for solving problems.</p><p>In this model, the units of information are <i>bits</i>, which store one of two possible values, usually denoted by 0 and 1. A computing machine contains a set of bits and performs operations that modify the values of the bits, also known as the machine’s state. Thus, a machine with <i>N</i> bits can be in one of _2_ᴺ possible states. With this in mind, the Post-Turing computing model can be abstractly described as a machine of states, in which running a program is translated as machine transitions along the set of states.</p><p>A <a href=\"https://royalsocietypublishing.org/doi/abs/10.1098/rspa.1985.0070\">paper</a> David Deutsch published in 1985 describes a computing model that extends the capabilities of a Turing machine based on the theory of quantum mechanics. This computing model introduces several advantages over the Turing model for processing large volumes of information. It also presents unique properties that deviate from the way we understand classical computing. Most of these properties come from the nature of quantum mechanics. We’re going to dive into these details before approaching the concept of quantum computing.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"superposition\">Superposition</h3>\n            <a href=\"#superposition\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>One of the most exciting properties of quantum computing that provides an advantage over the classical computing model is <i>superposition</i>. In physics, superposition is the ability to produce valid states from the addition or superposition of several other states that are part of a system.</p><p>Applying these concepts to computing information, it means that there is a system in which it is possible to generate a machine state that represents a (weighted) sum of the states 0 and 1; in this case, the term <i>weighted</i> means that the state can keep track of “the quantity of” 0 and 1 present in the state. In the classical computation model, one bit can only store either the state of 0 or 1, not both; even using two bits, they cannot represent the weighted sum of these states. Hence, to make a distinction from the basic states, quantum computing uses the concept of a <i>quantum bit</i> (<i>qubit</i>) -- a unit of information to denote the superposition of two states. This is a cornerstone concept of quantum computing as it provides a way of tracking more than a single state per unit of information, making it a powerful tool for processing information.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1I6axLkTlVksOUICoYw8qj/627dd13efb4c253315cabd05493757a9/switch-vs-dimmer_3x-1.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"933\" loading=\"lazy\"/>\n            \n            </figure><p>Classical computing – A bit stores only one of two possible states: ON or OFF.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2AUfinBsQ8DGXSaPeeOR7b/3334eb6183daca9b89b3184043210d2c/switch-vs-dimmer_3x-copy.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"768\" loading=\"lazy\"/>\n            \n            </figure><p>Quantum computing – A qubit stores a combination of two or more states.</p><p>So, a qubit represents the sum of two parts: the 0 or 1 state plus the amount each 0/1 state contributes to produce the state of the qubit.</p><p>In mathematical notation, qubit \\( | \\Psi \\rangle \\) is an explicit sum indicating that a qubit represents the superposition of the states 0 and 1. This is the Dirac notation used to describe the value of a qubit \\( | \\Psi \\rangle =  A | 0 \\rangle +B | 1 \\rangle \\), where, A and B are complex numbers known as the <i>amplitude</i> of the states 0 and 1, respectively. The value of the basic states is represented by qubits as \\( | 0 \\rangle =  1 | 0 \\rangle + 0 | 1 \\rangle \\)  and \\( | 1 \\rangle =  0 | 0 \\rangle + 1 | 1 \\rangle \\), respectively. The right side of the term contains the abbreviated notation for these special states.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"measurement\">Measurement</h3>\n            <a href=\"#measurement\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>In a classical computer, the values 0 and 1 are implemented as digital signals. Measuring the current of the signal automatically reveals the status of a bit. This means that at any moment the value of the bit can be observed or <i>measured</i>.</p><p>The state of a qubit is maintained in a physically closed system, meaning that the properties of the system, such as superposition, require no interaction with the environment; otherwise any interaction, like performing a measurement, can cause interference on the state of a qubit.</p><p>Measuring a qubit is a probabilistic experiment. The result is a bit of information that depends on the state of the qubit. The bit, obtained by measuring \\( | \\Psi \\rangle =  A | 0 \\rangle +B | 1 \\rangle \\), will be equal to 0 with probability \\( |A|^2 \\),  and equal to 1 with probability \\( |B|^2 \\), where \\( |x| \\) represents the <a href=\"https://en.wikipedia.org/wiki/Absolute_value#Complex_numbers\">absolute value</a> of \\(x\\).</p><p>From Statistics, we know that the sum of probabilities of all possible events is always equal to 1, so it must hold that \\( |A|^2 +|B|^2 =1 \\). This last equation motivates to represent qubits as the points of a circle of radius one, and more generally, as the points on the surface of a sphere of radius one, which is known as the <a href=\"https://en.wikipedia.org/wiki/Bloch_sphere\">Bloch Sphere</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6NmMTlriFkeL9Jb1td5SfO/53735ec341c68f97057099281563e1ee/unit_circl-1.png\" alt=\"\" class=\"kg-image\" width=\"358\" height=\"332\" loading=\"lazy\"/>\n            \n            </figure><p>The qubit state is analogous to a point on a unitary circle.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7qMFBDnHzzZwOl9AFmnReZ/61dc703ac2c850e36363b1972a1a5100/Bloch_sphere.png\" alt=\"\" class=\"kg-image\" width=\"350\" height=\"372\" loading=\"lazy\"/>\n            \n            </figure><p>The Bloch Sphere by <a href=\"https://commons.wikimedia.org/w/index.php?curid=5829358\">Smite-Meister</a> - Own work, CC BY-SA 3.0.</p><p>Let’s break it down: If you measure a qubit you also destroy the superposition of the qubit, resulting in a superposition state collapse, where it assumes one of the basics states, providing your final result.</p><p>Another way to think about superposition and measurement is through the coin tossing experiment.</p><p>Toss a coin in the air and you give people a random choice between two options: heads or tails. Now, don&#39;t focus on the randomness of the experiment, instead note that while the coin is rotating in the air, participants are uncertain which side will face up when the coin lands. Conversely, once the coin stops with a random side facing up, participants are 100% certain of the status.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1JLa4qxwkVC68ygOK96p4j/e6530dd234ddc2dd80a0578d1701b57d/coin.png\" alt=\"\" class=\"kg-image\" width=\"300\" height=\"223\" loading=\"lazy\"/>\n            \n            </figure><p>How does it relate? Qubits are similar to the participants. When a qubit is in a superposition of states, it is tracking the probability of heads or tails, which is the participants’ uncertainty quotient while the coin is in the air. However, once you start to measure the qubit to retrieve its value, the superposition vanishes, and a classical bit value sticks: heads or tails. Measurement is that moment when the coin is static with only one side facing up.</p><p>A fair coin is a coin that is not biased. Each side (assume 0=heads and 1=tails) of a fair coin has the same probability of sticking after a measurement is performed. The qubit \\( \\tfrac{1}{\\sqrt{2}}|0\\rangle + \\tfrac{1}{\\sqrt{2}}|1\\rangle \\) describes the probabilities of tossing a fair coin. Note that squaring either of the amplitudes results in ½, indicating that there is a 50% chance either heads or tails sticks.</p><p>It would be interesting to be able to charge a fair coin at will while it is in the air. Although this is the magic of a professional illusionist, this task, in fact, can be achieved by performing operations over qubits. So, get ready to become the next quantum magician!</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/532YwSvZO7qW1yBi7Up29t/99f327467f63ec00bb0070e67ff535c4/coinMagic.png\" alt=\"\" class=\"kg-image\" width=\"300\" height=\"190\" loading=\"lazy\"/>\n            \n            </figure>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"quantum-gates\">Quantum Gates</h3>\n            <a href=\"#quantum-gates\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>A logic gate represents a Boolean function operating over a set of inputs (on the left) and producing an output (on the right). A logic circuit is a set of connected logic gates, a convenient way to represent bit operations.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3r5DwkDJpXFX5z9c2TLwQf/26349d4859e4f85ac36e8bc05f4d0a79/notGate-1.png\" alt=\"\" class=\"kg-image\" width=\"217\" height=\"113\" loading=\"lazy\"/>\n            \n            </figure><p>The NOT gate is a single-bit operation that flips the value of the input bit.</p><p>Other gates are AND, OR, XOR, and NAND, and more. A set of gates is universal if it can generate other gates. For example, NOR and NAND gates are universal since any circuit can be constructed using only these gates.</p><p>Quantum computing also admits a description using circuits. Quantum gates operate over qubits, modifying the superposition of the states. For example, there is a quantum gate analogous to the NOT gate, the X gate.</p><p>The X quantum gate interchanges the amplitudes of the states of the input qubit.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2uLztfzrwMTgv3EgzcCh68/67a0aa788e99a27da20dc88b904eb0f9/Xgate-1.png\" alt=\"\" class=\"kg-image\" width=\"694\" height=\"69\" loading=\"lazy\"/>\n            \n            </figure><p>The Z quantum gate flips the sign’s amplitude of state 1:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1v01TxJtUeYWdKWfI6JO5g/a6e7b5c411191a8733cbb761999af3bb/Zgate-1.png\" alt=\"\" class=\"kg-image\" width=\"688\" height=\"69\" loading=\"lazy\"/>\n            \n            </figure><p>Another quantum gate is the Hadamard gate, which generates an equiprobable superposition of the basic states.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/41HRIfWHpFQBIFfqrgUMg1/94769cbdae4034d9d8bcf2326c4ac6e2/hadamard-1.png\" alt=\"\" class=\"kg-image\" width=\"560\" height=\"180\" loading=\"lazy\"/>\n            \n            </figure><p>Using our coin tossing analogy, the Hadamard gate has the action of tossing a fair coin to the air. In quantum circuits, a triangle represents measuring a qubit, and the resulting bit is indicated by a double-wire.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7byLmFB5x7RfBSLPFGVu0S/1f2db2197514575f7a5ecad7769effeb/measureGate-1.png\" alt=\"\" class=\"kg-image\" width=\"632\" height=\"96\" loading=\"lazy\"/>\n            \n            </figure><p>Other gates, such as the CNOT gate, Pauli’s gates, Toffoli gate, Deutsch gate, are slightly more advanced. <a href=\"https://algassert.com/quirk\">Quirk</a>, the open-source playground, is a fun sandbox where you can construct quantum circuits using all of these gates.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"reversibility\">Reversibility</h3>\n            <a href=\"#reversibility\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>An operation is reversible if there exists another operation that rolls back the output state to the initial state. For instance, a NOT gate is reversible since applying a second NOT gate recovers the initial input.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1P37tXMONI1EmSBEn4cizm/26b63188cb18bc769789e33cc8d6d526/notReversibleGate-1.png\" alt=\"\" class=\"kg-image\" width=\"385\" height=\"54\" loading=\"lazy\"/>\n            \n            </figure><p>In contrast, AND, OR, NAND gates are not reversible. This means that some classical computations cannot be reversed by a classic circuit that uses only the output bits. However, if you insert additional bits of information, the operation can be reversed.</p><p>Quantum computing mainly focuses on reversible computations, because there’s always a way to construct a reversible circuit to perform an irreversible computation. The reversible version of a circuit could require the use of <i>ancillary</i> qubits as auxiliary (but not temporary) variables.</p><p>Due to the nature of composed systems, it could be possible that these <i>ancillas</i> (extra qubits) correlate to qubits of the main computation. This correlation makes it infeasible to reuse ancillas since any modification could have the side-effect on the operation of a reversible circuit. This is like memory assigned to a process by the operating system: the process cannot use memory from other processes or it could cause memory corruption, and processes cannot release their assigned memory to other processes. You could use garbage collection mechanisms for ancillas, but performing reversible computations increases your qubit budget.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"composed-systems\">Composed Systems</h3>\n            <a href=\"#composed-systems\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>In quantum mechanics, a single qubit can be described as a single closed system: a system that has no interaction with the environment nor other qubits. Letting qubits interact with others leads to a <i>composed system</i> where more states are represented. The state of a 2-qubit composite system is denoted as \\(A_0|00\\rangle+A_1|01\\rangle+A_2|10\\rangle+A_3|11\\rangle \\), where, \\( A_i \\) values correspond to the amplitudes of the four basic states 00, 01, 10, and 11. This qubit \\( \\tfrac{1}{2}|00\\rangle+\\tfrac{1}{2}|01\\rangle+\\tfrac{1}{2}|10\\rangle+\\tfrac{1}{2}|11\\rangle \\) represents the superposition of these basic states, both having the same probability obtained after measuring the two qubits.</p><p>In the classical case, the state of N bits represents only <b>one</b> of 2ᴺ possible states, whereas a composed state of N qubits represents <b>all</b> the 2ᴺ states <i>but</i> in superposition. This is one big difference between these computing models as it carries two important properties: entanglement and quantum parallelism.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"entanglement\">Entanglement</h3>\n            <a href=\"#entanglement\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>According to the theory behind quantum mechanics, some composed states can be described through the description of its constituents. However, there are composed states where no description is possible, known as <i>entangled states</i>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6AjGsPw33QpE8Dtpz2vCSU/ccef8278f241951a758a81239ba19793/bellStates-2.png\" alt=\"\" class=\"kg-image\" width=\"856\" height=\"160\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://en.wikipedia.org/wiki/Bell_state\">Bell states</a> are entangled qubit examples</p><p>The entanglement phenomenon was pointed out by Einstein, Podolsky, and Rosen in the so-called <a href=\"https://en.wikipedia.org/wiki/EPR_paradox\">EPR paradox</a>. Suppose there is a composed system of two entangled qubits, in which by performing a measurement in one qubit causes interference in the measurement of the second. This interference occurs even when qubits are separated by a long distance, which means that some information transfer happens faster than the speed of light. This is how quantum entanglement conflicts with the theory of relativity, where information cannot travel faster than the speed of light. The EPR paradox motivated further investigation for deriving new interpretations about quantum mechanics and aiming to resolve the paradox.</p><p>Quantum entanglement can help to transfer information at a distance by following a communication protocol. The following protocol examples rely on the fact that Alice and Bob separately possess one of two entangled qubits:</p><ul><li><p>The superdense coding protocol allows Alice to communicate a 2-bit message \\(m_0,m_1\\) to Bob using a quantum communication channel, for example, using fiber optics to transmit photons. All Alice has to do is operate on her qubit according to the value of the message and send the resulting qubit to Bob. Once Bob receives the qubit, he measures both qubits, noting that the collapsed 2-bit state corresponds to Alice’s message.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3B27r5nXlznlvOEeM8H6pm/8bce22506622f7ccacfdf17981b8a2aa/superdenseCoding-3.png\" alt=\"\" class=\"kg-image\" width=\"598\" height=\"335\" loading=\"lazy\"/>\n            \n            </figure><p>Superdense coding protocol.</p><ul><li><p>The quantum teleportation protocol allows Alice to transmit a qubit to Bob without using a quantum communication channel. Alice measures the qubit to send Bob and her entangled qubit resulting in two bits. Alice sends these bits to Bob, who operates on his entangled qubit according to the bits received and notes that the result state matches the original state of Alice’s qubit.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3UFNkskWzfhAdyxS4jrAKH/15d547196c7a13e4d721dc454c0451ae/teleportation-2.png\" alt=\"\" class=\"kg-image\" width=\"569\" height=\"309\" loading=\"lazy\"/>\n            \n            </figure><p>Quantum teleportation protocol.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"quantum-parallelism\">Quantum Parallelism</h3>\n            <a href=\"#quantum-parallelism\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Composed systems of qubits allow representation of more information per composed state. Note that operating on a composed state of N qubits is equivalent to operating over a set of 2ᴺ states in superposition. This procedure is <i>quantum parallelism</i>. In this setting, operating over a large volume of information gives the intuition of performing operations in parallel, like in the parallel computing paradigm; one big caveat is that superposition is not equivalent to parallelism.</p><p>Remember that a composed state is a superposition of several states so, a computation that takes a composed state of inputs will result in a composed state of outputs. The main divergence between classical and quantum parallelism is that quantum parallelism can obtain only <b>one</b> of the processed outputs. Observe that a measurement in the output of a composed state causes that the qubits collapse to only <b>one</b> of the outputs, making it unattainable to calculate all computed values.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2sgYPfYBGUWfrFMQOlq3Fw/e1b5ef233c303c2a7d76e62297e3496a/parallel-3.png\" alt=\"\" class=\"kg-image\" width=\"936\" height=\"71\" loading=\"lazy\"/>\n            \n            </figure><p>Although quantum parallelism does not match precisely with the traditional notion of parallel computing, you can still leverage this computational power to get related information.</p><p><i>Deutsch-Jozsa Problem</i>: Assume \\(F\\) is a function that takes as input N bits, outputs one bit, and is either constant (always outputs the same value for all inputs) or balanced (outputs 0 for half of the inputs and 1 for the other half). The problem is to determine if \\(F\\) is constant or balanced.</p><p>The quantum algorithm that solves the Deutsch-Jozsa problem uses quantum parallelism. First, N qubits are initialized in a superposition of 2ᴺ states. Then, in a single shot, it evaluates \\(F\\) for all of these states.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2i53rGbCSX6mPwXVbvij17/26f3b116ccca9d78085a61dafeb47940/deutsch.png\" alt=\"\" class=\"kg-image\" width=\"675\" height=\"68\" loading=\"lazy\"/>\n            \n            </figure><p>(note that some factors were omitted for simplicity)</p><p>The result of applying \\(F\\) appears (in the exponent) of the amplitude of the all-zero state. Note that only when \\(F\\) is constant is this amplitude, either +1 or -1. If the result of measuring the N qubit is an all-zeros bitstring, then there is a 100% certainty that \\(F\\) is constant. Any other result indicates that \\(F\\) is balanced.</p><p>A deterministic classical algorithm solves this problem using \\( 2^{N-1}+1\\) evaluations of \\(F\\) in the worst case. Meanwhile, the quantum algorithm requires only <b>one</b> evaluation. The Deutsch-Jozsa problem exemplifies the exponential advantage of a quantum algorithm over classical algorithms.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"quantum-computers\">Quantum Computers</h2>\n            <a href=\"#quantum-computers\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>The theory of quantum computing is supported by investigations in the field of quantum mechanics. However, constructing a quantum machine requires a physical system that allows representing qubits and manipulation of states in a reliable and precise way.</p><p>The <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1002/1521-3978%28200009%2948%3A9/11%3C771%3A%3AAID-PROP771%3E3.0.CO%3B2-E\">DiVincenzo Criteria</a> require that a physical implementation of a quantum computer must:</p><ol><li><p>Be scalable and have well-defined qubits.</p></li><li><p>Be able to initialize qubits to a state.</p></li><li><p>Have long decoherence times to apply quantum error-correcting codes. Decoherence of a qubit happens when the qubit interacts with the environment, for example, when a measurement is performed.</p></li><li><p>Use a universal set of quantum gates.</p></li><li><p>Be able to measure single qubits without modifying others.</p></li></ol><p>Quantum computer physical implementations face huge engineering obstacles to satisfy these requirements. The most important challenge is to guarantee low error rates during computation and measurement. Lowering these rates require techniques for error correction, which add a significant number of qubits specialized on this task. For this reason, the number of qubits of a quantum computer should not be regarded as for classical systems. In a classical computer, the bits of a computer are all effective for performing a calculation, whereas the number of qubits is the sum of the effective qubits (those used to make calculations) plus the ancillas (used for reversible computations) plus the error correction qubits.</p><p>Current implementations of quantum computers partially satisfy the DiVincenzo criteria. Quantum adiabatic computers fit in this category since they do not operate using quantum gates. For this reason, they are not considered to be universal quantum computers.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"quantum-adiabatic-computers\">Quantum Adiabatic Computers</h3>\n            <a href=\"#quantum-adiabatic-computers\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>A recurrent problem in optimization is to find the global minimum of an objective function. For example, a route-traffic control system can be modeled as a function that reduces the cost of routing to a minimum. Simulated annealing is a heuristic procedure that provides a good solution to these types of problems. Simulated annealing finds the solution state by slowly introducing changes (<a href=\"https://en.wikipedia.org/wiki/Adiabatic_theorem\">the adiabatic process</a>) on the variables that govern the system.</p><p><a href=\"https://doi.org/10.1103/PhysRevA.57.2403\">Quantum annealing</a> is the analogous quantum version of simulated annealing. A qubit is initialized into a superposition of states representing all possible solutions to the problem. Here is used the <a href=\"https://en.wikipedia.org/wiki/Hamiltonian_(quantum_mechanics)\">Hamiltonian operator</a>, which is the sum of vectors of potential and kinetic energies of the system. Hence, the objective function is encoded using this operator describing the evolution of the system in correspondence with time. Then, if the system is allowed to evolve very slowly, it will eventually land on a final state representing the optimal value of the objective function.</p><p>Currently, there exist adiabatic computers in the market, such as the D-Wave and IBM Q systems, featuring hundreds of qubits; however, their capabilities are somewhat limited to some problems that can be modeled as optimization problems. The limits of adiabatic computers were studied by <a href=\"https://people.eecs.berkeley.edu/~vazirani/pubs/adiabatic.pdf\">van Dam et al</a>, showing that despite solving local searching problems and even some instances of the <a href=\"https://doi.org/10.1080/00107514.2018.1450720\">max-SAT problem</a>, there exists harder searching problems this computing model cannot efficiently solve.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"nuclear-magnetic-resonance\">Nuclear Magnetic Resonance</h3>\n            <a href=\"#nuclear-magnetic-resonance\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Nuclear Magnetic Resonance (NMR) is a physical phenomena that can be used to represent qubits. The spin of atomic nucleus of molecules is perturbed by an oscillating magnetic field. A 2001 <a href=\"https://www.nature.com/articles/414883a\">report</a> describes successful implementation of Shor’s algorithm in a 7-qubit NMR quantum computer. An iconic result since this computer was able to factor the number 15.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4nhODbPubqocd6duEMvzui/9330f1a27684d959443bfae20fd4eb19/NMR_EPR.gif\" alt=\"\" class=\"kg-image\" width=\"302\" height=\"145\" loading=\"lazy\"/>\n            \n            </figure><p>Nucleus spinning induced by a magnetic field, <a href=\"https://commons.wikimedia.org/w/index.php?curid=20398517\">Darekk2</a> - <a href=\"https://creativecommons.org/licenses/by-sa/3.0/us/\">CC BY-SA 3.0</a></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5HwOLCsA3LUrJwOid1a5Bd/d134ec31fbdbeec162a1d37bafb70205/pasted-image-0--9-.png\" alt=\"\" class=\"kg-image\" width=\"174\" height=\"262\" loading=\"lazy\"/>\n            \n            </figure><p>NRM Spectrometer by <a href=\"http://web.physics.ucsb.edu/~msteffen/nmrqc.htm\">UCSB</a></p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"superconducting-quantum-computers\">Superconducting Quantum Computers</h3>\n            <a href=\"#superconducting-quantum-computers\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>One way to physically construct qubits is based on superconductors, materials that conduct electric current with zero resistance when exposed to temperatures close to absolute zero.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4EbOKUEsS0c1kzEqJ8ygGs/3dad6346018a3800ac3bdfe9bafdd5e4/thermo.png\" alt=\"\" class=\"kg-image\" width=\"600\" height=\"337\" loading=\"lazy\"/>\n            \n            </figure><p>The Josephson effect, in which current flows across the junction of two superconductors separated by a non-superconducting material, is used to physically implement a superposition of states.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6Nu6SWJ97k1yjuOCnmwjaK/035e2519ed36af9d0721e3048cfd7851/pasted-image-0--11-.png\" alt=\"\" class=\"kg-image\" width=\"1280\" height=\"791\" loading=\"lazy\"/>\n            \n            </figure><p>A Josephson junction - <a href=\"https://commons.wikimedia.org/w/index.php?curid=319467\">Public Domain</a></p><p>When a magnetic flux is applied to this junction, the current flows continuously in one direction. But, depending on the quantity of magnetic flux applied, the current can also flow in the opposite direction. There exists a quantum superposition of currents going both clockwise and counterclockwise leading to a physical implementation of a qubit called <i>flux qubit</i>. The complete device is known as the Superconducting Quantum Interference Device (SQUID) and can be easily coupled scaling the number of qubits. Thus, SQUIDs are like the transistors of a quantum computer.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4GUTS2ji1u31Laa9Ki7qsa/4a040661686bf49e679529362f0fab69/pasted-image-0--12-.png\" alt=\"\" class=\"kg-image\" width=\"1068\" height=\"694\" loading=\"lazy\"/>\n            \n            </figure><p>SQUID: Superconducting Quantum Interference Device. Image by <a href=\"https://www.kurzweilai.net/lockheed-martin-buys-first-d-wave-quantum-computing-system\">Kurzweil Network</a> and <a href=\"https://www.dwavesys.com/tutorials/background-reading-series/introduction-d-wave-quantum-hardware\">original</a> source.</p><p>Examples of superconducting computers are:</p><ul><li><p>D-wave’s <a href=\"https://www.dwavesys.com/d-wave-two-system\">adiabatic computers</a> process quantum annealing for solving diverse optimization problems.</p></li><li><p>Google’s <a href=\"https://ai.googleblog.com/2018/03/a-preview-of-bristlecone-googles-new.html\">72-qubit computer</a> was recently announced and also several <a href=\"https://ai.googleblog.com/2019/02/on-path-to-cryogenic-control-of-quantum.html\">engineering issues</a> such as achieving lower temperatures.</p></li><li><p>IBM’s <a href=\"https://www.research.ibm.com/ibm-q/technology/devices/\">IBM-Q Tokyo</a>, a 20-qubit adiabatic computer, and IBM Q Experience, a cloud-based system for exploring quantum circuits.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2KGpruf4BLxzcZWmIdEygU/dd7fbc74a3ccaf89d9dbb70a99ebf3d2/pasted-image-0--13-.png\" alt=\"\" class=\"kg-image\" width=\"223\" height=\"400\" loading=\"lazy\"/>\n            \n            </figure><p>D-Wave Cooling System by <a href=\"https://www.dwavesys.com/tutorials/background-reading-series/introduction-d-wave-quantum-hardware\">D-Wave Systems Inc.</a></p><p>IBM Q System</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2TWZIHj4mFrE5mrF8eod4Y/1fbee6190611e6e85d96c35c646ad5d7/pasted-image-0--14-.png\" alt=\"\" class=\"kg-image\" width=\"960\" height=\"960\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"https://www.forbes.com/sites/tiriasresearch/2019/01/17/ibm-lattice-cryptography-is-needed-now-to-defend-against-quantum-computing-future/#38383853c42e\">IBM Q System One</a> cryostat at CES.</p>\n          <div class=\"flex anchor relative\">\n            <h2 id=\"the-imminent-threat-of-quantum-algorithms\">The Imminent Threat of Quantum Algorithms</h2>\n            <a href=\"#the-imminent-threat-of-quantum-algorithms\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n          <p>The <a href=\"https://quantumalgorithmzoo.org\">quantum zoo website</a> tracks problems that can be solved using quantum algorithms. As of mid-2018, more than 60 problems appear on this list, targeting diverse applications in the area of number theory, approximation, simulation, and searching. As terrific as it sounds, some easily-solvable problems by quantum computing are surrounding the security of information.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"grovers-algorithm\">Grover’s Algorithm</h3>\n            <a href=\"#grovers-algorithm\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <blockquote><p><b>Tales of a quantum detective (fragment)</b><i>.</i> A couple of detectives have the mission of finding one culprit in a group of suspects that always respond to this question honestly: “are you guilty?”.The detective C follows a classic interrogative method and interviews every person one at a time, until finding the first one that confesses.The detective Q proceeds in a different way, First gather all suspects in a completely dark room, and after that, the detective Q asks them -- are you guilty? -- A steady sound comes from the room saying “No!” while at the same time, a single voice mixed in the air responds “Yes!.” Since everybody is submerged in darkness, the detective cannot see the culprit. However, detective Q knows that, as long as the interrogation advances, the culprit will feel desperate and start to speak louder and louder, and so, he continues asking the same question. Suddenly, detective Q turns on the lights, enters into the room, and captures the culprit. How did he do it?</p></blockquote><p>The task of the detective can be modeled as a searching problem. Given a Boolean function \\( f\\) that takes N bits and produces one bit, to find the unique input \\(x\\) such that \\( f(x)=1\\).</p><p>A classical algorithm (detective C) finds \\(x\\) using \\(2^N-1\\) function evaluations in the worst case. However, the quantum algorithm devised by Grover, corresponding to detective Q, searches quadratically faster using around \\(2^{N/2}\\) function evaluations.</p><p>The key intuition of Grover’s algorithm is increasing the amplitude of the state that represents the solution while maintaining the other states in a lower amplitude. In this way, a system of N qubits, which is a superposition of 2ᴺ possible inputs, can be continuously updated using this intuition until the solution state has an amplitude closer to 1. Hence, after updating the qubits many times, there will be a high probability to measure the solution state.</p><p>Initially, a superposition of 2ᴺ states (horizontal axis) is set, each state has an amplitude (vertical axis) close to 0. The qubits are updated so that the amplitude of the solution state increases more than the amplitude of other states. By repeating the update step, the amplitude of the solution state gets closer to 1, which boosts the probability of collapsing to the solution state after measuring.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6Db09DeqNScBPD5IBrFSwH/45b2bac441bee6ba789779707600a487/grover.gif\" alt=\"\" class=\"kg-image\" width=\"609\" height=\"557\" loading=\"lazy\"/>\n            \n            </figure><p>Image taken from D. Bernstein’s <a href=\"https://cr.yp.to/talks/2019.02.05/slides-djb-20190205-walks-4x3.pdf\">slides</a>.</p><p><b>Grover’s Algorithm</b> (pseudo-code):</p><ol><li><p>Prepare an N qubit \\(|x\\rangle \\) as a uniform superposition of 2ᴺ states.</p></li><li><p>Update the qubits by performing this core operation. $$ |x\\rangle \\mapsto (-1)^{f(x)} |x\\rangle $$ The result of \\( f(x) \\) only flips the amplitude of the searched state.</p></li><li><p>Negate the N qubit over the average of the amplitudes.</p></li><li><p>Repeat Step 2 and 3 for \\( (\\tfrac{\\pi}{4})  2^{ N/2} \\) times.</p></li><li><p>Measure the qubit and return the bits obtained.</p></li></ol><p>Alternatively, the second step can be better understood as a conditional statement:</p>\n            <pre class=\"language-fortran\"><code class=\"language-fortran\">IF f(x) = 1 THEN\n     Negate the amplitude of the solution state.\nELSE\n     /* nothing */\nENDIF</pre></code>\n            <p>Grover’s algorithm considers function \\(f\\) a black box, so with slight modifications, the algorithm can also be used to find collisions on the function. This implies that Grover’s algorithm can find a collision using an asymptotically less number of operations than using a brute-force algorithm.</p><p>The power of Grover’s algorithm can be turned against cryptographic hash functions. For instance, a quantum computer running Grover’s algorithm could find a collision on SHA256 performing only 2¹²⁸ evaluations of a reversible circuit of SHA256. The natural protection for hash functions is to increase the output size to double. More generally, most of symmetric key encryption algorithms will survive to the power of Grover’s algorithm by doubling the size of keys.</p><p>The scenario for public-key algorithms is devastating in face of Peter Shor’s algorithm.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"shors-algorithm\">Shor’s Algorithm</h3>\n            <a href=\"#shors-algorithm\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Multiplying integers is an easy task to accomplish, however, finding the factors that compose an integer is difficult. The <i>integer factorization</i> problem is to decompose a given integer number into its prime factors. For example, 42 has three factors 2, 3, and 7 since \\( 2\\times 3\\times 7 = 42\\). As the numbers get bigger, integer factorization becomes more difficult to solve, and the hardest instances of integer factorization are when the factors are only two different large primes. Thus, given an integer number \\(N\\), to find primes \\(p\\) and \\(q\\) such that \\( N = p \\times q\\), is known as <i>integer splitting</i>.</p><p>Factoring integers is like cutting wood, and the specific task of splitting integers is analogous to using an axe for splitting the log in two parts. There exist many different tools (algorithms) for accomplishing each task.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3xu3bHkkIKDkHCIGmFpMHW/933aebe8dc06d560b6046b2a717ed22c/split-logs-_2x-1.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"738\" loading=\"lazy\"/>\n            \n            </figure><p>For integer factorization, trial division, the Rho method, the elliptic curve method are common algorithms. Fermat&#39;s method, the quadratic- and rational-sieve, leads to the (general) number field sieve (NFS) algorithm for integer splitting. The latter relies on finding a congruence of squares, that is, splitting \\(N\\) as a product of squares such that $$ N = x^2 - y^2 = (x+y)\\times(x-y) $$ The complexity of NFS is mainly attached to the number of pairs \\((x, y)\\) that must be examined before getting a pair that factors \\(N\\). The NFS algorithm has subexponential complexity on the size of \\(N\\), meaning that the time required for splitting an integer increases significantly as the size of \\(N\\) grows. For large integers, the problem becomes intractable for classical computers.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"the-axe-of-thor-shor\">The Axe of Thor Shor</h3>\n            <a href=\"#the-axe-of-thor-shor\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        \n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2GxTLE4NstVADFSD1GrMYJ/7ad0d018f58e6e19ee9d227085c16a63/pasted-image-0--5-.png\" alt=\"\" class=\"kg-image\" width=\"498\" height=\"666\" loading=\"lazy\"/>\n            \n            </figure><p>Olaf Tryggvason - <a href=\"https://be.m.wikipedia.org/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:Olaf_Trygvason_struck_the_god_Thor_down_from_his_seat.gif\">Public Domain</a></p><p>The many different guesses of the NFS algorithm are analogous to hitting the log using a dulled axe; after subexponential many tries, the log is cut by half. However, using a sharper axe allows you to split the log faster. This sharpened axe is the quantum algorithm proposed by Shor in 1994.</p><p>Let \\(x\\) be an integer less than \\(N\\) and of the order \\(k\\). Then, if \\(k\\) is even, there exists an integer \\(q\\) so \\(qN\\) can be factored as follows.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7t1jfVt9FExCaJg1ECBEPe/b780f2d2beac0c0166e03b3cd8f7b15d/GDU9PfKYGcI6l4uvKFH_wk_yZjX55rFpFFR0cLHr1ZCQmtkHlU8EO2K9VQWerbwwaIEdej8CLlJh9M3P1pCJWJ6SwGtRSIWoqNqll5enRkvvIv_nhj6uTWojWy0b.png\" alt=\"\" class=\"kg-image\" width=\"1272\" height=\"513\" loading=\"lazy\"/>\n            \n            </figure><p>This approach has some issues. For example, the factorization could correspond to \\(q\\) not \\(N\\) and the order of \\(x\\) is unknown, and here is where Shor’s algorithm enters the picture, finding the order of \\(x\\).</p><p>The internals of Shor’s algorithm rely on encoding the order \\(k\\) into a periodic function, so that its period can be obtained using the quantum version of the Fourier transform (QFT). The order of \\(x\\) can be found using a polynomial number quantum evaluations of Shor’s algorithm. Therefore, splitting integers using this quantum approach has polynomial complexity on the size of \\(N\\).</p><p>Shor’s algorithm carries strong implications on the security of the RSA encryption scheme because its security relies on integer factorization. A large-enough quantum computer can efficiently break RSA for current instances.</p><p>Alternatively, one may recur to elliptic curves, used in cryptographic protocols like <a href=\"/ecdsa-the-digital-signature-algorithm-of-a-better-internet/\">ECDSA</a> or ECDH. Moreover, all <a href=\"/staying-on-top-of-tls-attacks/\">TLS ciphersuites</a> use a combination of elliptic curve groups, large prime groups, and RSA and DSA signatures. Unfortunately, these algorithms all succumb to Shor’s algorithm. It only takes a few modifications for Shor’s algorithm to solve the discrete logarithm problem on finite groups. This sounds like a catastrophic story where all of our encrypted data and privacy are no longer secure with the advent of a quantum computer, and in some sense this is true.</p><p>On one hand, it is a fact that the quantum computers constructed as of 2019 are not large enough to run, for instance, Shor’s algorithm for the RSA key sizes used in standard protocols. For example, a 2018 <a href=\"https://doi.org/10.1038/s41598-018-36058-z\">report</a> shows experiments on the factorization of a 19-bit number using 94 qubits, they also estimate that 147456 qubits are needed for factoring a 768-bit number. Hence, there numbers indicates that we are still far from breaking RSA.</p><p>What if we increment RSA key sizes to be resistant to quantum algorithms, just like for symmetric algorithms?</p><p><a href=\"https://cr.yp.to/papers/pqrsa-20170419.pdf\">Bernstein et al</a>. estimated that RSA public keys should be as large as 1 terabyte to maintain secure RSA even in the presence of quantum factoring algorithms. So, for public-key algorithms, increasing the size of keys does not help.</p><p>A recent investigation by <a href=\"https://arxiv.org/abs/1905.09749\">Gidney and Ekerá</a> shows improvements that accelerate the evaluation of quantum factorization. In their report, the cost of factoring 2048-bit integers is estimated to take a few hours using a quantum machine of 20 million qubits, which is far from any current development. Something worth noting is that the number of qubits needed is two orders of magnitude smaller than the estimated numbers given in previous works developed in this decade. Under these estimates, current encryption algorithms will remain secure several more years; however, consider the following not-so-unrealistic situation.</p><p>Information currently encrypted with for example, RSA, can be easily decrypted with a quantum computer in the future. Now, suppose that someone records encrypted information and stores them until a quantum computer is able to decrypt ciphertexts. Although this could be as far as 20 years from now, the forward-secrecy principle is violated. A 20-year gap to the future is sometimes difficult to imagine. So, let’s think backwards, what would happen if all you did on the Internet at the end of the 1990s can be revealed 20 years later -- today. How does this impact the security of your personal information? What if the ciphertexts were company secrets or business deals? In 1999, most of us were concerned about the effects of the <a href=\"https://en.wikipedia.org/wiki/Year_2000_problem\">Y2K problem</a>, now we’re facing Y2Q (<i>years to quantum</i>): the advent of quantum computers.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"post-quantum-cryptography\">Post-Quantum Cryptography</h3>\n            <a href=\"#post-quantum-cryptography\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Although the current capacity of the physical implementation of quantum computers is far from a real threat to secure communications, a transition to use stronger problems to protect information has already started. This wave emerged as <a href=\"https://en.wikipedia.org/wiki/Post-quantum_cryptography\">post-quantum cryptography</a> (PQC). The core idea of PQC is finding algorithms difficult enough that no quantum (and classical) algorithm can solve them.</p><p>A recurrent question is: How does it look like a problem that even a quantum computer can not solve?</p><p>These so-called quantum-resistant algorithms rely on different hard mathematical assumptions; some of them as old as RSA, others more recently proposed. For example, McEliece cryptosystem, formulated in the late 70s, relies on the hardness of decoding a linear code (in the sense of coding theory). The practical use of this cryptosystem didn’t become widespread, since with the passing of time, other cryptosystems superseded in efficiency. Fortunately, McEliece cryptosystem <a href=\"https://www.iacr.org/archive/crypto2011/68410758/68410758.pdf\">remains immune</a> to Shor’s algorithm, gaining it relevance in the post-quantum era.</p><p>Post-quantum cryptography presents alternatives:</p><ol><li><p><a href=\"https://en.wikipedia.org/wiki/Lattice-based_cryptography\">Lattice-based Cryptography</a></p></li><li><p><a href=\"https://en.wikipedia.org/wiki/Hash-based_cryptography\">Hash-based Cryptography</a></p></li><li><p><a href=\"https://en.wikipedia.org/wiki/Supersingular_isogeny_key_exchange\">Isogeny-based Cryptography</a></p></li><li><p><a href=\"https://en.wikipedia.org/wiki/Linear_code\">Code-based Cryptography</a></p></li><li><p><a href=\"https://en.wikipedia.org/wiki/Multivariate_cryptography\">Multivariate-based Cryptography</a></p></li></ol>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4psB57ri3b4jm3c9wLRyEo/25da1355cbeb382b1e8ac6653d4e7007/postq.png\" alt=\"\" class=\"kg-image\" width=\"401\" height=\"693\" loading=\"lazy\"/>\n            \n            </figure><p>As of 2017, the <a href=\"https://csrc.nist.gov/projects/post-quantum-cryptography/post-quantum-cryptography-standardization\">NIST</a> started an evaluation process that tracks possible alternatives for next-generation secure algorithms. From a practical perspective, all candidates present different trade-offs in implementation and usage. The time and space requirements are diverse; at this moment, it’s too early to define which will succeed RSA and elliptic curves. An initial round collected 70 algorithms for deploying key encapsulation mechanisms and digital signatures. As of early 2019, 28 of these survive and are currently in the analysis, investigation, and experimentation phase.</p><p>Cloudflare&#39;s mission is to help build a better Internet. As a proactive action, our cryptography team is preparing experiments on the deployment of post-quantum algorithms at Cloudflare scale. Watch our <a href=\"/towards-post-quantum-cryptography-in-TLS\">blog post</a> for more details.</p>",
		"id": "kpmRInAtlxRgOqKXv2WPp",
		"localeList": {
			"name": "The Quantum Menace Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "The impact of quantum computing on cryptography conducts research and development towards a Post-Quantum era.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2019-06-20T14:02:00.000+01:00",
		"slug": "the-quantum-menace",
		"tags": [
			{
				"id": "5grQBv96AL5Ck0c8I54a0f",
				"name": "Crypto Week",
				"slug": "crypto-week"
			},
			{
				"id": "1x7tpPmKIUCt19EDgM1Tsl",
				"name": "Research",
				"slug": "research"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "2UVIYusJwlvsmPYl2AvSuR",
				"name": "Deep Dive",
				"slug": "deep-dive"
			},
			{
				"id": "6bIo7ayy56Fzdrtf9z2EWy",
				"name": "Post-Quantum",
				"slug": "post-quantum"
			}
		],
		"title": "The Quantum Menace",
		"updated_at": "2024-10-09T21:44:55.458Z",
		"url": "https://blog.cloudflare.com/the-quantum-menace"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}