{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"ja-jp",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Justin Paine",
				"slug": "justin",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6tEloK6bIo2UEa1LXmziIj/a3aec6f71dce0e00c6694d65c5f89ff6/justin.jpg",
				"location": null,
				"website": "https://www.linkedin.com/in/justinpaine/",
				"twitter": null,
				"facebook": null
			},
			{
				"name": "John Graham-Cumming",
				"slug": "john-graham-cumming",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5vGNsXzZrtSLn2X30pnpUY/a43660c54db33a4289ab5a7d99d3d414/john-graham-cumming.jpg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Two weeks ago we wrote about Cloudflare's approach to dealing with child sexual abuse material (CSAM). We first began working with the National Center for Missing and Exploited Children (NCMEC), the US-based organization that acts as a clearinghouse for removing this abhorrent content",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5UpsMlTB0qGXDXox9ce7Tb/32c1f27f063a93eb6954fed15922a543/the-csam-scanning-tool.png",
		"featured": false,
		"html": "<p>Two weeks ago we wrote about <a href=\"/cloudflares-response-to-csam-online/\">Cloudflare&#39;s approach to dealing with child sexual abuse material (CSAM)</a>. We first began working with the National Center for Missing and Exploited Children (NCMEC), the US-based organization that acts as a clearinghouse for removing this abhorrent content, within months of our public launch in 2010. Over the last nine years, our Trust &amp; Safety team has worked with <a href=\"http://www.missingkids.com/\">NCMEC</a>, <a href=\"https://www.interpol.int/en/Crimes/Crimes-against-children\">Interpol</a>, and nearly 60 other public and private agencies around the world to design our program. And we are proud of the work we&#39;ve done to remove CSAM from the Internet.</p><p>The most repugnant cases, in some ways, are the easiest for us to address. While Cloudflare is not able to remove content hosted by others, we will take steps to terminate services to a website when it becomes clear that the site is dedicated to sharing CSAM or if the operators of the website and its host fail to take appropriate steps to take down CSAM content. When we terminate websites, we purge our caches — something that takes effect within seconds globally — and we block the website from ever being able to use Cloudflare&#39;s network again.</p><h3>Addressing the Hard Cases</h3><p>The hard cases are when a customer of ours runs a service that allows user generated content (such as a discussion forum) and a user uploads CSAM, or if they’re hacked, or if they have a malicious employee that is storing CSAM on their servers. We&#39;ve seen many instances of these cases where services intending to do the right thing are caught completely off guard by CSAM that ended up on their sites. Despite the absence of intent or malice in these cases, there’s still a need to identify and remove that content quickly.</p><p>Today we&#39;re proud to take a step to help deal with those hard cases. Beginning today, every Cloudflare customer can login to their dashboard and enable access to the CSAM Scanning Tool. As the CSAM Scanning Tool moves through development to production, the tool will check all Internet properties that have enabled CSAM Scanning for this illegal content. Cloudflare will automatically send a notice to you when it flags CSAM material, block that content from being accessed (with a 451 “blocked for legal reasons” status code), and take steps to support proper reporting of that content in compliance with legal obligations.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4AbFvKTllB8PtLhuXka8Cd/62e896a58c0b201191b8a237907721af/csam-tool.png\" alt=\"\" class=\"kg-image\" width=\"1650\" height=\"659\" loading=\"lazy\"/>\n            \n            </figure><p>CSAM Scanning will be available via the Cloudflare dashboard at no cost for all customers regardless of their plan level. You can find this tool under the “Caching” tab in your dashboard. We&#39;re hopeful that by opening this tool to all our customers for free we can help do even more to counter CSAM online and help protect our customers from the legal and reputational risk that CSAM can pose to their businesses.</p><p>It has been a long journey to get to the point where we could commit to offering this service to our millions of users. To understand what we&#39;re doing and why it has been challenging from a technical and policy perspective, you need to understand a bit about the state of the art of tracking CSAM.</p><h3>Finding Similar Images</h3><p>Around the same time as Cloudflare was first conceived in 2009, a Dartmouth professor named Hany Farid was working on software that could compare images against a list of hashes maintained by NCMEC. Microsoft took the lead in creating a tool, PhotoDNA, that used Prof. Farid’s work to identify CSAM automatically.</p><p>In its earliest days, Microsoft used PhotoDNA for their services internally and, in late 2009, <a href=\"http://blogs.msdn.com/b/microsoftuseducation/archive/2009/12/17/microsoft-donates-photodna-technology-to-make-the-internet-safer-for-kids.aspx\">donated the technology to NCMEC</a> to help manage its use by other organizations. Social networks were some of the first adopters. In 2011, <a href=\"http://www.huffingtonpost.com/2011/05/20/facebook-photodna-microsoft-child-pornography_n_864695.html\">Facebook rolled out an implementation</a> of the technology as part of their abuse process. <a href=\"https://www.theguardian.com/technology/2013/jul/22/twitter-photodna-child-abuse\">Twitter incorporated it in 2014</a>.</p><p>The process is known as a fuzzy hash. Traditional hash algorithms like MD5, SHA1, and SHA256 take a file (such as an image or document) of arbitrary length and output a fixed length number that is, effectively, the file’s digital fingerprint. For instance, if you take the MD5 of this picture then the resulting fingerprint is <b>605c83bf1bba62e85f4f5fccc56bc128</b>.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/56l9Sl2FmrYei4gHB1ejSi/518a2a2270924793568a8cfb2ccd183b/base-image.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1335\" loading=\"lazy\"/>\n            \n            </figure><p>The base image</p><p>If we change a single pixel in the picture to be slightly off white rather than pure white, it&#39;s visually identical but the fingerprint changes completely to <b>42ea4fb30a440d8787477c6c37b9daed</b>. As you can see from the two fingerprints, a small change to the image results in a massive and unpredictable change to the output of a traditional hash.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3dbf5FVy09FFVrTDvhTbkm/fb8965ec2cadfc6919ce9a7584fcd23b/base-image-pixel-changed.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1335\" loading=\"lazy\"/>\n            \n            </figure><p>The base image with a single pixel changed</p><p>This is great for some uses of hashing where you want to definitively identify if the document you&#39;re looking at is exactly the same as the one you&#39;ve seen before. For example, if an extra zero is added to a digital contract, you want the hash of the document used in its signature to no longer be valid.</p><h3>Fuzzy Hashing</h3><p>However, in the case of CSAM, this characteristic of traditional hashing is a liability. In order to avoid detection, the criminals producing CSAM resize, add noise, or otherwise alter the image in such a way that it looks the same but it would result in a radically different hash.</p><p>Fuzzy hashing works differently. Instead of determining if two photos are exactly the same it instead attempts to get at the essence of a photograph. This allows the software to calculate hashes for two images and then compare the &quot;distance&quot; between the two. While the fuzzy hashes may still be different between two photographs that have been altered, unlike with traditional hashing, you can compare the two and see how similar the images are.</p><p>So, in the two photos above, the fuzzy hash of the first image is</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">00e308346a494a188e1042333147267a\n653a16b94c33417c12b433095c318012\n5612442030d1484ce82c613f4e224733\n1dd84436734e4a5c6e25332e507a8218\n6e3b89174e30372d</pre></code>\n            <p>and the second image is</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">00e308346a494a188e1042333147267a\n653a16b94c33417c12b433095c318012\n5612442030d1484ce82c613f4e224733\n1dd84436734e4a5c6e25332e507a8218\n6e3b89174e30372d</pre></code>\n            <p>There&#39;s only a slight difference between the two in terms of pixels and the fuzzy hashes are identical.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1XABj7ngnOZ2SrnRyOl3mI/f7cbdbfe82ed65bc8d50827af0ced241/base-image-altered-2.jpeg.jpeg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1335\" loading=\"lazy\"/>\n            \n            </figure><p>The base image after increasing the saturation, changing to sepia, adding a border and then adding random noise.</p><p>Fuzzy hashing is designed to be able to identify images that are substantially similar. For example, we modified the image of dogs by first enhancing its color, then changing it to sepia, then adding a border and finally adding random noise.  The fuzzy hash of the new image is</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">00d9082d6e454a19a20b4e3034493278\n614219b14838447213ad3409672e7d13\n6e0e4a2033de545ce731664646284337\n1ecd4038794a485d7c21233f547a7d2e\n663e7c1c40363335</pre></code>\n            <p>This looks quite different from the hash of the unchanged image above, but fuzzy hashes are compared by seeing how close they are to each other.</p><p>The largest possible distance between two images is about 5m units. These two fuzzy hashes are just 4,913 units apart (the smaller the number, the more similar the images) indicating that they are substantially the same image.</p><p>Compare that with two unrelated photographs. The photograph below has a fuzzy hash of</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">011a0d0323102d048148c92a4773b60d\n0d343c02120615010d1a47017d108b14\nd36fff4561aebb2f088a891208134202\n3e21ff5b594bff5eff5bff6c2bc9ff77\n1755ff511d14ff5b</pre></code>\n            \n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/59LaVGZVc82yuxKulGMcWM/4bc8d1f87b8ee30ceb330644255aae02/image-1.jpg\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1333\" loading=\"lazy\"/>\n            \n            </figure><p>The photograph below has a fuzzy hash of</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">062715154080356b8a52505955997751\n9d221f4624000209034f1227438a8c6a\n894e8b9d675a513873394a2f3d000722\n781407ff475a36f9275160ff6f231eff\n465a17f1224006ff</pre></code>\n            \n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/67Np3uJW3La9k5dzGJ3tEC/bfa229fee2f5ef74f2f9f79cbbb14d86/D18OTNFaeIrwcpN2MmNhljU9mau-GND77Cu9qV8lWo8Na3ciZlQ7pTg-wP9bqDK4ILo5-6yCM96uVlvKkDnrxbOCK3-XhlAQx-ln7AJp-k6_5YClzo9jXvkCzRb.jpeg\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"1067\" loading=\"lazy\"/>\n            \n            </figure><p>The distance between the two hashes is calculated as 713,061. Through experimentation, it&#39;s possible to set a distance threshold under which you can consider two photographs to be likely related.</p><h3>Fuzzy Hashing&#39;s Intentionally Black Box</h3><p>How does it work? While there has been lots of work on fuzzy hashing published, the innards of the process are intentionally a bit of a mystery. The New York Times recently <a href=\"https://www.nytimes.com/interactive/2019/11/09/us/internet-child-sex-abuse.html\">wrote a story</a> that was probably the most public discussion of how such technology works. The challenge was if criminal producers and distributors of CSAM knew exactly how such tools worked then they might be able to craft how they alter their images in order to beat it. To be clear, Cloudflare will be running the CSAM Screening Tool on behalf of the website operator from within our secure points of presence. We will not be distributing the software directly to users. We will remain vigilant for potential attempted abuse of the platform, and will take prompt action as necessary.</p><h3>Tradeoff Between False Negatives and False Positives</h3><p>We have been working with a number of authorities on how we can best roll it out this functionality to our customers. One of the challenges for a network with as diverse a set of customers as Cloudflare&#39;s is what the appropriate threshold should be to set the comparison distance between the fuzzy hashes.</p><p>If the threshold is too strict — meaning that it&#39;s closer to a traditional hash and two images need to be virtually identical to trigger a match — then you&#39;re more likely to have have many false negatives (i.e., CSAM that isn&#39;t flagged). If the threshold is too loose, then it&#39;s possible to have many false positives. False positives may seem like the lesser evil, but there are legitimate concerns that increasing the possibility of false positives at scale could waste limited resources and further <a href=\"https://www.nytimes.com/interactive/2019/09/28/us/child-sex-abuse.html\">overwhelm the existing ecosystem</a>.  We will work to iterate the CSAM Scanning Tool to provide more granular control to the website owner while supporting the ongoing effectiveness of the ecosystem. Today, we believe we can offer a good first set of options for our customers that will allow us to more quickly flag CSAM without overwhelming the resources of the ecosystem.</p><h3>Different Thresholds for Different Customers</h3><p>The same desire for a granular approach was reflected in our conversations with our customers. When we asked what was appropriate for them, the answer varied radically based on the type of business, how sophisticated its existing abuse process was, and its likely exposure level and tolerance for the risk of CSAM being posted on their site.</p><p>For instance, a mature social network using Cloudflare with a sophisticated abuse team may want the threshold set quite loose, but not want the material to be automatically blocked because they have the resources to manually review whatever is flagged.</p><p>A new startup dedicated to providing a forum to new parents may want the threshold set quite loose and want any hits automatically blocked because they haven&#39;t yet built a sophisticated abuse team and the risk to their brand is so high if CSAM material is posted -- even if that will result in some false positives.</p><p>A commercial financial institution may want to set the threshold quite strict because they&#39;re less likely to have user generated content and would have a low tolerance for false positives, but then automatically block anything that&#39;s detected because if somehow their systems are compromised to host known CSAM they want to stop it immediately.</p><h3>Different Requirements for Different Jurisdictions</h3><p>There also may be challenges based on where our customers are located and the laws and regulations that apply to them. Depending on where a customers business is located and where they have users, they may choose to use one, more than one, or all the different available hash lists.</p><p>In other words, one size does not fit all and, ideally, we believe allowing individual site owners to set the parameters that make the most sense for their particular site will result in lower false negative rates (i.e., more CSAM being flagged) than if we try and set one global standard for every one of our customers.</p><h3>Improving the Tool Over Time</h3><p>Over time, we are hopeful that we can improve CSAM screening for our customers. We expect that we will add additional lists of hashes from numerous global agencies for our customers with users around the world to subscribe to. We&#39;re committed to enabling this flexibility without overly burdening the ecosystem that is set up to fight this horrible crime.</p><p>Finally, we believe there may be an opportunity to help build the next generation of fuzzy hashing. For example, the software can only scan images that are at rest in memory on a machine, not those that are streaming. We&#39;re talking with Hany Farid, the former Dartmouth professor who now teaches at Berkeley California, about ways that we may be able to build a more flexible fuzzy hashing system in order to flag images before they&#39;re even posted.</p><h3>Concerns and Responsibility</h3><p>One question we asked ourselves back when we began to consider offering CSAM scanning was whether we were the right place to be doing this at all. We share the universal concern about the distribution of depictions of horrific crimes against children, and believe it should have no place on the Internet, however Cloudflare is a network infrastructure provider, not a content platform.</p><p>But we thought there was an appropriate role for us to play in this space. Fundamentally, Cloudflare delivers tools to our more than 2 million customers that were previously reserved for only the Internet giants. The security, performance, and reliability services that we offer, often for free, without us would have been extremely expensive or limited to the Internet giants like Facebook and Google.</p><p>Today there are startups that are working to build the next Internet giant and compete with Facebook and Google because they can use Cloudflare to be secure, fast, and reliable online. But, as the regulatory hurdles around dealing with incredibly difficult issues like CSAM continue to increase, many of them lack access to sophisticated tools to scan proactively for CSAM. You have to get big to get into the club that gives you access to these tools, and, concerningly, being in the club is increasingly a prerequisite to getting big.</p><p>If we want more competition for the Internet giants we need to make these tools available more broadly and to smaller organizations. From that perspective, we think it makes perfect sense for us to help democratize this powerful tool in the fight against CSAM.</p><p>We hope this will help enable our customers to build more sophisticated content moderation teams appropriate for their own communities and will allow them to scale in a responsible way to compete with the Internet giants of today. That is directly aligned with our mission of helping build a better Internet, and it&#39;s why we&#39;re announcing that we will be making this service available for free for all our customers.</p>",
		"id": "54YgxLpRSXSe6u6jDEfW2r",
		"localeList": {
			"name": "Announcing the CSAM Scanning Tool, Free for All Cloudflare Customers Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "CSAM (Child Sexual Abuse Material) Scanning is now available via the Cloudflare dashboard at no cost for all customers regardless of their plan level. ",
		"metadata": {
			"title": "Announcing the CSAM Scanning Tool, Free for All Cloudflare Customers",
			"description": "CSAM (Child Sexual Abuse Material) Scanning is now available via the Cloudflare dashboard at no cost for all customers regardless of their plan level. ",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/13VqWAa04TVzqwtPV8a1yT/fab3e920b8d2c149cc421d7eb7f77930/the-csam-scanning-tool-G58oQM.png"
		},
		"primary_author": {},
		"published_at": "2019-12-18T18:02:42.000+00:00",
		"reading_time": 9,
		"slug": "the-csam-scanning-tool",
		"tags": [
			{
				"id": "16yk8DVbNNifxov5cWvAov",
				"name": "Legal",
				"slug": "legal"
			},
			{
				"id": "2yskwsCS0bVLjzbIJrpFuZ",
				"name": "Abuse",
				"slug": "abuse"
			}
		],
		"title": "Announcing the CSAM Scanning Tool, Free for All Cloudflare Customers",
		"updated_at": "2024-08-27T02:06:54.789Z",
		"url": "https://blog.cloudflare.com/the-csam-scanning-tool"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}