{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Kirk Schwenkler",
				"slug": "kirk",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7JhNGjTuIEM5f3q5bfcbdU/3224744bf259157ba4c34fdb0d51626f/kirk.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "As Cloudflare Workers, and other Serverless platforms, continue to drive down costs while making it easier for developers to stand up globally scaled applications, the migration of legacy applications is becoming increasingly common.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/72gmOY7BGrLJhWxSfSyoTy/25d25097a009aa833250da8f383167bb/the-migration-of-legacy-applications-to-workers.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1CiiwpLDvIDyqpsuuAMUqJ/acd29c3f91622a23350cac6401aaf8e7/Serverless-Week-Day-2_2x-1.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"814\" loading=\"lazy\"/>\n            \n            </figure><p>As Cloudflare Workers, and other Serverless platforms, continue to drive down costs while making it easier for developers to stand up globally scaled applications, the migration of legacy applications is becoming increasingly common. In this post, I want to show how easy it is to migrate such an application onto Workers. To demonstrate, I’m going to use a common migration scenario: moving a legacy application — on an old compute platform behind a VPN or in a private cloud — to a serverless compute platform behind zero-trust security.</p><h3>Wait but why?</h3><p>Before we dive further into the technical work, however, let me just address up front: why would someone want to do this? What benefits would they get from such a migration? In my experience, there are two sets of reasons: (1) factors that are “pushing” off legacy platforms, or the constraints and problems of the legacy approach; and (2) factors that are “pulling” onto serverless platforms like Workers, which speaks to the many benefits of this new approach. In terms of the push factors, we often see three core ones:</p><ul><li><p>Legacy compute resources are not flexible and must be constantly maintained, often leading to capacity constraints or excess cost;</p></li><li><p>Maintaining VPN credentials is cumbersome, and can introduce security risks if not done properly;</p></li><li><p>VPN client software can be challenging for non-technical users to operate.</p></li></ul><p>Similarly, there are some very key benefits “pulling” folks onto Serverless applications and zero-trust security:</p><ul><li><p>Instant scaling, up or down, depending on usage. No capacity constraints, and no excess cost;</p></li><li><p>No separate credentials to maintain, users can use Single Sign On (SSO) across many applications;</p></li><li><p>VPN hardware / private cloud; and existing compute, can be retired to simplify operations and reduce cost</p></li></ul><p>While the benefits to this more modern end-state are clear, there’s one other thing that causes organizations to pause: the costs in time and migration effort seem daunting. Often what organizations find is that migration is not as difficult as they fear. In the rest of this post, I will show you how Cloudflare Workers, and the rest of the Cloudflare platform, can greatly simplify migrations and help you modernize all of your applications.</p><h3>Getting Started</h3><p>To take you through this, we will use a contrived application I’ve written in Node.js to illustrate the steps we would take with a real, and far more complex, example. The goal is to show the different tools and features you can use at each step; and how our platform design supports development and cutover of an application.  We’ll use four key Cloudflare technologies, as we see how to move this Application off of my Laptop and into the Cloud:</p><ol><li><p><b><b><b>Serverless Compute</b></b></b><b><b> through </b></b><b><b><b>Workers</b></b></b></p></li><li><p><b><b><b>Robust Developer-focused Tooling</b></b></b><b><b> for Workers via </b></b><b><b><b>Wrangler</b></b></b></p></li><li><p><b><b><b>Zero-Trust security</b></b></b><b><b> through </b></b><b><b><b>Access</b></b></b></p></li><li><p><b><b><b>Instant, Secure Origin Tunnels</b></b></b><b><b> through </b></b><b><b><b>Argo Tunnels</b></b></b></p></li></ol><p>Our example application for today is called Post Process, and it performs business logic on input provided in an HTTP POST body. It takes the input data from authenticated clients, performs a processing task, and responds with the result in the body of an HTTP response. The server runs in Node.js on my laptop.</p><p>Since the example application is written in Node.js; we will be able to directly copy some of the JavaScript assets for our new application. You could follow this “direct port” method not only for JavaScript applications, <a href=\"https://github.com/cloudflare/worker-emscripten-template\">but even applications in our other WASM-supported languages.</a> For other languages, you first need to rewrite or transpile into one with WASM support.</p><p><b>Into our Application</b>Our basic example will perform only simple text processing, so that we can focus on the broad features of the migration. I’ve set up an unauthenticated copy (using Workers, to give us a scalable and reliable place to host it) at <a href=\"https://postprocess-workers.kirk.workers.dev/postprocess\">https://postprocess-workers.kirk.workers.dev/postprocess</a> where you can see how it operates. Here is an example cURL:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">curl -X POST https://postprocess-workers.kirk.workers.dev/postprocess --data &#039;{&quot;operation&quot;:&quot;2&quot;,&quot;data&quot;:&quot;Data-Gram!&quot;}&#039;</pre></code>\n            <p>The relevant takeaways from the code itself are pretty simple:</p><ul><li><p>There are two code modules, which conveniently split the application logic completely from the Preprocessing / HTTP interface.</p></li><li><p>The application logic module exposes one function <i>postProcess(object)</i> where <i>object</i> is the parsed JSON of the POST body. It returns a JavaScript object, ready to be encoded into a string in the JSON HTTP response. <b>This module can be run on Workers JavaScript, with no changes. It only needs a new preprocessing / HTTP interface</b>.</p></li><li><p>The Preprocessing / HTTP interface runs on raw Node.js; and exposes a local HTTPS server. The server does not directly take inbound traffic from the Internet, but sits behind a gateway which controls access to the service.</p></li></ul><h4>Code snippet from Node.js HTTP module</h4>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">const server = http.createServer((req, res) =&gt; {\n    if (req.url == &#039;/postprocess&#039;) {\n        if(req.method == &#039;POST&#039;) {\n                gatherPost(req, data =&gt; {\n                        try{\n                                jsonData = JSON.parse(data)\n                        } catch (e) {\n                                res.end(&#039;Invalid JSON payload! \\n&#039;)\n                                return\n                        }\n                        result = postProcess(jsonData)\n                        res.write(JSON.stringify(result) + &#039;\\n&#039;);\n                        res.end();\n                })\n        } else {\n                res.end(&#039;Invalid Method, only POST is supported! \\nPlease send a POST with data in format {&quot;Operation&quot;:1&quot;,&quot;data&quot;,&quot;Data-Gram!&quot;        }\n    } else {\n        res.end(&#039;Invalid request. Did you mean to POST to /postprocess? \\n&#039;);\n    }\n});</pre></code>\n            <h4>Code snippet from Node.js logic module</h4>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">function postProcess (postJson) {\n        const ServerVersion = &quot;2.5.17&quot;\n        if(postJson != null &amp;&amp; &#039;operation&#039; in postJson &amp;&amp; &#039;data&#039; in postJson){\n                var output\n                var operation = postJson[&#039;operation&#039;]\n                var data = postJson[&#039;data&#039;]\n                switch(operation){\n                        case &quot;1&quot;:\n                              output = String(data).toLowerCase()\n                              break\n                        case &quot;2&quot;:\n                              d = data + &quot;\\n&quot;\n                              output = d + d + d\n                              break\n                        case &quot;3&quot;:\n                              output = ServerVersion\n                              break\n                        default:\n                              output = &quot;Invalid Operation&quot;\n                }\n                return {&#039;Output&#039;: output}\n        }\n        else{\n                return {&#039;Error&#039;:&#039;Invalid request, invalid JSON format&#039;}\n        }</pre></code>\n            <h4>Current State Application Architecture</h4>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1d6MEhUqu77DDapE41clZn/4535c396b06248d0ffe6b55b92f8f7bd/image4-9.png\" alt=\"\" class=\"kg-image\" width=\"1597\" height=\"659\" loading=\"lazy\"/>\n            \n            </figure><h3>Design Decisions</h3><p>With all this information in hand, we can arrive at at the details of our new Cloudflare-based design:</p><ol><li><p>Keep the business logic completely intact, and specifically use the same .js asset</p></li><li><p>Build a new preprocessing layer in Workers to replace the Node.js module</p></li><li><p>Use Cloudflare Access to authenticate users to our application</p></li></ol><h4>Target State Application Architecture</h4>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3XTQxjhc7V7BCNLD6OYtNu/e2d71de73dfa10a6685eb90e4f71fc4c/image3-15.png\" alt=\"\" class=\"kg-image\" width=\"1737\" height=\"766\" loading=\"lazy\"/>\n            \n            </figure><h3>Finding the first win</h3><p>One good way to make a migration successful is to find a quick win early on; a useful task which can be executed while other work is still ongoing. It is even better if the quick win also benefits the eventual cutover. We can find a quick win here, if we solve the zero-trust security problem ahead of the compute problem by putting Cloudflare’s security in front of the existing application.</p><p>We will do this by using cloudflare’s <a href=\"https://developers.cloudflare.com/argo-tunnel/\">Argo Tunnel</a> feature to securely connect to the existing application, and <a href=\"https://developers.cloudflare.com/access/\">Access</a> for zero-trust authentication. Below, you can see how easy this process is for any command-line user, with our cloudflared tool.</p><p>I open up a terminal and use <code>cloudflared tunnel login</code>, which presents me with an authentication flow. I then use the <code>cloudflared tunnel --hostname postprocess.kschwenkler.com --url localhost:8080</code> command to connect an Argo Tunnel between the “url” (my local server) and the “hostname” (the new, public address we will use on my Cloudflare zone).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6HmHbX1sc9KoQHRihx36SP/746dbd70f805a55d5d0b9a15fb20f658/2.gif\" alt=\"\" class=\"kg-image\" width=\"1400\" height=\"763\" loading=\"lazy\"/>\n            \n            </figure><p>Next I flip over to my Cloudflare dashboard, and attach an Access Policy to the “hostname” I specified before. We will be using the Service Token mode of Access; which generates a client-specific security token which that client can attach to each HTTP POST. Other modes are better suited to interactive browser use cases.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/343nkuLHV6Hro1OpA9ae6g/0e1d63dfdc7c77615b49a6d0186d43e8/3.gif\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"785\" loading=\"lazy\"/>\n            \n            </figure><p>Now, without using the VPN, I can send a POST to the service, still running on Node.js on my laptop, from any Internet-connected device which has the correct token! It has taken only a few minutes to add zero-trust security to this application; and safely expose it to the Internet while still running on a legacy compute platform (my laptop!).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7BYW2YOuW6EuHNgzM92W7i/97614b466ae09a9eb9ce0da0bf9c0f2e/4.gif\" alt=\"\" class=\"kg-image\" width=\"1402\" height=\"734\" loading=\"lazy\"/>\n            \n            </figure><h3>“Quick Win” Architecture</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/qYhPJkmdsepqfjMCytdnS/28c21ce7eef4b28ef6961068fd228977/image13.png\" alt=\"\" class=\"kg-image\" width=\"1555\" height=\"642\" loading=\"lazy\"/>\n            \n            </figure><p>Beyond the direct benefit of a huge security upgrade; we’ve also made our eventual application migration much easier, by putting the traffic through the target-state API gateway already. We will see later how we can surgically move traffic to the new application for testing, in this state.</p><h3>Lift to the Cloud</h3><p>With our zero-trust security benefits in hand, and our traffic running through Cloudflare; we can now proceed with the migration of the application itself to Workers. We’ll be using the <a href=\"https://developers.cloudflare.com/workers/tooling/wrangler\">Wrangler</a> tooling to make this process very easy.</p><p>As noted when we first looked at the code, this contrived application exposes a very clean interface between the Node.js-specific HTTP module, which we need to replace, and the business logic <i>postprocess</i> module which we can use as is with Workers. We’ll first need to re-write the HTTP module, and then bundle it with the existing business logic into a new Workers application.</p><p>Here is a handwritten example of the basic pattern we’ll use for the HTTP module. We can see how the Service Workers API makes it very easy to grab the POST body with <i>await</i>, and how the JSON interface lets us easily pass the data to the <i>postprocess</i> module we took directly from the initial Node.js app.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">addEventListener(&#039;fetch&#039;, event =&gt; {\n event.respondWith(handleRequest(event.request))\n})\n\nasync function handleRequest(request) {\n try{\n   requestData = await request.json()\n } catch (e) {\n   return new Response(&quot;Invalid JSON&quot;, {status:500})\n }\n const response = new Response(JSON.stringify(postProcess (requestData)))\n return response\n}</pre></code>\n            <p>For our work on the mock application, we will go a slightly different route; more in line with a real application which would be more complex. Instead of writing this by hand, we will use <a href=\"https://developers.cloudflare.com/workers/quickstart\">Wrangler</a> and our <a href=\"https://developers.cloudflare.com/workers/templates/pages/router/\">Router template,</a> to build the new front end from a robust framework.</p><p>We’ll run <code>wrangler generate post-process-workers https://github.com/cloudflare/worker-template-router</code> to initialize a new Wrangler project with the Router template. Most of the configurations for this template will work as is; and we just have to update account_id in our wrangler.toml and make a few small edits to the code in index.js.</p><p>Below is our <code>index.js</code> after my edits, Note the line const <code>postProcess = require(&#39;./postProcess.js&#39;)</code> at the start of the new http module - this will tell Wrangler to include the original business logic, from the legacy app’s <code>postProcess.js</code> module which I will copy to our working directory.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">const Router = require(&#039;./router&#039;)\nconst postProcess = require(&#039;./postProcess.js&#039;)\n\naddEventListener(&#039;fetch&#039;, event =&gt; {\n    event.respondWith(handleRequest(event.request))\n})\n\nasync function handler(request) {\n    const init = {\n        headers: { &#039;content-type&#039;: &#039;application/json&#039; },\n    }\n    const body = JSON.stringify(postProcess(await request.json()))\n    return new Response(body, init)\n}\n\nasync function handleRequest(request) {\n    const r = new Router()\n    r.post(&#039;.*/postprocess*&#039;, request =&gt; handler(request))\n    r.get(&#039;/&#039;, () =&gt; new Response(&#039;Hello worker!&#039;)) // return a default message for the root route\n\n    const resp = await r.route(request)\n    return resp\n}</pre></code>\n            <p>Now we can simply run wrangler publish, to put our application on <a href=\"https://workers.dev/\">workers.dev</a> for testing! The Router template’s defaults; and the small edits made above, are all we need. Since Wrangler automatically exposes the test application to the Internet (note that we can *also* put the test application behind Access, with a slightly modified method), we can easily send test traffic from any device.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4ikUB5oJkvyjkScPyyJ8PT/bb834f282678678e6363980283427441/5.gif\" alt=\"\" class=\"kg-image\" width=\"1399\" height=\"753\" loading=\"lazy\"/>\n            \n            </figure><h4>Shift, Safely!</h4><p>With our application up for testing on workers.dev, we finally come to the last and most daunting migration step: cutting over traffic from the legacy application to the new one without any service interruption.</p><p>Luckily, we had our quick win earlier and are already routing our production traffic through the Cloudflare network (to the legacy application via Argo Tunnels). This provides huge benefits now that we are at the cutover step. Without changing our IP address, SSL configuration, or any other client-facing properties, we can route traffic to the new application with just one wrangler command.</p><h4>Seamless cutover from Transition to Target state</h4>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7rYqzkjG8iwCxKPNYSbvTH/a55b5be9e1499ec9a623dfef8c713482/image14.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1319\" loading=\"lazy\"/>\n            \n            </figure><p>We simply modify <code>wrangler.toml</code> to indicate the production domain / route we’d like the application to operate on; and <code>wrangler publish</code>. As soon as Cloudflare receives this update; it will send production traffic to our new application instead of the Argo Tunnel. We have configured the application to send a ‘version’ header which lets us verify this easily using curl.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1NNWzJ0Lf1qPBPQVGv6SpK/8dafefd471b1c508cce88dad8d8c0282/6.gif\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1S3FRDRzxAL0M2JciODIkA/cf903061a8500b182b89897e6252f5b7/7.gif\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"250\" loading=\"lazy\"/>\n            \n            </figure><p>Rollback, if it is needed, is also very easy. We can either set the <code>wrangler.toml</code> back to the workers.dev only mode, and <code>wrangler publish</code> again; or delete our route manually. Either will send traffic back to the Argo Tunnel.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7zkTHE7QsTycEDpCzOjCWL/966eb2941051a0fa32d07113a2c68655/8.gif\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"826\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4qYUySUW2sUik0WhhsOFiP/c50d0241de3cf2c8ea930df33c21e944/9.gif\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"432\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1wlX569YmzRMhxjjgy7ZLm/f30e82b4953690a0b2fc800242343bb6/10.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"706\" loading=\"lazy\"/>\n            \n            </figure><h3>In Conclusion</h3><p>Clearly, a real application will be more complex than our example above. It may have multiple components, with complex interactions, which must each be handled in turn. Argo Tunnel might remain in use, to connect to a data store or other application outside of our network. We might use WASM to support modules written in other languages. In any of these scenarios, Cloudflare’s Wrangler tooling and Serverless capabilities will help us work through the complexities and achieve success.</p><p>I hope that this simple example has helped you to see how Wrangler, cloudflared, Workers, and our entire global network can work together to make migrations as quick and hassle-free as possible. Whether for this case of an old application behind a VPN, or another application that has outgrown its current home - our Workers platform, Wrangler tooling, and underlying platform will scale to meet your business needs.</p>",
		"id": "3vNFOI5bc36SSeB0SaAr1s",
		"localeList": {
			"name": "The Migration of Legacy Applications to Workers Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2020-07-28T14:00:00.000+01:00",
		"slug": "the-migration-of-legacy-applications-to-workers",
		"tags": [
			{
				"id": "3Vp1bHIwHQA04RM5yJVXxm",
				"name": "Serverless Week",
				"slug": "serverless-week"
			},
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "78aSAeMjGNmCuetQ7B4OgU",
				"name": "JavaScript",
				"slug": "javascript"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			}
		],
		"title": "The Migration of Legacy Applications to Workers",
		"updated_at": "2024-08-27T02:00:12.970Z",
		"url": "https://blog.cloudflare.com/the-migration-of-legacy-applications-to-workers"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}