{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Julien Desgats",
				"slug": "julien-desgats",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7rDtCt8aM8HBmfsg6xuTiV/a69bd62bbb70abab9411c9ce5e92b6d5/julien-desgats.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "Back when Cloudflare was created, over 10 years ago now, the dominant HTTP server used to power websites was Apache httpd. However, we decided to build our infrastructure using the then relatively new NGINX server.",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4ZdljBHpVrxdXHlhZC1tbT/68b8d4be5b0af210b3b9fec49bbf7311/the-problem-with-event-loops.png",
		"featured": false,
		"html": "<p>Back when Cloudflare was created, over 10 years ago now, the <a href=\"https://news.netcraft.com/archives/category/web-server-survey/\">dominant HTTP server</a> used to power websites was <a href=\"https://httpd.apache.org/\">Apache httpd</a>. However, we decided to build our infrastructure using the then relatively new NGINX server.</p><p>There are many differences between the two, but crucially for us, the event loop architecture of NGINX was the key differentiator. In a nutshell, event loops work around the need to have one thread or process per connection by coalescing many of them in a single process, this reduces the need for expensive context switching from the operating system and also keeps the memory usage predictable. This is done by processing each connection until it wants to do some I/O, at that point, the said connection is queued until the I/O task is complete. During that time the event loop is available to process other in-flight connections, accept new clients, and the like. The loop uses a multiplexing system call like <a href=\"http://man7.org/linux/man-pages/man7/epoll.7.html\">epoll</a> (or kqueue) to be notified whenever an I/O task is complete among all the running connections.</p><p>In this article we will see that despite its advantages, event loop models also have their limits and falling back to good old threaded architecture is sometimes a good move.</p><!--kg-card-begin: html--><p><a href=\"/content/images/2020/03/3649485942_09f777897d_o.jpg\" target=\"_blank\" rel=\"noopener\"><img style=\"border-width: 0px;\" src=\"/content/images/2020/03/3649485942_09f777897d_o.jpg\" width=\"740\" height=\"555\" /></a>\n<br><center><a href=\"https://www.flickr.com/photos/mpd01605/3649485942\">Photo</a> credit: Flickr CC-BY-SA</center></p><!--kg-card-end: html-->\n          <div class=\"flex anchor relative\">\n            <h3 id=\"the-key-assumption-of-an-event-loop-architecture\">The key assumption of an event loop architecture</h3>\n            <a href=\"#the-key-assumption-of-an-event-loop-architecture\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>For an event loop to work correctly, there is one key requirement that has to be held: <b>every piece of work has to finish quickly</b>. This is because, as with other collaborative multitasking approaches, once a piece of work is started, there is no preemption mechanism.</p><p>For a proxy service like Cloudflare, this assumption works quite well as we spend most of the time waiting for the client to send data, or the origin to answer. This model is also widely successful for web applications that spend most of their time waiting for the database or other kind of RPC.</p><p>Let&#39;s take an example at a situation where two requests hit a Cloudflare server at the same time:</p><!--kg-card-begin: html--><a href=\"/content/images/2020/03/evpool-sequence-diagram@2x-inblog.png\" target=\"_blank\" rel=\"noopener\"><img style=\"border-width: 0px;\" src=\"/content/images/2020/03/evpool-sequence-diagram@2x-inblog.png\" alt=\"\" width=\"740\" /></a><!--kg-card-end: html--><p>In this case, requests don&#39;t block each other too much… However, if one of the work units takes an unreasonable amount of time, it will start blocking other requests and the whole model will fall apart very quickly.</p><p>Such long operations might be CPU-intensive tasks, or blocking system calls. A common mistake is to call a library that uses blocking system calls internally: in this case an event-based program will perform a lot worse than a threaded one.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"issues-with-the-cloudflare-workload\">Issues with the Cloudflare workload</h3>\n            <a href=\"#issues-with-the-cloudflare-workload\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>As I said previously, most of the work done by Cloudflare servers to process an HTTP request is quick and fits the event loop model well. However, a few places might require more CPU. Most notably, our <a href=\"https://www.cloudflare.com/learning/ddos/glossary/web-application-firewall-waf/\">Web Application Firewall (WAF)</a> is in charge of inspecting incoming requests to look for potential threats.</p><p>Although this process only takes a few milliseconds in the large majority of cases, a tiny portion of requests might need more time. It might be tempting to say that it is rare enough to be ignored. However, a typical worker process can have hundreds of requests in flight at the same time. This means that halting the event loop could slow down any of these unrelated requests as well. Keep in mind that the median web page requires around <a href=\"https://httparchive.org/reports/state-of-the-web#reqTotal\">70 requests</a> to fully load, and pages well over 100 assets are common. So looking at the average metrics <a href=\"https://bravenewgeek.com/everything-you-know-about-latency-is-wrong/\">is not very useful</a> in this case, the 99th percentile is more relevant as a regular page load will likely hit that case at some point.</p><p>We want to make the web as fast as possible, even in edge cases. So we started to think about solutions to remove or mitigate that delay. There are quite a few options:</p><ul><li><p>Increase the number of worker processes: this merely mitigates the problem, and creates more pressure on the kernel. Worse, spawning more workers does not cause a linear increase in capacity (even with spare CPU cores) because it also means that critical sections of code will have more lock contention.</p></li><li><p>Create a separate service dedicated to the WAF: this is a more realistic solution, it makes more sense to adopt a thread-based model for CPU-intensive tasks. A separate process allows that. However it would make migration from the existing codebase more difficult, and adding more IPC also has costs: serialization/deserialization, latency, more error cases, etc.</p></li><li><p>Offload CPU-intensive tasks to a thread pool: this is a hybrid approach where we could just hand over the WAF processing to a dedicated thread. There are still some costs of doing that, but overall using a thread pool is a lot faster and simpler than calling an external service. Moreover, we keep roughly the same code, we just call it differently.</p></li></ul><p>All of these solutions are valid and this list is far from exhaustive. As in many situations, there is no one right solution: we have to weigh the different tradeoffs. In this case, given that we already have working code in NGINX, and that the process must be as quick as possible, we chose the thread pool approach.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"nginx-already-has-thread-pools\">NGINX already has thread pools!</h3>\n            <a href=\"#nginx-already-has-thread-pools\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Okay, I omitted one detail: NGINX already takes this hybrid approach for other reasons. Which made our task easier.</p><p>It is not always easy to avoid blocking system calls. The filesystem operations on Linux are <a href=\"/io_submit-the-epoll-alternative-youve-never-heard-about/\">famously known</a> to be tricky in an asynchronous mode: among other limitations, files have to be read using &quot;direct&quot; mode, bypassing the filesystem cache. Quite annoying for a static file server<a href=\"#foot-iouring\"><sup>[1]</sup></a>.</p><p>This is why <a href=\"http://nginx.org/en/docs/ngx_core_module.html#thread_pool\">thread pools</a> were introduced back in 2015. The idea is quite simple: each worker process will spawn a group of threads that will be dedicated to process these synchronous operations. We use (and improved) that feature ourselves with <a href=\"/how-we-scaled-nginx-and-saved-the-world-54-years-every-day/\">great success</a> for our caching layer.</p><p>Whenever the event loop wants to have such an operation performed, it will push it into a queue that gets processed by the threads, and it will be notified with a result when it is done.</p><!--kg-card-begin: html--><p><a href=\"/content/images/2020/03/imageLikeEmbed--1--3.png\" target=\"_blank\" rel=\"noopener\"><img style=\"border-width: 0px;\" src=\"/content/images/2020/03/imageLikeEmbed--1--3.png\" alt=\"\" width=\"456\" height=\"306\" /></a></p><!--kg-card-end: html--><p>This approach is not unique to NGINX: <a href=\"http://docs.libuv.org/en/v1.x/threadpool.html#threadpool\">libuv</a> (that powers node.js) also uses thread pools for filesystem operations.</p><p>Can we repurpose this system to offload our CPU-intensive sections too? It turns out we can. The threading model here is quite simple: nearly nothing is shared between the main loop, only a <code>struct</code> describing the operation to perform is sent and a result is sent back to the event loop<a href=\"#foot-threadbuf\"><sup>[2]</sup></a>. This share-nothing approach also has some drawbacks, notably memory usage: in our case, every thread has its own Lua VM to run the WAF code and its own compiled regular expression cache. Some of it can be improved, but as our code was written assuming there were no data races, changing that assumption would require a significant refactoring.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"the-best-of-both-worlds-not-quite-yet\">The best of both worlds? Not quite yet.</h3>\n            <a href=\"#the-best-of-both-worlds-not-quite-yet\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>It&#39;s not a secret that epoll is very difficult to use correctly, in the past my colleague Marek <a href=\"https://idea.popcount.org/2017-02-20-epoll-is-fundamentally-broken-12/\">wrote</a> <a href=\"https://idea.popcount.org/2017-03-20-epoll-is-fundamentally-broken-22/\">extensively</a> about its challenges. But more importantly in our case, its <a href=\"/the-sad-state-of-linux-socket-balancing/\">load balancing issues</a> were a real problem.</p><p>In a nutshell, when multiple processes listen on the same socket, some processes will be busier than others. This is due to the fact that whenever the event loop sits idle, it is free to accept new connections.</p><p>Offloading the WAF to a thread pool means freeing up time on the event loop, that can accept even more connections for the unlucky processes, which in turn will need the WAF. In this case, making this change would only make a bad situation worse: the WAF tasks would start piling up in the job queue waiting for the threads to process them.</p><p>Fortunately, this problem is quite well known and even if there is no solution yet in the upstream kernel, people have already <a href=\"https://lkml.org/lkml/2015/2/17/518\">attempted to fix it</a>. We applied that patch, adding the <code>EPOLLROUNDROBIN</code> flag to our kernels quite some time ago and it played a crucial role in this case.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"thats-a-lot-of-text-show-us-the-numbers\">That's a lot of text… Show us the numbers!</h3>\n            <a href=\"#thats-a-lot-of-text-show-us-the-numbers\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Alright, that was a lot of talking, let&#39;s have a look at actual numbers. I will examine how our servers behaved before (baseline) and after offloading our WAF into thread pools<a href=\"#foot-metrics\"><sup>[3]</sup></a>.</p><p>First let&#39;s have a look at the NGINX event loop itself. Did our change really improve the situation?</p><p>We have a metric telling us the maximum amount of time a request blocked the event loop during its processing. Let&#39;s look at its 99th percentile:</p><!--kg-card-begin: html--><p><a href=\"/content/images/2020/03/pasted-image-0--1--1.png\" target=\"_blank\" rel=\"noopener\"><img style=\"border-width: 0px;\" src=\"/content/images/2020/03/pasted-image-0--1--1.png\" alt=\"\" width=\"740\" height=\"189\" /></a></p><!--kg-card-end: html--><p>Using 100% as our baseline, we can see that this metric is 30% to 40% lower for the requests using the WAF when it is offloaded (yellow line). This is quite expected as we just offloaded a fair chunk of processing to a thread. For other requests (green line), the situation seems a tiny bit worse, but can be explained by the fact that the kernel has more threads to care about now, so the main event loop is more likely to be interrupted by the scheduler while it is running.</p><p>This is encouraging (at least for the requests with WAF enabled), but this doesn&#39;t really say what is the value for our customers, so let&#39;s look at more concrete metrics. First, the Time To First Byte (TTFB), the following graph only takes cache hits into account to reduce the noise due to other moving parts.</p><!--kg-card-begin: html--><p><a href=\"/content/images/2020/03/pasted-image-0--2--1.png\" target=\"_blank\" rel=\"noopener\"><img style=\"border-width: 0px;\" src=\"/content/images/2020/03/pasted-image-0--2--1.png\" width=\"740\" height=\"189\" /></a></p><!--kg-card-end: html--><p>The 99th percentile is significantly reduced for both WAF and non-WAF requests, overall the gains of freeing up time on the event loop dwarfs the slight penalty we saw on the previous graph.</p><p>Let&#39;s finish by looking at another metric: the TTFB here starts only when a request has been accepted by the server. But now we can assume that these requests will be accepted faster as the event loop spends more time idle. Is that the case?</p><!--kg-card-begin: html--><p><a href=\"/content/images/2020/03/pasted-image-0--3--1.png\" target=\"_blank\" rel=\"noopener\"><img style=\"border-width: 0px;\" src=\"/content/images/2020/03/pasted-image-0--3--1.png\" width=\"740\" height=\"189\" /></a></p><!--kg-card-end: html--><p>Success! The accept latency is also a lot lower. Not only the requests are faster, but the server is able to start processing them more quickly as well.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"conclusion\">Conclusion</h3>\n            <a href=\"#conclusion\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Overall, event-loop-based processing makes a lot of sense in many situations, especially in a microservices world. But this model is particularly vulnerable in cases where a lot of CPU time is necessary. There are a few different ways to mitigate this issue and as is often the case, the right answer is &quot;it depends&quot;. In our case the thread pool approach was the best tradeoff: not only did it give visible improvements for our customers but it also allowed us to spread the load across more CPUs so we can more efficiently use our hardware.</p><p>But this tradeoff has many variables. Despite being too long to comfortably run on an event loop, the WAF is still very quick. For more complex tasks, having a separate service is usually a better option in my opinion. And there are a ton of other factors to take into account: security, development and deployment processes, etc.</p><p>We also saw that despite looking slightly worse in some micro metrics, the overall performance improved. This is something we all have to keep in mind when working on complex systems.</p><p>Are you interested in debugging and solving problems involving userspace, kernel and hardware? <a href=\"https://www.cloudflare.com/careers/\">We&#39;re hiring</a>!</p><hr/><p><sup>[1]</sup> hopefully this pain will go away over time as we now have <a href=\"https://lwn.net/Articles/776703\">io_uring</a></p><p><sup>[2]</sup> we still have to make sure the buffers are safely shared to avoid use-after-free and other data races, copying is the safest approach, but not necessarily the fastest.</p><p><sup>[3]</sup> in every case, the metrics are taken over a period of 24h, exactly one week apart.</p>",
		"id": "13h1dXAZxY1KXW19XxG0BR",
		"localeList": {
			"name": "The problem with thread^W event loops Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Back when Cloudflare was created, over 10 years ago now, the dominant HTTP server used to power websites was Apache httpd. However, we decided to build our infrastructure using the then relatively new NGINX server.",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2020-03-18T12:00:00.000+00:00",
		"slug": "the-problem-with-event-loops",
		"tags": [
			{
				"id": "3FBpuRfF7HUFga2Z5jgAFf",
				"name": "NGINX",
				"slug": "nginx"
			},
			{
				"id": "383iv0UQ6Lp0GZwOAxGq2p",
				"name": "Linux",
				"slug": "linux"
			}
		],
		"title": "The problem with thread^W event loops",
		"updated_at": "2024-08-27T02:04:40.541Z",
		"url": "https://blog.cloudflare.com/the-problem-with-event-loops"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}