{
	"locale": "en-us",
	"post": {
		"id": "5d16453b41acde0011a95638",
		"uuid": "adf503b1-3e3c-4a73-bd42-27f52653c8fc",
		"title": "The History of Email",
		"slug": "the-history-of-email",
		"html": "<!--kg-card-begin: markdown--><p class=\"attribution\">\nThis was adapted from a post which originally appeared on the Eager blog. Eager has now become the new <a href=\"https://www.cloudflare.com/apps\" target=\"_blank\">Cloudflare Apps</a>.</p>\n<blockquote class=\"pull-quote-centered\" style=\"padding-bottom: 0\">\n<p>\nQWERTYUIOP\n</p>\n<p>\n— Text of the first email ever sent, 1971\n</p>\n</blockquote>\n<p>The ARPANET (a precursor to the Internet) was created “to help maintain U.S. technological superiority and guard against unforeseen technological advances by potential adversaries,” in other words, to avert the next Sputnik.  Its purpose was to allow scientists to share the products of their work and to make it more likely that the work of any one team could potentially be somewhat usable by others.  One thing which was not considered particularly valuable was allowing these scientists to communicate using this network.  People were already perfectly capable of communicating by phone, letter, and in-person meeting.  The purpose of a computer was to do <a href=\"http://www.kurzweilai.net/memorandum-for-members-and-affiliates-of-the-intergalactic-computer-network\">massive computation</a>, to <a href=\"http://groups.csail.mit.edu/medg/people/psz/Licklider.html\">augment our memories</a> and <a href=\"http://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/\">empower our minds</a>.</p>\n<p>Surely we didn’t need a computer, this behemoth of technology and innovation, just to talk to each other.</p>\n<figure class=\"standard\">\n<div class=\"figcontent\">\n<img src=\"http://blog.cloudflare.com/content/images/2017/08/posts-history-of-email-images-first-email-computers.jpg\" alt=\"Computers which sent the first email\">\n<small>\n<div class=\"figcaption\">\nThe computers which sent (and received) the first email.\n</div>\n</figcaption>\n</div>\n</figure>\n<p>The history of computing moves from massive data processing mainframes, to time sharing where many people share one computer, to the diverse collection of personal computing devices we have today.  Messaging was first born in the time sharing era, when users wanted the ability to message other users of the same time shared computer.</p>\n<p>Unix machines have a command called <code>write</code> which can be used to send messages to other currently logged-in users.  For example, if I want to ask Mark out to lunch:</p>\n<pre><code>$ write mark\nwrite: mark is logged in more than once; writing to ttys002\n\nHi, wanna grab lunch?\n</code></pre>\n<p>He will see:</p>\n<pre><code>Message from zack@Awesome-Mainframe.local on ttys003 at 10:36 ...\nHi, wanna grab lunch?\n</code></pre>\n<p>This is absolutely hilarious if your coworker happens to be using a graphical tool like vim which will not take kindly to random output on the screen.</p>\n<h3 id=\"persistantmessages\">Persistant Messages</h3>\n<blockquote>\n<p>\nWhen the mail was being developed, nobody thought\n     at the beginning it was going to be the smash hit\n     that it was. People liked it, they thought it was\n     nice, but nobody imagined it was going to be the\n     explosion of excitement and interest that it\n     became. So it was a surprise to everybody, that it\n     was a big hit.\n </p>\n <p>\n — Frank Heart, director of the ARPANET infrastructure team\n </p>\n</blockquote>\n<p>An early alternative to Unix called <a href=\"https://en.wikipedia.org/wiki/TOPS-20\">Tenex</a> took this capability one step further.  Tenex included the ability to send a message to another user by writing onto the end of a file which only they could read.  This is conceptually very simple, you could implement it yourself by creating a file in everyones home directory which only they can read:</p>\n<pre><code>mkdir ~/messages\nchmod 0442 ~/messages\n</code></pre>\n<p>Anyone who wants to send a message just has to append to the file:</p>\n<pre><code>echo &quot;??\\n&quot; &gt;&gt; /Users/zack/messages\n</code></pre>\n<p>This is, of course, not a great system because anyone could delete your messages! I trust the Tenex implementation (called <code>SNDMSG</code>) was a bit more secure.</p>\n<h3 id=\"arpanet\">ARPANET</h3>\n<p>In 1971, the Tenex team had just gotten access to the ARPANET, the network of computers which was a main precursor to the Internet.  The team quickly created a program called CPYNET which could be used to send files to remote computers, similar to FTP today.</p>\n<p>One of these engineers, Ray Tomlinson, had the idea to combine the message files with <a href=\"https://tools.ietf.org/html/rfc310\">CPYNET</a>.  He added a command which allowed you to append to a file.  He also wired things up such that you could add an <code>@</code> symbol and a remote machine name to your messages and the machine would automatically connect to that host and append to the right file.  In other words, running:</p>\n<pre><code>SNDMSG zack@cloudflare\n</code></pre>\n<p>Would append to the <code>/Users/zack/messages</code> file on the host <code>cloudflare</code>.  And email was born!</p>\n<h3 id=\"ftp\">FTP</h3>\n<p>The CPYNET format did not have much of a life outside of Tenex unfortunately.  It was necessary to create a standard method of communication which every system could understand.  Fortunately, this was also the goal of another similar protocol, FTP.  FTP (the File Transfer Protocol) sought to create a single way by which different machines could transfer files over the ARPANET.</p>\n<p>FTP <a href=\"https://tools.ietf.org/html/rfc114\">originally</a> didn’t include support for email.  Around the time it was <a href=\"http://www.rfc-editor.org/rfc/rfc385.txt\">updated</a> to use TCP (rather than the NCP protocol which ARPANET historically used) the <code>MAIL</code> command was added.</p>\n<pre><code>$ ftp\n&lt; open bbn\n\n&gt; 220 HELLO, this is the BBN mail service\n\n&lt; MAIL zack\n\n&gt; 354 Type mail, ended by &lt;CRLF&gt;.&lt;CRLF&gt;\n\n&lt; Sup?\n&lt; .\n\n&gt; 250 Mail stored\n</code></pre>\n<p>These commands were ultimately <a href=\"https://tools.ietf.org/html/rfc772\">borrowed from</a> FTP and formed the basis for the SMTP (Simple Mail Transfer Protocol) protocol in <a href=\"https://tools.ietf.org/html/rfc821\">1982</a>.</p>\n<h3 id=\"mailboxes\">Mailboxes</h3>\n<p>The format for defining how a message should be transmitted (and often how it would be stored on disk) was first <a href=\"https://tools.ietf.org/html/rfc733\">standardized</a> in 1977:</p>\n<pre><code>Date     :  27 Aug 1976 0932-PDT\nFrom     :  Ken Davis &lt;KDavis at Other-Host&gt;\nSubject  :  Re: The Syntax in the RFC\nTo       :  George Jones &lt;Group at Host&gt;,\n              Al Neuman at Mad-Host\n\nThere’s no way this is ever going anywhere...\n</code></pre>\n<p>Note that at this time the ‘at’ word could be used rather than the ‘@’ symbol.  Also note that this use of headers before the message predates HTTP by almost fifteen years.  This format remains nearly identical today.</p>\n<p>The Fifth Edition of Unix used a very similar <a href=\"https://en.wikipedia.org/wiki/Mbox\">format</a> for storing a users email messages on disk.  Each user would have a file which contained their messages:</p>\n<pre><code>From MAILER-DAEMON Fri Jul  8 12:08:34 1974\nFrom: Author &lt;author@example.com&gt;\nTo: Recipient &lt;recipient@example.com&gt;\nSubject: Save $100 on floppy disks\n\nThey’re never gonna go out of style!\n\nFrom MAILER-DAEMON Fri Jul  8 12:08:34 1974\nFrom: Author &lt;author@example.com&gt;\nTo: Recipient &lt;recipient@example.com&gt;\nSubject: Seriously, buy AAPL\n\nYou’ve never heard of it, you’ve never heard of me, but when you see\nthat stock symbol appear.  Buy it.\n\n- The Future\n</code></pre>\n<p>Each message began with the word ‘From’, meaning if a message happened to contain From at the beginning of a line it needed to be escaped lest the system think that’s the start of a new message:</p>\n<pre><code>From MAILER-DAEMON Fri Jul  8 12:08:34 2011\nFrom: Author &lt;author@example.com&gt;\nTo: Recipient &lt;recipient@example.com&gt;\nSubject: Sample message 1\n\nThis is the body.\n&gt;From (should be escaped).\nThere are 3 lines.\n</code></pre>\n<p>It was technically possible to interact with your email by simply editing your mailbox file, but it was much more common to use an email client.  As you might expect there was a <a href=\"http://www.rfc-editor.org/rfc/rfc808.txt\">diversity</a> of clients available, but a few are of historical note.</p>\n<p>RD was an editor which was created by <a href=\"http://www.livinginternet.com/i/ii_roberts.htm\">Lawrence Roberts</a> who was actually the program manager for the ARPANET itself at the time.  It was a set of macros on top of the Tenex text editor (TECO), which itself would later become Emacs.</p>\n<p>RD was the first client to give us the ability to sort messages, save messages, and delete them.  There was one key thing missing though: any integration between receiving a message and sending one.  RD was strictly for consuming emails you had received, to reply to a message it was necessary to compose an entirely new message in SNDMSG or another tool.</p>\n<p>That innovation came from MSG, which itself was an improvement on a client with the hilarious name BANANARD.  MSG added the ability to reply to a message, in the words of Dave Crocker:</p>\n<blockquote>\n<p>\nMy subjective sense was that propagation of MSG resulted in an exponential explosion of email use, over roughly a 6-month period. The simplistic explanation is that people could now close the Shannon-Weaver communication loop with a single, simple command, rather than having to formulate each new message. In other words, email moved from the sending of independent messages into having a conversation.\n</p>\n</blockquote>\n<p>Email wasn’t just allowing people to talk more easily, it was changing how they talk.  In <a href=\"http://www.livinginternet.com/References/Ian%20Hardy%20Email%20Thesis.txt\">the words</a> of C. R. Linklider and Albert Vezza in 1978:</p>\n<blockquote>\n<p>\nOne of the advantages of the message systems over letter mail was that, in an ARPANET message, one could write tersely and type imperfectly, even to an older person in a superior position and even to a person one did not know very well, and the recipient took no offense... Among the advantages of the network message services over the telephone were the fact that one could proceed immediately to the point without having to engage in small talk first, that the message services produced a preservable record, and that the sender and receiver did not have to be available at the same time.\n</p>\n</blockquote>\n<p>The most popular client from this era was called <a href=\"https://en.wikipedia.org/wiki/MH_Message_Handling_System\">MH</a> and was composed of several command line utilities for doing various actions with and to your email.</p>\n<pre><code>$ mh\n\n% show\n\n(Message inbox:1)\nReturn-Path: joed\nReceived: by mysun.xyz.edu (5.54/ACS)\n        id AA08581; Mon, 09 Jan 1995 16:56:39 EST\nMessage-Id: &lt;9501092156.AA08581@mysun.xyz.edu&gt;\nTo: angelac\nSubject: Here’s the first message you asked for\nDate: Mon, 09 Jan 1995 16:56:37 -0600\nFrom: &quot;Joe Doe&quot; &lt;joed&gt;\n\nHi, Angela!  You asked me to send you a message.  Here it is.\nI hope this is okay and that you can figure out how to use\nthat mail system.\n\nJoe\n</code></pre>\n<p>You could reply to the message easily:</p>\n<pre><code>% repl\n\nTo: &quot;Joe Doe&quot; &lt;joed&gt;\ncc: angelac\nSubject: Re: Here’s the first message you asked for\nIn-reply-to: Your message of &quot;Mon, 09 Jan 1995 16:56:37 -0600.&quot;\n        &lt;9501092156.AA08581@mysun.xyz.edu&gt;\n-------\n\n% edit vi\n</code></pre>\n<p>You could then edit your reply in vim which is actually pretty cool.</p>\n<p>Interestingly enough, in June of 1996 the guide “<a href=\"http://rand-mh.sourceforge.net/book/\">MH &amp; xmh: Email for Users &amp; Programmers</a>” was actually the first book in history to be published on the Internet.</p>\n<h3 id=\"pineelmmutt\">Pine, Elm &amp; Mutt</h3>\n<blockquote>\n<p>\nAll mail clients suck. This one just sucks less.\n</p>\n<p>\n— Mutt Slogan\n</p>\n</blockquote>\n<p>It took several years until terminals became powerful enough, and perhaps email pervasive enough, that a more graphical program was required.  In 1986 Elm was introduced, which allowed you to interact with your email more interactively.</p>\n<figure class=\"standard\">\n<img src=\"http://blog.cloudflare.com/content/images/2017/08/posts-history-of-email-images-elm.png\" alt=\"Elm Screenshot\">\n<figcaption>\n<div class=\"figcaption\">\nElm Mail Client\n</div>\n</figcaption>\n</figure>\n<p>This was followed by more graphical <a href=\"https://en.wikipedia.org/wiki/Text-based_user_interface\">TUI</a> clients like <a href=\"https://web.archive.org/web/19970126101209/http://www.cs.hmc.edu/~me/mutt/index.html\">Mutt</a> and <a href=\"https://groups.google.com/forum/#!msg/comp.mail.misc/kqKQojTDVBM/kvYgyYbwfKoJ\">Pine</a>.</p>\n<p>In the words of the University of Washington’s <a href=\"http://www.washington.edu/pine/overview/project-history.html\">Pine team</a>:</p>\n<blockquote>\n<p>\nOur goal was to provide a mailer that naive users could use without fear of making mistakes. We wanted to cater to users who were less interested in learning the mechanics of using electronic mail than in doing their jobs; users who perhaps had some computer anxiety. We felt the way to do this was to have a system that didn’t do surprising things and provided immediate feedback on each operation; a mailer that had a limited set of carefully-selected functions.\n</p>\n</blockquote>\n<p>These clients were becoming gradually easier and easier to use by non-technical people, and it was becoming clear how big of a deal this really was:</p>\n<blockquote>\n<p>We in the ARPA community (and no doubt many others\n     outside it) have come to realize that we have in\n     our hands something very big, and possibly very\n     important. It is now plain to all of us that\n     message service over computer networks has\n     enormous potential for changing the way\n     communication is done in all sectors of our\n     society: military, civilian government, and\n     private.\n</p>\n</blockquote>\n<h3 id=\"webmail\">Webmail</h3>\n<blockquote>\n<p>\nIts like when I did the referer field. I got nothing but grief for my choice\nof spelling. I am now attempting to get the spelling corrected in the OED\nsince my spelling is used several billion times a minute more than theirs.\n</p>\n<p>\n— Phillip Hallam-Baker on his spelling of ’Referer’ <a href=\"https://groups.google.com/forum/#!original/alt.folklore.computers/7X75In21_54/JgV9Rw04f-EJ\"><code>2000</code></a>\n</p>\n</blockquote>\n<p>The first webmail client was created by Phillip Hallam-Baker at CERN in <a href=\"https://groups.google.com/forum/#!topic/comp.archives/vpWqUAmg8xU\">1994</a>.  Its creation was early enough in the history of the web that it led to the identification of the need for the <code>Content-Length</code> header in POST requests.</p>\n<p>Hotmail was released in 1996.  The name was chosen because it included the letters HTML to emphasize it being ‘on the web’ (it was original stylized as ‘HoTMaiL’).  When it was launched users were limited to 2MB of storage (at the time a 1.6GB hard drive was $399).</p>\n<p>Hotmail was originally implemented using FreeBSD, but in a decision I’m sure every engineer regretted, it was moved to Windows 2000 after the service was bought by Microsoft.  In 1999, hackers revealed a security flaw in Hotmail that permitted anybody to log in to any Hotmail account using the password ‘<a href=\"http://archive.wired.com/science/discoveries/news/1999/08/21503\">eh</a>’.  It took until 2001 for ‘hackers’ to realize you could access other people’s messages by swap usernames in the URL and guessing at a valid message number.</p>\n<p><img src=\"http://blog.cloudflare.com/content/images/2017/08/posts-history-of-email-images-gmail.jpg\" alt=\"Gmail\" loading=\"lazy\"></p>\n<p>Gmail was famously created in 2004 as a ‘20% project’ of Paul Buchheit.  Originally it wasn’t particularly believed in as a product within Google.  They had to launch using a few hundred Pentium III computers no one else wanted, and it took three years before they had the resources to accept users without an invitation.  It was notable both for being much closer to a desktop application (using AJAX) and for the unprecedented offer of 1GB of mail storage.</p>\n<h3 id=\"thefuture\">The Future</h3>\n<figure class=\"standard\">\n<img src=\"http://blog.cloudflare.com/content/images/2017/08/posts-history-of-email-images-mail.gif\" alt=\"Volume of Postal Mail\">\n<figcaption>\n<div class=\"figcaption\">\nUS Postal Mail Volume, <a href=\"http://www.slideshare.net/jesserobbins/devops-change/14-US_Postal_Service_Mail_Volume\" target=\"_blank\"><small>KPCB</small></a>\n</div>\n</figcaption>\n</figure>\n<p>At this point email is a ubiquitous enough communication standard that it’s very possible postal mail as an everyday idea will die before I do. One thing which has not survived well is any attempt to replace email with a more complex messaging tool like <a href=\"https://en.wikipedia.org/wiki/Apache_Wave\">Google Wave</a>. With the rise of more targeted communication tools like Slack, Facebook, and Snapchat though, you never know.</p>\n<p>There is, of course, a cost to that. The ancestors of the Internet were kind enough to give us a communication standard which is free, transparent, and standardized. It would be a shame to see the tech communication landscape move further and further into the world of locked gardens and proprietary schemas.</p>\n<p>We’ll leave you with two quotes:</p>\n<blockquote>\n<p>\nMostly because it seemed like a neat idea. There was no directive to ‘go forth and invent e-mail’.\n</p>\n<p>\n— Ray Tomlinson, answering a question about why he invented e-mail\n</p>\n</blockquote>\n<hr style=\"visibility: hidden; margin: 0.5em auto;\">\n<blockquote>\n<p>\nPermit me to carry the doom-crying one step further.  I am\ncurious whether the increasingly easy access to computers by\nadolescents will have any effect, however small, on their social \ndevelopment. Keep in mind that the social skills necessary for \ninterpersonal relationships are not taught; they are learned by \nexperience.  Adolescence is probably the most important time period \nfor learning these skills. There are two directions for a cause-effect relationship.\nEither people lacking social skills (shy people, etc.) turn to\nother pasttimes, or people who do not devote enough time to human\ninteractions have difficulty learning social skills.  I do\nnot [consider] whether either or both of these alternatives actually occur. I believe I am justified in asking whether computers will\ncompete with human interactions as a way of spending time?  \nWill they compete more effectively than other pasttimes?  \nIf so, and if we permit computers\nto become as ubiquitous as televisions, will computers have\nsome effect (either positive or negative) on personal development\nof future generations?\n</p>\n<p>\n— Gary Feldman, <a href=\"http://www.livinginternet.com/References/Ian%20Hardy%20Email%20Thesis.txt\"><code class=\"date\">1981</code></a>\n</p>\n</blockquote>\n<ul class=\"closing-cards\">\n<li class=\"closing-card\">\n<p>Use Cloudflare Apps to build tools which can be installed by millions of sites.</p>\n<p><a href=\"https://www.cloudflare.com/apps/developer/docs/getting-started\">Build an app →</a></p>\n<p>If you're in San Francisco, London or Austin: <a href=\"https://boards.greenhouse.io/cloudflare/jobs/850951\">work with us</a>.</p>\n<li id=\"mc_embed_signup\" class=\"closing-card\">\n<form action=\"//cloudflare.us5.list-manage.com/subscribe/post?u=d80d4d74266c0c044b0bcd7ca&amp;id=cb12c756a6\" method=\"post\" id=\"mc-embedded-subscribe-form\" name=\"mc-embedded-subscribe-form\" class=\"validate\" target=\"_blank\" novalidate>\n    <div id=\"mc_embed_signup_scroll\">\n        <p>Our next post is on the history of the URL! <br><strong>Get notified when new apps and apps-related posts are released:</strong></p>\n<div class=\"mc-field-group\">\n\t<label for=\"mce-EMAIL\">Email Address\n</label>\n\t<input type=\"email\" value=\"\" name=\"EMAIL\" class=\"required email\" id=\"mce-EMAIL\">\n</div>\n<div id=\"mce-responses\" class=\"clear\">\n<div class=\"response\" id=\"mce-error-response\" style=\"display:none\"></div>\n<div class=\"response\" id=\"mce-success-response\" style=\"display:none\"></div>\n</div>\n<div style=\"position: absolute; left: -5000px;\" aria-hidden=\"true\"><input type=\"text\" name=\"b_f1669393e91a33564714f9437_b07e9881b0\" tabindex=\"-1\" value=\"\"></div>\n<div class=\"clear\"><input type=\"submit\" value=\"Subscribe\" name=\"subscribe\" id=\"mc-embedded-subscribe\" class=\"button\"></div>\n</div>\n</form>\n</ul>\n<script type='text/javascript' src='//cloudflare.works/files/mc-validate.js'></script><script type='text/javascript'>(function($) {window.fnames = new Array(); window.ftypes = new Array();fnames[0]='EMAIL';ftypes[0]='email';fnames[1]='FNAME';ftypes[1]='text';fnames[2]='LNAME';ftypes[2]='text';}(jQuery));var $mcj = jQuery.noConflict(true);</script>\n<script type='text/javascript' src='//cloudflare.works/files/prism.js'></script>\n<link rel='stylesheet' href='//cloudflare.works/files/prism.css' />\n<style>\n/* Social */\n\n.social {\n  margin-top: 1.3em;\n}\n.fb_iframe_widget {\n  padding-right: 1px;\n}\n.IN-widget {\n  padding-left: 11px;\n}\n\n/* Hide period after author */\n\n.post-header .meta a {\n  border-right: 5px solid white;\n  margin-right: -5px;\n  position: relative;\n}\n\n/* Post */\n\nbody {\n  background-color: white;\n}\npre, code {\n  font-size: inherit;\n  line-height: inherit;\n}\nsection.primary-content {\n  font-size: 16px;\n  line-height: 1.6;\n  color: black;\n}\nblockquote {\n  padding-bottom: 1.5em;\n  padding-top: 1em;\n  font-style: italic;\n  font-size: 1.25rem;\n}\nblockquote.pull-quote-centered {\n  font-size: 1.2em;\n  text-align: center;\n  max-width: 100%;\n  margin-left: auto;\n  margin-right: auto;\n}\nblockquote blockquote {\n  margin-left: 1em;\n  padding-left: 1em;\n  border-left: 5px solid rgba(0, 0, 0, 0.2);\n  padding-bottom: 0.5em;\n  padding-top: 0.5em;\n  margin-bottom: 0.5em;\n  margin-top: 0.5em;\n}\nfigure.standard {\n  position: relative;\n  max-width: 100%;\n  margin: 1em auto;\n  text-align: center;\n  z-index: -1;\n}\n.figcaption {\n  padding-top: .5em;\n  font-size: .8em;\n  color: #888;\n  font-weight: 300;\n  letter-spacing: .03em;\n  line-height: 1.35;\n}\n.figcontent {\n  display: inline-block;\n}\np.attribution {\n  color: #666;\n  font-size: 0.9em;\n  padding-bottom: 1em;\n}\na code.year {\n  text-decoration: underline;\n}\n.closing-cards #mc_embed_signup .mc-field-group {\n  margin: 0.75em 0;\n}\n.closing-cards #mc_embed_signup input {\n  font-size: 1.5em;\n  height: auto;\n}\n.closing-cards #mc_embed_signup input[type=\"email\"] {\n  border: 1px solid #bcbcbc;\n  border-radius: 2px;\n  margin-bottom: 0;\n}\n.closing-cards #mc_embed_signup input[type=\"submit\"] {\n  background: #f38020;\n  color: #fff;\n  padding: .8em 1em .8em 1em;\n  white-space: nowrap;\n  line-height: 1.2;\n  text-align: center;\n  border-radius: 2px;\n  border: 0;\n  display: inline-block;\n  text-rendering: optimizeLegibility;\n  -webkit-tap-highlight-color: transparent;\n  -webkit-font-smoothing: subpixel-antialiased;\n  user-select: none;\n  -webkit-appearance: none;\n  appearance: none;\n  letter-spacing: .04em;\n  text-indent: .04em;\n  cursor: pointer;\n}\n.closing-cards #mc_embed_signup div.mce_inline_error {\n  background-color: transparent;\n  color: #C33;\n  padding: 0;\n  display: inline-block;\n  font-size: 0.9em;\n}\n.closing-cards #mc_embed_signup p:not(:empty) {\n  line-height: 1.5;\n  margin-bottom: 2em;\n}\n\n.closing-cards #mc_embed_signup input[type=\"email\"] {\n  font-size: 20px !important;\n  width: 100% !important;\n  padding: .6em 1em !important;\n}\n\n.closing-cards #mc_embed_signup .mc-field-group {\n  margin: 0 !important;\n}\n\n.closing-cards #mc_embed_signup input[type=\"submit\"] {\n  font-size: 20px !important;\n  margin-top: .5em !important;\n  padding: .6em 1em !important;\n}\n\n.closing-cards #mc_embed_signup div.mce_inline_error {\n  padding: 0;\n  margin: 0;\n  color: #F38020 !important;\n}\n\naside.section.learn-more {\n  display: none;\n}\n\n.closing-cards {\n  background: #eee;\n  width: 100%;\n  list-style-type: none;\n  margin-left: 0;\n}\n.closing-card {\n  width: calc(50% - 10px) !important;\n  font-size: 20px;\n  padding: 1.5em;\n  display: inline-block;\n  box-sizing: border-box;\n  vertical-align: top;\n}\n\n@media (max-width: 788px){\n  .closing-card {\n    width: 100% !important;\n  }\n  .closing-card + .closing-card {\n    border-top: 10px solid white;\n  }\n}\n\n\n</style><!--kg-card-end: markdown-->",
		"comment_id": "4990",
		"feature_image": "http://blog.cloudflare.com/content/images/2017/09/posts-history-of-email-images-gmail--1-.jpg",
		"featured": false,
		"visibility": "public",
		"created_at": "2017-08-11T02:31:25.000+01:00",
		"updated_at": "2018-08-29T03:01:58.000+01:00",
		"published_at": "2017-09-23T17:00:00.000+01:00",
		"custom_excerpt": "This was adapted from a post which originally appeared on the Eager blog. Eager has now become the new Cloudflare Apps.",
		"codeinjection_head": null,
		"codeinjection_foot": null,
		"custom_template": null,
		"canonical_url": null,
		"tags": [
			{
				"id": "5d16450341acde0011a9520b",
				"name": "History",
				"slug": "history",
				"description": null,
				"feature_image": null,
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/history/"
			},
			{
				"id": "5d16450341acde0011a9515e",
				"name": "Cloudflare Apps",
				"slug": "cloudflare-apps",
				"description": "Cloudflare Apps is a simple and powerful way for millions of site owners to get access to tools previously only available to technical experts.",
				"feature_image": "https://ghost.mrk.cfdata.org/content/images/2018/02/Screen-Shot-2018-02-22-at-1.12.26-PM.png",
				"visibility": "public",
				"meta_title": null,
				"meta_description": null,
				"og_image": null,
				"og_title": null,
				"og_description": null,
				"twitter_image": null,
				"twitter_title": null,
				"twitter_description": null,
				"codeinjection_head": null,
				"codeinjection_foot": null,
				"canonical_url": null,
				"accent_color": null,
				"url": "http://blog.cloudflare.com/tag/cloudflare-apps/"
			}
		],
		"authors": [
			{
				"id": "5d1644b141acde0011a94f7b",
				"name": "Zack Bloom",
				"slug": "zack-bloom",
				"profile_image": "http://blog.cloudflare.com/content/images/2017/03/YZCINbF6.jpg",
				"cover_image": "http://blog.cloudflare.com/content/images/2018/08/general@2x-12.png",
				"bio": null,
				"website": null,
				"location": null,
				"facebook": null,
				"twitter": null,
				"meta_title": null,
				"meta_description": null,
				"url": "http://blog.cloudflare.com/author/zack-bloom/"
			}
		],
		"primary_author": {
			"id": "5d1644b141acde0011a94f7b",
			"name": "Zack Bloom",
			"slug": "zack-bloom",
			"profile_image": "http://blog.cloudflare.com/content/images/2017/03/YZCINbF6.jpg",
			"cover_image": "http://blog.cloudflare.com/content/images/2018/08/general@2x-12.png",
			"bio": null,
			"website": null,
			"location": null,
			"facebook": null,
			"twitter": null,
			"meta_title": null,
			"meta_description": null,
			"url": "http://blog.cloudflare.com/author/zack-bloom/"
		},
		"primary_tag": {
			"id": "5d16450341acde0011a9520b",
			"name": "History",
			"slug": "history",
			"description": null,
			"feature_image": null,
			"visibility": "public",
			"meta_title": null,
			"meta_description": null,
			"og_image": null,
			"og_title": null,
			"og_description": null,
			"twitter_image": null,
			"twitter_title": null,
			"twitter_description": null,
			"codeinjection_head": null,
			"codeinjection_foot": null,
			"canonical_url": null,
			"accent_color": null,
			"url": "http://blog.cloudflare.com/tag/history/"
		},
		"url": "http://blog.cloudflare.com/the-history-of-email/",
		"excerpt": "This was adapted from a post which originally appeared on the Eager blog. Eager has now become the new Cloudflare Apps.",
		"reading_time": 12,
		"access": true,
		"comments": false,
		"og_image": null,
		"og_title": null,
		"og_description": null,
		"twitter_image": null,
		"twitter_title": null,
		"twitter_description": null,
		"meta_title": "The History of Email",
		"meta_description": "A brief look at how and why email was invented.",
		"email_subject": null,
		"frontmatter": null,
		"feature_image_alt": null,
		"feature_image_caption": null
	}
}