{
	"initialReadingTime": "10",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Junade Ali",
				"slug": "junade-ali",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3OWtXkEWho3HaulkNRp0L2/94facede17b4a972393d41defc8d8cfe/junade-ali.jpg",
				"location": null,
				"website": null,
				"twitter": "@IcyApril",
				"facebook": null
			}
		],
		"excerpt": "News outlets and blogs will frequently compare DDoS attacks by the volume of traffic that a victim receives. Surely this makes some sense, right? The greater the volume of traffic a victim receives, the harder to mitigate an attack - right? ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/wMPmxf26vXI6TUIJvSE3j/ee6fde77bc442cf3d2a113dbe8b3ac33/the-new-ddos-landscape.png",
		"featured": false,
		"html": "<p>News outlets and blogs will frequently compare DDoS attacks by the volume of traffic that a victim receives. Surely this makes some sense, right? The greater the volume of traffic a victim receives, the harder to mitigate an attack - right?</p><p>At least, this is how things used to work. An attacker would gain capacity and then use that capacity to launch an attack. With enough capacity, an attack would overwhelm the victim&#39;s network hardware with junk traffic such that they can no longer serve legitimate requests. If your web traffic is served by a server with a 100 Gbps port and someone sends you 200 Gbps, your network will be saturated and the website will be unavailable.</p><p>Recently, this dynamic has shifted as attackers have gotten far more sophisticated. The practical realities of the modern Internet have increased the amount of effort required to clog up the network capacity of a DDoS victim - attackers have noticed this and are now choosing to perform attacks higher up the network stack.</p><p>In recent months, Cloudflare has seen a dramatic reduction in simple attempts to flood our network with junk traffic. Whilst we continue to see large network level attacks, in excess of 300 and 400 Gbps, network level attacks in general have become far less common (the largest recent attack was just over 0.5 Tbps). This has been especially true since the end of September when we made official a policy that <a href=\"/unmetered-mitigation/\">would not remove any customers from our network merely for receiving a DDoS attack that&#39;s too big</a>, including those on our free plan.</p><p>Far from attackers simply closing shop, we see a trend whereby attackers are moving to more advanced application-layer attack strategies. This trend is not only seen in metrics from our automated attack mitigation systems, but has also been the experience of our frontline customer support engineers. Whilst we continue to see very large network level attacks, note that they are occurring less frequently since the introduction of Unmetered Mitigation:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4j6SZYixPDOxuWY5hwbHXE/0c4a33024e9ec47d9cb951eb6a5dd9be/syn.png\" alt=\"\" class=\"kg-image\" width=\"2029\" height=\"1011\" loading=\"lazy\"/>\n            \n            </figure><p>To understand how the landscape has made such a dramatic shift, we must first understand how DDoS attacks are performed.</p><h3>Performing a DDoS</h3><blockquote><p>From presentation by <a href=\"https://twitter.com/IcyApril?ref_src=twsrc%5Etfw\">@IcyApril</a> - First thing you absolutely need for a successful DDoS - is a cool costume. <a href=\"https://t.co/WIC0LjF4ka\">pic.twitter.com/WIC0LjF4ka</a></p><p>— majek04 (@majek04) <a href=\"https://twitter.com/majek04/status/933332376159162370?ref_src=twsrc%5Etfw\">November 22, 2017</a></p></blockquote><p>The first thing you need before you can carry out a DDoS Attack is capacity. You need the network resources to be able to overwhelm your victim.</p><p>To build up capacity, attackers have a few mechanisms at their disposal; three such examples are Botnets, IoT Devices and DNS Amplification:</p><h4>Botnets</h4><p>Computer viruses are deployed for multiple reasons, for example; they can harvest private information from users or blackmail users into paying them money to get their precious files back. Another utility of computer viruses is building capacity to perform DDoS Attacks.</p><p>A Botnet is a network of infected computers that are centrally controlled by an attacker; these zombie computers can then be used to send spam emails or perform DDoS attacks.</p><p>Consumers have access to faster Internet than ever before. In November 2016, the average UK broadband upload speed reached 4.3Mbps - this means a Botnet which has infected a little under 2,400 computers can launch an attack of around 10Gbps. Such capacity is plenty enough to saturate the end networks that power most websites online.</p><p>On August 17th, 2017, multiple networks online were subject to significant attacks from a botnet known as WireX. Researchers from a variety of organisations, including from Akamai, Cloudflare, Flashpoint, Google, Oracle Dyn, RiskIQ, Team Cymru, and other organizations cooperated to combat this botnet - eventually leading to hundreds of Android apps being removed and a process started to remove the malware-ridden apps from all devices.</p><h4>IoT Devices</h4><p>More and more of our everyday appliances are being embedded with Internet connectivity. Like other types of technology, they can be taken over with malware and controlled to launch large-scale DDoS attacks.</p><p>Towards the end of last year, we began to see Internet-connected cameras start to launch <a href=\"/say-cheese-a-snapshot-of-the-massive-ddos-attacks-coming-from-iot-cameras/\">large DDoS attacks</a>. The use of video cameras was advantageous to attackers in the sense they needed to be connected to networks with enough bandwidth to be capable of streaming video.</p><p>Mirai was one such botnet which targeted Internet-connected cameras and Internet routers. It would start by logging into the web dashboard of a device using a table of 60 default usernames and passwords, then installing malware on the device.</p><p>Where users set passwords instead of them merely being the default values, other pieces of malware can use Dictionary Attacks to repeatedly guess simple user-configured passwords, using a list of common passwords like the one shown below. I have self-censored some of the passwords, apparently users can be in a fairly angry state-of-mind when setting passwords:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3lxX56Rn4vULNewXMTViZ8/870c4aed9ce7aa699a24b7377e19744e/Screen-Shot-2017-11-24-at-16.22.59.png\" alt=\"\" class=\"kg-image\" width=\"1424\" height=\"1050\" loading=\"lazy\"/>\n            \n            </figure><p>Passwords aside, back in May, I blogged specifically about some examples of security risks we are starting to see which are specific to IoT devices: <a href=\"/iot-security-anti-patterns/\">IoT Security Anti-Patterns</a>.</p><h4>DNS Amplification</h4><p>DNS is the phonebook of the Internet; in order to reach this site, your local computer used DNS to look up which IP Address would serve traffic for <code>blog.cloudflare.com</code>. I can perform this DNS queries from my command line using <code>dig A blog.cloudflare.com</code>:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6Hh5Ef8wCUFfsLgQFSTDnL/303c52c238cc3f7950b3e30318f66cd3/Screen-Shot-2017-11-24-at-16.37.47.png\" alt=\"\" class=\"kg-image\" width=\"2180\" height=\"1648\" loading=\"lazy\"/>\n            \n            </figure><p>Firstly notice that the response is pretty big, it&#39;s certainly bigger than the question we asked.</p><p>DNS is built on a Transport Protocol called UDP, when using UDP it&#39;s easy to forge the requester of a query as UDP doesn&#39;t require a handshake before sending a response.</p><p>Due to these two factors, someone is able to make a DNS query on behalf of someone else. We can make a request for a relatively small DNS query, which will will then result in a long response being sent somewhere else.</p><p>Online there are open DNS resolvers that will take a request from anyone online and send the response to anyone else. In most cases we should not be exposing open DNS resolvers to the internet (most are open due to configuration mistakes). However, when intentionally exposing DNS resolvers online, security steps should be taken - StrongArm has <a href=\"https://strongarm.io/blog/secure-open-dns-resolver/\">a primer on securing open DNS resolvers</a> on their blog.</p><p>Let&#39;s use a hypothetical to illustrate this point. Imagine that you wrote to a mail order retailer requesting a catalogue (if you still know what one is). You&#39;d send a relatively short postcard with your contact information and your request - you&#39;d then get back quite a big catalogue. Now imagine you did the same, but sent hundreds of these postcards and instead included the address of someone else. Assuming the retailer was obliging in sending such a vast amount of catalogues, your friend could wake up one day with their front door blocked with catalogues.</p><p>In 2013, we blogged about how one DNS Amplification attack we faced <a href=\"/the-ddos-that-almost-broke-the-internet/\">almost broke the internet</a>; however, in recent times aside from one exceptionally high attack (occurring just after we launched <a href=\"/unmetered-mitigation/\">Unmetered DDoS Mitigation</a>), DNS Amplification attacks have generally been a low proportion of attacks we see recently:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4zWEAcupocMXEFYGTN7qfk/7a4717c7ab648cafff7221a0c9016b14/dns.png\" alt=\"\" class=\"kg-image\" width=\"1575\" height=\"1023\" loading=\"lazy\"/>\n            \n            </figure><p>Whilst we&#39;re seeing fewer of these attacks, you can find a more detailed overview on our learning centre: <a href=\"https://www.cloudflare.com/learning/ddos/dns-amplification-ddos-attack/\">DNS Amplification Attack</a></p><h3>DDoS Mitigation: The Old Priorities</h3><p>Using the capacity an attacker has built up, they can send junk traffic to a web property. This is referred to as a Layer 3/4 attack. This kind of attack primarily seeks to block up the network capacity of the victim network.</p><p>Above all, mitigating these attacks requires capacity. If you get an attack of 600 Gbps and you only have 10 Gbps of capacity you either need to pay an intermediary network to filter traffic for you or have your network go offline due to the force of the attack.</p><p>As a network, Cloudflare works by passing a customer&#39;s traffic through our network; in doing so, we are able to apply performance optimisations and security filtering to the traffic we see. One such security filter is removing junk traffic associated with Layer 3/4 DDoS attacks.</p><p>Cloudflare&#39;s network was built when large scale DDoS Attacks were becoming a reality. Huge network capacity, spread out over the world in many different data centres makes it easier to absorb large attacks. We currently have over 15 Tbps and this figure is always growing fast.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/64a0Lhlr7C7Fj66wdHTi4K/64bf2b678addae9c9259a0d3b224e924/network-map-gradient.png\" alt=\"\" class=\"kg-image\" width=\"1100\" height=\"678\" loading=\"lazy\"/>\n            \n            </figure><p>Preventing DDoS attacks needs a little more sophistication than just capacity though. While traditional Content Delivery Networks are built using Unicast technology, Cloudflare&#39;s network is built using an Anycast design.</p><p>In essence, this means that network traffic is routed to the nearest available Point-of-Presence and it is not possible for an attacker to override this routing behaviour - the routing is effectively performed using BGP, the routing protocol of the Internet.</p><p>Unicast networks will frequently use technology like DNS to steer traffic to close data centres. This routing can easily be overridden by an attacker, allowing them to force attack traffic to a single data centre. This is not possible with Cloudflare&#39;s Anycast network; meaning we maintain full control of how our traffic is routed (providing intermediary ISPs respect our routes). With this network design, have the ability to rapidly update routing decisions even against ISPs which ordinarily do not respect cache expiration times for DNS records (TTLs).</p><p>Cloudflare&#39;s network also maintains an Open Peering Policy; we are open to interconnecting our network with any other network without cost. This means we tend to eliminate intermediary networks across our network. When we are under attack, we usually have a very short network path from the attacker to us - this means there are no intermediary networks which can suffer collateral damage.</p><h3>The New Landscape</h3><p>I started this blog post with a chart which demonstrates the frequency of a type of network-layer attack known as a SYN Flood against the Cloudflare network. You&#39;ll notice how the largest attacks are further spaced out over the past few months:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6UvuxVBCEB5uFaqbDnN1XH/a8709b10f9bb909d79c857bbd9c92b1d/syn.png\" alt=\"\" class=\"kg-image\" width=\"2029\" height=\"1011\" loading=\"lazy\"/>\n            \n            </figure><p>You can also see that this trend does not follow when compared to a graph of Application Layer DDoS attacks which we continue to see coming in:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/0o48AirpaxWXQkjV6lmcZ/fdaa6009bc9567f019dc466ee0c4bed2/layer7.png\" alt=\"\" class=\"kg-image\" width=\"2085\" height=\"975\" loading=\"lazy\"/>\n            \n            </figure><p>The chart above has an important caveat, an Application Layer attack is defined by what <b>we</b> determine an attack is. Application Layer (Layer 7) attacks are more indistinguishable from real traffic than Layer 3/4 attacks. The attacks effectively resemble normal web requests, instead of junk traffic.</p><p>Attackers can order their Botnets to perform attacks against websites using &quot;Headless Browsers&quot; which have no user interface. Such Headless Browsers work exactly like normal browsers, except that they are controlled programmatically instead of being controlled via a window on a user&#39;s screen.</p><p>Botnets can use Headless Browsers to effectively make HTTP requests that load and behave just like ordinary web requests. As this can be done programmatically, they can order bots to repeat these HTTP requests rapidly - effectively taking up the entire capacity of a website, taking it offline for ordinary visitors.</p><p>This is a non-trivial problem to solve. At Cloudflare, we have specific services like <a href=\"/meet-gatebot-a-bot-that-allows-us-to-sleep/\">Gatebot</a> which identify DDoS attacks by picking up on anomalies in network traffic. We have tooling like <a href=\"https://support.cloudflare.com/hc/en-us/articles/200170076-What-does-I-m-Under-Attack-Mode-do-\">&quot;I&#39;m Under Attack Mode&quot;</a> to analyse traffic to ensure the visitor is human. This is, however, only part of the story.</p><p>A $20/month server running a resource intense e-commerce platform may not be able to cope with any more than a dozen concurrent HTTP requests before being unable to serve any more traffic.</p><p>An attack which can take down a small e-commerce site will likely not even be a drop in the ocean for Cloudflare&#39;s network, which sees around 10% of Internet requests online.</p><p>The chart below outlines DDoS attacks per day against Cloudflare customers; but it is important to bear in mind that this includes what <b>we</b> define as an attack. In recent times, Cloudflare has built specific products to help customers define what they think an attack looks like and how much traffic they feel they should cope with.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/jDOUHwa7eNwq42lzB65M8/3dc9310f765f350782a6f890beab2087/cfddos.png\" alt=\"\" class=\"kg-image\" width=\"2115\" height=\"1039\" loading=\"lazy\"/>\n            \n            </figure><h3>A Web Developers Guide to Defeating an Application Layer DDoS Attack</h3><p>One of the reasons why Application Layer DDoS attacks are so attractive is due to the uneven balance between the relative computational overhead required to for someone to request a web page, and the computational difficulty in serving one. Serving a dynamic website requires all kinds of operations; fetching information from a database, firing off API requests to separate services, rendering a page, writing log lines and potentially even pushing data down a message queue.</p><p>Fundamentally, there are two ways of dealing with this problem:</p><ul><li><p>making the balance between requester and server, less asymmetric by making it easier to serve web requests</p></li><li><p>limiting requests which are in such excess, they are blatantly abusive</p></li></ul><p>It remains critical you have a high-capacity DDoS mitigation network in front of your web application; one of the reasons why Application Layer attacks are increasingly attractive to attackers because networks have gotten good at mitigating volumetric attacks at the network layer.</p><p>Cloudflare has found that whilst performing Application Layer attacks, attackers will sometimes pick cryptographic ciphers that are the hardest for servers to calculate and are not usually accelerated in hardware. What this means is the attackers will try and consume more of your servers resources by actually using the fact you offer encrypted HTTPS connections against you. Having a proxy in front of your web traffic has the added benefit of ensuring that it has to establish a brand new secure connection to your origin web server - effectively meaning you don&#39;t have to worry about Presentation Layer attacks.</p><p>Additionally, offloading services which don&#39;t have custom application logic (like DNS) to managed providers can help ensure you have less surface area to worry about at the Application Layer.</p><h4>Aggressive Caching</h4><p>One of the ways to make it easier to serve web requests is to use some form of caching. There are multiple forms of caching; however, here I&#39;m going to be talking about how you enable caching for HTTP requests.</p><p>Suppose you&#39;re using a CMS (Content Management System) to update your blog, the vast majority of visitors to your blog will see the identical page to every other visitor. It will only be the when an anonymous visitor logs in or leaves a comment that they will see a page that&#39;s dynamic and unlike every other page that&#39;s been rendered.</p><p>Despite the vast majority of HTTP requests to specific URLs being identical, your CMS has to regenerate the page for every single request as if it was brand new. Application Layer DDoS attacks exploit this to amplification to make their attacks more brutal.</p><p>Caching proxies like NGINX and services like Cloudflare allow you to specify that until a user has a browser cookie that de-anonymises them, content can be served from cache. Alongside performance benefits, these configuration changes can prevent the most crude Application Layer DDoS Attacks.</p><p>For further information on this, you can consult NGINX guide to caching or alternatively see my blog post on caching anonymous page views:</p><ul><li><p><a href=\"https://www.nginx.com/blog/nginx-caching-guide/\">NGINX Caching Guide</a></p></li><li><p><a href=\"/caching-anonymous-page-views/\">Caching Anonymous Page Views at the Edge with Cloudflare</a></p></li></ul><h4>Rate Limiting</h4><p>Caching isn&#39;t enough; non-idempotent HTTP requests like POST, PUT and DELETE are not safe to cache - as such making these requests can bypass caching efforts used to prevent Application Layer DDoS attacks. Additionally, attackers can attempt to vary URLs to bypass advanced caching behaviour.</p><p>Software exists for web servers to be able to perform rate limiting before anything hits dynamic logic; examples of such tools include <a href=\"https://www.fail2ban.org/wiki/index.php/Main_Page\">Fail2Ban</a> and <a href=\"https://httpd.apache.org/docs/trunk/mod/mod_ratelimit.html\">Apache mod_ratelimit</a>.</p><p>If you do rate limiting on your server itself, be sure to configure your edge network to cache the rate limit block pages, such that attackers cannot perform Application Layer attackers once blocked. This can be done by caching responses with a 429 status code against a Custom Cache Key based on the IP Address.</p><p>Services like Cloudflare offer Rate Limiting at their edge network; for example <a href=\"https://www.cloudflare.com/rate-limiting/\">Cloudflare Rate Limiting</a>.</p><h3>Conclusion</h3><p>As the capacity of networks like Cloudflare continue to grow, attackers move from attempting DDoS attacks at the network layer to performing DDoS attacks targeted at applications themselves.</p><p>For applications to be resilient to DDoS attacks, it is no longer enough to use a large network. A large network must be complemented with tooling that is able to filter malicious Application Layer attack traffic, even when attackers are able to make such attacks look near-legitimate.</p>",
		"id": "4o1cEOKQJRXCb4DQJy1fWR",
		"localeList": {
			"name": "The New DDoS Landscape Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2017-11-23T03:28:00.000+00:00",
		"slug": "the-new-ddos-landscape",
		"tags": [
			{
				"id": "64g1G2mvZyb6PjJsisO09T",
				"name": "DDoS",
				"slug": "ddos"
			},
			{
				"id": "5kIxDMJCg3PXQxVINDL0Cw",
				"name": "Attacks",
				"slug": "attacks"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "6QVJOBzgKXUO9xAPEpqxvK",
				"name": "Reliability",
				"slug": "reliability"
			},
			{
				"id": "4LtMoX5pkj38ujzMRVhgvC",
				"name": "Mitigation",
				"slug": "mitigation"
			},
			{
				"id": "5fZHv2k9HnJ7phOPmYexHw",
				"name": "DNS",
				"slug": "dns"
			}
		],
		"title": "The New DDoS Landscape",
		"updated_at": "2024-08-27T02:26:29.096Z",
		"url": "https://blog.cloudflare.com/the-new-ddos-landscape"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}