{
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Matthew Prince",
				"slug": "matthew-prince",
				"bio": "A little bit geek, wonk, and nerd. Repeat entrepreneur, recovering lawyer, and former ski instructor. Co-founder & CEO of Cloudflare (NYSE: NET).",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1VD9WePJ1jvjFwuSRF0IfQ/4867307860761eb8209f67f2a9dd771f/matthew-prince.jpeg",
				"location": "San Francisco, CA",
				"website": null,
				"twitter": "@eastdakota",
				"facebook": null
			}
		],
		"excerpt": "A huge storm rolled across the eastern United States last night, topping trees and knocking out power. Amazon Web Services (AWS) had one of their primary data centers in Virginia lose power. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5f1nB5ZONDF9pVUHfpG0f5/a609c4d3ee4797a836c4bf3a182ef15c/thoughts-on-the-aws-outage-the-failure-charac.jpg",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4xCFSw8e6btXmsOV5ReU1Z/d00ee968b7d8fd30527f8dd9ec93d4a2/cumulus_cloud.jpg.scaled500.jpg\" alt=\"Thoughts on the AWS outage: making the cloud more resilient to failure\" class=\"kg-image\" width=\"400\" height=\"267\" loading=\"lazy\"/>\n            \n            </figure><p>A huge storm rolled across the eastern United States last night, topping trees and knocking out power. Amazon Web Services (AWS) had one of their primary data centers in Virginia lose power. While data centers typically have backup generators for when they lose power from the grid, it appears something in the backup systems failed and AWS&#39;s EC2 Northern Virginia region went offline. That took down much of Netflix, Pinterest, Instagram, and other services that rely on Amazon&#39;s cloud hosting service.</p><p>My favorite comment on the incident came from Phil Kaplan (<a href=\"https://twitter.com/pud\">@pud</a>) who <a href=\"https://twitter.com/pud/status/218952182182064128\">tweeted</a>: &quot;The cloud is no match for the clouds.&quot; It got me thinking about the different types of &quot;cloud&quot; services, their different sensitivities to failure, and how they can be made more resilient.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"cumulus-stratus-cirrus-nimbus\">Cumulus, Stratus, Cirrus, Nimbus</h3>\n            <a href=\"#cumulus-stratus-cirrus-nimbus\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>There are a lot of different products that call themselves &quot;cloud&quot; services. What that means, however, is very different from one service to another. For example, Salesforce.com was among the first to trumpet the benefits of the cloud. In their case, they were comparing themselves against traditional customer relationship management (CRM) systems that required you to run your own database and maintain your own hardware. In Salesforce.com&#39;s case, &quot;cloud&quot; means you can run a specialized application (CRM) on someone else&#39;s equipment and pay for it as a service.</p><p>For their core CRM product, Salesforce.com runs their own hardware in multiple locations around the world. However, Salesforce.com purchased another &quot;cloud&quot; service provider called Heroku. Heroku was originally built as a platform to run applications written for the Ruby programming language. It has expanded over time to provide support for other languages including Java, Node.js, Scala, Clojure and Python. Where Salesforce.com&#39;s original cloud service allowed you to run their CRM application as a service, Heroku lets you run any application you want from their managed platform.</p><p>Salesforce.com runs on the company&#39;s own servers, but Heroku runs atop Amazon&#39;s AWS service. In other words, Heroku provides a cloud service that makes it easier to write and deploy your own applications, but they use someone else&#39;s infrastructure to deploy it. Before everyone started calling all these &quot;cloud&quot; services, the analysts gave them more specific names that started with a letter and always ended with &quot;aaS.&quot; Salesforce.com was Software as a Service (SaaS), Heroku was Platform as a Service (PaaS), and AWS was Infrastructure as a Service (IaaS).</p><p>I&#39;d add a further distinction: the three cloud services I&#39;ve mentioned so far are all what I&#39;d call Data &amp; Application (D&amp;A) cloud service. In one way or another, they let you store data and process without having to think about the underlying hardware. They may all be cloud services, but they are very different from what we&#39;re building at CloudFlare (more on that in a bit).</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"servers-all-the-way-down\">Servers All the Way Down</h3>\n            <a href=\"#servers-all-the-way-down\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>In Hindu mythology, there story that talks about how the world is supported on the back of a giant turtle. Steven Hawking&#39;s book <i>A Brief History of Time</i> included an anecdote about a scientist giving a lecture to the public on the structure of the universe:</p><blockquote><p>At the end of the lecture, a little old lady at the back of the room got up and said: &quot;What you have told us is rubbish. The world is really a flat plate supported on the back of a giant tortoise.&quot; The scientist gave a superior smile before replying, &quot;What is the tortoise standing on?&quot; &quot;You&#39;re very clever, young man, very clever,&quot; said the old lady. &quot;But it&#39;s turtles all the way down!&quot;</p></blockquote>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7M1uT1Jsdz95kM0AUmobfX/d14371e8889705e37606c3b829b3d0ee/turtles_all_the_way_down.jpg.scaled500.jpg\" alt=\"Thoughts on the AWS outage: making the cloud more resilient to failure\" class=\"kg-image\" width=\"392\" height=\"401\" loading=\"lazy\"/>\n            \n            </figure><p>While it&#39;s easy to forget with the abstractions provided by these services, under all these clouds are servers, switches, and routers. If you&#39;re using Salesforce.com for CRM and your company adds a large number of new customers, you don&#39;t need to think about adding more drives or servers to scale up. Instead, Salesforce.com handles the process of adding capacity across its hardware. If you&#39;re developing on top of a cloud service like AWS&#39;s EC2, as your application scales you can &quot;spin up&quot; new instances to provide more computational power. These instances are fractions of the capacity on a physical server which may be shared with other EC2 users. Because each EC2 customer only uses whatever isnecessary for their application, the utilization rates across the servers is very high.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"when-clouds-go-boom\">When Clouds Go Boom</h3>\n            <a href=\"#when-clouds-go-boom\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>It is inevitable that the hardware that makes up these clouds will, from time to time, fail. Spinning hard drives crash, memory goes bad, CPUs overheat, routers flake out, or someone disconnects the wrong power circuit bringing a whole rack of equipment offline. When those pieces of hardware fail, different cloud services will react in different ways.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3lvOuxWUqg5Bc6J47J6750/8790b6c7e96bc026a84e42a791df13e1/storm_clouds.jpg.scaled500.jpg\" alt=\"Thoughts on the AWS outage: making the cloud more resilient to\nfailure\" class=\"kg-image\" width=\"500\" height=\"333\" loading=\"lazy\"/>\n            \n            </figure><p>Salesforce.com runs their own hardware and their own software. They have created systems that replicate the application itself across multiple hardware systems. If one system fails, a load balancer switches to a different hardware system to process the request. Customers&#39; data stored with Salesforce.com is also replicated by the software. While I don&#39;t know the explicit details of Salesforce.com&#39;s redundancy strategy, it&#39;s a safe bet that they use RAID to replicate data between multiple disks that are part of a storage array and backup to some long term storage in case of a major failure. They also likely replicate data betweenmultiple storage arrays within a particular data center and, maybe, replicate the data between data centers.</p><p>Replicating data is relatively easy. Replicating data and keeping it in sync is hard. The problem becomes harder if the locations are geographically separated. The speed of light is very fast, but it still takes a photon of light traveling under perfect conditions nearly <a href=\"http://www.wolframalpha.com/input/?i=2+*+%28distance+from+Amsterdam+to+san+francisco+in+kilometers+%2F+%28speed+of+light+in+kilometers+per+millisecond%29%29\">60ms to roundtrip from San Francisco to Amsterdam</a>. It&#39;s slower through the actual fiber and copper cables that make up the Internet, and much, much slower when you take into account the <a href=\"/the-bandwidth-of-a-boeing-747-and-its-impact\">real world performance of the Internet</a>. If two people change the same piece of data in two locations during the latency window between updates, very unpredictable bad things can happen.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"the-challenge-of-being-in-sync\">The Challenge of Being in Sync</h3>\n            <a href=\"#the-challenge-of-being-in-sync\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>For certain systems, replicating data is easier than others. Compare Google and Twitter. If you&#39;re running a search on Google you&#39;ll hit one of the company&#39;s many geographically distributed data centers and get aset of results. Someone else running a different search hitting adifferent data center may get slightly different results. Google doesn&#39;t promise that everyone will see the same search results. As a result, they have a relatively straight forward data replication problem. The data that makes up Google&#39;s index will be &quot;eventually consistent&quot; across all their facilities, but that doesn&#39;t harm the underlying application.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2hihBJTyiNu2ODfGzMinRy/72e9dcc84286a1f419eb30595e832e93/nsync.jpg.scaled500.jpg\" alt=\"Thoughts on the AWS outage: making the cloud more resilient to failure\" class=\"kg-image\" width=\"270\" height=\"180\" loading=\"lazy\"/>\n            \n            </figure><p>Twitter, on the other hand, promises that you&#39;ll see real time updates from the people you follow. This creates a much more difficult data replication problem and explains why Twitter has a much more centralized infrastructure and continues to experience many more scaling pains. Facebook provides an interesting case study as well. As Facebook has scaled, they have deemphasized real time updates to timeline in order to make it easier to scale their infrastructure.</p><p>Twitter, Facebook, Google (with their new emphasis on products that require more data synchronization), and a lot of other smart people are working ways to mitigate the problem of data replication and synchronization but the speed of light is only so fast and at some level you&#39;ll always bump into the laws of physics. What is key, however, is that choosing to host in the cloud alone is not sufficient to ensure your application is fault tolerant. The data and application layer remain difficult to scale, and even with a service like AWS creating resiliency still requires programmers to make their application servers redundant and replicate their data to the extent possible and practical.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"front-end-layer-scaling\">Front End Layer Scaling</h3>\n            <a href=\"#front-end-layer-scaling\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>While data synchronization makes geographic scaling of the Data &amp; Application layer difficult, there is a part of the web application stack that is a natural candidate for massively distributed scaling: the Front End layer. All web services have a front end. It is the part of the service that receives the requests and hands it off to the application to begin churning. The front end layer also returns the response from the application and databases back to the user that requested it.</p><p>Unlike the Data &amp; Application layer, the Front End layer doesn&#39;t need specific knowledge about the application. This means it can be distributed geographically without special application logic or a need for complex data replication strategies. The Front End layer can help tune the response from the Data &amp; Application layer depending on the characteristics of the user. For example, rather than the Data &amp; Application layer changing the presentation of a response based on whether someone is on an iPad or Internet Explorer on a desktop PC, the Front End layer can handle the response.</p><p>The Front End layer can also shield the Data &amp; Application layer from potential threats and attacks. In fact, if you use a protocol like Anycast to route requests geographically, you can isolate attacks or any network problems to only impact a small part of the overall system.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"front-end-in-the-cloud-ftw\">Front End In the Cloud FTW</h3>\n            <a href=\"#front-end-in-the-cloud-ftw\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>While there remains hesitation in some quarters to turn over the Data &amp; Application layer to the cloud, moving the Front End layer to the cloud is a no-brainer. That, of course, is exactly what we&#39;ve built at CloudFlare: a scalable front end layer that can run in front of any web application to help it better scale. What&#39;s powerful is that any web site or application can provision CloudFlare simply by making a DNS change. Since the Front End layer doesn&#39;t need to synchronize data, CloudFlare can begin working to accelerate and protect web traffic immediately and without any changes to the Data &amp; Application layer.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/Vrt4GyaYpuCEoicyecNL8/8b399933c7f00b63b9d6fb50f05824b3/cloudflare_literally.png.scaled500.png\" alt=\"Thoughts on the AWS outage: making the cloud more resilient to\nfailure\" class=\"kg-image\" width=\"500\" height=\"343\" loading=\"lazy\"/>\n            \n            </figure><p>Because we&#39;ve focused on the Front End layer, CloudFlare&#39;s scaling and failure characteristics are very favorable to traditional Data &amp; Application cloud services. Today, for instance, we had a hardware failure in our San Jose data center. Most customers never noticed because 1) it only impacted a limited number of visitors in the region; and 2) we were able to quickly and gracefully fail the data center out and traffic automatically shifted to the next closest data center. The logic to make this graceful failover didn&#39;t need to be constructed by our customers&#39; programmers at the application layer because the Front End layer doesn&#39;t need the same synchronization as the Data &amp; Application layer.</p><p>We&#39;ve also worked to make sure that our Front End layer continues to serve static content when one of our customers&#39; Data &amp; Application layer goes down. One of the ways we first get word when AWS or another major host is struggling is when our customers write to us letting us know that they&#39;d be entirely offline if not for our Always Online™ feature. We&#39;ve got some big improvements to Always Online coming out over the next few weeks which will make the feature even better.</p><p>Going forward, we will continue to make scaling web application easier by providing services like intelligent load balancing between various Data &amp; Application service providers both to maximize performance and also to ensure availability. Moreover, since every CloudFlare customer gets the benefit of all our data centers, as we continue to build out our network it inherently becomes more resilient to failure. Over the next month, we&#39;ll be turning on 9 new <a href=\"http://www.cloudflare.com/network-map\">data center locations</a> to further expand our network. While I expect the decision of where to host your Data &amp; Application layer will remain vexing, we&#39;re working to make using CloudFlare as your Front End layer a <a href=\"http://www.cloudflare.com/testimonials#page=aroundtheweb\">no-brainer</a>.</p>",
		"id": "2zBmNqzC5HWCeDUGIz8wj6",
		"localeList": {
			"name": "Thoughts on the AWS outage: making the cloud more resilient to failure Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2012-06-30T20:56:00.000+01:00",
		"slug": "thoughts-on-the-aws-outage-the-failure-charac",
		"tags": [
			{
				"id": "4xYkcVnnMwHSYkL19IbOFd",
				"name": "AWS",
				"slug": "aws"
			},
			{
				"id": "4rZ8fMZpcTMTfeMlIh6pdJ",
				"name": "EC2",
				"slug": "ec2"
			},
			{
				"id": "4yliZlpBPZpOwBDZzo1tTh",
				"name": "Outage",
				"slug": "outage"
			}
		],
		"title": "Thoughts on the AWS outage: making the cloud more resilient to failure",
		"updated_at": "2024-08-27T02:49:25.482Z",
		"url": "https://blog.cloudflare.com/thoughts-on-the-aws-outage-the-failure-charac"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}