{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "6",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Javier Castro",
				"slug": "javier",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3hJsvxP0uRGmk4DjS9IdSW/5c219d8500bfab4131dc4394ce1190a7/javier.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			},
			{
				"name": "Alexandra Moraru",
				"slug": "alexandra",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/URwbDrA0k9GNtNsCsAC7N/01aed0a80ca42a6fe058097aa2992f86/alexandra.png",
				"location": "London",
				"website": null,
				"twitter": "@alexandramoraru",
				"facebook": null
			}
		],
		"excerpt": "Our Security Center now houses Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs). These features are available via API as well and Cloudforce One customers can start leveraging them today for enhanced security analysis",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/1o2ccusa80MOqWpArGoK6N/2dae17631333e9f6d2be2b5c54ebb3d5/threat-intel-rfi-pir.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3dVTzn72D5tpx8uhtK9Vit/c5e05a44d7b9c32dca0d2a8ad64c0649/image4-25.png\" alt=\"Introducing Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs) for threat intelligence teams\" class=\"kg-image\" width=\"1800\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p><a href=\"/introducing-cloudforce-one-threat-operations-and-threat-research/\">Cloudforce One</a> is our threat operations and research team. Its primary objective: track and disrupt threat actors targeting Cloudflare and the customer systems we protect. <a href=\"https://www.cloudflare.com/en-gb/application-services/products/cloudforceone/\">Cloudforce One customers</a> can engage directly with analysts on the team to help understand and stop the specific threats targeting them.</p><p>Today, we are releasing in general availability two new tools that will help Cloudforce One customers get the best value out of the service by helping us prioritize and organize the information that matters most to them: Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs). We’d also like to review how we’ve used the Cloudflare <a href=\"https://developers.cloudflare.com/workers/\">Workers</a> and <a href=\"https://developers.cloudflare.com/pages\">Pages</a> platform to build our internal pipeline to not only perform investigations on behalf of our customers, but conduct our own internal investigations of the threats and attackers we track.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-are-requests-for-information-rfis\">What are Requests for Information (RFIs)?</h3>\n            <a href=\"#what-are-requests-for-information-rfis\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>RFIs are designed to streamline the process of accessing critical intelligence. They provide an avenue for users to submit specific queries and requests directly into Cloudforce One&#39;s analysis queue. Essentially, they are a well-structured way for you to tell the team what to focus their research on to best support your security posture.</p><p>Each RFI filed is routed to an analyst and treated as a targeted call for information on specific threat elements. From malware analysis to <a href=\"https://www.cloudflare.com/learning/ddos/what-is-a-ddos-attack/\">DDoS attack</a> analysis, we have a group of seasoned threat analysts who can provide deeper insight into a wide array of attacks. Those who have found RFIs invaluable typically belong to <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-a-security-operations-center-soc/\">Security Operation Centers</a>, Incident Response Teams, and Threat Research/Intelligence teams dedicated to supporting internal investigations within an organization. This approach proves instrumental in unveiling potential vulnerabilities and enhancing the understanding of the security posture, especially when confronting complex risks.</p><p>Creating an RFI is straightforward. Through the Security Center dashboard, users can create and track their RFIs:</p><ol><li><p><b>Submission</b>: Submit requests via Cloudforce One RFI Dashboard:a. Threat: The threat or campaign you would like more information onb. Priority: routine, high or urgentc. Type: Binary Analysis, Indicator Analysis, Traffic Analysis, Threat Detection Signature, Passive DNS Resolution, DDoS Attack or Vulnerabilityd. Output: Malware Analysis Report, Indicators of Compromise, or Threat Research Report</p></li><li><p><b>Tracking</b>: Our Threat Research team begins work and the customer can track progress (open, in progress, pending, published, complete) via the RFI Dashboard. Automated alerts are sent to the customer with each status change.</p></li><li><p><b>Delivery</b>: Customers can access/download the RFI response via the RFI Dashboard.</p></li></ol>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4ovThbZzH3fMIT7aBbHqcP/70cc4c51d9566a38d535a94793bde3c6/pasted-image-0-7.png\" alt=\"Fabricated example of the detailed view of an RFI and communication with the Cloudflare Threat Research Team\" class=\"kg-image\" width=\"1600\" height=\"1335\" loading=\"lazy\"/>\n            \n            </figure><p><i>Fabricated example of the detailed view of an RFI and communication with the Cloudflare Threat Research Team</i></p><p>Once an RFI is submitted, teams can stay informed about the progress of their requests through automated alerts. These alerts, generated when a Cloudforce One analyst has completed the request, are delivered directly to the user’s email or to a team chat channel via a webhook.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-are-priority-intelligence-requirements-pirs\">What are Priority Intelligence Requirements (PIRs)?</h3>\n            <a href=\"#what-are-priority-intelligence-requirements-pirs\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Priority Intelligence Requirements (PIRs) are a structured approach to identifying intelligence gaps, formulating precise requirements, and organizing them into categories that align with Cloudforce One&#39;s overarching goals. For example, you can create a PIR signaling to the Cloudforce One team what topic you would like more information on.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/58S0RVvoHSSuMenctFVdVH/614ab7fd48520567a043c977b6a9bd9f/Screenshot-2024-03-08-at-15.44.24.png\" alt=\"PIR dashboard with fictitious examples of priority intelligence requirements\" class=\"kg-image\" width=\"1868\" height=\"1426\" loading=\"lazy\"/>\n            \n            </figure><p><b>PIR dashboard with fictitious examples of priority intelligence requirements</b></p><p>PIRs help target your intelligence collection efforts toward the most relevant insights, enabling you to make informed decisions and <a href=\"https://www.cloudflare.com/cybersecurity-risk-management/\">strengthen your organization&#39;s cybersecurity posture</a>.</p><p>While PIRs currently offer a framework for prioritizing intelligence requirements, our vision extends beyond static requirements. Looking ahead, our plan is to evolve PIRs into dynamic tools that integrate real-time intelligence from Cloudforce One. Enriching PIRs by integrating them with real-time intelligence from Cloudforce One will provide immediate insights into your Cloudflare environment, facilitating a direct and meaningful connection between ongoing threat intelligence and your predefined intelligence needs.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"what-drives-cloudforce-one\">What drives Cloudforce One?</h3>\n            <a href=\"#what-drives-cloudforce-one\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Since our inception, Cloudforce One has been actively collaborating with our Security Incident Response Team (SIRT) and Trust and Safety (T&amp;S) team, aiming to provide valuable insights into attacks targeting Cloudflare and counteract the misuse of Cloudflare services. Throughout these investigations, we recognized the need for a centralized platform to capture insights from Cloudflare&#39;s unique perspective on the Internet, aggregate data, and correlate reports.</p><p>In the past, our approach would have involved deploying a frontend UI and backend API in a core data center, leveraging common services like Postgres, Redis, and a Ceph storage solution. This conventional route would have entailed managing Docker deployments, constantly upgrading hosts for vulnerabilities, and dealing with a complex environment where we must juggle secrets, external service configurations, and maintaining availability.</p><p>Instead, we welcomed being <a href=\"https://www.cloudflare.com/the-net/top-of-mind-security/customer-zero/\">Customer Zero</a> for Cloudflare and fully embraced Cloudflare&#39;s Workers and Pages platforms to construct a powerful threat investigation tool, and since then, we haven’t looked back. For anyone that has used Workers in the past, much of what we have done is not revolutionary, but almost commonplace given the ease of configuring and implementing the features in Cloudflare Workers. We routinely store file data in <a href=\"https://developers.cloudflare.com/r2\">R2</a>, metadata in <a href=\"https://developers.cloudflare.com/kv\">KV</a>, and indexed data in <a href=\"https://developers.cloudflare.com/d1\">D1</a>. That being said, we do have a few non-standard deployments as well, further outlined below.</p><p>Altogether, our Threats Investigation architecture consists of five services, four of which are deployed at the edge with the other one deployed in our core data centers due to data dependency constraints.</p><ul><li><p><b>RFIs &amp; PIRs</b>: This API manages our formal Cloudforce One requests and customer priorities submitted via the Cloudflare Dashboard.</p></li><li><p><b>Threats:</b> Our UI, deployed via Pages, serves as the interface for interacting with all of our Cloudforce One services, Cloudflare internal services, and the RFIs and PIRs submitted by our customers.</p></li><li><p><b>Cases</b>: A case management system that allows analysts to store notes, Indicators of Compromise (IOCs), malware samples, and data analytics related to an attack. The service provides live updates to all analysts viewing the case, facilitating real-time collaboration. Each case is a Durable Object that is connected to via a Websocket that stores “files” and “file content” in the Durable Object’s persistent storage. Metadata for the case is made searchable via D1.</p></li><li><p><b>Leads</b>: A queue of informal internal and external requests that may be reviewed by Cloudforce One when doing threat hunting discovery. Lead content is stored into KV, while metadata and extracted IOCs are stored in D1.</p></li><li><p><b><b><b>Binary DB:</b></b></b> A raw binary file warehouse for any file we come across during our investigation. Binary DB also serves as the repository for malware samples used in some of our machine learning training. Each file is stored in R2, with its associated metadata stored in KV.</p></li></ul>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/w9NH6Cz20Uu6bRKwzeQzN/9f9cf2425b4834461c9075cad1186a14/image1-29.png\" alt=\"Cloudforce One Threat Investigation Architecture\" class=\"kg-image\" width=\"1986\" height=\"1130\" loading=\"lazy\"/>\n            \n            </figure><p><i>Cloudforce One Threat Investigation Architecture</i></p><p>At the heart of our Threats ecosystem is our case management service built on Workers and Durable Objects. We were inspired to build this tool because we often had to jump into collaborative documents that were not designed to store forensic data, organize it, mark sections with <a href=\"https://www.cisa.gov/news-events/news/traffic-light-protocol-tlp-definitions-and-usage\">Traffic Light Protocol</a> (TLP) releasability codes, and relate analysis to existing RFIs or Leads.</p><p>Our concept of cases is straightforward — each case is a Durable Object that can accept HTTP REST API or <a href=\"https://developers.cloudflare.com/durable-objects/learning/websockets/\">WebSocket</a> connections. Upon initiating a WebSocket connection, it is seamlessly incorporated into the Durable Object&#39;s in-memory state, allowing us to instantly broadcast real-time events to all users engaged with the case. Each case comprises distinct folders, each housing a collection of files containing content, releasability information, and file metadata.</p><p>Practically, our Durable Object leverages its persistent storage with each storage key prefixed with the value type: “case”, “folder”, or “file” followed by the UUID assigned to the file. Each case value has metadata associated with the case and a list of folders that belong to the case. Each folder has the folder’s name and a list of files that belong to it.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/22WN1PQAbDZHhEQonQnuVi/a5929e7faf90429a7e18b4ad851f0b99/image5-17.png\" alt=\"\" class=\"kg-image\" width=\"1588\" height=\"721\" loading=\"lazy\"/>\n            \n            </figure><p>Our internal Threats UI helps us tie together the service integrations with our threat hunting analysis. It is here we do our day-to-day work which allows us to bring our unique insights into Cloudflare attacks. Below is an example of our Case Management in action where we tracked the <a href=\"/malicious-redalert-rocket-alerts-application-targets-israeli-phone-calls-sms-and-user-information\">RedAlerts attack</a> before we formalized our analysis into the blog.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2e2DI2UBqkXEshsi3eeh3z/8e173542efd2410b862419ee24741b92/image2-25.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"981\" loading=\"lazy\"/>\n            \n            </figure><p>What good is all of this if we can’t search it? The <a href=\"https://developers.cloudflare.com/workers-ai\">Workers AI</a> team launched <a href=\"https://developers.cloudflare.com/vectorize\">Vectorize</a> and enabled inference on the edge, so we decided to go all in on Workers and began indexing all case files as they’re being edited so that they can be searched. As each case file is being updated in the Durable Object, the content of the file is pushed to <a href=\"https://developers.cloudflare.com/queues/\">Cloudflare Queues</a>. This data is consumed by an indexing engine consumer that does two things: extracts and indexes indicators of compromise, and embeds the content into a vector and pushes it into Vectorize. Both of the search mechanisms also pass the reference case and file identifiers so that the case may be found upon searching.</p><p>Given how easy it is to set up Workers AI, we took the final step of implementing a full <a href=\"https://developers.cloudflare.com/workers-ai/tutorials/build-a-retrieval-augmented-generation-ai/\">Retrieval Augmented Generation (RAG)</a> AI to allow analysts to ask questions about our previous analysis. Each question undergoes the same process as the content that is indexed. We pull out any indicators of compromise and embed the question into a vector, so we can use both results to search our indexes and Vectorize respectively, and provide the most relevant results for the request. Lastly, we send the vector data to a text-generation model using Workers AI that then returns a response to our analysts.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7jVrsni5cUJ9kv0iXuLimo/63d3f8352968d88acc587e30e611bf0b/image3-28.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"368\" loading=\"lazy\"/>\n            \n            </figure>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"using-rfis-and-pirs\">Using RFIs and PIRs</h3>\n            <a href=\"#using-rfis-and-pirs\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Imagine submitting an RFI for “Passive DNS Resolution - IOCs” and receiving real-time updates directly within the PIR, guiding your next steps.</p><p>Our workflow ensures that the intelligence you need is not only obtained but also used optimally. This approach empowers your team to tailor your intelligence gathering, strengthening your cybersecurity strategy and security posture.</p><p>Our mission for Cloudforce One is to equip organizations with the tools they need to stay one step ahead in the rapidly changing world of cybersecurity. The addition of RFIs and PIRs marks another milestone in this journey, empowering users with enhanced threat intelligence capabilities.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"getting-started\">Getting started</h3>\n            <a href=\"#getting-started\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Cloudforce One customers can already see the PIR and RFI Dashboard in their Security Center, and they can also use the API if they prefer that option. Click to see more documentation about our <a href=\"https://developers.cloudflare.com/api/operations/cloudforce-one-request-list\">RFI</a> and our <a href=\"https://developers.cloudflare.com/api/operations/cloudforce-one-priority-list\">PIR</a> APIs.</p><p>If you’re looking to try out the new RFI and PIR capabilities within the Security Center, contact your Cloudflare account team or fill out <a href=\"https://www.cloudflare.com/en-gb/zero-trust/lp/cloudforce-one-threat-intel-subscription/?cf_target_id=99B9BF88D6D4607E503427CE17D61E89\">this form</a> and someone will be in touch. Finally, if you’re interested in joining the Cloudflare team, check out our open job postings <a href=\"https://www.cloudflare.com/en-gb/careers/?cf_target_id=96C6F98DE231254296C355D2DDABBF2E\">here</a>.</p>",
		"id": "4bKTNfcYPf9CVYUB1yStOQ",
		"localeList": {
			"name": "Introducing Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs) for threat intelligence teams Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Our Security Center now houses Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs). These features are available via API as well and Cloudforce One customers can start leveraging them today for enhanced security analysis",
		"metadata": {
			"title": "Introducing Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs) for threat intelligence teams",
			"description": "Our Security Center now houses Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs). These features are available via API as well and Cloudforce One customers can start leveraging them today for enhanced security analysis",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7tiAnfabkjqQsqCKCxy1qt/fcce8dd097cf19fd1c077e67078c6132/threat-intel-rfi-pir-PU75t9.png"
		},
		"primary_author": {},
		"published_at": "2024-03-08T14:00:13.000+00:00",
		"slug": "threat-intel-rfi-pir",
		"tags": [
			{
				"id": "3DmitkNK6euuD5BlhuvOLW",
				"name": "Security Week",
				"slug": "security-week"
			},
			{
				"id": "3GUtnWmux4qZOUh5OjIljE",
				"name": "Cloudforce One",
				"slug": "cloudforce-one"
			},
			{
				"id": "6Mp7ouACN2rT3YjL1xaXJx",
				"name": "Security",
				"slug": "security"
			},
			{
				"id": "6hv2Z69PGr0qU411KfQNUE",
				"name": "Threat Intelligence",
				"slug": "threat-intelligence"
			},
			{
				"id": "36Dg2NwTgUHhrlE0FRpSdJ",
				"name": "Application Services",
				"slug": "application-services"
			},
			{
				"id": "3Q4ynfOKvG4H3c86WnGto8",
				"name": "Visibility",
				"slug": "visibility"
			}
		],
		"title": "Introducing Requests for Information (RFIs) and Priority Intelligence Requirements (PIRs) for threat intelligence teams",
		"updated_at": "2024-08-27T00:59:31.730Z",
		"url": "https://blog.cloudflare.com/threat-intel-rfi-pir"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}