{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Pooya Jaferian (Guest Blogger)",
				"slug": "pooya-jaferian",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7iT7FAc2GlFk6MOwtlEycp/0fb4be051b7c2e1543ec9abb7cebf2db/pooya-jaferian.png",
				"location": null,
				"website": null,
				"twitter": "@pooyaj",
				"facebook": null
			},
			{
				"name": "Tasha Alfano (Guest Author)",
				"slug": "tasha-alfano",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3uOnilcgBxEHIXXpBCf4uk/65fa3903249539526fc07e79e94ccb32/tasha-alfano.png",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "With Segment Edge SDK, built on Cloudflare Workers, developers can collect high-quality first-party data and use Segment Edge SDK to access real-time user profiles and state, to deliver personalized app experiences without managing a ton of infrastructure. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/3Z7E3PyozQkfm4k3ULKNAe/6c1ff83adce466754af9650c3229242c/twilio-segment-sdk-powered-by-cloudflare-workers.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7Icsnq0MfraKeAfhZuKsdH/e875e3c489466b5ac84ba087911d1220/image3-41.png\" alt=\"Twilio Segment Edge SDK Powered by Cloudflare Workers\" class=\"kg-image\" width=\"1800\" height=\"1013\" loading=\"lazy\"/>\n            \n            </figure><p>The Cloudflare team was so excited to hear how Twilio Segment solved problems they encountered with tracking first-party data and personalization using Cloudflare Workers. We are happy to have guest bloggers Pooya Jaferian and Tasha Alfano from Twilio Segment to share their story.</p><h2>Introduction</h2><p>Twilio Segment is a customer data platform that collects, transforms, and activates first-party customer data. Segment helps developers collect user interactions within an application, form a unified customer record, and sync it to hundreds of different marketing, product, analytics, and data warehouse integrations.</p><p>There are two “unsolved” problem with app instrumentation today:</p><p><b>Problem #1:</b> Many important events that you want to track happen on the “wild-west” of the client, but collecting those events via the client can lead to <i>low data quality,</i> as events are dropped due to user configurations, browser limitations, and network connectivity issues.</p><p><b>Problem #2:</b> Applications need access to real-time (&lt;50ms) user state to personalize the application experience based on advanced computations and <a href=\"https://www.cloudflare.com/learning/access-management/what-is-network-segmentation/\">segmentation logic</a> that <i>must</i> be executed on the cloud.</p><p>The Segment Edge SDK – built on Cloudflare Workers – solves for both. With Segment Edge SDK, developers can collect high-quality first-party data. Developers can also use Segment Edge SDK to access real-time user profiles and state, to deliver personalized app experiences without managing a ton of infrastructure.</p><p>This post goes deep on how and why we built the Segment Edge SDK. We chose the Cloudflare Workers platform as the runtime for our SDK for a few reasons. First, we needed a scalable platform to collect billions of events per day. Workers running with no cold-start made them the right choice. Second, our SDK needed a fast storage solution, and Workers KV fitted our needs perfectly. Third, we wanted our SDK to be easy to use and deploy, and Workers’ ease and speed of deployment was a great fit.</p><p>It is important to note that the Segment Edge SDK is in early development stages, and any features mentioned are subject to change.</p><h2>Serving a JavaScript library 700M+ times per day</h2><p>analytics.js is our core JavaScript UI SDK that allows web developers to send data to any tool without having to learn, test, or use a new API every time.</p><p>Figure 1 illustrates how Segment can be used to collect data on a web application. Developers add Segment’s web SDK, <a href=\"https://segment.com/docs/connections/sources/catalog/libraries/website/javascript/\"><b>analytics.js</b></a>, to their websites by <a href=\"https://segment.com/docs/connections/sources/catalog/libraries/website/javascript/quickstart/#step-2-add-the-segment-snippet\">including a JavaScript snippet</a> to the <code>HEAD</code> of their web pages. The snippet can immediately collect and buffer events while it also loads the full library asynchronously from the Segment CDN. Developers can then use analytics.js to identify the visitors, e.g., <code>**analytics**.identify(&#39;john&#39;)</code>, and track user behavior, e.g., <code>analytics.track(&#39;**Order** **Completed**&#39;)</code>. Calling the `analytics.js methods such as <i>identify</i> or <i>track</i> will send data to Segment’s API (<code>api.segment.io</code>). Segment’s platform can then deliver the events to different tools, as well as create a profile for the user (e.g., build a profile for user “John”, associate “Order Completed”, as well as add all future activities of john to the profile).</p><p>Analytics.js also stores state in the browser as first-party cookies (e.g., storing an <code>ajs_user_id</code> cookie with the value of john, with cookie scoped at the example.com domain) so that when the user visits the website again, the user identifier stored in the cookie can be used to recognize the user.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3cFwIwnC5QZKPZ0617hgDb/f995420d5d23c273bbfd677f174219c6/image2-49.png\" alt=\"\" class=\"kg-image\" width=\"1840\" height=\"870\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 1- How analytics.js loads on a website and tracks events</p><p>While analytics.js only tracks first-party data (i.e., the data is collected and used by the website that the user is visiting), certain browser controls incorrectly identify analytics.js as a third-party tracker, because the SDK is loaded from a third-party domain (cdn.segment.com) and the data is going to a third-party domain (api.segment.com). Furthermore, despite using first-party cookies to store user identity, some browsers such as Safari have limited the TTL for non-HTTPOnly cookies to 7-days, making it challenging to maintain state for long periods of time.</p><p>To overcome these limitations, we have built a Segment Edge SDK (currently in early development) that can automatically add Segment’s library to a web application, eliminate the use of third-party domains, and maintain user identity using HTTPOnly cookies. In the process of solving the first-party data problem, we realized that the Edge SDK is best positioned to act as a personalization library, given it has access to the user identity on every request (in the form of cookies), and it can resolve such identity to a full-user profile stored in Segment. The user profile information can be used to deliver personalized content to users directly from the Cloudflare Workers platform.</p><p>The remaining portions of this post will cover how we solved the above problems. We first explain how the Edge SDK helps with first-party collection. Then we cover how the Segment profiles database becomes available on the Cloudflare Workers platform, and how to use such data to drive personalization.</p><h2>Segment Edge SDK and first-party data collection</h2><p>Developers can set up the Edge SDK by creating a Cloudflare Worker sitting in front of their web application (via <a href=\"https://developers.cloudflare.com/workers/platform/routing/routes\">Routes</a>) and importing the Edge SDK via npm. The Edge SDK will handle requests and automatically injects analytics.js snippets into every webpage. It also configures first-party endpoints to download the SDK assets and send tracking data. The Edge SDK also captures user identity by looking at the Segment events and instructs the browser to store such identity as HTTPOnly cookies.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">import { Segment } from &quot;@segment/edge-sdk-cloudflare&quot;;\n\nexport default {\n   async fetch(request: Request, env: Env): Promise&lt;Response&gt; {\n       const segment = new Segment(env.SEGMENT_WRITE_KEY); \n\n       const resp = await segment.handleEvent(request, env);\n\n       return resp;\n   }\n};</pre></code>\n            <h2>How the Edge SDK works under the hood to enable first-party data collection</h2><p>The Edge SDK&#39;s internal router checks the inbound request URL against predefined patterns. If the URL matches a route, the router runs the route&#39;s chain of handlers to process the request, fetch the origin, or modify the response.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">export interface HandlerFunction {\n (\n   request: Request,\n   response: Response | undefined,\n   context: RouterContext\n ): Promise&lt;[Request, Response | undefined, RouterContext]&gt;;\n}</pre></code>\n            <p>Figure 2 demonstrates the routing of incoming requests. The Worker calls  <code>segment.handleEvent</code> method with the request object (step 1), then the router matches the <code>request.url</code> and <code>request.method</code> against a set of predefined routes:</p><ul><li><p>GET requests with <code>/seg/assets/*</code> path are proxied to Segment CDN (step 2a)</p></li><li><p>POST requests with <code>/seg/events/*</code> path are proxied to Segment tracking API (step 2b)</p></li><li><p>Other requests are proxied to the origin (step 2c) and the HTML responses are enriched with the analytics.js snippet (step 3)</p></li></ul><p>Regardless of the route, the router eventually returns a response to the browser (step 4) containing data from the origin, the response from Segment tracking API, or analytics.js assets. When Edge SDK detects the user identity in an incoming request (more on that later), it sets an HTTPOnly cookie in the response headers to persist the user identity in the browser.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/7cKXch0aUGqaIrvETjhR3K/ee302362d172b7e8062e08a9fb871aec/image1-65.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"959\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 2- Edge SDK router flow‌‌</p><p>In the subsequent three sections, we explain how we inject analytics.js, proxy Segment endpoints, and set server-side cookies.</p><h3>Injecting Segment SDK on requests to origin</h3><p>For all the incoming requests routed to the origin, the Edge SDK fetches the HTML page and then adds the analytics.js snippet to the <code>&lt;HEAD&gt;</code> tag, embeds the <a href=\"https://segment.com/docs/getting-started/02-simple-install/#find-your-write-key\">write key</a>, and configures the snippet to download the subsequent javascript bundles from the first-party domain <code>([first-party host]/seg/assets/*)</code> and sends data to the first-party domain as well <code>([first-party host]/seg/events/*)</code>. This is accomplished using the <a href=\"https://developers.cloudflare.com/workers/runtime-apis/html-rewriter/\">HTMLRewriter</a> API.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">import snippet from &quot;@segment/snippet&quot;; // Existing Segment package that generates snippet\n\nclass ElementHandler {\n   constructor(host: string, writeKey: string)\n\n   element(element: Element) {\n     // generate Segment snippet and configure it with first-party host info\n     const snip = snippet.min({\n         host: `${this.host}/seg`,\n         apiKey: this.writeKey,\n       })\n     element.append(`&lt;script&gt;${snip}&lt;/script&gt;`, { html: true });\n   }\n }\n  \nexport const enrichWithAJS: HandlerFunction = async (\n   request,\n   response,\n   context\n ) =&gt; {\n   const {\n     settings: { writeKey },\n   } = context;\n   const host = request.headers.get(&quot;host&quot;) || &quot;&quot;;\n    return [\n     request,\n     new HTMLRewriter().on(&quot;head&quot;,\n         new ElementHandler(host, writeKey))\n       .transform(response),\n     context,\n   ];\n };</pre></code>\n            <h3>Proxy SDK bundles and Segment API</h3><p>The Edge SDK proxies the Segment CDN and API under the first-party domain. For example, when the browser loads a page with the injected analytics.js snippet, the snippet loads the full analytics.js bundle from <code>https://example.com/seg/assets/sdk.js</code>, and the Edge SDK will proxy that request to the Segment CDN:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">https://cdn.segment.com/analytics.js/v1/&lt;WRITEKEY&gt;/analytics.min.js</pre></code>\n            \n            <pre class=\"language-javascript\"><code class=\"language-javascript\">export const proxyAnalyticsJS: HandlerFunction = async (request, response, ctx) =&gt; {\n const url = `https://cdn.segment.com/analytics.js/v1/${ctx.params.writeKey}/analytics.min.js`;\n const resp = await fetch(url);\n return [request, resp, ctx];\n};</pre></code>\n            <p>Similarly, analytics.js collects events and sends them via a POST request to <code>https://example.com/seg/events/[method]</code> and the Edge SDK will proxy such requests to the Segment tracking API:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">https://api.segment.io/v1/[method]</pre></code>\n            \n            <pre class=\"language-javascript\"><code class=\"language-javascript\">export const handleAPI: HandlerFunction = async (request, response, context) =&gt; {\n const url = new URL(request.url);\n const parts = url.pathname.split(&quot;/&quot;);\n const method = parts.pop();\n let body: { [key: string]: any } = await request.json();\n\n const init = {\n   method: &quot;POST&quot;,\n   headers: request.headers,\n   body: JSON.stringify(body),\n };\n\n const resp = await fetch(`https://api.segment.io/v1/${method}`, init);\n\n return [request, resp, context];\n};</pre></code>\n            <h3>First party server-side cookies</h3><p>The Edge SDK also re-writes existing client-side analytics.js cookies as HTTPOnly cookies. When Edge SDK intercepts an <code>identify</code> event e.g., <code>**analytics**.identify(&#39;john&#39;)</code>, it extracts the user identity (“john”) and then sets a server-side cookie when sending a response back to the user. Therefore, any subsequent request to the Edge SDK can be associated with “john” using request cookies.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">export const enrichResponseWithIdCookies: HandlerFunction = async (\n request, response, context) =&gt; {\n\n\n const host = request.headers.get(&quot;host&quot;) || &quot;&quot;;\n const body = await request.json();\n const userId = body.userId;\n\n […]\n\n const headers = new Headers(response.headers);\n const cookie = cookie.stringify(&quot;ajs_user_id&quot;, userId, {\n   httponly: true,\n   path: &quot;/&quot;,\n   maxage: 31536000,\n   domain: host,\n });\n headers.append(&quot;Set-Cookie&quot;, cookie);\n \n const newResponse = new Response(response.body, {\n   ...response,\n   headers,\n });\n\n return [request, newResponse, newContext];\n};</pre></code>\n            <p>Intercepting the <code>ajs_user_id</code> on the Workers, and using the cookie identifier to associate each request to a user, is quite powerful, and it opens the door for delivering personalized content to users. The next section covers how Edge SDK can drive personalization.</p><h2>Personalization on the Supercloud</h2><p>The Edge SDK offers a <code>registerVariation</code> method that can customize how a request to a given route should be fetched from the origin. For example, let&#39;s assume we have three versions of a landing page in the origin: <code>/red</code>, <code>/green</code>, and  <code>/</code> (default), and we want to deliver one of the three versions based on the visitor traits. We can use Edge SDK as follows:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">   const segment = new Segment(env.SEGMENT_WRITE_KEY); \n   segment.registerVariation(&quot;/&quot;, (profile) =&gt; {\n     if (profile.red_group) {\n       return &quot;/red&quot;\n     } else if (profile.green_group) \n       return &quot;/green&quot;\n     }\n   });\n\n   const resp = await segment.handleEvent(request, env);\n\n   return resp</pre></code>\n            <p>The <code>registerVariation</code> accepts two inputs: the path that displays the personalized content, and a decision function that should return the origin address for the personalized content. The decision function receives a profile object visitor in Segment. In the example, when users visit <code>example.com/(root path)</code>, personalized content is delivered by checking if the visitor has a <code>red_group</code> or <code>green_group</code> trait and subsequently requesting the content from either <code>/red</code> or <code>/green</code> path at the origin.</p><p>We already explained that Edge SDK knows the identity of the user via <code>ajs_user_id</code> cookie, but we haven’t covered how the Edge SDK has access to the full profile object. The next section explains how the full profile becomes available on the Cloudflare Workers platform.</p><h3>How does personalization work under the hood?</h3><p>The Personalization feature of the Edge SDK requires storage of profiles on the Cloudflare Workers platform. A <a href=\"https://developers.cloudflare.com/workers/runtime-apis/kv/\">Cloudflare KV</a> should be created for the Worker running the Edge SDK and passed to the Edge SDK during initialization. Edge SDK will store profiles in KV, where keys are the ajs_user_id, and values are the serialized profile object. To move <a href=\"https://segment.com/docs/profiles/\">Profiles</a> data from Segment to the KV, the SDK uses two methods:</p><ul><li><p><i>Profiles data push from Segment to the Cloudflare Workers platform:</i> The Segment product <a href=\"https://segment.com/docs/engage/using-engage-data/\">can sync user profiles database with different tools</a>, including pushing the data to a webhook. The Edge SDK automatically exposes a webhook endpoint under the first-party domain (e.g., <code>example.com/seg/profiles-webhook</code>) that Segment can call periodically to sync user profiles. The webhook handler receives incoming sync calls from Segment, and writes profiles to the KV.</p></li><li><p><i>Pulling data from Segment by the Edge SDK:</i> If the Edge SDK queries the KV for a user id, and doesn’t find the profile (i.e., data hasn’t synced yet), it requests the user profile from the <a href=\"https://segment.com/docs/profiles/profile-api/\">Segment API</a>, and stores it in the KV.</p></li></ul><p>Figure 3 demonstrates how the personalization flow works. In <i>step 1</i>, the user requests content for the root path ( / ), and the Worker sends the request to the Edge SDK <i>(step 2)</i>. The Edge SDK router determines that a variation is registered on the route, therefore, extracts the <code>ajs_user_id</code> from the request cookies, and goes through the full profile extraction <i>(step 3)</i>. The SDK first checks the KV for a record with the key of <code>ajs_user_id</code> value and if not found, queries Segment API to fetch the profile, and stores the profile in the KV. Eventually, the profile is extracted and passed into the decision function to decide which path should be served to the user <i>(step 4)</i>. The router eventually fetches the variation from the origin <i>(step 5)</i> and returns the response under the / path to the browser <i>(step 6).</i></p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1KzFSDxZVXQ1P7YN7IeyKC/3c7dba4b78dd268535381e96b329fe94/image4-28.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1226\" loading=\"lazy\"/>\n            \n            </figure><p>Figure 3- Personalization flow</p><h2>Summary</h2><p>In this post we covered how the Cloudflare Workers platform can help with tracking first-party data and personalization. We also explained how we built a Segment Edge SDK to enable Segment customers to get those benefits out of the box, without having to create their own DIY solution. The Segment Edge SDK is currently in early development, and we are planning to launch a private pilot and open-source it in the near future.</p>",
		"id": "6xXo9Rwt825JWe0JE45bbO",
		"localeList": {
			"name": "Twilio Segment Edge SDK powered by Cloudflare Workers Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "With Segment Edge SDK, built on Cloudflare Workers, developers can collect high-quality first-party data and use Segment Edge SDK to access real-time user profiles and state, to deliver personalized app experiences without managing a ton of infrastructure. ",
		"metadata": {
			"title": "Twilio Segment Edge SDK powered by Cloudflare Workers",
			"description": "With Segment Edge SDK, built on Cloudflare Workers, developers can collect high-quality first-party data and use Segment Edge SDK to access real-time user profiles and state, to deliver personalized app experiences without managing a ton of infrastructure. ",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7oSUQ1bIoxbotu9Zp5aSDP/ded5582297c7333bc38819ff78042034/twilio-segment-sdk-powered-by-cloudflare-workers-VLi15J.png"
		},
		"primary_author": {},
		"published_at": "2022-11-18T14:00:00.000+00:00",
		"reading_time": 9,
		"slug": "twilio-segment-sdk-powered-by-cloudflare-workers",
		"tags": [
			{
				"id": "2xCnBweKwOI3VXdYsGVbMe",
				"name": "Developer Week",
				"slug": "developer-week"
			},
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "7mFLEw3Z6dksCNAsnCMHTH",
				"name": "Guest Post",
				"slug": "guest-post"
			},
			{
				"id": "3OPPjcK7cKutTdeAjpThfG",
				"name": "Edge",
				"slug": "edge"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			},
			{
				"id": "1Efeqd1oZ7vy3xls0fdjHF",
				"name": "Agile Developer Services",
				"slug": "agile-developer-services"
			}
		],
		"title": "Twilio Segment Edge SDK powered by Cloudflare Workers",
		"updated_at": "2024-08-27T01:21:21.189Z",
		"url": "https://blog.cloudflare.com/twilio-segment-sdk-powered-by-cloudflare-workers"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}