{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "João Tomé",
				"slug": "joao-tome",
				"bio": "After years as a journalist covering technology, cinema, sports (soccer/football), and mobility (including hosting a TV show about it), I’m now telling data-driven and other stories at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/KOYiYhfI8O9WNWxB8IWk7/a87510f59b05f585ec6a0e4fd71f7352/joao-tome.jpeg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": "@emot",
				"facebook": null
			},
			{
				"name": "Fallon Blossom",
				"slug": "fallon",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/7ski10Z1RTEi5QJbuCI1lI/3e129c9147291f29244828c376da1028/fallon.jpg",
				"location": null,
				"website": null,
				"twitter": "@fallon_blossom",
				"facebook": null
			}
		],
		"excerpt": "Global in-person events are back. We present a few ideas from Web Summit 2021 about the future and where the Internet is going. Check the interviews we’ve done at the event (from the lack of Internet access to Web3). ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4hcGWPwNMk0mcGM3jFqtk/0c05e491ab6fa1f72a930500aaa4165b/web-summit-2021-internet.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5l3IE0tt6XWbCpdGDgPUaS/566ad958941f5a0143c4b45aeefcbefc/image1-73.png\" alt=\"Opening night of Web Summit 2021, at the Altice Arena in Lisbon, Portugal. Photo by Sam Barnes/Web Summit\" class=\"kg-image\" width=\"1999\" height=\"1333\" loading=\"lazy\"/>\n            \n            </figure><p>Opening night of Web Summit 2021, at the Altice Arena in Lisbon, Portugal. Photo by Sam Barnes/Web Summit</p><p>Global in-person events were back in a big way at the start of November (1-4) in Lisbon, Portugal, with Web Summit 2021 gathering more than 42,000 attendees from 128 countries. I was there to discover Internet trends and meet interesting people. What I saw was the contagious excitement of people from all corners of the world coming together for what seemed like a type of normality in a time when the Internet “is almost as important as having water”, according to Sonia Jorge from the World Wide Web Foundation.</p><p>Here’s some of what I heard in the halls.</p><p>With a lot happening on a screen, the lockdowns throughout the pandemic showed us a glimpse of what the metaverse could be, just without VR or AR headsets. Think about the way many were able to use virtual tools to work all day, learn, collaborate, order food, supplies, and communicate with friends and family — all from their homes.</p><p>While many had this experience, many others were unable to, with some talks at the event focusing on the <a href=\"https://en.wikipedia.org/wiki/Digital_divide\">digital divide</a> and how “Internet access is a basic human right”, according to the grandson of Nelson Mandela — we interviewed him, and you can watch the conversation below.</p><p>The future already has some paths laid out, and many were discussed at the event.</p><p>The pandemic helped to accelerate most of them, especially by bringing more people (in some countries) to the digital world.</p><p>The CPO of Meta, Chris Cox, shared how the company previously known as Facebook has some ideas about the future of augmented reality, and how they want to see those ideas play out in the next five to 10 years. “We want to get the conversation going,” he said.</p><p>Also present at the event was Jon Vlassopulos, Global Head of Music, Roblox. He explained how virtual concerts on the video game platform could be the future of music performances, and even bring free tickets to fans of famous music stars like Adele. Stars like Zara Larsson, KSI and Ava Max have already performed on Roblox and “they’re making big money from selling digital merchandise”.</p><p>On the other hand, Paddy Cosgrave, CEO of Web Summit, says that there’s something magical about in-person big events that can’t be replicated in full online events. However, the real and virtual world can complement each other — it was announced that CES 2022 will use a combination of Web Summit online and offline software.</p><p>Web3 was another big part of the discussion, sometimes in clear sight, other times embedded in the many conversations about blockchain, NFTs and cryptocurrencies, and as <a href=\"/what-is-web3/\">a vision for a decentralized web</a> (we’re actually <a href=\"/announcing-web3-gateways/\">working on that</a>).</p><p>Speakers also focused on data privacy and security, ethics in AI and data protection. Ownership to the user and <a href=\"https://www.cloudflare.com/learning/privacy/what-is-data-sovereignty/\">sovereignty</a> were topics discussed and emphasized by Sir Tim Berners-Lee on the last day of the event.</p><p>The workplace was also a popular topic, as well as the changes it underwent in the past couple of years. We heard about the importance of diversity in the workplace, as well as the future of work — is it going to be flexible, hybrid, full remote or something in between? Speakers also mentioned <a href=\"https://en.wikipedia.org/wiki/Great_Resignation\">The Great Resignation</a> and the <a href=\"https://www.weforum.org/focus/the-great-reset\">reset</a> of people’s and organizations’ mindsets.</p><p>Using AI to hire and motivate people was also in the air, as well as big topics like the digitalization of healthcare, mental health, behaviour changes in humans (young and adult) who are more and more on the Internet and even the decentralization of financial services.</p><p>And here are some examples of the different speakers at the event we talked to:</p><h3>Vice-Admiral Gouveia e Melo: Vaccination, misinformation and leadership</h3><p><b>Portuguese Navy officer and coordinator of the Task Force for the Portugal COVID-19 vaccination plan</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/d7ce362ea7d517808ec88d7b8809230f?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2Fd7ce362ea7d517808ec88d7b8809230f%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D14s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>Portugal has achieved an 86% vaccination rate on the vice-admiral’s watch. He brought a sense of mission to a task that involved organization, focus and the use of both digital and communication tools.</p><p>The country started the vaccination process <a href=\"https://www.reuters.com/article/us-health-coronavirus-portugal-vaccine-idUSKBN29X23M\">late</a> but is now one of the countries with a higher vaccination rate in the world. We talked with the vice-admiral about how the Internet helped, but also how it created problems related to disinformation and misinformation, and we asked about the dangers of controlling speech online. Finally, we asked for bits of leadership advice.</p><h3>Sonia Jorge: The need for Internet — affordable, fast and for everyone</h3><p><b>Executive Director World Wide Web Foundation (Alliance for Affordable Internet)</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/3a352a3510772621fdabd1ac787a98e7?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2F3a352a3510772621fdabd1ac787a98e7%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D14s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><blockquote><p><i>“The Internet is now an essential public good that everybody needs at this time just like we need to drink water or to have electricity and shelter. We should do more to bring everyone into the digital society.”</i></p></blockquote><p>In some countries around the world Internet access is very limited. In some places people have to go to a particular plaza to have access to the Internet <b>—</b> five years ago John Graham-Cumming saw <a href=\"/the-cuban-cdn/\">something similar in Cuba</a>. Sonia Jorge knows that very well. She is trying to bring affordable Internet to everyone and that challenge is more difficult than it appears.</p><p>She explains that the world is far behind in the <a href=\"https://www.weforum.org/agenda/2020/09/sdi20-united-nations-sdg-digital-cooperation/\">UN’s goals for Internet access</a> — today only about half of the earth’s population has any Internet access at all. But many of those who have access to the World Wide Web have limited possibilities to be online: “some have access once a month, for example.” So the digital divide is real, and it “should worry everyone”.</p><p>The pandemic caused health and economic difficulties that didn’t help the mission of bringing good, fast and reliable Internet to everyone. Nevertheless, Sonia — who is Portuguese and moved to the US to study when she was 17 — saw that many African countries like Nigeria began to realize that the Internet is really important for knowledge and also for the possibilities it opens in terms of cultural, financial and societal growth.</p><p>Sonia also highlights that there is a big disparity in the world between men and women in terms of Internet access.</p><h3>David Kiron: The future of work and how AI (and philosophy) can help</h3><p><b>Editorial director of MIT Sloan Management Review</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/ecdf4803e83866182ef1f9b9d6509106?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2Fecdf4803e83866182ef1f9b9d6509106%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D13s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>Technology will play a significant role in the future of work. In a way, that “future” is already here, but isn’t evenly distributed — and researchers are just beginning to study it. David Kiron goes on to explain the challenge for some people to be “really seen by their leadership when you’re not in the office.”</p><p>The former senior researcher at Harvard Business School tells us how companies started valuing employees even more through the pandemic. There’s also an opportunity for different ways of work interaction through digital tools — “Zoom calls aren’t it.” He’s also worried that the pandemic caused a great reset that is driving many out of the workforce entirely: “There’s a trend of working moms opting out,” for example.</p><p>About the metaverse and a universe of universes: “If tech leaders spent more time reading philosophy they might have a better sense of where the world is going (...) more and more leaders of companies are taking on the philosopher&#39;s role.”</p><p>And how can <a href=\"https://www.cloudflare.com/learning/ai/what-is-artificial-intelligence/\">AI</a> help? “Once you get AI going in a company we saw in our new study that there’s a big bump in morale, collaboration, learning and people’s sense on what they should be doing”. AI can also help better identify talent and match candidates to skills that are already represented in a company, but he also highlights that “humans play a role in all the stages of the hiring and working process.”</p><p>David Kiron explains that “if you’re not asking the right questions to your AI teams you’re going to be behind other companies that are doing better questions”. He adds that AI can help with performance, but it also helps “redefine what performance means in your organization by finding other metrics to look at.”</p><h3>Ana Maiques: neuroscience &amp; women in tech</h3><p><b>Co-founder and CEO of neuroscience-based medical device company Neuroelectrics</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/19c3bff3373c68eebd170e1ef13a4b97?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2F19c3bff3373c68eebd170e1ef13a4b97%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D11s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>We talked to Ana about the future of the Internet. She thinks moving forward there will be more fluid interfaces — not only limited to computers and smartphones, but we will have different devices that go beyond VR headsets and that will lead to new types of interactions. In the neuroscience field, she has big hopes in the technology that Neuroelectrics, her company, is developing in Barcelona, Spain. They work with devices that use non-invasive transcranial electrical stimulation to treat the brain in diseases like epilepsy, depression and Alzheimer.</p><p>Neuroelectrics is also developing a process called digital copy (for better personalized treatments) that could be useful in the future if someone develops one of these problems. But she says humankind is still very far from the dangers of something like a mind-reading device or the possibility of reading and downloading thoughts and dreams: “it’s fun to think of science fiction possibilities, but we need to act now on things and problems that are affecting us today.”</p><p>She also talks about the difficulties of being a woman in the tech business and raising money. “But little by little I see more women and that’s why it’s important to get out there and explain to women that they can do it.”</p><h3>Siyabulela Mandela: The Internet is a human right</h3><p><b>Director for Africa Journalists for Human Rights</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/1b2ac076f0810ee4525580c8b9935d73?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2F1b2ac076f0810ee4525580c8b9935d73%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D17s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>The grandson of Nelson Mandela is on a mission to help journalists in Africa to be free to publish human rights stories. He explains how the Internet is critical for this mission and “a human rights issue”. Not only does the Internet give communities access to trustworthy information, but it also helps them become aware of their rights, gives access to financial tools and allows them to grow in our era.</p><p>He also highlights how the Internet can be misused, for example when it becomes a vehicle for misinformation, or when governments shut down Internet access to control communities — <a href=\"/sudan-seven-days-without-internet-access-and-counting/\">in Sudan the Internet has been cut off</a> since October 25, 2021 (you can track that information on <a href=\"https://radar.cloudflare.com/sd?date_filter=last_30_days\">Cloudflare Radar</a>).</p><h3>Carlos Moedas: The light (and innovation) in Lisbon</h3><p><b>Newly elected Mayor of Lisbon; previous European Commissioner for Research, Science and Innovation</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/c46ca65c99ad307c3728f2ab7c60968f?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2Fc46ca65c99ad307c3728f2ab7c60968f%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D15s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>Why is Lisbon attracting so many tech companies and talent? Carlos Moedas welcomes Cloudflare to his city — we’re growing fast in the city, and we have more than 80 job openings in the country. He also talks about why Portugal’s capital is so special and should be considered by company leaders who want to grow innovative companies. Paddy Cosgrave, from the Web Summit, <a href=\"https://twitter.com/Cloudflare/status/1455252080910905346\">told us something similar four weeks ago</a>.</p><p>The ambition? “Make Lisbon the capital of innovation of the world” or, at least, of Europe. The new mayor also has a project called Unicorn Factory to achieve just that.</p><h3>Sudarsan Reddy: Why is Cloudflare Tunnel relevant?</h3><p><b>Cloudflare engineer from the Tunnel Team</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/6712494a8ba894014bfbfc674e09886f?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2F6712494a8ba894014bfbfc674e09886f%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D13s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>Also, at the event was our very own engineer Sudarsan Reddy (based in Lisbon). We asked him some questions about Cloudflare Tunnel, our tunneling software that lets you quickly secure and encrypt application traffic to any type of infrastructure, so you can hide your server IP addresses, block direct attacks, and get back to delivering great applications.</p><p>Sudarsan focuses on what Tunnel is, why it is relevant, how it works and examples of situations where it can make a difference.</p><h3>Yusuf Sherwani: Addiction treated online</h3><p><b>Co-founder &amp; CEO, Quit Genius</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/04d7c25b2aca4d9638163d52ec9c055d?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2F04d7c25b2aca4d9638163d52ec9c055d%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D12s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>Yusuf graduated as a doctor from Imperial College School of Medicine, in London, but joined two passions, healthcare and technology, when he co-founded Quit Genius. He explains how in just 18 months the pandemic accelerated the adoption of digital health by 10 years, and there’s no going back. “The Internet enables people to unlock improvements to their lives, and digital healthcare went from being convenient to a necessity”.</p><p>We dig into the benefits of digital healthcare, but also the scrutiny that is needed in technology, now that it is more powerful than ever and cemented in people&#39;s lives. Yusuf also gives examples of how his digital clinic is helping people in treating tobacco, vaping, alcohol, and opioid addictions.</p><p>Yusuf has co-authored 12 peer-reviewed studies on behavioural health and substance addictions. He was featured on the Forbes 30 Under 30 List of 2018 and in Fast Company&#39;s 100 Most Creative People in Business.</p><h3>David Shrier: From sharing economy to blockchain</h3><p><b>American futurist and Professor of Practice, AI &amp; Innovation with Imperial College Business School in London</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/75a7d02235881d5debebd1321e9d0c0e?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2F75a7d02235881d5debebd1321e9d0c0e%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D3m10s%26height%3D600&primaryColor=%23f6821f\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>David sums up how the pandemic has affected people&#39;s relationship with technology: “Everyone is tired of Zoom calls, but the convenience opened people&#39;s minds”.</p><p>We also talk about the digital divide, about human-centered ways of working with AI, and we also address the potential in VR and AR and how nobody saw the sharing economy coming 20 years ago and, now, “it&#39;s incredible to see how people embraced blockchain and the digitalization of financial services”.</p><h3>Dame Til Wykes: The mental health discussion went viral</h3><p><b>Professor of Clinical Psychology and Rehabilitation at King&#39;s College London, Director of the NIHR Clinical Research Network: Mental Health</b></p><!--kg-card-begin: html--><div style=\"position: relative; padding-top: 56.25%;\"><iframe src=\"https://iframe.videodelivery.net/d51448230647424f55b75d30dbc5b846?preload=true&poster=https%3A%2F%2Fvideodelivery.net%2Fd51448230647424f55b75d30dbc5b846%2Fthumbnails%2Fthumbnail.jpg%3Ftime%3D23s%26height%3D600&primaryColor=%23e77f08\" style=\"border: none; position: absolute; top: 0; left: 0; height: 100%; width: 100%;\" allow=\"accelerometer; gyroscope; autoplay; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe></div>\n<p></p><!--kg-card-end: html--><p>As someone with experience in the psychology field for more than 50 years, Dame Til Wykes still had to learn new ways of engaging with patients throughout the pandemic — and even learn which buttons to push on a computer to make Zoom calls. COVID-19 and the hardships of the pandemic made people more aware and ready to talk about their mental health issues, like anxiety or depression. But the pandemic wasn’t the same for everyone and Dame Til Wykes is worried about some of the effects, “most of them remain to be seen”.</p><p>Remote consultations were a big help, but she reminds us that in her field it is important to see the whole person and not just the face — for example, “if someone is tapping a foot nervously while giving us a smile, that tells us something that we cannot see in a Zoom call”. She also mentions the adoption of meditation apps bringing a form of help to some was another positive trend in this difficult period, as well as the reset button the pandemic brought to some people&#39;s lives.</p>",
		"id": "7HM9FaIs4MN3amG1EoDrwh",
		"localeList": {
			"name": "Heard in the halls of Web Summit 2021 Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Global in-person events are back. We present a few ideas from Web Summit 2021 about the future and where the Internet is going. Check the interviews we’ve done at the event (from the lack of Internet access to Web3). ",
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2021-11-26T13:59:12.000+00:00",
		"reading_time": 9,
		"slug": "web-summit-2021-internet",
		"tags": [
			{
				"id": "7qrmHspTZnIVIRl7tmvg6k",
				"name": "Events",
				"slug": "events"
			},
			{
				"id": "5kZtWqjqa7aOUoZr8NFGwI",
				"name": "Cloudflare Radar",
				"slug": "cloudflare-radar"
			},
			{
				"id": "7mVMfcxp4tMqKil9jj8BJa",
				"name": "Cloudflare Stream",
				"slug": "cloudflare-stream"
			},
			{
				"id": "3Fo5JgRZ6Fh2HHzhEr7AKn",
				"name": "Better Internet",
				"slug": "better-internet"
			}
		],
		"title": "Heard in the halls of Web Summit 2021",
		"updated_at": "2024-08-27T01:40:26.334Z",
		"url": "https://blog.cloudflare.com/web-summit-2021-internet"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}