{
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "André Cruz",
				"slug": "andre-cruz",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/44BhO6kzQz5IiGfDAqLlOe/f24b31b19f55ca957ef98812861146dc/andre-cruz.jpg",
				"location": "Lisbon, Portugal",
				"website": null,
				"twitter": "@edevil",
				"facebook": null
			},
			{
				"name": "Celso Martinho",
				"slug": "celso",
				"bio": "From when Mosaic took over Gopher. Engineering Director at Cloudflare.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/2pzgat1zmt1oF1byi7hskH/7e3b95ac25469b2640929caf376fa4c8/celso.png",
				"location": "Portugal, Lisbon",
				"website": "https://celso.io/",
				"twitter": "@celso",
				"facebook": null
			}
		],
		"excerpt": "Today, we are introducing WebGPU support to Cloudflare Workers. This blog will explain why it's important, why we did it, how you can use it, and what comes next",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/32i82HuBXFSeBMcBsKu6en/a208a8e724614f57c845012d771d18c4/webgpu-in-workers.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3QtFfPLnvvYxXex2Yn5JHy/7bafaa5db19e12ce4ee6b5cd4bd5943f/image1-27.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1125\" loading=\"lazy\"/>\n            \n            </figure><p>The browser as an app platform is real and stronger every day; long gone are the Browser Wars. Vendors and standard bodies have done amazingly well over the last years, working together and advancing web standards with new <a href=\"https://www.cloudflare.com/learning/security/api/what-is-an-api/\">APIs</a> that allow developers to build fast and powerful applications, finally comparable to those we got used to seeing in the native OS&#39; environment.</p><p>Today, browsers can render web pages and run code that interfaces with an <a href=\"https://developer.mozilla.org/en-US/docs/Web/API\">extensive catalog of modern Web APIs</a>. Things like networking, rendering accelerated graphics, or even accessing low-level hardware features like USB devices are all now possible within the browser sandbox.</p><p>One of the most exciting new browser APIs that browser vendors have been rolling out over the last months is WebGPU, a modern, low-level GPU programming interface designed for high-performance 2D and 3D graphics and general purpose GPU compute.</p><p>Today, we are introducing <a href=\"https://developer.chrome.com/blog/webgpu-release/\">WebGPU</a> support to Cloudflare Workers. This blog will explain why it&#39;s important, why we did it, how you can use it, and what comes next.</p><h3>The history of the GPU in the browser</h3><p>To understand why WebGPU is a big deal, we must revisit history and see how browsers went from relying only on the CPU for everything in the early days to taking advantage of GPUs over the years.</p><p>In 2011, <a href=\"https://en.wikipedia.org/wiki/WebGL\">WebGL 1</a>, a limited port of <a href=\"https://www.khronos.org/opengles/\">OpenGL ES 2.0</a>, was introduced, providing an API for fast, accelerated 3D graphics in the browser for the first time. By then, this was somewhat of a revolution in enabling gaming and 3D visualizations in the browser. Some of the most popular 3D animation frameworks, like <a href=\"https://threejs.org/\">Three.js</a>, launched in the same period. Who doesn&#39;t remember going to the (now defunct) <a href=\"https://en.wikipedia.org/wiki/Google_Chrome_Experiments\">Google Chrome Experiments</a> page and spending hours in awe exploring the demos? Another option then was using the Flash Player, which was still dominant in the desktop environment, and their <a href=\"https://en.wikipedia.org/wiki/Stage3D\">Stage 3D</a> API.</p><p>Later, in 2017, based on the learnings and shortcomings of its predecessor, WebGL 2 was a significant upgrade and brought more advanced GPU capabilities like shaders and more flexible textures and rendering.</p><p>WebGL, however, has proved to be a steep and complex learning curve for developers who want to take control of things, do low-level 3D graphics using the GPU, and not use 3rd party abstraction libraries.</p><p>Furthermore and more importantly, with the advent of <a href=\"https://www.cloudflare.com/learning/ai/what-is-machine-learning/\">machine learning</a> and cryptography, we discovered that GPUs are great not only at drawing graphics but can be used for other applications that can take advantage of things like high-speed data or blazing-fast matrix multiplications, and one can use them to perform general computation. This became known as <a href=\"https://en.wikipedia.org/wiki/General-purpose_computing_on_graphics_processing_units\">GPGPU</a>, short for general-purpose computing on graphics processing units.</p><p>With this in mind, in the native desktop and mobile operating system worlds, developers started using more advanced frameworks like <a href=\"https://en.wikipedia.org/wiki/CUDA\">CUDA</a>, <a href=\"https://developer.apple.com/metal/\">Metal</a>, <a href=\"https://en.wikipedia.org/wiki/DirectX#DirectX_12\">DirectX 12</a>, or <a href=\"https://www.vulkan.org/learn#key-resources\">Vulkan</a>. WebGL stayed behind. To fill this void and bring the browser up to date, in 2017, companies like Google, Apple, Intel, Microsoft, Kronos, and Mozilla created the <a href=\"https://www.w3.org/community/gpu/\">GPU for Web Community Working Group</a> to collaboratively design the successor of WebGL and create the next modern 3D graphics and computation capabilities APIs for the Web.</p><h3>What is WebGPU</h3><p>WebGPU was developed with the following advantages in mind:</p><ul><li><p><b>Lower Level Access</b> - WebGPU provides lower-level, direct access to the GPU vs. the high-level abstractions in WebGL. This enables more control over GPU resources.</p></li><li><p><b>Multi-Threading</b> - WebGPU can leverage multi-threaded rendering and compute, allowing improved CPU/GPU parallelism compared to WebGL, which relies on a single thread.</p></li><li><p><b>Compute Shaders</b> - First-class support for general-purpose compute shaders for GPGPU tasks, not just graphics. WebGL compute is limited.</p></li><li><p><b>Safety</b> - WebGPU ensures memory and GPU access safety, avoiding common WebGL pitfalls.</p></li><li><p><b>Portability</b> - WGSL shader language targets cross-API portability across GPU vendors vs. GLSL in WebGL.</p></li><li><p><b>Reduced Driver Overhead</b> - The lower level Vulkan/Metal/D3D12 basis improves overhead vs. OpenGL drivers in WebGL.</p></li><li><p><b>Pipeline State Objects</b> - Predefined pipeline configs avoid per-draw driver overhead in WebGL.</p></li><li><p><b>Memory Management</b> - Finer-grained buffer and resource management vs. WebGL.</p></li></ul><p>The “too long didn&#39;t read” version is that WebGPU provides lower-level control over the GPU hardware with reduced overhead. It&#39;s safer, has multi-threading, is focused on compute, not just graphics, and has portability advantages compared to WebGL.</p><p>If these aren&#39;t reasons enough to get excited, developers are also looking at WebGPU as an option for native platforms, not just the Web. For instance, you can use this <a href=\"https://github.com/webgpu-native/webgpu-headers/blob/main/webgpu.h\">C API</a> that mimics the JavaScript specification. If you think about this and the power of WebAssembly, you can effectively have a truly platform-agnostic GPU hardware layer that you can use to <a href=\"https://developer.chrome.com/blog/webgpu-cross-platform/\">develop</a> platforms for any operating system or browser.</p><h3>More than just graphics</h3><p>As explained above, besides being a graphics API, WebGPU makes it possible to perform tasks such as:</p><ul><li><p><b>Machine Learning</b> - Implement ML applications like <a href=\"https://www.cloudflare.com/learning/ai/what-is-neural-network/\">neural networks</a> and computer vision algorithms using WebGPU compute shaders and matrices.</p></li><li><p><b>Scientific Computing</b> - Perform complex scientific computation like physics simulations and mathematical modeling using the GPU.</p></li><li><p><b>High Performance Computing</b> - Unlock breakthrough performance for parallel workloads by connecting WebGPU to languages like Rust, C/C++ via <a href=\"https://webassembly.org/\">WebAssembly</a>.</p></li></ul><p><a href=\"https://gpuweb.github.io/gpuweb/wgsl/\">WGSL</a>, the shader language for WebGPU, is what enables the general-purpose compute feature. Shaders, or more precisely, <a href=\"https://www.khronos.org/opengl/wiki/Compute_Shader\">compute shaders</a>, have no user-defined inputs or outputs and are used for computing arbitrary information. Here are <a href=\"https://webgpufundamentals.org/webgpu/lessons/webgpu-compute-shaders.html\">some examples</a> of simple WebGPU compute shaders if you want to learn more.</p><h3>WebGPU in Workers</h3><p>We&#39;ve been watching WebGPU since the API was published. Its general-purpose compute features perfectly fit our Workers&#39; ecosystem and capabilities and align well with our vision of providing our customers multiple compute and hardware options and bringing GPU workloads to our global network, close to clients.</p><p>Cloudflare also has a track record of pioneering support for emerging web standards on our network and services, accelerating their adoption for our customers. Examples of these are <a href=\"https://developers.cloudflare.com/workers/runtime-apis/web-crypto/\">Web Crypto API</a>, <a href=\"/introducing-http2/\">HTTP/2</a>, <a href=\"/http3-the-past-present-and-future/\">HTTP/3</a>, <a href=\"/introducing-tls-1-3/\">TLS 1.3</a>, or <a href=\"/early-hints/\">Early hints</a>, but <a href=\"https://developers.cloudflare.com/workers/runtime-apis/\">there are more</a>.</p><p>Bringing WebGPU to Workers was both natural and timely. Today, we are announcing that we have released a version of <a href=\"https://github.com/cloudflare/workerd\">workerd</a>, the open-sourced JavaScript / Wasm runtime that powers Cloudflare Workers, with <a href=\"https://github.com/cloudflare/workerd/tree/main/src/workerd/api/gpu\">WebGPU support</a>, that you can start playing and developing applications with, locally.</p><p>Starting today anyone can run this on their personal computer and experiment with WebGPU-enabled workers. Implementing local development first allows us to put this API in the hands of our customers and developers earlier and get feedback that will guide the development of this feature for production use.</p><p>But before we dig into code examples, let&#39;s explain how we built it.</p><h3>How we built WebGPU on top of Workers</h3>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2rem1ZyAcVa3LO7ue6OTC7/1cdf357066de018c67174488b5f32b4f/image2-22.png\" alt=\"\" class=\"kg-image\" width=\"1540\" height=\"1350\" loading=\"lazy\"/>\n            \n            </figure><p>To implement the WebGPU API, we took advantage of <a href=\"https://dawn.googlesource.com/dawn/\">Dawn</a>, an open-source library backed by Google, the same used in Chromium and Chrome, that provides applications with an implementation of the WebGPU standard. It also provides the <a href=\"https://github.com/webgpu-native/webgpu-headers/blob/main/webgpu.h\">webgpu.h</a> headers file, the de facto reference for all the other implementations of the standard.</p><p>Dawn can interoperate with Linux, MacOS, and Windows GPUs by interfacing with each platform&#39;s native GPU frameworks. For example, when an application makes a WebGPU draw call, Dawn will convert that draw command into the equivalent Vulkan, Metal, or Direct3D 12 API call, depending on the platform.</p><p>From an application standpoint, Dawn handles the interactions with the underlying native graphics APIs that communicate directly with the GPU drivers. Dawn essentially acts as a middle layer that translates the WebGPU API calls into calls for the platform&#39;s native graphics API.</p><p>Cloudflare <a href=\"/workerd-open-source-workers-runtime/\">workerd</a> is the underlying open-source runtime engine that executes Workers code. It shares most of its code with the same runtime that powers Cloudflare Workers&#39; production environment but with some changes designed to make it more portable to other environments. We then have release cycles that aim to synchronize both codebases; more on that later. Workerd is also used with <a href=\"https://github.com/cloudflare/workers-sdk\">wrangler</a>, our command-line tool for building and interacting with Cloudflare Workers, to support local development.</p><p>The WebGPU code that interfaces with the Dawn library can be found <a href=\"https://github.com/cloudflare/workerd/tree/main/src/workerd/api/gpu\">here</a>, and can easily be enabled with a flag, checked <a href=\"https://github.com/cloudflare/workerd/blob/main/src/workerd/api/global-scope.c%2B%2B#L728\">here</a>.</p>\n            <pre class=\"language-c++\"><code class=\"language-c++\">jsg::Ref<api::gpu::GPU> Navigator::getGPU(CompatibilityFlags::Reader flags) {\n  // is this a durable object?\n  KJ_IF_MAYBE (actor, IoContext::current().getActor()) {\n    JSG_REQUIRE(actor->getPersistent() != nullptr, TypeError,\n                \"webgpu api is only available in Durable Objects (no storage)\");\n  } else {\n    JSG_FAIL_REQUIRE(TypeError, \"webgpu api is only available in Durable Objects\");\n  };\n\n  JSG_REQUIRE(flags.getWebgpu(), TypeError, \"webgpu needs the webgpu compatibility flag set\");\n\n  return jsg::alloc<api::gpu::GPU>();\n}</pre></code>\n            <p>The WebGPU API can only be accessed using <a href=\"https://developers.cloudflare.com/durable-objects/\">Durable Objects</a>, which are essentially global singleton instances of Cloudflare Workers. There are two important reasons for this:</p><ul><li><p>WebGPU code typically wants to store the state between requests, for example, loading an <a href=\"https://www.cloudflare.com/learning/ai/what-is-artificial-intelligence/\">AI model</a> into the GPU memory once and using it multiple times for inference.</p></li><li><p>Not all Cloudflare servers have GPUs yet, so although the worker that receives the request is typically the closest one available, the Durable Object that uses WebGPU will be instantiated where there are GPU resources available, which may not be on the same machine.</p></li></ul><p>Using Durable Objects instead of regular Workers allow us to address both of these issues.</p><h3>The WebGPU Hello World in Workers</h3><p>Wrangler uses Miniflare 3, a <a href=\"/wrangler3/\">fully-local simulator for Workers</a>, which in turn is powered by workerd. This means you can start experimenting and doing WebGPU code locally on your machine right now before we prepare things in our production environment.</p><p>Let’s get coding then.</p><p>Since Workers doesn&#39;t render graphics yet, we started with implementing the general-purpose GPU (GPGPU) APIs in the <a href=\"https://www.w3.org/TR/webgpu/\">WebGPU specification</a>. In other words, we fully support the part of the API that the <a href=\"https://www.w3.org/TR/webgpu/#gpucomputepipeline\">compute shaders and the compute pipeline</a> require, but we are not yet focused on fragment or vertex shaders used in rendering pipelines.</p><p>Here’s a typical “hello world” in WebGPU. This Durable Object script will output the name of the GPU device that workerd found in your machine to your console.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">const adapter = await navigator.gpu.requestAdapter();\nconst adapterInfo = await adapter.requestAdapterInfo([\"device\"]);\nconsole.log(adapterInfo.device);</pre></code>\n            <p>A more interesting example, though, is a simple compute shader. In this case, we will fill a results buffer with an incrementing value taken from the iteration number via <code>global_invocation_id</code>.</p><p>For this, we need two buffers, one to store the results of the computations as they happen (<code>storageBuffer</code>) and another to copy the results at the end (<code>mappedBuffer</code>).</p><p>We then dispatch four workgroups, meaning that the increments can happen in parallel. This parallelism and programmability are two key reasons why compute shaders and GPUs provide an advantage for things like machine learning inference workloads. Other advantages are:</p><ul><li><p><b>Bandwidth</b> - GPUs have a very high memory bandwidth, up to 10-20x more than CPUs. This allows fast reading and writing of all the model parameters and data needed for inference.</p></li><li><p><b>Floating-point performance</b> - GPUs are optimized for high floating point operation throughput, which are used extensively in neural networks. They can deliver much higher <a href=\"https://www.tomshardware.com/reviews/gpu-hierarchy,4388.html\">TFLOPs than CPUs</a>.</p></li></ul><p>Let’s look at the code:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">// Create device and command encoder\nconst adapter = await navigator.gpu.requestAdapter();\nconst device = await adapter.requestDevice();\nconst encoder = device.createCommandEncoder();\n\n// Storage buffer\nconst storageBuffer = device.createBuffer({\n  size: 4 * Float32Array.BYTES_PER_ELEMENT, // 4 float32 values\n  usage: GPUBufferUsage.STORAGE | GPUBufferUsage.COPY_SRC,\n});\n\n// Mapped buffer\nconst mappedBuffer = device.createBuffer({\n  size: 4 * Float32Array.BYTES_PER_ELEMENT,\n  usage: GPUBufferUsage.MAP_READ | GPUBufferUsage.COPY_DST,\n});\n\n// Create shader that writes incrementing numbers to storage buffer\nconst computeShaderCode = `\n    @group(0) @binding(0)\n    var<storage, read_write> result : array<f32>;\n\n    @compute @workgroup_size(1)\n    fn main(@builtin(global_invocation_id) gid : vec3<u32>) {\n      result[gid.x] = f32(gid.x);\n    }\n`;\n\n// Create compute pipeline\nconst computePipeline = device.createComputePipeline({\n  layout: \"auto\",\n  compute: {\n    module: device.createShaderModule({ code: computeShaderCode }),\n    entryPoint: \"main\",\n  },\n});\n\n// Bind group\nconst bindGroup = device.createBindGroup({\n  layout: computePipeline.getBindGroupLayout(0),\n  entries: [{ binding: 0, resource: { buffer: storageBuffer } }],\n});\n\n// Dispatch compute work\nconst computePass = encoder.beginComputePass();\ncomputePass.setPipeline(computePipeline);\ncomputePass.setBindGroup(0, bindGroup);\ncomputePass.dispatchWorkgroups(4);\ncomputePass.end();\n\n// Copy from storage to mapped buffer\nencoder.copyBufferToBuffer(\n  storageBuffer,\n  0,\n  mappedBuffer,\n  0,\n  4 * Float32Array.BYTES_PER_ELEMENT //mappedBuffer.size\n);\n\n// Submit and read back result\nconst gpuBuffer = encoder.finish();\ndevice.queue.submit([gpuBuffer]);\n\nawait mappedBuffer.mapAsync(GPUMapMode.READ);\nconsole.log(new Float32Array(mappedBuffer.getMappedRange()));\n// [0, 1, 2, 3]</pre></code>\n            <p>Now that we covered the basics of WebGPU and compute shaders, let&#39;s move to something more demanding. What if we could perform machine learning inference using Workers and GPUs?</p><h3>ONNX WebGPU demo</h3><p>The <a href=\"https://github.com/microsoft/onnxruntime\">ONNX runtime</a> is a popular open-source cross-platform, high performance machine learning inferencing accelerator. <a href=\"https://github.com/webonnx/wonnx\">Wonnx</a> is a GPU-accelerated version of the same engine, written in Rust, that can be compiled to WebAssembly and take advantage of WebGPU in the browser. We are going to run it in Workers using a combination of <a href=\"https://github.com/cloudflare/workers-rs\">workers-rs</a>, our Rust bindings for Cloudflare Workers, and the workerd WebGPU APIs.</p><p>For this demo, we are using <a href=\"https://www.kdnuggets.com/2016/09/deep-learning-reading-group-squeezenet.html\">SqueezeNet</a>. This small image classification model can run under lower resources but still achieves similar levels of accuracy on the <a href=\"https://en.wikipedia.org/wiki/ImageNet\">ImageNet</a> image classification validation dataset as larger models like <a href=\"https://en.wikipedia.org/wiki/AlexNet\">AlexNet</a>.</p><p>In essence, our worker will receive any uploaded image and attempt to classify it according to the 1000 ImageNet classes. Once ONNX runs the machine learning model using the GPU, it will return the list of classes with the highest probability scores. Let’s go step by step.</p><p>First we load the model from R2 into the GPU memory the first time the Durable Object is called:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">#[durable_object]\npub struct Classifier {\n    env: Env,\n    session: Option<wonnx::Session>,\n}\n\nimpl Classifier {\n    async fn ensure_session(&mut self) -> Result<()> {\n        match self.session {\n            Some(_) => worker::console_log!(\"DO already has a session\"),\n            None => {\n                // No session, so this should be the first request. In this case\n                // we will fetch the model from R2, build a wonnx session, and\n                // store it for subsequent requests.\n                let model_bytes = fetch_model(&self.env).await?;\n                let session = wonnx::Session::from_bytes(&model_bytes)\n                    .await\n                    .map_err(|err| err.to_string())?;\n                worker::console_log!(\"session created in DO\");\n                self.session = Some(session);\n            }\n        };\n        Ok(())\n    }\n}</pre></code>\n            <p>This is only required once, when the Durable Object is instantiated. For subsequent requests, we retrieve the model input tensor, call the existing session for the inference, and return to the calling worker the result tensor converted to JSON:</p>\n            <pre class=\"language-json\"><code class=\"language-json\">        let request_data: ArrayBase<OwnedRepr<f32>, Dim<[usize; 4]>> =\n            serde_json::from_str(&req.text().await?)?;\n        let mut input_data = HashMap::new();\n        input_data.insert(\"data\".to_string(), request_data.as_slice().unwrap().into());\n\n        let result = self\n            .session\n            .as_ref()\n            .unwrap() // we know the session exists\n            .run(&input_data)\n            .await\n            .map_err(|err| err.to_string())?;\n...\n        let probabilities: Vec<f32> = result\n            .into_iter()\n            .next()\n            .ok_or(\"did not obtain a result tensor from session\")?\n            .1\n            .try_into()\n            .map_err(|err: TensorConversionError| err.to_string())?;\n\n        let do_response = serde_json::to_string(&probabilities)?;\n        Response::ok(do_response)</pre></code>\n            <p>On the Worker script itself, we load the uploaded image and pre-process it into a model input tensor:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">    let image_file: worker::File = match req.form_data().await?.get(\"file\") {\n        Some(FormEntry::File(buf)) => buf,\n        Some(_) => return Response::error(\"`file` part of POST form must be a file\", 400),\n        None => return Response::error(\"missing `file`\", 400),\n    };\n    let image_content = image_file.bytes().await?;\n    let image = load_image(&image_content)?;</pre></code>\n            <p>Finally, we call the GPU Durable Object, which runs the model and returns the most likely classes of our image:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">    let probabilities = execute_gpu_do(image, stub).await?;\n    let mut probabilities = probabilities.iter().enumerate().collect::<Vec<_>>();\n    probabilities.sort_unstable_by(|a, b| b.1.partial_cmp(a.1).unwrap());\n    Response::ok(LABELS[probabilities[0].0])</pre></code>\n            <p>We packaged this demo in a public repository, so you can also run it. Make sure that you have a <a href=\"https://www.rust-lang.org/\">Rust</a> compiler, <a href=\"https://nodejs.org/en\">Node.js</a>, <a href=\"https://git-scm.com/\">Git</a> and <a href=\"https://curl.se/\">curl</a> installed, then clone the repository:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">git clone https://github.com/cloudflare/workers-wonnx.git\ncd workers-wonnx</pre></code>\n            <p>Upload the model to the local R2 simulator:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">npx wrangler@latest r2 object put model-bucket-dev/opt-squeeze.onnx --local --file models/opt-squeeze.onnx</pre></code>\n            <p>And then run the Worker locally:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">npx wrangler@latest dev</pre></code>\n            <p>With the Worker running and waiting for requests you can then open another terminal window and upload one of the image examples in the same repository using curl:</p>\n            <pre class=\"language-curl\"><code class=\"language-curl\">> curl -F \"file=@images/pelican.jpeg\" http://localhost:8787\nn02051845 pelican</pre></code>\n            <p>If everything goes according to plan the result of the curl command will be the most likely class of the image.</p><h3>Next steps and final words</h3><p>Over the upcoming weeks, we will merge the workerd WebGPU code in the Cloudflare Workers production environment and make it available globally, on top of our growing GPU nodes fleet. We didn&#39;t do it earlier because that environment is subject to strict security and isolation requirements. For example, we can&#39;t break the <a href=\"https://developers.cloudflare.com/workers/learning/security-model/\">security model</a> of our process sandbox and have V8 talking to the GPU hardware directly, that would be a problem; we must create a configuration where another process is closer to the GPU and use IPC (inter-process communication) to talk to it. Other things like managing resource allocation and billing are being sorted out.</p><p>For now, we wanted to get the good news out that we will support WebGPU in Cloudflare Workers and ensure that you can start playing and coding with it today and learn from it. WebGPU and general-purpose computing on GPUs is still in its early days. We presented a machine-learning demo, but we can imagine other applications taking advantage of this new feature, and we hope you can show us some of them.</p><p>As usual, you can talk to us on our <a href=\"https://discord.cloudflare.com/\">Developers Discord</a> or the <a href=\"https://community.cloudflare.com/c/developers/39\">Community forum</a>; the team will be listening. We are eager to hear from you and learn about what you&#39;re building.</p>",
		"id": "4osLizDbNHndEk9BG23KFi",
		"localeList": {
			"name": "You can now use WebGPU in Cloudflare Workers Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "Today, we are introducing WebGPU support to Cloudflare Workers. This blog will explain why it's important, why we did it, how you can use it, and what comes next.",
		"metadata": {
			"title": "You can now use WebGPU in Cloudflare Workers",
			"description": "Today, we are introducing WebGPU support to Cloudflare Workers. This blog will explain why it's important, why we did it, how you can use it, and what comes next.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4yukd2zurop1o7iczaMUuj/1ad9c43663291eccafe6e2e912c5c6d7/webgpu-in-workers-0SKKMb.png"
		},
		"primary_author": {},
		"published_at": "2023-09-27T14:00:56.000+01:00",
		"reading_time": 10,
		"slug": "webgpu-in-workers",
		"tags": [
			{
				"id": "1Cv5JjXzKWKEA10JdYbXu1",
				"name": "Birthday Week",
				"slug": "birthday-week"
			},
			{
				"id": "6hbkItfupogJP3aRDAq6v8",
				"name": "Cloudflare Workers",
				"slug": "workers"
			},
			{
				"id": "iiynSxxhE6dlxRhbsXqc4",
				"name": "Standards",
				"slug": "standards"
			},
			{
				"id": "4HIPcb68qM0e26fIxyfzwQ",
				"name": "Developers",
				"slug": "developers"
			},
			{
				"id": "3JAY3z7p7An94s6ScuSQPf",
				"name": "Developer Platform",
				"slug": "developer-platform"
			}
		],
		"title": "You can now use WebGPU in Cloudflare Workers",
		"updated_at": "2024-08-27T01:05:29.273Z",
		"url": "https://blog.cloudflare.com/webgpu-in-workers"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}