{
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"zh-tw",
		"ja-jp",
		"ko-kr",
		"id-id",
		"th-th"
	],
	"post": {
		"authors": [
			{
				"name": "Annika Garbers",
				"slug": "annika",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/6SY53ZloWPZ3xlkvdwhfNZ/17f85d5432fafbd717b7c2fc9b593dd4/annika.png",
				"location": null,
				"website": null,
				"twitter": "@annikagarbers",
				"facebook": null
			}
		],
		"excerpt": "This week, we’ll demonstrate how Cloudflare One, our Zero Trust Network-as-a-Service, is helping CIOs transform their corporate networks. ",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5YiOvETJMTbPZjvikekgKv/454bd26ac3c9c867793a2f5fdee03572/welcome-to-cio-week.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/4EQaq7tZsMiFiejnnCuXhP/ce1ded28f4625e0806dbcb1d498de4c0/image5-2.png\" alt=\"Welcome to CIO Week and the future of corporate networks.\" class=\"kg-image\" width=\"1200\" height=\"675\" loading=\"lazy\"/>\n            \n            </figure><p>The world of a Chief Information Officer has changed — today’s corporate networks look nothing like those of even five or ten years ago — and these changes have created gaps in visibility and security, introduced high costs and operational burdens, and made networks fragile and brittle.</p><p>We’re optimistic that CIOs have a brighter future to look forward to. The Internet has evolved from a research project into integral infrastructure companies depend on, and we believe a better Internet is the path forward to solving the most challenging problems CIOs face today. Cloudflare is helping build an Internet that’s faster, more secure, more reliable, more private, and programmable, and by doing so, we’re enabling organizations to build their next-generation networks on ours.</p><p>This week, we’ll demonstrate how Cloudflare One, our Zero Trust <a href=\"https://www.cloudflare.com/learning/network-layer/network-as-a-service-naas/\">Network-as-a-Service</a>, is helping CIOs transform their corporate networks. We’ll also introduce new functionality that expands the scope of Cloudflare’s platform to address existing and emerging needs for CIOs. But before we jump into the week, we wanted to spend some time on our vision for the corporate network of the future. We hope this explanation will clarify language and acronyms used by vendors and analysts who have realized the opportunity in this space (what does Zero Trust Network-as-a-Service mean, anyway?) and set context for how our innovative approach is realizing this vision for real CIOs today.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/5rqxtwrgzS3N9UhobOEGAX/169f575b6aeac00b6aa610837ce01a82/Castle-and-Moat-to-Zero-Trust.png\" alt=\"\" class=\"kg-image\" width=\"1920\" height=\"668\" loading=\"lazy\"/>\n            \n            </figure><h2>Generation 1: Castle and moat</h2><p>For years, corporate networks looked like this:</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/fMla3Gx5wuISK48F7lJFf/f37a60400d55944900c419dd733041f7/unnamed--1--16.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"877\" loading=\"lazy\"/>\n            \n            </figure><p>Companies built or rented space in data centers that were physically located within or close to major office locations. They hosted business applications — email servers, ERP systems, CRMs, etc. — on servers in these data centers. Employees in offices connected to these applications through the local area network (LAN) or over private <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-a-wan/\">wide area network (WAN)</a> links from branch locations. A stack of security hardware (e.g., firewalls) in each data center enforced security for all traffic flowing in and out. Once on the corporate network, users could move laterally to other connected devices and hosted applications, but basic forms of network authentication and physical security controls like employee badge systems generally prevented untrusted users from getting access.</p><p><b>Network Architecture Scorecard: Generation 1</b></p><p>Characteristic</p><p>Score</p><p>Description</p><p>Security</p><p>⭐⭐</p><p>All traffic flows through <a href=\"https://www.cloudflare.com/learning/access-management/what-is-the-network-perimeter/\">perimeter security</a> hardware. Network access restricted with physical controls. Lateral movement is only possible once on network.</p><p>Performance</p><p>⭐⭐⭐</p><p>Majority of users and applications stay within the same building or regional network.</p><p>Reliability</p><p>⭐⭐</p><p>Dedicated data centers, private links, and security hardware present single points of failure. There are cost tradeoffs to purchase redundant links and hardware.</p><p>Cost</p><p>⭐⭐</p><p>Private connectivity and hardware are high cost capital expenditures, creating a high barrier to entry for small or new businesses. However, a limited number of links/boxes are required (trade off with redundancy/reliability). Operational costs are low to medium after initial installation.</p><p>Visibility</p><p>⭐⭐⭐</p><p>All traffic is routed through central location, so it’s possible to access NetFlow/packet captures and more for 100% of flows.</p><p>Agility</p><p>⭐</p><p>Significant network changes have a long lead time.</p><p>Precision</p><p>⭐</p><p>Controls are primarily exercised at the network layer (e.g., IP ACLs). Accomplishing “allow only HR to access employee payment data” looks like: <code>IP in range X allowed to access IP in range Y</code> (and requires accompanying spreadsheet to track IP allocation).</p><h2>Applications and users left the castle</h2><p>So what changed? In short, the Internet. Faster than anyone expected, the Internet became critical to how people communicate and get work done. The Internet introduced a radical shift in how organizations thought about their computing resources: if any computer can talk to any other computer, why would companies need to keep servers in the same building as employees’ desktops? And even more radical, why would they need to buy and maintain their own servers at all? From these questions, the cloud was born, enabling companies to rent space on other servers and host their applications while minimizing operational overhead. An entire new industry of Software-as-a-Service emerged to simplify things even further, allowing companies to completely abstract away questions of capacity planning, server reliability, and other operational struggles.</p><p>This golden, Internet-enabled future — cloud and SaaS everything — sounds great! But CIOs quickly ran into problems. Established corporate networks with castle-and-moat architecture can’t just go down for months or years during a large-scale transition, so most organizations are in a hybrid state, one foot still firmly in the world of data centers, hardware, and <a href=\"https://www.cloudflare.com/learning/network-layer/what-is-mpls/\">MPLS</a>. And traffic to applications still needs to stay secure, so even if it’s no longer headed to a server in a company-owned data center, many companies have continued to send it there (backhauled through private lines) to flow through a stack of firewall boxes and other hardware before it’s set free.</p><p>As more applications moved to the Internet, the volume of traffic leaving branches — and being backhauled through MPLS lines through data centers for security — continued to increase. Many CIOs faced an unpleasant surprise in their bandwidth charges the month after adopting Office 365: with traditional network architecture, more traffic to the Internet meant more traffic over expensive private links.</p><p>As if managing this first dramatic shift — which created complex hybrid architectures and brought unexpected cost increases — wasn’t enough, CIOs had another to handle in parallel. The Internet changed the game not just for applications, but also for users. Just as servers don’t need to be physically located at a company’s headquarters anymore, employees don’t need to be on the office LAN to access their tools. VPNs allow people working outside of offices to get access to applications hosted on the company network (whether physical or in the cloud).</p><p>These VPNs grant remote users access to the corporate network, but they’re slow, clunky to use, and can only support a limited number of people before performance degrades to the point of unusability. And from a security perspective, they’re terrifying — once a user is on the VPN, they can move laterally to discover and gain access to other resources on the corporate network. It’s much harder for CIOs and CISOs to control laptops with VPN access that could feasibly be brought anywhere — parks, public transportation, bars — than computers used by badged employees in the traditional castle-and-moat office environment.</p><p>In 2020, COVID-19 turned these emerging concerns about VPN cost, performance, and security into mission-critical, business-impacting challenges, and they’ll continue to be even as some employees return to offices.</p>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3HuKGUFxfzPONVYODAM82x/4bb14b9c8790d42f82d2ec88896f8417/unnamed--2-.png\" alt=\"\" class=\"kg-image\" width=\"1600\" height=\"881\" loading=\"lazy\"/>\n            \n            </figure><h2>Generation 2: Smörgåsbord of point solutions</h2><p>Lots of vendors have emerged to tackle the challenges introduced by these major shifts, often focusing on one or a handful of use cases. Some providers offer virtualized versions of hardware appliances, delivered over different cloud platforms; others have cloud-native approaches that address a specific problem like application access or <a href=\"https://www.cloudflare.com/learning/access-management/what-is-url-filtering/\">web filtering</a>. But stitching together a patchwork of point solutions has caused even more headaches for CIOs and most products available focused only on shoring up identity, endpoint, and application security without truly addressing <a href=\"https://www.cloudflare.com/learning/network-layer/network-security/\">network security</a>.</p><h4><b>Gaps in visibility</b></h4><p>Compared to the castle and moat model, where traffic all flowed through a central stack of appliances, modern networks have extremely fragmented visibility. IT teams need to piece together information from multiple tools to understand what’s happening with their traffic. Often, a full picture is impossible to assemble, even with the support of tools including SIEM and SOAR applications that consolidate data from multiple sources. This makes troubleshooting issues challenging: IT support ticket queues are full of unsolved mysteries. How do you manage what you can’t see?</p><h4><b>Gaps in security</b></h4><p>This patchwork architecture — coupled with the visibility gaps it introduced — also creates security challenges. The concept of “Shadow IT” emerged to describe services that employees have adopted and are using without explicit IT permission or integration into the corporate network’s traffic flow and security policies. Exceptions to filtering policies for specific users and use cases have become unmanageable, and our customers have described a general “wild west” feeling about their networks as Internet use grew faster than anyone could have anticipated. And it’s not just gaps in filtering that scare CIOs — the proliferation of Shadow IT means company data can and does now exist in a huge number of unmanaged places across the Internet.</p><h4><b>Poor user experience</b></h4><p>Backhauling traffic through central locations to enforce security introduces latency for end users, amplified as they work in locations farther and farther away from their former offices. And the Internet, while it’s come a long way, is still fundamentally unpredictable and unreliable, leaving IT teams struggling to ensure availability and performance of apps for users with many factors (even down to shaky coffee shop Wi-Fi) out of their control.</p><h4><b>High (and growing) cost</b></h4><p>CIOs are still paying for MPLS links and hardware to enforce security across as much traffic as possible, but they’ve now taken on additional costs of point solutions to secure increasingly complex networks. And because of fragmented visibility and security gaps, coupled with performance challenges and rising expectations for a higher quality of user experience, the cost of providing IT support is growing.</p><h4><b>Network fragility</b></h4><p>All this complexity means that making changes can be really hard. On the legacy side of current hybrid architectures, provisioning MPLS lines and deploying new security hardware come with long lead times, only worsened by recent issues in the global hardware supply chain. And with the medley of point solutions introduced to manage various aspects of the network, a change to one tool can have unintended consequences for another. These effects compound in IT departments often being the bottleneck for business changes, limiting the flexibility of organizations to adapt to an only-accelerating rate of change.</p><p><b>Network Architecture Scorecard: Generation 2</b></p><p>Characteristic</p><p>Score</p><p>Description</p><p>Security</p><p>⭐</p><p>Many traffic flows are routed outside of perimeter security hardware, Shadow IT is rampant, and controls that do exist are enforced inconsistently and across a hodgepodge of tools.</p><p>Performance</p><p>⭐</p><p>Traffic backhauled through central locations introduces latency as users move further away; VPNs and a bevy of security tools introduce processing overhead and additional network hops.</p><p>Reliability</p><p>⭐⭐</p><p>The redundancy/cost tradeoff from Generation 1 is still present; partial cloud adoption grants some additional resiliency but growing use of unreliable Internet introduces new challenges.</p><p>Cost</p><p>⭐</p><p>Costs from Generation 1 architecture are retained (few companies have successfully deprecated MPLS/security hardware so far), but new costs of additional tools added, and operational overhead is growing.</p><p>Visibility</p><p>⭐</p><p>Traffic flows and visibility are fragmented; IT stitches partial picture together across multiple tools.</p><p>Agility</p><p>⭐⭐</p><p>Some changes are easier to make for aspects of business migrated to cloud; others have grown more painful as additional tools introduce complexity.</p><p>Precision</p><p>⭐⭐</p><p>Mix of controls exercised at network layer and application layer. Accomplishing “allow only HR to access employee payment data” looks like: <code>Users in group X allowed to access IP in range Y</code> (and accompanying spreadsheet to track IP allocation)</p><p>In summary — to reiterate where we started — modern CIOs have really hard jobs. But we believe there’s a better future ahead.</p><h2>Generation 3: The Internet as the new corporate network</h2><p>The next generation of corporate networks will be built on the Internet. This shift is already well underway, but CIOs need a platform that can help them get access to a <i>better</i> Internet — one that’s more secure, faster, more reliable, and preserves user privacy while navigating complex global data regulations.</p><h3>Zero Trust security at Internet scale</h3><p>CIOs are hesitant to give up expensive forms of private connectivity because they feel more secure than the public Internet. But a <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust approach</a>, delivered on the Internet, dramatically increases security versus the classic castle and moat model or a patchwork of appliances and point software solutions adopted to create “defense in depth.” Instead of trusting users once they’re on the corporate network and allowing lateral movement, Zero Trust dictates authenticating and authorizing every request into, out of, and between entities on your network, ensuring that visitors can only get to applications they’re explicitly allowed to access. And delivering this authentication and policy enforcement from an edge location close to the user enables radically better performance, rather than forcing traffic to backhaul through central data centers or traverse a huge stack of security tools.</p><p>In order to enable this new model, CIOs need a platform that can:</p><p><b>Connect all the entities on their corporate network.</b></p><p>It has to not just be possible, but also easy and reliable to connect users, applications, offices, data centers, and cloud properties to each other as flexibly as possible. This means support for the hardware and connectivity methods customers have today, from enabling mobile clients to operate across OS versions to compatibility with standard tunneling protocols and network peering with global telecom providers.</p><p><b>Apply comprehensive security policies.</b></p><p>CIOs need a solution that integrates tightly with their existing identity and endpoint security providers and provides Zero Trust protection at all layers of the OSI stack across traffic within their network. This includes end-to-end encryption, microsegmentation, sophisticated and precise filtering and inspection for traffic between entities on their network (“East/West”) and to/from the Internet (“North/South”), and protection from other threats like DDoS and <a href=\"https://www.cloudflare.com/learning/bots/what-is-a-bot-attack/\">bot attacks</a>.</p><p><b>Visualize and provide insight on traffic.</b></p><p>At a base level, CIOs need to understand the full picture of their traffic: who’s accessing what resources and what does performance (latency, jitter, packet loss) look like? But beyond providing the information necessary to answer basic questions about traffic flows and user access, next-generation visibility tools should help users understand trends and highlight potential problems proactively, and they should provide easy-to-use controls to respond to those potential problems. Imagine logging into one dashboard that provides a comprehensive view of <a href=\"https://www.cloudflare.com/application-services/products/securitycenter/\">your network’s attack surface</a>, user activity, and performance/traffic health, receiving customized suggestions to tighten security and optimize performance, and being able to act on those suggestions with a single click.</p><h3>Better quality of experience, everywhere in the world</h3><p>More classic critiques of the public Internet: it’s slow, unreliable, and increasingly subject to complicated regulations that make operating on the Internet as a CIO of a globally distributed company exponentially challenging. The platform CIOs need will make intelligent decisions to optimize performance and ensure reliability, while offering flexibility to make compliance easy.</p><p><b>Fast, in the ways that matter most.</b></p><p>Traditional methods of measuring network performance, like speed tests, don’t tell the full story of actual user experience. Next-generation platforms will measure performance holistically and consider application-specific factors, along with using real-time data on Internet health, to optimize traffic end-to-end.</p><p><b>Reliable, despite factors out of your control.</b></p><p>Scheduled downtime is a luxury of the past: today’s CIOs need to operate 24x7 networks with as close as possible to 100% uptime and reachability from everywhere in the world. They need a provider that’s resilient in its own services, but also has the capacity to handle massive attacks with grace and flexibility to route around issues with intermediary providers. Network teams should also not need to take action for their provider’s planned or unplanned data center outages, such as needing to manually configure new data center connections. And they should be able to onboard new locations at any time without waiting for vendors to provision additional capacity close to their network.</p><p><b>Localized and compliant with data privacy regulations.</b></p><p><a href=\"https://www.cloudflare.com/learning/privacy/what-is-data-sovereignty/\">Data sovereignty</a> laws are rapidly evolving. CIOs need to bet on a platform that will give them the flexibility to adapt as new protections are rolled out across the globe, with one interface to manage their data (not fractured solutions in different regions).</p><h3>A paradigm shift that’s possible starting today</h3><p>These changes sound radical and exciting. But they’re also intimidating — wouldn’t a shift this large be impossible to execute, or at least take an unmanageably long time, in complex modern networks? Our customers have proven this doesn’t have to be the case.</p><p><b>Meaningful change starting with just one flow</b></p><p>Generation 3 platforms should prioritize ease of use. It should be possible for companies to start their Zero Trust journey with just one traffic flow and grow momentum from there. There’s lots of potential angles to start with, but we think one of the easiest is configuring clientless Zero Trust access for one application. Anyone, from the smallest to the largest organizations, should be able to pick an app and prove the value of this approach within minutes.</p><p><b>A bridge between the old &amp; new world</b></p><p>Shifting from network-level <a href=\"https://www.cloudflare.com/learning/access-management/what-is-access-control/\">access controls</a> (IP ACLs, VPNs, etc.) to application and user-level controls to enforce Zero Trust across your entire network will take time. CIOs should pick a platform that makes it easy to migrate infrastructure over time by allowing:</p><ul><li><p><b>Upgrading from IP-level to application-level architecture over time</b>: Start by connecting with a GRE or IPsec tunnel, then use automatic service discovery to identify high-priority applications to target for finer-grained connection.</p></li><li><p><b>Upgrading from more open to more restrictive policies over time</b>: Start with security rules that mirror your legacy architecture, then leverage analytics and logs to implement more restrictive policies once you can see who’s accessing what.</p></li><li><p><b>Making changes to be quick and easy</b>: Design your next-generation network using a modern SaaS interface.</p></li></ul>\n            <figure class=\"kg-card kg-image-card kg-width-wide\">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2uR48rrlXRiy1jyHko824m/da8adf08d9aba283513b2ae2f63d183d/unnamed--3-.png\" alt=\"\" class=\"kg-image\" width=\"1523\" height=\"733\" loading=\"lazy\"/>\n            \n            </figure><p><b>Network Architecture Scorecard: Generation 3</b></p><p>Characteristic</p><p>Score</p><p>Description</p><p>Security</p><p>⭐⭐⭐</p><p>Granular security controls are exercised on every traffic flow; attacks are blocked close to their source; technologies like Browser Isolation keep malicious code entirely off of user devices.</p><p>Performance</p><p>⭐⭐⭐</p><p>Security controls are enforced at location closest to each user; intelligent routing decisions ensure optimal performance for all types of traffic.</p><p>Reliability</p><p>⭐⭐⭐</p><p>The platform leverages redundant infrastructure to ensure 100% availability; no one device is responsible for holding policy and no one link is responsible for carrying all critical traffic.</p><p>Cost</p><p>⭐⭐</p><p>Total cost of ownership is reduced by consolidating functions.</p><p>Visibility</p><p>⭐⭐⭐</p><p>Data from across the edge is aggregated, processed and presented along with insights and controls to act on it.</p><p>Agility</p><p>⭐⭐⭐</p><p>Making changes to network configuration or policy is as simple as pushing buttons in a dashboard; changes propagate globally within seconds.</p><p>Precision</p><p>⭐⭐⭐</p><p>Controls are exercised at the user and application layer. Accomplishing “allow only HR to access employee payment data” looks like: <code>Users in HR on trusted devices allowed to access employee payment data</code></p><h2>Cloudflare One is the first built-from-scratch, unified platform for next-generation networks</h2><p>In order to achieve the ambitious vision we’ve laid out, CIOs need a platform that can combine Zero Trust and network services operating on a world-class global network. We believe Cloudflare One is the first platform to enable CIOs to fully realize this vision.</p><p>We built Cloudflare One, our combined Zero Trust network-as-a-service platform, on our <a href=\"https://www.cloudflare.com/network/\">global network</a> in software on commodity hardware. We initially started on this journey to serve the needs of our own IT and security teams and extended capabilities to our customers over time as we realized their potential to help other companies transform their networks. Every Cloudflare service runs on every server in over 250 cities with over 100 Tbps of capacity, providing unprecedented scale and performance. Our security services themselves are also faster — our DNS filtering runs on the world’s fastest public DNS resolver and identity checks run on Cloudflare Workers, the fastest serverless platform.</p><p>We leverage insights from over 28 million requests per second and 10,000+ interconnects to make smarter security and performance decisions for all of our customers. We provide both network connectivity and security services in a single platform with single-pass inspection and single-pane management to fill visibility gaps and deliver exponentially more value than the sum of point solutions could alone. We’re giving CIOs access to our globally distributed, blazing-fast, intelligent network to use as an extension of theirs.</p><p>This week, we’ll recap and expand on Cloudflare One, with examples from real customers who are building their next-generation networks on Cloudflare. We’ll dive more deeply into the capabilities that are available today and how they’re solving the problems introduced in Generation 2, as well as introduce some new product areas that will make CIOs’ lives easier by eliminating the cost and complexity of legacy hardware, hardening security across their networks and from multiple angles, and making all traffic routed across our already fast network even faster.</p><p>We’re so excited to share how we’re making our dreams for the future of corporate networks reality — we hope CIOs (and everyone!) reading this are excited to hear about it.</p>",
		"id": "ZBDW05oRieXSKlFPx7O96",
		"localeList": {
			"name": "Welcome to CIO Week and the future of corporate networks Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "Translated for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "Translated for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "Translated for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "This week, we’ll demonstrate how Cloudflare One, our Zero Trust Network-as-a-Service, is helping CIOs transform their corporate networks. ",
		"metadata": {
			"title": "Welcome to CIO Week and the future of corporate networks",
			"description": "This week, we’ll demonstrate how Cloudflare One, our Zero Trust Network-as-a-Service, is helping CIOs transform their corporate networks. ",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/49iQYC6AM8FEhAQM1fZsV/2f4726e781f5eccc8ee3b47701c21c1b/welcome-to-cio-week-2rsDbL.png"
		},
		"primary_author": {},
		"published_at": "2021-12-05T20:58:39.000+00:00",
		"reading_time": 13,
		"slug": "welcome-to-cio-week",
		"tags": [
			{
				"id": "6PL1qd9UWWPNeHpKrVcurc",
				"name": "CIO Week",
				"slug": "cio-week"
			},
			{
				"id": "4Z2oveL0P0AeqGa5lL4Vo1",
				"name": "Cloudflare One",
				"slug": "cloudflare-one"
			},
			{
				"id": "J61Eszqn98amrYHq4IhTx",
				"name": "Zero Trust",
				"slug": "zero-trust"
			},
			{
				"id": "2pcyy3MC5QUGAVUG9WWwOO",
				"name": "NaaS",
				"slug": "naas"
			}
		],
		"title": "Welcome to CIO Week and the future of corporate networks",
		"updated_at": "2024-08-27T01:40:13.963Z",
		"url": "https://blog.cloudflare.com/welcome-to-cio-week"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}