{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"fr-fr",
		"de-de",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Mahrud Sayrafi",
				"slug": "mahrud",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3oJ9WVHHNMlgP7JrGdw98U/05f975dfccb065a94458a13e0cba2e5d/mahrud.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "As was mentioned in the original 1.1.1.1 blog post, our policy is to never write client IP addresses to disk and wipe all logs within 24 hours. Still some folks might not want to reveal their IP address to the resolver at all. This is why we are launching a Tor hidden service for our resolver.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6e7w7q4unkcG9dLGZFnH0A/a0c3a53b4f04d795577e7452cc609e5e/welcome-hidden-resolver.gif",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7Yw8GI5U0Zb0wCOEdtjJ9/bd6cb6387e0233485e9f9b1c090a3ae3/image_0.png\" alt=\"image_0\" class=\"kg-image\" width=\"2235\" height=\"840\" loading=\"lazy\"/>\n            \n            </figure><p>In case you haven’t heard yet, Cloudflare <a href=\"/dns-resolver-1-1-1-1/\">launched</a> a privacy-first <a href=\"https://www.cloudflare.com/learning/dns/what-is-dns/\">DNS</a> resolver service on April 1st. It was no joke! The service, which was our first consumer-focused service, supports emerging DNS standards such as DNS over HTTPS:443 and TLS:853 in addition to traditional protocols over UDP:53 and TCP:53, all in one easy to remember address: <a href=\"https://1.1.1.1/\">1.1.1.1</a>.</p><p>As it was mentioned in the original blog post, our policy is to never, ever write client IP addresses to disk and wipe all logs within 24 hours. Still, the exceptionally privacy-conscious folks might not want to reveal their IP address to the resolver at all, and we respect that. This is why we are launching a Tor onion service for our resolver at <a href=\"https://dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion/\">dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion</a> and accessible via <a href=\"https://tor.cloudflare-dns.com/\">tor.cloudflare-dns.com</a>.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/36t8h9iQGlsrDy3TQc1tKA/e9e068e98b028fca2ba78befea43aff2/tor.gif\" alt=\"tor\" class=\"kg-image\" width=\"800\" height=\"101\" loading=\"lazy\"/>\n            \n            </figure><p><b>NOTE:</b> the hidden resolver is still an experimental service and should not be used in production or for other critical uses until it is more tested.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"crash-course-on-tor\">Crash Course on Tor</h3>\n            <a href=\"#crash-course-on-tor\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <h4>What is <a href=\"https://www.torproject.org/\">Tor</a>?</h4><p>Imagine an alternative Internet where, in order to connect to <a href=\"http://www.cloudflare.com\">www.cloudflare.com</a>, instead of delegating the task of finding a path to our servers to your internet provider, you had to go through the following steps to reach Cloudflare:</p><ol><li><p>You calculate a path to your destination, like this:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"> You -&gt; Your ISP -&gt; X -&gt; Y -&gt; Z -&gt; www.cloudflare.com.</pre></code>\n            </li><li><p>You encrypt your packet with Z’s public key, then with Y’s, and finally with X’s.</p></li><li><p>You submit the result to X, who decrypts with their private key;</p></li><li><p>X submits the result to Y, who decrypts with their private key;</p></li><li><p>Y submits the result to Z, who decrypts with their private key to get the original packet;</p></li><li><p>Z submits the packet to <a href=\"www.cloudflare.com\">www.cloudflare.com</a>.</p></li></ol><p>If everyone plays their roles correctly, it is possible to ensure only the entry relay X knows your IP address and only the exit relay Z knows the website you’re connecting you, thereby providing you with privacy and anonymity. This is a simplified version of Tor: a collection of volunteer-run computers and servers around the world acting as relays for a huge network built on top of the Internet where every hop from one relay to the next peels one layer of encryption, hence its name: the onion router.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1yOeNLuz06vq97sSVI7Wh3/de4df11e1d5a16707fc9782e08e353f9/exit-node.png\" alt=\"exit-node\" class=\"kg-image\" width=\"1430\" height=\"496\" loading=\"lazy\"/>\n            \n            </figure><h4>What are Tor onion services?</h4><p>Keeping internet users anonymous is not the only function of the Tor network. In particular, one caveat of the procedure above is that the connection is still accessible by the exit relay and anyone sitting between there and the destination, including network providers. To solve this problem, and to also provide anonymity for content publishers, Tor allows for onion services. Onion services are Tor nodes that advertise their public key, encoded as an address with .onion TLD, and establish connections entirely within the Tor network:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3xHVrOH2M3xUJAoyWyOrVv/18da5a8d9cabe75b4e6e4d043794033b/image_3.png\" alt=\"image_3\" class=\"kg-image\" width=\"2500\" height=\"576\" loading=\"lazy\"/>\n            \n            </figure><h4>How do you resolve a domain while using Tor?</h4><p>The process of returning an IP address given a domain name is called <i>DNS resolution</i>. Since Tor still uses IP addresses, you still need to do DNS resolution to browse the web over Tor. There are two common methods to resolve a domain name when using Tor:</p><ol><li><p>Resolve the name directly, then talk to the IP address through Tor;</p></li><li><p>Ask a Tor exit relay to resolve the name publicly and connect to the IP.</p></li></ol><p>Clearly, the first option leaks your IP to your DNS resolver and, unless your client uses DNS-over-HTTPS or DNS-over-TLS, it leaks your destination name to your ISP. What is less obvious is that the second option can open you to manipulation <a href=\"https://arstechnica.com/information-technology/2014/01/scientists-detect-spoiled-onions-trying-to-sabotage-tor-privacy-network/\">attacks</a> such as DNS poisoning or sslstrip by <a href=\"https://trac.torproject.org/projects/tor/wiki/doc/ReportingBadRelays\">bad relays</a>. This is where our new service comes in:</p><ol><li><p>Ask a .onion-based resolver service!</p></li></ol>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"how-does-the-cloudflare-hidden-resolver-work\">How does the Cloudflare hidden resolver work?</h3>\n            <a href=\"#how-does-the-cloudflare-hidden-resolver-work\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>In a few words, our .onion-based resolver service is a Tor onion service which forwards all communication on DNS ports to the corresponding ports on 1.1.1.1, hence the apparent client IP is an internal IP rather than yours. There is, however, more than meets the eye.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/58mt2tE0qg8NuZBxlQLIkv/896c317a4e879fda177519e1a7ae8ab7/image_4.png\" alt=\"image_4\" class=\"kg-image\" width=\"2500\" height=\"597\" loading=\"lazy\"/>\n            \n            </figure><h4>Is the hidden resolver secure?</h4><p>One glaring difference between using 1.1.1.1 and this service is that the .onion address is &quot;dns4tor&quot; plus 49 seemingly random alphanumeric characters. This 56 character long string, in fact, contains a full Ed25519 public key which is used to secure communication with the onion service. This poses a number of challenges towards usable security:</p><ol><li><p>How can the users make sure that that the address is correct?</p></li></ol><p>We simply bought a <a href=\"https://crt.sh/?id=439705277\">certificate</a> with tor.cloudflare-dns.com as subject name and the .onion address as a subject alternative name. This way, if you’re in the right place, you should see this:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/WiWQY2XjyAsa9JZ9nJAbf/de8f31b6bfa3c419e1b35d62c40bbc8e/image_5.png\" alt=\"image_5\" class=\"kg-image\" width=\"782\" height=\"24\" loading=\"lazy\"/>\n            \n            </figure><ol><li><p>How can the users remember this address?</p></li></ol><p>We don’t think you should need to remember this address. Ideally, all you would need to do is go to <a href=\"https://tor.cloudflare-dns.com\">https://tor.cloudflare-dns.com</a> and have the browser route your request to the .onion address. This is possible using the &quot;<a href=\"https://tools.ietf.org/html/rfc7838\">Alt-Svc</a>&quot; HTTP header which is an optional header notifying the browser that the resources can be accessed from an alternative network location, possibly using a different protocol. Thanks to <a href=\"https://hacks.mozilla.org/2018/05/a-cartoon-intro-to-dns-over-https/\">Mozilla</a>, using .onion addresses as alternative services is now possible in <a href=\"https://nightly.mozilla.org/\">Firefox Nightly</a>.</p><p>Think of this feature like <a href=\"/opportunistic-encryption-bringing-http-2-to-the-unencrypted-web/\">opportunistic encryption</a>: once your browser receives an Alt-Svc header indicating that a .onion address is available for tor.cloudflare-dns.com, if it knows that .onion addresses can be accessed (for instance through a SOCKS proxy), it attempts to check that the alternative service has the same or a higher level of security. This includes making sure that it is possible to connect to the onion service using the same certificate and <a href=\"https://tools.ietf.org/html/rfc6066#section-3\">Server Name</a>. If that is the case, the browser uses the alternative service instead, therefore ensuring that your future requests do not leave the Tor network.</p><h4>Is the hidden resolver fast?</h4><p>Here is a thought experiment: suppose between each two points on Earth there is a fiber-optic cable, capable of lossless transmission of packets at the speed of light.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/7olJSMff3uxlGuOb2G6j3E/99c18c3b4a9a94c4586bdf2e8e6bd390/image_6.png\" alt=\"image_6\" class=\"kg-image\" width=\"1435\" height=\"957\" loading=\"lazy\"/>\n            \n            </figure><p>Using a back-of-the-envelope calculation it’s easy to see that, on average, each packet traverses a distance equivalent to a <b>quarter</b> of the circumference of the Earth in about <b>33ms</b>, while each Tor packet takes about <b>200ms</b> to go <b>one and a half</b> turns around the Earth before reaching an onion service; that’s three turns for a round trip that ensures anonymity of both parties.</p><p>Cloudflare, however, does not require anonymity for its servers, which is why we can reduce the number of relays to just three by enabling an <a href=\"https://trac.torproject.org/projects/tor/ticket/17178\">optional</a> <a href=\"https://gitweb.torproject.org/torspec.git/tree/proposals/260-rend-single-onion.txt\">setting</a> for onion services that prioritize lower latency over location anonymity of the service. To emphasize, this does not impact client privacy or anonymity whatsoever. Indeed, as you may have noticed, in the first onion service image the origin is three hops away from the rendezvous point whereas our onion service is only one hop away.</p><p>We are actively working on developing ways to make this service faster and ensure it has as little downtime as possible.</p><h4>Why should I use the Cloudflare hidden resolver?</h4><p>First and foremost, resolving DNS queries through the Tor network, for instance by connecting to Google’s 8.8.8.8 resolver, guarantees a significantly higher level of anonymity than making the requests directly. Not only does doing so prevent the resolver from ever seeing your IP address, even your ISP won’t know that you’ve attempted to resolve a domain name.</p><p>Still, unless the destination is an onion service, passive attackers can capture packets exiting the Tor network and malicious Exit Nodes can poison DNS queries or downgrade encryption through <a href=\"https://moxie.org/software/sslstrip/\">sslstripping</a>. Even if you limit your browsing to <a href=\"https://www.eff.org/pages/tor-and-https\">only HTTPS</a> sites, passive attackers can find out which addresses you’ve connected to. Even worse, actors capable of comparing traffic both before it enters the Tor network and after it leaves the network can potentially use the metadata (size, time, etc.) to <a href=\"https://nymity.ch/tor-dns/\">deanonymize</a> the client. The only solution, then, is to eliminate the need for Exit Nodes by using onion services instead. That is what our .onion-based resolver offers.</p><p>Moreover, if your client does not support encrypted DNS queries, using a .onion-based resolver can secure the connection from on-path attacks, including BGP hijacking attacks. This means having the same level of security for DNS-over-UDP and DNS-over-TCP as DNS-over-HTTPS and DNS-over-TLS provides.</p><p>Your personal anonymity, however, is not the only reason why you should use this service. The power of Tor in ensuring everyone’s anonymity rests on the number of people who use it. If only whistleblowers, for instance, were to use the Tor network, then anyone connecting to the Tor network would automatically be suspected of being a whistleblower. Therefore the more people use Tor to browse memes or to watch cat videos on the Internet, the easier it will be for those who truly need anonymity to blend in with the traffic.</p><p>One barrier to using Tor for many users is that it is simply slow, so I can try to sympathize with those who wouldn’t sacrifice quick website load times to help keep activists and dissidents anonymous. That said, DNS requests are small in size and since most browsers and operating systems cache DNS results the total traffic is not significant. As a result, using the .onion-based resolver will only slightly slow down your initial DNS request without slowing down anything else, while still contributing to the overall anonymity of the Tor network and its users.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"why-should-i-trust-the-cloudflare-hidden-resolver\">Why should I trust the Cloudflare hidden resolver?</h3>\n            <a href=\"#why-should-i-trust-the-cloudflare-hidden-resolver\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Using a .onion-based resolver ensures that your ISP never finds out that you’re resolving a domain, the Exit Nodes don’t get a chance to manipulate DNS replies, and the resolver never finds out your IP address. However, the unique benefit of using the Cloudflare .onion-based resolver is combining the power of Tor with all privacy-preserving features of the 1.1.1.1 resolver, such as query name minimization, as well as a team of engineers working on improving it at every level, including standards like DNS-over-HTTPS and DNS-over-TLS.</p><p>As CEO Matthew Prince said about <a href=\"/the-trouble-with-tor/\">two years ago</a>, anonymity online is a cause we value at Cloudflare. In addition, when we announced the 1.1.1.1 resolver we <a href=\"https://developers.cloudflare.com/1.1.1.1/commitment-to-privacy/\">committed</a> to taking every technical step to ensure we can’t know what you do on the internet. Providing a way to use the resolver through the Tor network and making it as fast as possible is a big step in that direction.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"how-to-set-it-up\">How to set it up?</h3>\n            <a href=\"#how-to-set-it-up\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>The .onion-based resolver supports every DNS protocol that 1.1.1.1 supports, only over the Tor network. However, since not every DNS client is capable of connecting to the Tor network, some hacking is required to get it to work. Here we will explain how to set up DNS-over-HTTPS provided from the .onion-based resolver, but for all other scenarios head to our <a href=\"http://developers.cloudflare.com/1.1.1.1/fun-stuff/dns-over-tor/\">developers page</a> to get the details of how to use the .onion-based resolver.</p><h4>Remember cloudflared?</h4><p>Here is how you can set up <code>cloudflared</code> to start a DNS client that uses DNS over HTTPS, routed through the Tor network:</p><ol><li><p>First, start with downloading <code>cloudflared</code> by following the regular guide for <a href=\"https://developers.cloudflare.com/1.1.1.1/dns-over-https/cloudflared-proxy/\">Running a DNS over HTTPS Client</a>.</p></li><li><p>Start a Tor SOCKS proxy and use <code>socat</code> to forward port TCP:443 to localhost:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"> socat TCP4-LISTEN:443,reuseaddr,fork SOCKS4A:127.0.0.1:dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion:443,socksport=9150</pre></code>\n            </li><li><p>Instruct your machine to treat the .onion address as localhost:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"> cat &lt;&lt; EOF &gt;&gt; /etc/hosts\n 127.0.0.1 dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion\n EOF</pre></code>\n            </li><li><p>Finally, start a local DNS over UDP daemon:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\"> cloudflared proxy-dns --upstream &quot;https://dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion/dns-query&quot;\n INFO[0000] Adding DNS upstream                           url=&quot;https://dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion/dns-query&quot;\n INFO[0000] Starting DNS over HTTPS proxy server          addr=&quot;dns://localhost:53&quot;\n INFO[0000] Starting metrics server                       addr=&quot;127.0.0.1:35659&quot;</pre></code>\n            </li><li><p>Profit!</p></li></ol>",
		"id": "5IWsSpqyKELgaGEVhkAhxx",
		"localeList": {
			"name": "Introducing DNS Resolver for Tor Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "Translated for Locale",
			"deDE": "Translated for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": null,
		"metadata": {
			"imgPreview": ""
		},
		"primary_author": {},
		"published_at": "2018-06-05T15:46:17.000+01:00",
		"slug": "welcome-hidden-resolver",
		"tags": [
			{
				"id": "2FQK880QI5lKEUCjVHBber",
				"name": "1.1.1.1",
				"slug": "1-1-1-1"
			},
			{
				"id": "6Nqy1V9XurncHC2WQb8NW8",
				"name": "Tor",
				"slug": "tor"
			},
			{
				"id": "3BWeMuiOShelE7QM48sW9j",
				"name": "Privacy",
				"slug": "privacy"
			},
			{
				"id": "5fZHv2k9HnJ7phOPmYexHw",
				"name": "DNS",
				"slug": "dns"
			},
			{
				"id": "2erOhyZHpwsORouNTuWZfJ",
				"name": "Resolver",
				"slug": "resolver"
			},
			{
				"id": "1QsJUMpv0QBSLiVZLLQJ3V",
				"name": "Cryptography",
				"slug": "cryptography"
			}
		],
		"title": "Introducing DNS Resolver for Tor",
		"updated_at": "2024-10-10T00:33:21.866Z",
		"url": "https://blog.cloudflare.com/welcome-hidden-resolver"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}