{
	"initialReadingTime": "6",
	"locale": "en-us",
	"localesAvailable": [],
	"post": {
		"authors": [
			{
				"name": "Yair Dovrat",
				"slug": "yair-dovrat",
				"bio": "Product Manager at Cloudflare. Previously co-founder & CEO of Zaraz, a third-party manager built for speed, privacy and security. A poet and classicist. Y Combinator W20 batch.",
				"profile_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/5UwO1VKanovwEMj5XpBEVZ/0645733ec015c8fa0f44ae45d98ae32b/yair-dovrat.jpeg",
				"location": "Brussels",
				"website": null,
				"twitter": "@YDovrat",
				"facebook": null
			}
		],
		"excerpt": "We are thrilled to announce Cloudflare Zaraz support for server-side rendering of embeds from X and Instagram. This allows for secure, privacy-preserving, and performant embedding without third-party JavaScript or cookies, enhancing security, privacy, and performance on your website",
		"feature_image": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/4QT8YG3JHwicIugNCUuO9K/0a062e60cbe6a944f68094089376e043/zaraz-supports-server-side-rendering-of-embeds.png",
		"featured": false,
		"html": "\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/6rAFgpMjk9I8iIWr3lM3Yy/b75191f4767e9f5857a186edc7e07871/Enhancing-Zaraz-Support_-Introducing-Certified-Developer-1.png\" alt=\"Cloudflare Zaraz adds support for server-side rendering of X and Instagram embeds\" class=\"kg-image\" width=\"2401\" height=\"1351\" loading=\"lazy\"/>\n            \n            </figure><p>We are thrilled to announce <a href=\"https://developers.cloudflare.com/zaraz/\">Cloudflare Zaraz</a> support of server-side rendering of embeds, featuring two Managed Components: X and Instagram. You can now use Cloudflare Zaraz to effortlessly embed posts from X or Instagram on your website in a performant, privacy-preserving, and secure way. Many traditional tag managers or customer data platforms rely heavily on third-party JavaScript and cookies to embed content, leading to concerns about privacy and performance. In contrast, we designed our solution to work without loading any third-party JavaScript or cookies, and furthermore to completely eliminate communication between the browser and third-party servers.</p><p>Starting today, you can use Cloudflare Zaraz not only for server-side data reporting to conventional marketing and analytics tools but also for server-side content rendering on your website. We are excited to pave the way with tools that enhance security, protect user privacy, and improve performance. Take a look at it:</p><!--kg-card-begin: html--><twitter-post tweet-id=\"1811018789498040736\"></twitter-post><!--kg-card-end: html--><h2>Embed social media content without sacrificing security and speed</h2><p>Since social media platforms emerged, we have become more and more familiar with seeing posts being embedded on websites, from showcasing user testimonials on product pages to featuring posts from reporters and politicians in news articles or blogs. Traditionally, this process has involved integrating HTML and JavaScript code provided by the social media platform. While this method was quite convenient and simple to implement, it also introduces significant drawbacks in terms of security, privacy, and performance.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/2qxUuLVQHw3C0rXGaaAb9m/08fa783bad193fce133c56d97e182c02/image5-6.png\" alt=\"\" class=\"kg-image\" width=\"1882\" height=\"1280\" loading=\"lazy\"/>\n            \n            </figure><p><i>Instagram’s interface to copy HTML embed code</i></p><p>One of the primary concerns with using the embed scripts from these platforms is privacy. Today, there’s simply no way to embed social media content on your website without letting social media platforms collect data on your users. Very often this is done via <a href=\"https://www.cloudflare.com/learning/privacy/what-are-cookies/\">cookies</a>, but it is not the only way in which social media platforms collect information on your end users. More often than not, traditional embed scripts <a href=\"https://www.insideprivacy.com/international/european-union/cjeu-rules-that-facebook-and-website-operators-are-joint-controllers-if-the-website-embeds-facebooks-like-button/\">capture sensitive information</a> from the browser and include it in the requests sent to their endpoints, and often even to other third-party endpoints. Even if they don’t explicitly collect private information, the very request made from the browser to fetch the remote JavaScript resource can potentially expose sensitive user information, such as the IP address or User Agent. This practice has already led to GDPR compliance issues in Europe with other tools, as seen in the case with <a href=\"/cloudflare-fonts-enhancing-website-privacy-speed/\">Google Fonts</a>, and poses a similar future risk with any other third-party tool, including embeds.</p><p>Security is another big risk embed scripts pose. By embedding these external scripts, websites essentially place their trust in the security of these third-party platforms. A single vulnerability in any of their dependency libraries could <a href=\"/detecting-magecart-style-attacks-for-pageshield/\">compromise user safety</a> on a massive scale.</p><p>In contrast to traditional social media platform code snippets, Zaraz&#39;s method of embedding X and Instagram posts does not load any third-party JavaScript on the client side. And not only that, by leveraging different <a href=\"https://managedcomponents.dev/specs/category/server-functionality\">Managed Component APIs</a> (see code walkthrough below), Zaraz is fetching and caching all the content on the server side, and serving everything from your own domain. This means that there’s simply no direct communication between the end user’s browser and the third-party endpoint, which gives you much greater control over what information is shared with the external platform, if any.</p><p>Zaraz, running entirely on Cloudflare Workers, and with its ability to inject HTML before web content is served, also has performance advantages. Below, you can see the perfect 100 score that our X embed has received from Google PageSpeed Insights, and our ability to reach 0ms Total Blocking Time with only one request and a minimal transfer size of 12.1 KiB. To showcase the new feature, we’ve put together two identical HTML pages that are loading <a href=\"https://twitter.com/eastdakota/status/1754336034228171055\">this tweet</a>. One is embedding the tweet using Zaraz, the other embeds the code snippet provided by X. We then ran the Google PageSpeed Insights tests on the pages, loaded from the exact same environment.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/pyQqFF6zKQSQ96Oprg5y6/53e785d04eee661f8a01402c8b5297f9/image3-16.png\" alt=\"Cloudflare Zaraz Twitter Embed scores 100 in Google PageSpeed Insights test\" class=\"kg-image\" width=\"1434\" height=\"1056\" loading=\"lazy\"/>\n            \n            </figure><p>In comparison, the traditional way of embedding social media posts introduces a significant performance hit. Below are the results of the traditional embed code we tested: a 27-point decrease in the performance score, multiple requests with transfer size of 475 KiB, and 1,010 ms of Total Blocking Time (more than a second just to render this tweet!).</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/1dJCmspfbNoxmc2dm9PiAl/8b667dc0faacc0589975ec8f8e60a27d/image2-16.png\" alt=\"X’s Embed code caused a 27-point decrease in the performance score on this Google PageSpeed Insights test.\" class=\"kg-image\" width=\"1458\" height=\"1324\" loading=\"lazy\"/>\n            \n            </figure>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/3gXElZQ1BvYq8KbEn6BIfQ/a5801ffc233aec3e42e867a7505fabc2/image1-24.png\" alt=\"X’s Embed code is blocking the main thread for over a second. \" class=\"kg-image\" width=\"1428\" height=\"1226\" loading=\"lazy\"/>\n            \n            </figure><p>By processing content server-side, we completely eliminate the need for cookies or third-party scripts on the client&#39;s browser, we prevent direct communication between the browser and the third-party server, and we provide a significantly faster user experience. So how does it work? Let’s dive into the code.</p><h2>Using and building embeds</h2><p>The <a href=\"https://github.com/managed-components/twitter/\">X</a> and <a href=\"https://github.com/managed-components/instagram/\">Instagram</a> Managed Components we’ve built are open source and available on GitHub. We took a different approach with each tool to showcase different methods for fetching content and generating the embed’s HTML and CSS. The X embed is requesting JSON from X’s endpoint, and is distributing the information received inside a templated HTML post we’ve written. The HTML template mimics the looks of the original post. The Instagram embed is requesting the actual post’s HTML generated by Instagram, manipulating it so that it doesn’t include any scripts, and routing all the images and CSS through your own domain. We outline and showcase the different processes below.</p><h3>How to embed posts using Cloudflare Zaraz</h3><p>Loading an embed with Cloudflare Zaraz is simple: instead of loading the Embed JavaScript provided by X or Instagram, you simply add a placeholder element to your HTML.</p><p>For X:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">&lt;twitter-post tweet-id=&quot;1754336034228171055&quot;&gt;&lt;/twitter-post&gt;</pre></code>\n            <p>* Make sure to replace the tweet-id with the number shown in the embedded tweet’s URL.</p><p>For Instagram:</p>\n            <pre class=\"language-bash\"><code class=\"language-bash\">&lt;instagram-post\n  post-url=&quot;https://www.instagram.com/p/Ct_qa1ZtmiW/&quot;\n  captions=&quot;true&quot;&gt;\n&lt;/instagram-post&gt;</pre></code>\n            <p>* Make sure to replace the post-url with the URL of the desired post. When `captions` is set to true, the embed will include the post’s captions.</p><p>Once you&#39;ve added the HTML to your page, activate the corresponding tools in your Cloudflare Zaraz dashboard. Click “Add new tools” to add X and Instagram. This is how your screen should look when you finish setting up your tools:</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/slt3lc6tev37/67s1MNMVw1VXwlgoAkGOg4/2f492af7f39388d3faf7f402626385c6/image6-4.png\" alt=\"\" class=\"kg-image\" width=\"1836\" height=\"1056\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare Zaraz will then detect placeholder elements in your HTML and replace them with the embedded social media content.</p><h3>Walkthrough of the X post embed</h3><p>The X Managed Component is registering the following embed:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">manager.registerEmbed(&quot;post&quot;, async ({ parameters, client }) =&gt; {\n  // embed&#039;s logic goes here\n});</pre></code>\n            <p>Zaraz detects the placeholder element , and picks up all the parameters included as HTML attributes of that element and sends them inside an object, together with the client, as the first argument of the <a href=\"https://managedcomponents.dev/specs/embed-and-widgets/embeds\"><code>manager.registerEmbed()</code></a> function. The <code>manager.registerEmbed()</code> <code>callback</code> will return HTML. To generate the HTML, we use generic HTML and CSS templates we’ve written to construct the post. Those templates contain placeholder variables to be filled with the relevant tweet data later on.</p><p>We use <a href=\"http://mustache.github.io/\">Mustache</a>, a library for rendering templates, to replace the placeholder variables spread across the HTML template. Wherever Mustache detects <code>{{text}}</code>, <code>{{name}}</code>, <code>{{username}}</code>, and the like in the HTML, it will replace their content with the relevant values we pass to it, like so:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">//using Mustache to search for and replace placeholder variables in the post template with the tweet&#039;s content \n    const output = mustache.render(post, {\n      text,\n      name: user.name,\n      username: user.screen_name,\n      picture: &#039;data:image/jpeg;base64,&#039; + profileImage,\n      datetime,\n      likes: numberFormatter(favorite_count, 1),\n      replies: numberFormatter(conversation_count, 1),\n      heartIcon,\n      commentIcon,\n      linkIcon,\n      tweetId,\n      xIcon,\n      tooltipIcon,\n      retweetUrl,\n    })</pre></code>\n            <p>Most of the values of the variables we pass to Mustache, which contain the specific post data, are being fetched from one of X’s endpoints. This is done with a server-side fetch request. The response, containing a JSON file with all the post’s data, is then populated into the corresponding variables as shown above.</p><p>Zaraz is also caching the JSON for better performance. This is done with the Managed Components <a href=\"https://managedcomponents.dev/specs/cache/useCache\"><code>manager.useCache()</code></a> method, which takes 3 arguments: name, function and expiry. Here, the function argument is using <a href=\"https://managedcomponents.dev/specs/server-functionality/fetch\"><code>manager.fetch()</code></a> to send a fetch request from the server.</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">(...)\n\n// grabs the tweet-id from the parameters argument\n    const tweetId = parameters[&#039;tweet-id&#039;] \n\n(...)\n\nconst tweetResponse = await manager.useCache(\n      &#039;tweet_&#039; + tweetId,\n      async () =&gt; {\n        const res = await manager.fetch(       `https://cdn.syndication.twimg.com/tweet-result?id=${tweetId}&amp;token=${randomToken}`,\n          {\n            headers: {\n              Accept: &#039;application/json&#039;,\n              &#039;User-Agent&#039;: client?.userAgent || prefixedUA,\n            },\n          }\n        )\n        if (!res) {\n          throw new Error(&#039;Failed to fetch tweet data.&#039;)\n        }\n        return await res.text()\n      },\n      600 // cache the Tweet for 10 minutes\n    )</pre></code>\n            <p>It is important to mention that all images populated in the post template, like the profile picture, are fetched server-side and cached using <a href=\"https://managedcomponents.dev/specs/storage/set\"><code>manager.set()</code></a>:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">// first, we check if profile image is already cached\nlet profileImage = await manager.get(&#039;profileImage_&#039; + user.screen_name)\n\n// if not, we fetch the image server-side and cache it using `manager.set()`\n\n    if (!profileImage) {\n      const res = await manager.fetch(user.profile_image_url_https, {\n        headers: {\n          Accept: &#039;image/jpeg,image/png,image/*,*/*;q=0.8&#039;,\n          &#039;User-Agent&#039;: client?.userAgent || prefixedUA,\n        },\n        method: &#039;GET&#039;,\n      })\n      if (res) {\n        const imageBuffer = await res.arrayBuffer()\n\n        profileImage = base64Encode(imageBuffer)\n        await manager.set(&#039;profileImage_&#039; + user.screen_name, profileImage)\n      }\n    }</pre></code>\n            <p>Once the post’s HTML is ready, with all the relevant content fetched and rendered, the Managed Component returns the HTML content to Zaraz. Zaraz will then use it to replace the  <code>&lt;twitter-post&gt;</code> placeholder element. Because this all happens on Cloudflare, the response to the end-user&#39;s browser will already contain the embed code.</p><h3>Walkthrough of the Instagram post embed</h3><p>The Instagram post embed is built around Instagram&#39;s own generated HTML. In contrast to the X example, which uses JSON data to populate an HTML template, this approach involves tweaking Instagram&#39;s HTML to meet our privacy and safety requirements.</p><p>We want the Instagram embed to work without requiring direct communication between the browser and any of Instagram’s endpoints. This is done by fetching CSS content server-side, caching it, and finally serving it together with the output HTML, avoiding any network request from the browser to fetch CSS content. We also set up a route server on the customer’s own domain, from which the Managed Components serve all images. Setting up a route endpoint with Managed Components is fairly straightforward:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">manager.route(&#039;/image/&#039;, async request =&gt; {\n// logic to fetch and cache all images\n});</pre></code>\n            <p>After setting up routes, we fetch the HTML content of the specific Instagram post, server-side, using the <code>manager.fetch()</code> method. We then manipulate the HTML to fit it to the specific website and cache it using <code>manager.useCache()</code>. Amongst other things, changes to the HTML include setting image <code>src</code> and <code>srcset</code> attributes to serve images from your own routes, to avoid requesting images from Instagram’s endpoint (and by so doing, potentially revealing sensitive user information). As mentioned above, we also remove all scripts and stylesheet links, as we prefetch and cache all CSS content from stylesheet links server-side, in order to serve CSS and spare the browser a few additional network requests, improving privacy and performance.</p><p>The HTML manipulation is done using the <a href=\"https://cheerio.js.org/\">Cheerio</a> library. This is how, for example, we adjust the `src` attribute of images to redirect through our route:</p>\n            <pre class=\"language-javascript\"><code class=\"language-javascript\">$(&#039;img[src*=&quot;scontent.cdninstagram.com&quot;]&#039;).each((i, el) =&gt; {\n        const img = $(el)\n        const src = img.attr(&#039;src&#039;)!\n        const newSrc = src.replace(\n          /^https:\\/\\/scontent.cdninstagram.com\\/(.*)$/,\n          (_match, path) =&gt;\n            `${hostName(client)}${imgRoute}?q=` + encodeURIComponent(path)\n        )\n        img.attr(&#039;src&#039;, newSrc) </pre></code>\n            <p>This implementation effectively prevents any direct communication from the browser to Instagram servers, safeguarding sensitive user information such as IP addresses.</p><h2>What is currently supported and what’s next for embeds</h2><p>Currently, our X embed supports text tweets and the Instagram embed supports image posts. We are working to broaden our support to other media types. Beyond these improvements, we aim to extend the application of our embeds across an even broader range of tools. We invite our users and partners to collaborate with us on the <a href=\"https://managedcomponents.dev/\">Managed Component</a> open source project, in adding support for more tools that can be rendered entirely server-side. We believe that this is the way to create a safer and faster web for everyone, and we hope that what we are launching today will inspire the community to build even better solutions together with us!</p><p>Start using embeds now by adding X and Instagram in your <a href=\"https://dash.cloudflare.com/?to=/:account/:zone/zaraz\">Zaraz dashboard</a>.</p>",
		"id": "7qKR1EQFjatQuFfSCAmPL8",
		"localeList": {
			"name": "Cloudflare Zaraz adds support for server-side rendering of X and Instagram embeds Config",
			"enUS": "English for Locale",
			"zhCN": "No Page for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "No Page for Locale",
			"koKR": "No Page for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "No Page for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "We are thrilled to announce Cloudflare Zaraz support for server-side rendering of embeds from X and Instagram. This allows for secure, privacy-preserving, and performant embedding without third-party JavaScript or cookies, enhancing security, privacy, and performance on your website.",
		"metadata": {
			"title": "Cloudflare Zaraz adds support for server-side rendering of X and Instagram embeds",
			"description": "We are thrilled to announce Cloudflare Zaraz support for server-side rendering of embeds from X and Instagram. This allows for secure, privacy-preserving, and performant embedding without third-party JavaScript or cookies, enhancing security, privacy, and performance on your website.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/slt3lc6tev37/KZIFtUDGgGJ1OO4ieSIlx/8a476b65a44df2e840afbb993fe02c06/zaraz-supports-server-side-rendering-of-embeds-Jc25iT.png"
		},
		"primary_author": {},
		"published_at": "2024-07-10T14:00:55.000+01:00",
		"slug": "zaraz-supports-server-side-rendering-of-embeds",
		"tags": [
			{
				"id": "5KsuE8WNLu5C4uyvr4XWCV",
				"name": "Zaraz",
				"slug": "zaraz"
			}
		],
		"title": "Cloudflare Zaraz adds support for server-side rendering of X and Instagram embeds",
		"updated_at": "2024-08-27T00:55:41.837Z",
		"url": "https://blog.cloudflare.com/zaraz-supports-server-side-rendering-of-embeds"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.blurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}