{
	"footerBlurb": "Cloudflare's connectivity cloud protects <a target='_blank' href='https://www.cloudflare.com/network-services/' rel='noreferrer'>entire corporate networks</a>, helps customers build <a target='_blank' href='https://workers.cloudflare.com/' rel='noreferrer'>Internet-scale applications efficiently</a>, accelerates any <a target='_blank' href='https://www.cloudflare.com/performance/accelerate-internet-applications/' rel='noreferrer'>website or Internet application</a>, <a target='_blank' href='https://www.cloudflare.com/ddos/' rel='noreferrer'>wards off DDoS attacks</a>, keeps <a target='_blank' href='https://www.cloudflare.com/application-security/' rel='noreferrer'>hackers at bay</a>, and can help you on <a target='_blank' href='https://www.cloudflare.com/products/zero-trust/' rel='noreferrer'>your journey to Zero Trust</a>.<br/><br/>Visit <a target='_blank' href='https://one.one.one.one/' rel='noreferrer'>1.1.1.1</a> from any device to get started with our free app that makes your Internet faster and safer.<br/><br/>To learn more about our mission to help build a better Internet, <a target='_blank' href='https://www.cloudflare.com/learning/what-is-cloudflare/' rel='noreferrer'>start here</a>. If you&apos;re looking for a new career direction, check out <a target='_blank' href='http://www.cloudflare.com/careers' rel='noreferrer'>our open positions</a>.",
	"initialReadingTime": "7",
	"locale": "en-us",
	"localesAvailable": [
		"zh-cn",
		"ja-jp",
		"ko-kr",
		"es-es"
	],
	"post": {
		"authors": [
			{
				"name": "Brian Parks",
				"slug": "brian-parks",
				"bio": null,
				"profile_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1V545Ct2rUBWSAf8y14rFw/951bd456e8ed87bd64183a45eaf111f2/brian-parks.jpg",
				"location": null,
				"website": null,
				"twitter": null,
				"facebook": null
			}
		],
		"excerpt": "As a small business network administrator, there are fundamentally three things you need to protect: devices, applications, and the network itself. Here's how.",
		"feature_image": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4xqBhj46D0LQ496ZR96KrF/39326bc16f77ac4aedd6e235914f888a/zero-trust-week-setting-up-cloudflare-one-as-a-small-business.png",
		"featured": false,
		"html": "<p>Earlier this week, <a href=\"/introducing-cloudflare-one/\">we announced</a> Cloudflare One™, our comprehensive, cloud-based network-as-a-service solution. <a href=\"/cloudflare-one/\">Cloudflare One</a> improves network performance and security while reducing cost and complexity for companies of all sizes.</p><p>Cloudflare One is built to handle the scale and complexity of the largest corporate networks. But when it comes to network security and performance, the industry has focused all too often on the largest of customers with significant budgets and technology teams. At Cloudflare, we think it’s our opportunity and responsibility to serve everyone, and help companies of all sizes benefit from a better Internet.</p><p>This is Zero Trust Week at Cloudflare, and we’ve already talked about our mantra of <a href=\"/teams-plans/\">Zero Trust for Everyone</a>. As a quick refresher, Zero Trust is a security framework that assumes all networks, devices, and Internet destinations are inherently compromised and therefore should not be trusted. Cloudflare One facilitates <a href=\"https://www.cloudflare.com/learning/security/glossary/what-is-zero-trust/\">Zero Trust security</a> by securing how your users connect to corporate applications and the Internet at large.</p><p>As a small business network administrator, there are fundamentally three things you need to protect: devices, <a href=\"https://www.cloudflare.com/application-services/solutions/\">applications</a>, and the network itself. Below, I’ll outline how you can secure devices whether they are in your office (DNS Filtering) or remote (WARP+ and Gateway), as well as applications and your network by moving to a Zero Trust model of security (Access).</p><p>By design, Cloudflare One is accessible to teams of any size. You shouldn&#39;t need a massive IT department or a Fortune 500 budget to connect to your tools safely.  On Tuesday, we <a href=\"/teams-plans/\">announced</a> a new free plan which provides many of the features of Cloudflare One, including DNS filtering, Zero Trust access, and a management dashboard - for up to 50 users at no cost.</p><p>Starting now, your team can begin deploying Cloudflare One in your organization in just a few simple steps.</p><p>Step 1: Protect offices from threats on the Internet with DNS Filtering (10 minutes)Step 2: <a href=\"https://www.cloudflare.com/products/zero-trust/remote-workforces/\">Secure remote workers</a> connecting to the Internet with Cloudflare WARP+ (30 minutes)Step 3: Connect users to applications without a VPN with Cloudflare Access (1 hour)Step 4: Block threats and data loss on devices with a <a href=\"https://www.cloudflare.com/learning/access-management/what-is-a-secure-web-gateway/\">Secure Web Gateway</a> (1 hour)Step 5: Add Zero Trust to your SaaS applications (2 hours)</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"1-start-blocking-malicious-sites-and-phishing-attempts-in-10-minutes\">1. Start blocking malicious sites and phishing attempts in 10 minutes</h3>\n            <a href=\"#1-start-blocking-malicious-sites-and-phishing-attempts-in-10-minutes\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>The Internet can be a dangerous place with malware and threats lurking everywhere. Protecting employees from threats on the Internet requires a way to inspect and filter their traffic. That starts with DNS-level filtering that can quickly and easily eliminate known malicious sites as well as restrict access to potentially dangerous neighborhoods on the Internet.</p><p>When your devices connect to a website, they start by sending a DNS query to a DNS resolver to find the IP address of the hostname for that site. The resolver responds and the device initiates the connection. That initial query creates two challenges for your team’s security:</p><ul><li><p>Most DNS queries are unencrypted. ISPs can spy on DNS queries made by your employees and corporate devices while they work from home. Even worse, a malicious actor could modify responses to launch an attack.</p></li><li><p>DNS queries can resolve to malicious hostnames. Team members can click on links that lead to phishing attacks or malware downloads.</p></li></ul><p>Cloudflare One can help keep that first query private and stop devices from inadvertently requesting a known malicious hostname.</p><p>Start by signing up for a Cloudflare account and navigating to the Cloudflare for <a href=\"https://dash.teams.cloudflare.com/\">Teams dashboard</a>.</p><p>Next, set up a location.  You’ll be <a href=\"https://developers.cloudflare.com/gateway/getting-started-new/onboarding-gateway/\">prompted to create a location</a> which you can do if you want to protect the DNS queries of an office network. Simply deploy Gateway’s DNS filtering for your office by changing your network’s router to point to the <a href=\"https://developers.cloudflare.com/cloudflare-one/policies/filtering/initial-setup/dns/\">assigned</a> Gateway IP address.</p><p>Cloudflare operates 1.1.1.1, the world’s fastest DNS resolver. We’ve built Cloudflare Gateway’s DNS filtering tools on top of that same architecture so that your team has faster and safer DNS.</p><p>Now you can easily create a Gateway DNS policy to filter security threats or specific content categories.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5vLj4IIfQn3zuDb4TazzQK/ee973f177a7a208cc16ff9d51f14a1b3/image9-4.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1224\" loading=\"lazy\"/>\n            \n            </figure><p>Then use the Gateway dashboard to monitor queries that are allowed or blocked.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/1evMsuFgNEJEI7Yj41LdFV/d16b02eacd523b9a5518c7a738e9bb67/image5-8.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1228\" loading=\"lazy\"/>\n            \n            </figure><p>Then navigate to the dashboard on the “Overview” tab and see your traffic including what you are blocking and allowing.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4Lhs7rdm16nhZ9W56zsCOE/f394c36c88a5142605e6d37dd8dca3d4/image2-16.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1092\" loading=\"lazy\"/>\n            \n            </figure>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"2-next-protect-all-of-your-remote-employees-and-send-all-traffic-through-cloudflare-over-an-encrypted-connection\">2.Next, protect all of your remote employees and send all traffic through Cloudflare over an encrypted connection</h3>\n            <a href=\"#2-next-protect-all-of-your-remote-employees-and-send-all-traffic-through-cloudflare-over-an-encrypted-connection\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Employees who used to connect to the Internet through your office network now connect from hundreds or thousands of different home networks or mobile hotspots to do their jobs. That traffic relies on connections that might not be private.</p><p>You can use Cloudflare One to route all team member traffic over an encrypted, accelerated path to the Internet with Cloudflare WARP. Cloudflare WARP is available as an application that your team members can install on macOS, Windows, iOS, and Android. The client will route all of their device’s traffic to a nearby Cloudflare data center over Cloudflare’s <a href=\"/boringtun-userspace-wireguard-rust/\">implementation</a> of a technology called WireGuard.</p><p>When they connect, Cloudflare One uses WARP+, our implementation of WARP that uses the Argo Smart Routing service to find the shortest path through our global network of data centers to reach the user’s destination.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/6lpWxa8FNUIleNEVW2YEkn/c6dd113f9fc0f64373d1e3ea1f3e0f0e/image6-8.png\" alt=\"\" class=\"kg-image\" width=\"287\" height=\"357\" loading=\"lazy\"/>\n            \n            </figure><p>Your team can begin using Cloudflare WARP today. Navigate to the Cloudflare for Teams dashboard and purchase the Cloudflare Gateway or Cloudflare for Teams Standard plan. Once purchased, you <a href=\"https://developers.cloudflare.com/gateway/connecting-to-gateway/with-client\">can create a rule</a> to determine who in your organization can use Cloudflare WARP.</p><p>Your end users can launch the client, input your team’s organization name, and login to begin using WARP+.  Alternatively, you can <a href=\"https://developers.cloudflare.com/warpclient/teams\">deploy the application</a> with settings preconfigured using an device management solution like JAMF or InTune.</p><p>Cloudflare WARP seamlessly integrates with Gateway’s DNS filtering to bring secure, encrypted, DNS resolution to roaming devices. Users can input the DoH subdomain of a location in your Cloudflare for Teams account to begin using your organization’s DNS filtering settings wherever they work.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"3-replace-your-vpn-with-cloudflare-access\">3. Replace your VPN with Cloudflare Access</h3>\n            <a href=\"#3-replace-your-vpn-with-cloudflare-access\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>When we were a smaller team and relied on a VPN, our IT help desk received hundreds of tickets complaining about our VPN. Some of these descriptions might look familiar.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/5JtTVp4FBquMrwu8NEfQRh/bead7fb5ba206e499c9dd985586538ff/image8-3.png\" alt=\"\" class=\"kg-image\" width=\"516\" height=\"206\" loading=\"lazy\"/>\n            \n            </figure><p>We built Cloudflare Access as a way to replace using a VPN as the gatekeeper to applications. Cloudflare Access follows a model known as Zero Trust security where Cloudflare’s network, by default, does not trust any connection. Every user attempting to reach an application has to prove they should be allowed to access that application based on rules that administrators configure. With our new Teams free plan, up to 50 seats of Access are available at no cost.</p><p>That sounds like adding a burden, but Cloudflare Access integrates with your team’s identity provider and single sign-on (SSO) options to make any application feel as seamless as a SaaS application with SSO. Even if your team does not have a corporate identity provider, you can integrate Access with free services like GitHub and LinkedIn, so your <a href=\"/multi-sso-and-cloudflare-access-adding-linkedin-and-github-teams/\">employees and partners can authenticate</a> without adding cost.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/2yArns5J9eEDKHozjra70n/93ccdd223efaa88febf99192c052c1aa/image10-2.png\" alt=\"\" class=\"kg-image\" width=\"1639\" height=\"822\" loading=\"lazy\"/>\n            \n            </figure><p>For hosted applications, you can connect your origin to Cloudflare’s network without opening holes in your firewall <a href=\"/argo-tunnels-that-live-forever/\">using Argo Tunnel</a>. Cloudflare’s network will accelerate the traffic from that origin to your users along fast lanes using our global private backbone.</p><p>When your team members need to connect to an application, they can visit it directly or start from a custom app launcher for your team. When they arrive, they’ll be prompted to login with your identity provider and Access will check their identity, and other characteristics like country of login, against rules that you create in the Cloudflare for Teams dashboard.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/4qVnQs3DTbJ2bdosRa6Lu/96aeb4c6d401e1dbe6039738e42591fb/image1-18.png\" alt=\"\" class=\"kg-image\" width=\"2000\" height=\"1253\" loading=\"lazy\"/>\n            \n            </figure><p>Cloudflare’s free plan includes up to 50 seats of Cloudflare Access at no cost so that your team can begin</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"4-add-a-secure-web-gateway-to-block-threats-and-file-loss\">4. Add a Secure Web Gateway to block threats and file loss</h3>\n            <a href=\"#4-add-a-secure-web-gateway-to-block-threats-and-file-loss\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>With Cloudflare WARP, all of the traffic leaving your devices now routes through Cloudflare’s network. However, threats and data loss can hide inside of that traffic. You can add Cloudflare Gateway’s HTTP filtering to your team’s Cloudflare WARP usage to block threats and file loss. For example, if your team uses Box you can restrict all file uploads to other cloud based storage services to ensure everything stays in one, approved place.</p><p>To get started, navigate to the Policies section of the Cloudflare for Teams dashboard. Select the HTTP tab to begin building rules that inspect traffic for potential issues like known malicious URLs or files being uploaded to unapproved destinations.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/JaWm0oz2tzTwb1Q31uqkp/c70d245e989224974643c5b6b673af45/image3-16.png\" alt=\"\" class=\"kg-image\" width=\"1999\" height=\"1198\" loading=\"lazy\"/>\n            \n            </figure><p>To inspect traffic, you’ll need to <a href=\"https://developers.cloudflare.com/gateway/connecting-to-gateway/with-client\">download and install</a> a certificate on the enrolled devices. Once installed, you can enable HTTP filtering from the Policies tab to begin enforcing the policies that you created and capturing event logs.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"5-bring-zero-trust-rules-to-your-saas-applications\">5. Bring Zero Trust rules to your SaaS applications</h3>\n            <a href=\"#5-bring-zero-trust-rules-to-your-saas-applications\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>If you don’t have self-hosted applications, or also use SaaS applications, you can still bring the same Zero Trust rules to the SaaS applications that your team uses with <a href=\"/cloudflare-access-for-saas/\">Cloudflare Access for SaaS</a> - wherever they live. With Access for SaaS, companies can now centrally manage user access and security monitoring for all applications.</p><p>You can integrate Cloudflare Access as an identity provider to any SaaS application that supports SAML SSO. That integration will send all login attempts through Cloudflare’s network to your configured identity providers and enforce rules that you control.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3SBvP1JzZ7LawBhtI3J31O/6915eaa5d980cb4ed77bf7fca97bb1de/image7-5.png\" alt=\"\" class=\"kg-image\" width=\"1638\" height=\"599\" loading=\"lazy\"/>\n            \n            </figure><p>Access for SaaS still includes the ability to run multiple identity providers simultaneously. When users login to the SaaS application, they’ll be prompted to pick the identity provider they need, or we’ll send them directly to the only provider you want to use for that application.</p>\n            <figure class=\"kg-card kg-image-card \">\n            \n            <Image src=\"https://cf-assets.www.cloudflare.com/zkvhlag99gkb/685vbJ2WQ1dfsy9SV8aGoF/bbe4bef6b7a66037204c34a00f823d9d/image4-12.png\" alt=\"\" class=\"kg-image\" width=\"1294\" height=\"1316\" loading=\"lazy\"/>\n            \n            </figure><p>Once deployed, Access for SaaS gives your team high visibility, with low effort, into every login to both internal and SaaS applications. You can use the new Access for SaaS feature as part of the Cloudflare for Teams free plan for up to 50 users.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"6-soon-protect-small-business-office-networks\">6. Soon: Protect small business office networks</h3>\n            <a href=\"#6-soon-protect-small-business-office-networks\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Cloudflare’s Magic Transit™ product takes everything we learned protecting our own network from IP-layer attacks and extends that security to our customers who operate their own IP address space. By protecting that network, customers also benefit from performant and reliable IP connectivity to the Internet.</p><p>Today, some of the largest enterprises in the world rely on Magic Transit to keep their business safe from attack. We plan to extend that same protection and connectivity to teams who operate smaller networks in upcoming releases.</p>\n          <div class=\"flex anchor relative\">\n            <h3 id=\"whats-next\">What’s next?</h3>\n            <a href=\"#whats-next\" aria-hidden=\"true\" class=\"relative sm:absolute sm:-left-5\">\n              <svg width=\"16\" height=\"16\" viewBox=\"0 0 24 24\"><path fill=\"currentcolor\" d=\"m12.11 15.39-3.88 3.88a2.52 2.52 0 0 1-3.5 0 2.47 2.47 0 0 1 0-3.5l3.88-3.88a1 1 0 0 0-1.42-1.42l-3.88 3.89a4.48 4.48 0 0 0 6.33 6.33l3.89-3.88a1 1 0 1 0-1.42-1.42Zm8.58-12.08a4.49 4.49 0 0 0-6.33 0l-3.89 3.88a1 1 0 0 0 1.42 1.42l3.88-3.88a2.52 2.52 0 0 1 3.5 0 2.47 2.47 0 0 1 0 3.5l-3.88 3.88a1 1 0 1 0 1.42 1.42l3.88-3.89a4.49 4.49 0 0 0 0-6.33ZM8.83 15.17a1 1 0 0 0 1.1.22 1 1 0 0 0 .32-.22l4.92-4.92a1 1 0 0 0-1.42-1.42l-4.92 4.92a1 1 0 0 0 0 1.42Z\"></path></svg>\n            </a>\n          </div>\n        <p>Cloudflare One represents our vision for the future of the corporate network, and we’re just getting started adding products and features that help teams move to that model. That said, your team shouldn’t have to wait to begin connecting through Cloudflare and securing your data and applications with our network.</p><p>To get started, <a href=\"https://dash.cloudflare.com/sign-up/teams\">sign up for a Cloudflare account</a> and follow the steps above.  If you have any questions on setting up Cloudflare One as a small business, or large enterprise, please let us know in this community forum post.</p>",
		"id": "5P5B1L3sijGQsbe7Azp6Ac",
		"localeList": {
			"name": "How small businesses can start using Cloudflare One today Config",
			"enUS": "English for Locale",
			"zhCN": "Translated for Locale",
			"zhHansCN": "No Page for Locale",
			"zhTW": "No Page for Locale",
			"frFR": "No Page for Locale",
			"deDE": "No Page for Locale",
			"itIT": "No Page for Locale",
			"jaJP": "Translated for Locale",
			"koKR": "Translated for Locale",
			"ptBR": "No Page for Locale",
			"esLA": "No Page for Locale",
			"esES": "Translated for Locale",
			"enAU": "No Page for Locale",
			"enCA": "No Page for Locale",
			"enIN": "No Page for Locale",
			"enGB": "No Page for Locale",
			"idID": "No Page for Locale",
			"ruRU": "No Page for Locale",
			"svSE": "No Page for Locale",
			"viVN": "No Page for Locale",
			"plPL": "No Page for Locale",
			"arAR": "No Page for Locale",
			"nlNL": "No Page for Locale",
			"thTH": "No Page for Locale",
			"trTR": "No Page for Locale",
			"heIL": "No Page for Locale",
			"lvLV": "No Page for Locale",
			"etEE": "No Page for Locale",
			"ltLT": "No Page for Locale"
		},
		"meta_description": "As a small business network administrator, there are fundamentally three things you need to protect: devices, applications, and the network itself. Here's how.",
		"metadata": {
			"title": "How small businesses can start using Cloudflare One today",
			"description": "As a small business network administrator, there are fundamentally three things you need to protect: devices, applications, and the network itself. Here's how.",
			"imgPreview": "https://cf-assets.www.cloudflare.com/zkvhlag99gkb/3kTCIiXO9ZbnSsjNXZxmQy/66d5760cffe8c811ff53ebf6f867e24c/zero-trust-week-setting-up-cloudflare-one-as-a-small-business-ujEGYo.png"
		},
		"primary_author": {},
		"published_at": "2020-10-15T18:00:00.000+01:00",
		"slug": "zero-trust-week-setting-up-cloudflare-one-as-a-small-business",
		"tags": [
			{
				"id": "6QktrXeEFcl4e2dZUTZVGl",
				"name": "Product News",
				"slug": "product-news"
			},
			{
				"id": "25A8I9ldOaZmvZRWTucDz8",
				"name": "Zero Trust Week",
				"slug": "zero-trust-week"
			},
			{
				"id": "4Z2oveL0P0AeqGa5lL4Vo1",
				"name": "Cloudflare One",
				"slug": "cloudflare-one"
			}
		],
		"title": "How small businesses can start using Cloudflare One today",
		"updated_at": "2024-10-09T23:12:18.979Z",
		"url": "https://blog.cloudflare.com/zero-trust-week-setting-up-cloudflare-one-as-a-small-business"
	},
	"translations": {
		"posts.by": "By",
		"footer.gdpr": "GDPR",
		"lang_blurb1": "This post is also available in {lang1}.",
		"lang_blurb2": "This post is also available in {lang1} and {lang2}.",
		"lang_blurb3": "This post is also available in {lang1}, {lang2} and {lang3}.",
		"footer.press": "Press",
		"header.title": "The Cloudflare Blog",
		"search.clear": "Clear",
		"search.filter": "Filter",
		"search.source": "Source",
		"footer.careers": "Careers",
		"footer.company": "Company",
		"footer.support": "Support",
		"footer.the_net": "theNet",
		"search.filters": "Filters",
		"footer.our_team": "Our team",
		"footer.webinars": "Webinars",
		"page.more_posts": "More posts",
		"posts.time_read": "{time} min read",
		"search.language": "Language",
		"footer.community": "Community",
		"footer.resources": "Resources",
		"footer.solutions": "Solutions",
		"footer.trademark": "Trademark",
		"header.subscribe": "Subscribe",
		"footer.compliance": "Compliance",
		"footer.free_plans": "Free plans",
		"footer.impact_ESG": "Impact/ESG",
		"posts.follow_on_X": "Follow on X",
		"footer.help_center": "Help center",
		"footer.network_map": "Network Map",
		"header.please_wait": "Please Wait",
		"page.related_posts": "Related posts",
		"search.result_stat": "Results <strong>{search_range}</strong> of <strong>{search_total}</strong> for <strong>{search_keyword}</strong>",
		"footer.case_studies": "Case Studies",
		"footer.connect_2024": "Connect 2024",
		"footer.terms_of_use": "Terms of Use",
		"footer.white_papers": "White Papers",
		"footer.cloudflare_tv": "Cloudflare TV",
		"footer.community_hub": "Community Hub",
		"footer.compare_plans": "Compare plans",
		"footer.contact_sales": "Contact Sales",
		"header.contact_sales": "Contact Sales",
		"header.email_address": "Email Address",
		"page.error.not_found": "Page not found",
		"footer.developer_docs": "Developer docs",
		"footer.privacy_policy": "Privacy Policy",
		"footer.request_a_demo": "Request a demo",
		"page.continue_reading": "Continue reading",
		"footer.analysts_report": "Analyst reports",
		"footer.for_enterprises": "For enterprises",
		"footer.getting_started": "Getting Started",
		"footer.learning_center": "Learning Center",
		"footer.project_galileo": "Project Galileo",
		"pagination.newer_posts": "Newer Posts",
		"pagination.older_posts": "Older Posts",
		"posts.social_buttons.x": "Discuss on X",
		"search.source_location": "Source/Location",
		"footer.about_cloudflare": "About Cloudflare",
		"footer.athenian_project": "Athenian Project",
		"footer.become_a_partner": "Become a partner",
		"footer.cloudflare_radar": "Cloudflare Radar",
		"footer.network_services": "Network services",
		"footer.trust_and_safety": "Trust & Safety",
		"header.get_started_free": "Get Started Free",
		"page.search.placeholder": "Search Cloudflare",
		"footer.cloudflare_status": "Cloudflare Status",
		"footer.cookie_preference": "Cookie Preferences",
		"header.valid_email_error": "Must be valid email.",
		"footer.connectivity_cloud": "Connectivity cloud",
		"footer.developer_services": "Developer services",
		"footer.investor_relations": "Investor relations",
		"page.not_found.error_code": "Error Code: 404",
		"footer.logos_and_press_kit": "Logos & press kit",
		"footer.application_services": "Application services",
		"footer.get_a_recommendation": "Get a recommendation",
		"posts.social_buttons.reddit": "Discuss on Reddit",
		"footer.sse_and_sase_services": "SSE and SASE services",
		"page.not_found.outdated_link": "You may have used an outdated link, or you may have typed the address incorrectly.",
		"footer.report_security_issues": "Report Security Issues",
		"page.error.error_message_page": "Sorry, we can't find the page you are looking for.",
		"header.subscribe_notifications": "Subscribe to receive notifications of new posts:",
		"footer.cloudflare_for_campaigns": "Cloudflare for Campaigns",
		"header.subscription_confimation": "Subscription confirmed. Thank you for subscribing!",
		"posts.social_buttons.hackernews": "Discuss on Hacker News",
		"footer.diversity_equity_inclusion": "Diversity, equity & inclusion",
		"footer.critical_infrastructure_defense_project": "Critical Infrastructure Defense Project"
	}
}